{"question_id": "19623242", "question_text": " 黄鹤楼 崔灏昔人已乘黄鹤去，此地空余黄鹤楼。黄鹤一去不复返，白云千载空悠悠。晴川历历汉阳树，芳草萋萋鹦鹉洲。日暮乡关何处是，烟波江上使人愁。黄鹤楼送盂浩然之广陵李白故人西辞黄鹤楼，烟花三月下扬州。孤帆远影碧空尽，惟见长江天际流。 ", "question_title": "关于黄鹤楼的诗词，李白与崔灏所描写的哪个更有韵味？", "question_commet": "​4 条评论", "answer_number": "20 个回答", "question_followers": "117", "brower_number": "36,808"}
{"answer_author": "周晓农", "answer_id": 13015150, "answer_text": " 受邀题。寂寂游子，登高送目，思古抚今，江天宏空，唯有陈迹，历历在目。何处是归程，唯有烟波浩茫。茫茫不确定中，顿起万般乡愁。空旷、寂寥、厚重，这是我读崔颢诗时，能体会到的一种感觉，一种时空浩大而个人无所把握无所归依的意味，也可以说是个人在时空中漂泊的韵味。而李白的诗，单纯、明了，送别之际，久久眺望，碧空、孤帆、天际，目送千里，万事万物，此时却归于对对友人深情送别。李白的此诗，净化了送别之情，虽有江天辽阔之感，却把整个情感限制于易把握的单纯的悠悠送别之韵中。崔颢的诗，是捉摸不定、难以把握的，对人的思绪触发，是开放的；李白的诗是凝聚的，收敛的，将送别之情表达到了极致。因此是不可比的。虽有传说，称李白极为推崇崔颢此诗，可能是他觉得要写出这种时空感觉太难了。在武汉时，我曾多次陪友人去黄鹤楼，或独上高楼，极目四望，却是高楼矗立，万车奔流，见不到历历汉阳树，也不见萋萋鹦鹉洲，大江之上，江轮嘶鸣，也难有天朗气清的碧空之时，早已天翻地覆，也不知崔颢，李白如在世，还能不能写出这样的诗？另外，崔灏，是“灏”还是“颢”，两字同音，都有使用，但正规诗集中，似只见用“颢”的，不知提问者对此有考证没有？ ", "answer_votes": "44", "answer_comment": "​8 条评论"}
{"answer_author": "姜弘宇", "answer_id": 15032125, "answer_text": "“眼前有景道不得，崔颢题诗在上头”。这个是李白的感叹。", "answer_votes": "24", "answer_comment": "​2 条评论"}
{"answer_author": "李超字子躍", "answer_id": 17648130, "answer_text": "黄鹤楼送盂浩然之广陵李白 故人西辞黄鹤楼，烟花三月下扬州。孤帆远影碧空尽，惟见长江天际流。与史郎中钦听黄鹤楼上吹笛李白一为迁客去长沙，西望长安不见家。黄鹤楼中吹玉笛，江城五月落梅花。望黄鹤楼李白东望黄鹤山，雄雄半空出。四面生白云，中峰倚红日。岩峦行穹跨，峰嶂亦冥密。颇闻列仙人，于此学飞术。一朝向蓬海，千载空石室。金灶生烟埃，玉潭秘清谧。地古遗草木，庭寒老芝术。□予羡攀跻，因欲保闲逸。观奇遍诸岳，兹岭不可匹。结心寄青松，永悟客情毕。醉后答丁十八以诗讥余槌碎黄鹤楼李白黄鹤高楼已槌碎，黄鹤仙人无所依。黄鹤上天诉玉帝，却放黄鹤江南归。神明太守再雕饰，新图粉壁还芳菲。一州笑我为狂客，少年往往来相讥。君平帘下谁家子，云是辽东丁令威。作诗调我惊逸兴，白云绕笔窗前飞。待取明朝酒醒罢，与君烂漫寻春晖。江夏送友人李白雪点翠云裘，送君黄鹤楼。黄鹤振玉羽，西飞帝王州。凤无琅□实，何以赠远游。徘徊相顾影，泪下汉江流。登金陵凤凰台                                      李白凤凰台上凤凰游，凤去台空江自流。吴宫花草埋幽径，晋代衣冠成古丘。三山半落青天外，一水中分白鹭洲。总为浮云能蔽日，长安不见使人愁。（谢@陈章鱼 教主指正引述不全。另：这首诗感觉是不是跟崔颢的诗很相同呢？清·纪昀等在《唐宋诗醇卷七》中评此诗说：“崔颢题诗黄鹤楼，李白见之，去不复作，至金陵登凤凰台乃题此诗，传者以为拟崔而作，理或有之。崔诗直举胸情，气体高浑；白诗寓目山河，别有怀抱，其言皆从心出发，即景而成，意象偶同，胜境各擅。论者不举其高情远意而沾沾吹索于字句之间，因已蔽矣。”）以上这么多首，比不过崔颢一首！诗仙也有认输的时候：“一拳打碎黄鹤楼，一脚踢翻鹦鹉洲。眼前有景道不得，崔颢题诗在上头！”", "answer_votes": "13", "answer_comment": "​3 条评论"}
{"answer_author": "枕水", "answer_id": 17647768, "answer_text": "崔颢的这首诗，有初唐之风，感怀而不感伤，悲凉但不失大气。有点像春江花月夜里的这几句：昔人已乘黄鹤去，此地空余黄鹤楼。——不知江月待何人，但见长江送流水。黄鹤一去不复返，白云千载空悠悠。——江水流春去欲尽，白云一片去悠悠，晴川历历汉阳树，芳草萋萋鹦鹉洲。——落月摇情满江树，江流宛转绕芳甸。日暮乡关何处是，烟波江上使人愁。——何处相思明月楼，青枫浦上不胜愁。两者均包含了对人类对宇宙自然的探究与思索。而李白的，则纯粹是一首离别诗，有景有情有意境，仅此而已。", "answer_votes": "12", "answer_comment": "​1 条评论"}
{"answer_author": "莫离", "answer_id": 13862338, "answer_text": "个人更喜欢崔颢的《黄鹤楼》，有一种对历史古旧的感怀，淡淡的直入人心。其中“白云千载空悠悠”、“烟波江上使人愁”两句最有韵味，这首诗语文课本上有收录呢！", "answer_votes": "0", "answer_comment": "​1 条评论"}
{"answer_author": "之彦", "answer_id": 22488366, "answer_text": "\"唐人七言律诗，当以崔颢《黄鹤楼》为第一\" (严羽《沧浪诗话》)崔颢的《黄鹤楼》在唐诗里面的地位是非常高的。这两首诗首先诗体就不一样。李白的《黄鹤楼送盂浩然之广陵》是七言绝句，而崔颢《黄鹤楼》是七言律诗。然后题材不同，李白诗属于送别诗，而崔颢黄鹤楼的咏物抒情更近似于陈子昂的“念天地之悠悠，独怆然而涕下。”但是若要硬比较，我不认为《宋孟浩然之广陵》的艺术成就能和崔颢《黄鹤楼》相比，传言李白登黄鹤楼时自己也说过:“眼前有景道不得，崔颢题诗在上头。” 一般文人喜欢拿来与之比较的是李白的《登金陵凤凰台》：凤凰台上凤凰游， 凤去台空江自流。 吴宫花草埋幽径， 晋代衣冠成古丘。 三山半落青天外， 一水中分白鹭洲。 总为浮云能蔽日， 长安不见使人愁。而这首诗是李白拟崔颢诗而作，单论也是非常优秀和高明，不过古来各评论家大多也都认为《凤凰台》尚不如《黄鹤楼》：“人传此奇是拟《黄鹤楼〉诗。设使果然，便是出手早低一格。盖崔第一句是去，第二句是空，……今先生岂欲避其形迹，乃将“去”、“空”缩入—句。既是两句缩入一句，势必句上别添闲句。因而起云：“凤凰台上凤凰游”，此于诗家赋、比、兴三者，竟属何体哉？”   ---- 金圣叹“起句失利，岂能比肩《黄鹤》？”  ---吴昌棋《黄鹤楼》一诗最脍炙人口的当是首联和颔联，这二联三用“黄鹤”一词，不仅朗朗上口，而且真是给人排山倒海的气势，那种空旷和内心之沧桑感，或许已胜过《登幽州台歌》稍许。崔颢之后律诗渐渐定型，韵律基本完善，反而是多了限制。《黄鹤楼》颈联尾联更符合律诗韵律，却不如前二联那么出彩，虽说单读也会感觉很好，但是放在\"黄鹤一去不复返，白云千载空悠悠。\"之后，难免会觉得高潮已过。这大概也是这首诗唯一的缺憾，确实难免。", "answer_votes": "9", "answer_comment": "​4 条评论"}
{"answer_author": "觉浅", "answer_id": 14360370, "answer_text": "唐人写黄鹤楼， 历代诗话都以崔颢的诗为第一，无可争议。李白也甘居其后，遂有 “三山半落青天外，一水中分白鹭洲。总为浮云能蔽日，长安不见使人愁”的模仿之作。", "answer_votes": "2", "answer_comment": "​1 条评论"}
{"answer_author": "王濤", "answer_id": 14789426, "answer_text": "崔颢之诗更佳，在这里是不存争议的。不过拿李白常作比崔首作，应属无益。", "answer_votes": "2", "answer_comment": "​1 条评论"}
{"answer_author": "黃載之", "answer_id": 12441194, "answer_text": " 崔诗主要表达的是一种乡愁，李诗表达的是一种离苦.崔诗黄鹤楼, 饱含着一种对历史悲凉的一种無奈...總的對比, 崔詩更有韻味. 畢竟是唐詩七律之首. ", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "庄仕尧", "answer_id": 34755053, "answer_text": "一群不懂诗的人在这边评论，使人望而发笑，可谓“小儿强作解事者”。崔诗向称高古，严沧浪推为七律第一，正在其虽名律诗，实为以古体入律，首两联，纯以气胜，似拙实秀，古朴浑成，有一种大的苍茫空阔之概。连用三次“黄鹤”，不避诗忌，一气而成，正是古体之长。后一联，“晴川历历汉阳树，芳草萋萋鹦鹉洲。”，使即成之势，退却一步，继而溢为最后的唱叹。整体诗歌平淡中见山高，朴质中出气骨，实为独绝，而推为七律第一，实则未必。后人常好古而薄今，以苏武诗胜六朝，以汉魏诗胜盛唐，想此诗苍厚浑然或可胜却一时佳作，而骨风旷逸似逊太白；句律化工，绝逊老杜；模山范水，不及王孟；深婉密丽，难比义山。是故诗有旷代之作，可也，而五岳风姿，各有其胜，未必必有天下第一峰之论。", "answer_votes": "11", "answer_comment": "​7 条评论"}
{"answer_author": "谭睿哲", "answer_id": 36235237, "answer_text": "一般不是把李白的登金陵凤凰台和崔灏的诗吧？那两首才有可比性。", "answer_votes": "3", "answer_comment": "​添加评论"}
{"answer_author": "陈少年", "answer_id": 17655380, "answer_text": "这两首不具有太多可比性。李白的《登金陵凤凰台》与之相比还差不多。                 登金陵凤凰台凤凰台上凤凰游，凤去台空江自流。吴宫花草埋幽径，晋代衣冠成古丘。三山半落青天外，一水中分白鹭洲。总为浮云能蔽日，长安不见使人愁。", "answer_votes": "3", "answer_comment": "​2 条评论"}
{"answer_author": "匿名用户", "answer_id": 17647856, "answer_text": "李白这首是十足的口水诗，跟赠汪伦异曲同工。还是错了，赠汪伦要好上许多。", "answer_votes": "4", "answer_comment": "​2 条评论"}
{"answer_author": "人间万事如淮水", "answer_id": 69223023, "answer_text": "无论是《黄鹤楼送孟浩然之广陵》还是《登金陵凤凰台》，我个人对其的喜好程度都在崔颢的《黄鹤楼》之上。。。", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "sirius", "answer_id": 15844941, "answer_text": "崔颢眼中所见提起心中愁绪，李白有的只是豪情", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "贾波涛", "answer_id": 13712699, "answer_text": "两个人的风格和情感有不同，韵味也不一样，见仁见智吧！", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "乱石如云", "answer_id": 12985398, "answer_text": " 个人见地不同，各有韵味我比较喜欢李白的。 ", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "哈哈", "answer_id": 77108009, "answer_text": "李白                                        扬州市旅游局", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "东方晓明", "answer_id": 17698175, "answer_text": "我感觉还是崔灏的有韵味，读起来舒服", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "木森林", "answer_id": 43972083, "answer_text": "李白的古诗（长篇）写的更好，可以比一比", "answer_votes": "0", "answer_comment": "​添加评论"}
