{"question_id": "21219219", "question_text": "", "question_title": "复杂系统与机器学习有什么联系？", "question_commet": "​添加评论", "answer_number": "3 个回答", "question_followers": "44", "brower_number": "2,658"}
{"answer_author": "许铁-巡洋舰科技", "answer_id": 117951401, "answer_text": "如何运用机器学习解决复杂系统的预测问题？ - 混沌巡洋舰 - 知乎专栏复杂系统和机器学习是面对生活中一些无法被传统物理覆盖的系统得到的方法， 比如股市，经济系统， 地震灾害， 流行病传播等。 复杂系统侧重于描述隐藏在这些系统背后共同的现象和规律，但是复杂系统的学问本身难以有预测性，我们可以通过复杂系统了解为什么会有股灾， 却无法告诉我我们做什么 。因此需要机器学习， 这个只讲数据， 然后从数据中预测我们需要的东西的学问的支撑。 机器学习之于复杂系统，一个是方法论， 一个是世界观， 一个浪漫， 一个实用。 简单点说，就是利用机器学习的方法，可以对复杂系统中的问题进行分析。复杂系统，说的是由大量单元互相作用组成的系统，其活动呈现非线性，往往形成具备无数层级的复杂组织。其中，系统是由相互作用相互依赖的若干组成部分结合而成的，具有特定功能的有机整体。比如对于国家产业发展规律的分析，就属于复杂系统的问题。而用机器学习的方法，可以从其庞杂的噪声中提取有效信息。机器学习， 用贝叶斯分析的方法， 来指挥我们吸收数据， 预测可能要发生的事情。 而深度学习， 更是利用神经网络， 这个本来属于复杂系统范畴的东西， 来做预测直接指导我们生活。详情关注混沌巡洋舰知乎专栏。", "answer_votes": "5", "answer_comment": "​3 条评论"}
{"answer_author": "赵霖林", "answer_id": 26128225, "answer_text": "最近做的东西跟这个有点关系，就抛砖引玉写一点。如果我想了解小明跟小红什么关系，一般先知道谁是小明小红，再看看小红小明干什么的，从哪来，到哪里去之类的。同样的，咱得先聊聊什么是复杂系统，什么是机器学习。复杂系统顾名思义，就是不简单，原因太多了，列几个：1. 非线性属性太多了，常规建模分析方法太难搞定了，这里能说的太多了，先作为原因之一吧；2. 高维度，或者large scale的系统，组成部分之间千丝万缕，相互联系，相互影响；3. 对系统未知的太多了，强制加一堆假设或条件的话，原系统完全就变样了。基因调控网络可以做个典型例子，相比高等生物的细胞，仅有4000个基因的大肠杆菌已经是太简单了，但是大肠杆菌过去是，现在是，将来还会是纯生物，理论生物，系统生物，生物信息等领域的宠儿，就是因为这个复杂系统能玩的东西太多了，谁都能拿它的局部或者整体来验证下自己的想法。机器学习很简单粗暴（但是我喜欢。。。），给我有用的数据或者信息，我不愿多费脑筋去盯着数据细节看，就用我的模型算法从中提炼出我想要的东西，让生活变得简单点。在我看来，现在机器学习给研究复杂系统提供一套很好的思路。我们在现实中面临着各种各样复杂的系统，特别是复杂的网络，常规的建微分方程---定参---动态分析的方法，有时候行不通；同时随着科技的进步，信息大爆炸，各行各业中都存在海量的数据，我们如果能搞出各种算法，告诉机器去学习这些复杂系统的内在规律，然后反过来再去看系统的动态细节，或许要容易很多。时间和能力有限，没举例来聊聊了，先码这么多。", "answer_votes": "8", "answer_comment": "​10 条评论"}
{"answer_author": "知乎用户", "answer_id": 43937197, "answer_text": "首先说明下，我不是专业研究人员，只是一个高中学生，看过几篇复杂系统和人工生命方面的论文，所以说得有问题请多多包涵。前面那位老师倒数第二段里面的想法非常，用机器学习的方法来分析和研究复杂系统，但是并没有在根本上写出机器学习和复杂系统的关系。其实机器学习我并不了解，只是身边的同学有研究过。复杂系统和人工生命我看过一点点。我觉得可以用人工智能和人工生命之间的区别来解答这个问题。人工智能(机器学习应该算人工智能)是从上到下的，整体的程序可以分为一个个子程序。而人工生命(我认为这里的想法和复杂系统类似)是从下而上的，先定义个体的规则,然后个体的行为组成了整体的pattern(我不知道怎么用中文翻译这个词)。复杂系统为什么叫复杂系统，是因为正是这个系统的复杂性导致了其内在的鲁棒性(也可以说是灵活性)，具体就不再卖弄了~^_^有什么不对的地方大家尽管留言，但请不要打击某人献身科学的决心，谢谢。", "answer_votes": "0", "answer_comment": "​2 条评论"}
