{"question_id": "21857364", "question_text": "2013探索中日大智慧 凤凰卫视时事辩论会特别节目 凤凰视频   推荐这个 希望能够给大家一些启示纠正一下，并没有同时打开国门，清朝是在1840年第一次中英战争之后“打开国门”。而日本处于相似的境况则是在1853年的黑船事件，鸦片战争使得西方国家开始关注东亚，而日本开国可以说是这一事件的结果之一。而日本方面对于美国人的态度，也是与清朝在战争前后的境遇有关。（天皇不同意与蛮夷接触，但幕府方面害怕重蹈清朝的覆辙）……", "question_title": "为什么中国和日本同样都是被打开国门，日本发展得快？为什么日本从幕府变成了帝国，中国从帝国走向了分裂？", "question_commet": "​31 条评论", "answer_number": "216 个回答", "question_followers": "3,303", "brower_number": "230,156"}
{"answer_author": "Hakumo", "answer_id": 26091785, "answer_text": "考虑了很久，决定在这个有百多位知友回答的问题里分享一下自己的看法。花了断断续续一天的时间将所有的答案看了一遍，先感谢以下三位知友的回答：@胡明亮 先生的答案基本概括了国内学界早先对此问题的一个解释。其实从经济制度入手分析该问题的，国内还有一套丛书可参：2004年上海远东出版社出版的《依田熹家著作集》。里面有两本书基本为此观点的深入研究。1、依田熹家：《近代日本与中国 日本的近代化——与中国的比较》，卞立强等译，卞立强校，上海远东出版社，上海，2004年2、依田熹家：《日中两国近代化比较研究》，卞立强等译，卞立强校，上海远东出版社，上海，2004年@王瀚 先生的答案提到了兰学，一语点明，通过比较日本与中国在学习西方上的差异 ，试图解释中日近代化上的不同。这是一个切入该问题非常好的视角，然至少以不才现在手头中日两学界对兰学的诸多研究，对此观点的结论基本是兰学之于江户时期的日本，大多还只局限于形而下学，即知识及器物的层面，或者说仅仅是处于实学的延长线的位置。（可参：复旦大学文史研究院编：《世界史中的东亚海域》，中华书局，北京，2011年；或张翔、园田英弘主编：《“封建”・“郡県”再考——東アジア社会体制論の深層》，东京：思文阁出版，2006年。）于是在 @王瀚先生答案的基础上，另有  @彭博先生的回答，直言中日文官制度的区别。即，中国（清立国至晚清考试制度改革前）的职业文官，通过科举考试及其周边的培养与选拔；而日本（江户幕府）则以武士一辈立国，世袭罔替。国之精英主体为何——这便又是一个解释此问题的极佳角度，在下接下来的浅谈便建立在三位先生的先见上。其实各位有否注意到，中日两国对“江湖”一词，其理解是截然相反的么？@彭博 先生注意到了“士”在两国语境下的差异，如果再深入去探讨的话，可以有趣的发现，于我国语境中，知识分子远离政治圈，谓“退隐江湖”，不再过问政事。而在江户日本，因为幕府政治为身份序列结构所定，“知识分子”无法参与政治，譬如作为“兰学者”的林子平真的是因为其“兰学者”的身份而为幕府所处罚么，其罪名是“处世横议”，即越过了自己的身份对朝政指手画脚。那么这里出现了一个矛盾的现象，即幕末各藩的云风人物大潮如何浪起？而，在日语语境中，“江湖”与汉语之意相左，演变到近世后期，却与了无法参与幕政知识分子之“公共圈”联系在了一起。（明治时期有一刊物即为《江湖》，与自由民权运动息息相关）。于是，了解哈贝马斯理论的知友们肯定能明白，知识分子“公共圈”的出现，对一个国家的“近代化”有多么密切的联系了吧。（另外，从这个角度来分析，中日两国公与私的概念也是有着非常大的差异的。）（请参：三谷博：《黑船来航——对长期危机的预测摸索与美国使节的到来》，张宪生、谢跃译，社会科学文献出版社，北京，2013年；或东岛诚：《公共圏の歴史的創造——江湖の思想へ》，东京大学出版会，东京，2000年；或佐佐木毅等编：《公共哲学第3卷——日本的公与私》，刘雨珍等译，人民出版社，北京，2009年）那么培养出江户日本后期知识分子“公共圈”的源头又在何方呢？那大约就是1792年，宽政朝老中松平定信的“学问吟味”及“宽政异学之禁”的改革了。而这一次改革，前者“学问吟味”便仿效了中国的科举制度，以朱子学为基本内容，针对幕臣（中下级武士的）的学问考试，通过该考试来选拔优秀人才。并设立国家最高学问机构“昌平簧”（东大前身）统一教学。虽然该政策仅限于首都，但各藩纷纷起而效仿。另外，江户幕府虽规定文教以朱子学一家为尊，却没有积极干预地方上的学术研究和思想活动，使得地方在选定教材及教师人选时颇为自由。&lt;img src=\"https://pic2.zhimg.com/50/6f51da2369d46cf48933931f1ce3f4f8_hd.jpg\" data-rawwidth=\"2448\" data-rawheight=\"3264\" class=\"origin_image zh-lightbox-thumb\" width=\"2448\" data-original=\"https://pic2.zhimg.com/6f51da2369d46cf48933931f1ce3f4f8_r.jpg\"&gt;（“学问吟味”出题书目一览，宽政6（1794）年至天保9（1838）年。真壁仁：《徳川後期の学問と政治》，名古屋大学出版会，名古屋，2007年，P.124）这一政策直到明治建国才中断，并使得晚期的江户幕府出现了以下几个趋势的变动：1、外交机构和人员方面，大量的以昌平簧为核心的儒学者参与了外交事务的咨询、实施机构。而以往则是古代的留学官僚、中世的禅僧、近世的幕府直属官僚。儒者之于江户日本不再只是学问的研究者，而是真正意义上进入了幕政的咨询与实施活动中。2、各地藩校、私塾的兴起，陪臣（地方武士）们得以获得更多集中授课的机会，并伴随幕府后期部分藩严重的财政危机，这些受过儒学教育的陪臣纷纷参与到各地地方政治中，更有陪臣被招入幕府中央机构任职。如一关藩藩士大槻玄泽破格被招入天文台，作对洋文书籍的翻译工作。3、作为启蒙教育的寺子屋，教师的身份也从原来的村医、僧侣大量的变化为各地受过教育的下级武士。这里不谈受过教育程度是否能够达到入阁拜相的程度，但至少打下了非常牢固的汉文基础，江户末期的高识字率也与此莫不有关。故，作为新知识分子出现（儒学化）的下级武士，在原有的社会序列逐步松动的情况下，成为社会的一股新力量，且主力多为远离首都政治舞台的地方武士。而这些武士通过集会式的学习，引经据典，继而结合实际议论政治，在江户末期，俨然成为风气。（譬如对“尊王”、“天下”、“封建”等概念的重新认识）而这正是拜了幕府在江户中晚期努力重新融入儒家文化圈，向西土清帝国学习之赐。儒者西山拙斋（1735-1798）曾言：自宋季元初，历明迨清，五百有余岁于今，虽geming（应审核的原因无法直接打出，请见谅）迭兴，学政画一，无复异论焉。明叔世间有立异者，亦唯私议草野，未有公言于庙堂之上。非唯汉土为然，即朝鲜琉球诸蕃，苟从事于斯者，亦皆率由不愆。（《與赤松滄州論学書》，《日本思想大系》第47卷《近世后期儒家集》，东京，岩波书店，1972年，P.325）由此可见，清王朝在近世的长期稳定的统治及与周边各国的互动，使得日本对大陆的文化传统及承续，对东亚儒学文化的共同认同得到了进步一的确认。日本学者小岛康敬对此另有卓见：正式18世纪后半叶的这个时期，儒学敏锐地与现实紧密结合，增强了其社会意义。暂且不论学问与政治的结合是否理想的状态，儒学并不是被作为书桌上的学问，而是被视为追求克服现实问题的政治实践、甚至是被视为政治改革的学问。（小岛康敬：《儒学の社会化——政治改革と徂徠以後の儒学》，赖期一编：《日本の近世》13《儒学・国学・洋学》，P.174）所以，再回到本题问题。为什么会有这样的区别？其实两国如此不同，当然不可能也无法一样。然历史学非自然科学，不是非要划一条横线，以线上答案上为是，线下为否。所有历史研究者的努力，皆是尽量不以偏颇（却又无可奈何受条件所限）地描述一段史实，将所有可能的答案设为相关，尽数全收。在下学识粗浅，在此地也仅仅一提，江户日本在53年佩里来航之前，其社会所出现的一个阶层流动的新趋势。此趋势在清帝国有没有，本人不是中国史的学生无法作答，但凭些许记忆，应没有同样对应之物，至少清帝国还留有科举制度直至20世纪初。而1792年的日本，却一改“武力威慑”，变“文教立国”，仿效中国，小范围推举“学问吟味”，并伴随各地的儒学热，产生了一个新的知识分子“公共圈”，虽然无法妄然为其与哈氏之理论勾稽一二，却也期望以此解，供诸位佐参，并待方家斧正。", "answer_votes": "62", "answer_comment": "​23 条评论"}
{"answer_author": "Jiwei Li", "answer_id": 25972327, "answer_text": "中日国运近代翻转的问题,一直以来都存在过度解读,还有一些深入人心但非常扯淡的理论,比如什么学习能力,民族性之类的东西,看到目前的答案,发现这么多年了,大家对这个问题的认识并没有什么长进.简单说一下,日本近代超越中国的原因,在于17,18世纪日本社会具有中国不具备的优势,主要就是城市化程度和受教育程度,有多少人知道19世纪初日本识字率处于世界先进水平,高于法国,而当时中国90%以上的文盲?又有多少人知道江户时期的东京(江户)是世界最大的城市之一,已经具有了相当发达的城市文化?很多人应该听说过浮世汇,其实浮世汇背后是当时日本的浮世文化,浮世的意思的是不同阶层不同职业的市民汇聚在江户的闹市中,使人产生浮游尘世之感,其实反映了当时日本的城市文明和商人阶层的兴旺.这种现象的产生跟日本的城-町二元结构有关,利于打破小农经济使人口向城市聚集,进而产生市民阶层文化,也就是日本所谓的町人文化.具体大家可以去了解下江户时代的剧院和公共澡堂的发达程度.现在西方讲日本,江户时代的城市化现象是一个重点,可惜国人一直到今天对这个问题还是知之甚少.高度的城市化利于市民阶层的形成,教育的普及,以及商业文明的发展.有多少人知道日本在战国时代末期已经出现原始的海商保险?又有多少人知道日本江户时期就产生了[米市],而现在股票交易所用的[K线图]和[期货]都是江户的米市商人发明的?很多人只了解德川幕府的锁国政策和儒家意识形态接近同时期的中国,但不了解日本社会结构与中国的巨大不同,幕府体制和中华帝国体制的差异.清朝中国到达了小农经济的巅峰,而日本则萌发了初步的商业文明,在城市化程度和教育这两项现代化的重要指标上,日本在明治以前就是领先于中国的.再加上一些其他原因,比如日本战国时代形成的兰学(西学)传统,到德川锁国以后并没有完全断绝,再加上日本单一民族国家和清朝多民族大帝国的成功(以及形成的负担).在这里还要补充一下上面一些答案提到的,西方势力对两国策略的不同,本质上就是中国和日本的地缘政治差异.综合分析,后来的两国国运之变其实是意料之中的,并没有我们一般所认识的那么偶然.我们想一想,中国近代对于日本的挫败,甲午海战的失利,对中国最大的影响是什么,我觉得不是我们的战败损失,而恰恰是国人对于中国相对于日本失败的过度解读.从甲午到今天,中国人一遍又一遍的检讨中日的民族性,传统文化,一直到今天仍然有很多人肤浅的相信中国人[懒][不团结][小聪明][不善于学习],而日本就是高大上,又勤奋又有觉悟这种谬论,不了解日本文化本身就是中华文明之下的一种次生文化的事实.一味的从所谓[文化]上找答案,从[精神]上找原因,论证日本武士如何比中国士大夫高明,这种思维本质是\"文化决定论\"和历史维心主义,导致我们对自身传统文化产生不必要的,愚蠢的怀疑和批判,对国情产生一些扭曲的认识,影响是十分恶劣的.同时,很少有人去研究中日两国近代社会经济的实际对比.最后说一下,19世纪的情形在今天依旧一定程度上存在,目前中国的城市化程度和教育相比日本仍然有差距,建国后大力进行扫盲工作,划分城乡二元结构,以农村补贴城市,改革开放几十年来迅猛的城市化进程,说明中国的当政者终于找到了问题的关键所在,我相信按目前形势发展下去,日本不复为我所忧所惧之日,近可待矣", "answer_votes": "226", "answer_comment": "​59 条评论"}
{"answer_author": "胡明亮", "answer_id": 19667598, "answer_text": "你的这个问题正好是我的研究对象，我有一篇专文讨论这个的：  在一般人看来，中国早于日本接触西方。中国于1842年鸦片战争国门被打开，日本1854年国门为佩里所打开。之后，大家看到的是中国人对西方文明的不断抗拒，而日本则很快发生了倒幕运动，随后便进行了明治维新。而中国在第二次鸦片战争后先是“以中学为体，西学为用”进行洋务运动，实行器物层面的变革，直到甲午中日战争洋务运动破产后，才勉为其难的进行戊戌变法，结果很快就失败了。再后来受了八国联军的攻打后，才在1901年进行有限的新政。魏源在《海国图志》中提出“师夷长技以制夷”的主张，可出版后一直不受国人待见。此书传到了日本却极受欢迎，几年间书价上涨了三倍。据学者统计，江南制造总局三十年间所翻译的著作发行约1.5万部，而日本福泽谕吉的《西洋事情》于1866年出版后，立即在国内卖出25万册。（http://www.tianya.cn/publicforum/Content/worldlook/1/90178.shtml）由此看来中国人之保守守旧比之日本简直一个天上一个地下。中国先进时，日本学中国，西方先进时日本学西方，日本之善于学习差不多成了中国人的固定印象。黄仁宇在《资本主义与二十一世纪》中提到当时中国人对日本的印象是“短小精悍，长于模仿，勇于进取”。中国人对日本的另一印象便是日本人的勤奋、纪律、守秩序。这表现在日本政府的廉洁高效、军队的纪律与素质、企业员工的勤勉工作。同为落后的封建国家，日本能够崛起而中国不能。似乎这就是中日之大不同的原因。传统学界的看法 未能找到足够的资料，这里以吴于廑、齐世荣主编的《世界史.近代史下卷》为例。对于近代中日变革成败的原因，作者进行了对比，例举了以下理由。1.日本土地制度禁止买卖，不如中国的地主制有弹性。2.中国的中央集权强于日本，所以较易镇压反叛。3.日本除幕府将军外，还有天皇这一权力中心，而中国只有皇帝。中国皇帝的统治地位较幕府将军稳固。4.日本的门阀制于世袭制不如中国的科举制有弹性。5.清王朝太腐败6.日本的传统文化负担没有中国重7.日本的社会经济发展水平高于中国8.日本有一支新生的革新势力9.日本所受到的侵略小于中国。专家学者的观点比之大众的看法要平实许多，少了情绪化。尤其是第7点与一般大众的看法相反。对于以上所列理由，我认同其中的第2、3、5、7条，反对其他几条理由。其中第2条、第3条可以归结为日本的集权专制不如中国，第5条则是集权专制的结果。第7条该如何解释呢？同为落后地区为什么日本的经济发展水平高于中国。当然，总体自然环境来说，中国的北部、西部自然条件差，比不上日本。但我认为即使是在自然条件好于日本的江南地区，当时的社会经济发展水平也低于日本。日本此时社会经济的相对发达不是偶然的，正是其分权式的封建制度的必然结果，犹如西方的市民阶层诞生于中世纪一样。至于8条是果不是因，是日本分权的社会结构与新兴的商人、豪农发展壮大的结果。 其中第1条与第4条是从旧制度的刚性来论证的，此种观点在中国史学界广为流传。厉以宁的《资本主义的起源》先是列了一大堆的经济史史料，然后用西欧制度的刚性、中国制度的弹性来说明资本主义为什么起源，这不是他的原创。这个理由貌似有理，实则本末倒置。世界历史上属于刚性旧制度的国家不是只有西欧、日本，阿拉伯国家、奥斯曼土耳其、俄罗斯、印度也是，资本主义怎么就不从他们那里起源呢？制度缺乏弹性，毫无疑问是会阻碍一个社会的发展的。而旧制度的弹性为什么能够支撑旧制度，其原因在于有弹性的旧制度对社会经济的发展具有较大的容纳力，其情况犹如改革开放后的中国。第6条的所谓传统文化云云，中国与日本统治意识形态都是理学，文化传统既可以是一个国家的包袱，也可以是一个国家的财富，就看你怎么利用了。第9条则不值一驳。日本身处大海，更易遭受资本主义帝国势力的入侵，可日本所受侵略小于中国且很快就反过来侵略中国，这是日本自强的结果。而日本能够自强，佩里的入侵是一个刺激。中国若不是受两次鸦片战争的刺激，后来的中日战争可能败得更惨。如不是得益于洋务运动与商业开放，清政府甚至有可能在太平天国中就倒下了。如此看来，西方对中国的入侵未必全是坏事。中国近代应对西方的缓慢 中国近代的遭遇有必然因素，也有偶然因素。对于近代清朝面对西方时的反应、面对外敌入侵时的抵抗，闻者莫不痛心疾首。清王朝太腐败无能了，太愚昧了。我读近代史的一大感受就是清政府的动作迟缓，一件简单的事情迟迟不能够解决。在研究近代中国的失败时，一个不能忽略的大背景是—清政府经过近两百多年的统治，已经到了一个传统王朝的衰亡期。嘉庆时的清王朝，腐败无孔不入，蔓延至社会的各个角落；军事废弛，许多炮台还用明朝的火炮，军事力量比之康熙时期大大下降，90余万军队几乎没有能够打仗的；经济萧条，据学者研究，清末时的农业生产率比明代还低；人口过剩，流民横行。清政府的行政效能也极为低下了，地方欺骗中央、中央压迫地方，官僚结党营私、鱼肉百姓，暗税激增。思想界了无生趣。末世之态已经显露出来。对此，龚自珍、陶澍等有责任感的士大夫已经意识到了危机，知道清朝政局每况愈下，以至不可收拾。对外交涉的失败，清政府的衰朽比其天朝上国的优越感要付更多的责任。假设中国在康熙时期就遇到了鸦片战争，又或者此时的中国政府如唐宋那样开放而又有行动力，那中国的境遇是不是会有根本的改观呢？中国的发展是不是就能与日本一样呢？我的答案是否定的。因为对中日两国来说，能否顺利转型，关键在于其国内资本主义因素的发展程度。设若中国不闭关锁国，积极发展对外贸易，学习西方文化。毫无疑问，这些对中国的社会经济发展会有很大助益。但中国的根本状况却难以改变—中国仍然是大一统的中央集权的国家，官僚阶层居于社会统治地位。像日本三井、鸿池、小野、住友这样连幕府将军都要依赖他们的特权商人在中国是不会有的。庞大的官僚机构，缺乏地方自治的政府，在官僚机构的自我扩张的趋势下，农民、商人的税收压力越来越重，且其私有财产难以得到保护。工业资本也就难以积累。庞大的贫穷人口，每当天灾人祸，流民汇集，大规模的起义就难以避免。更像西方的日本  日本虽是一个民族高度单一的国家，但岛国面积不大却山岭密集，只在海边有少量平原，同时又孤悬海外，不易遭受外敌入侵。日本虽孤悬海外，但朝鲜海峡较窄，易通过朝鲜半岛与大陆交流。这些特点使得日本难以形成中央集权的帝国，同时人民又有较高的国家认同，日本既能学习大陆的先进文明，同时又不会被其所征服。1.封建制度的形成  5世纪，日本处于部落王国割据时代，后来形成了统一的大和国。但其统治还很薄弱。到其七世纪时，日本经济发展很快，部民组织开始解体，大和国统治出现危机。此时法制完备中央集权的隋唐帝国对日本产生了很大的吸引力。日本开始效法中国建立中央集权制国家，经过两次政变，日本进行了两次改革，建立起了律令制国家。改革后的日本实行土地国有和授田法，同时赐予贵族官僚私有土地。此时日本虽建立了律令制国家，但贵族阶层还保存完好，又没有实行察举制、科举制，不存在作为官僚后备的士大夫阶层，其中央集权的程度远不能与中国比。律令制国家建立不久就开始动摇。为发展经济，日本政府鼓励垦荒，随着荒地的开垦，土地私有制不断发展。政府也在743年颁布“垦田永世私财法”，承认了私有土地的合法性。各权贵势力积极垦荒，到8世纪末，各种私领庄园开始建立起来。皇族，中央贵族和大寺社拥有“不输、不入”（不纳税，不受地方官管辖）的特权。后来普通领主为了获得此等特权，将自己的庄园寄进给特权庄园。到10世纪，寄进系庄园普遍发展起来。庄园最初以私垦地建立，到后来，领主纷纷分割公领地建立庄园，形成庄园公领制。为了抑制国有土地被侵占，朝廷实行知行国制，将某国（行政单位，相当于县）的支配权授予皇族、公卿或寺社。此做法无异于分封，很快知行国主变为世袭。庄园发展后，政府权力衰微，地方秩序混乱。为了保护庄园，庄园主组建自己的私人武装—武士。武士势力由此迅速增长，成为与西方骑士相类似的阶层。于是在日本形成了与同期西欧采邑制类似的封建庄园制度。武士势力的发展形成了力量强大的武士集团，武士集团势力向中央发展，进而控制天皇，形成了日本独特的幕府政权。2.战国时期的发展幕府制下，幕府将军是实际的统治者，武士与将军结成主从关系，与西欧的封君封臣制类似。相较而言，日本武士的权利地位比西欧的封臣要低。1336年—1573年是室町幕府时期。室町时期，将军权力虚弱，各守护大名不断扩张势力，形成独立的地方诸侯。整个室町时期，战乱频仍，中小领主破产，农民从庄园里解放出来，成为独立经营的小农。日本庄园的解体与西方差不多处于同一时期，但日本农民的独立性不如西欧的自耕农，他们仍需向地主缴纳实物地租。1467年因将军继嗣问题，日本爆发内战，史称“应仁之乱”，日本从此进入了战国时代。战国时代，幕府统治瘫痪，大名完全自主的统治者。这一时期日本社会经济快速发展。也就是在这一时期，日本社会在很多方面表现得与西欧极其相像。行会、自由市、乡村自治、农民起义最能体现日本与西欧的相似。最初，日本的手工业者、工商业者组成自治的行会“座”。“座”与中世纪西欧的基尔特相似，是一个封闭的圈子，拥有专营某一行业以及免税的特权。后来大名为增强自己的经济实力，废除行会特权，免除工商税收、免除关税，鼓励自由经营。日本的自由市是通过抗争取得自治地位。自由市由民主选举的议会（会合众）进行管理，并且自由市拥有自己的法庭与雇佣军。日本的村社向来是自治的。战国时代，出现了“惣”和“惣村”的组织，有时“惣”发展为几个村乃至全郡的联合组织。如此强大的地方自治势力使得农民拥有反击大名压迫的力量，因此日本农民的维权起义很成功。这样的情况下，日本的农民起义与中国大不相同而与西欧很相像。中国的农民起义实际上是流民起义，目的是夺取政权。而日本农民起义多是维权行为，成功了也不占山为王。1485年，山城国人民起义，迫使大名放弃统治权。山城国人民选出议会进行统治。这可以说是亚洲最早的共和政体，虽然只维持了8年。3.江户时期的资本主义萌芽  日本的市民力量与商人力量虽大，但却不能向西欧那样与国王进行结盟打击贵族（大名、武士）。而且，日本的武士集团没能像西欧的土地贵族那样转化为工商业经营者。在战国后期，各大名强化统治，一度非常兴盛的自由市衰落了，为大名控制的城下町所取代。十六世纪末，织田信长与丰臣秀吉统一日本。丰臣秀吉建立起了以武士为基础的中央政府，以大名家属为人质的办法控制了政治权力，通过检地控制财政。后来的德川家康继承了丰臣秀吉的政策，建立起了比较健全的中央到地方的政权机构。江户幕府的集权统治虽然比较有效，但幕府的直辖领地只有全国的四分之一，其余由“藩国”统治。这时幕府虽集权，但集权有限，也不为市民工商业阶层服务，而是为武士服务。这与同期西方社会的演化正好相反。西欧此时国王与市民的权力一同扩大，中央集权开始发展，贵族势力与封建割据开始消亡。  集权的幕府把人民划为四等—“士、农、工、商”，武士（士）居于统治地位，农、工、商阶层的法律地位依次降低。另外，幕府和各藩在思想上推行理学，为自己的统治服务。在经济政策上，幕府禁止土地买卖，强迫农民种植水稻。最后，江户幕府实行闭关锁国政策。这一切都将战国时代发展起来的商业势力给扼杀了。但是，由于毕竟没有建立起中国式的中央集权体制。在这样的体制下，随着商品经济的发展，只能获取实物地租（主要是禄米，由将军发放）的武士很快陷入了贫困。同时，大商人的势力却发展起来，出现了三井这样的特权商人。  幕藩体制下的日本，政府对经济的压榨远不如中国，外加长期的和平环境与农业技术的积累，此时日本农业发展很快。农业的发展反过来又刺激了手工业与商业的发展。到18世纪末，中国马克思主义经济史家作为资本主义萌芽象征的手工业工场在日本各地已普遍开花。农村中有所积累的农民兼营手工业，慢慢转化为工商业者。由于没有活跃的海外贸易，日本的资产阶级主要来源于农村，在农村活动。农村的资产阶级与新兴地主，在日本被称为“豪农豪商”，显然他们已经相当的政治经济实力。此时日本农村经济的发展水平显然高于中国江南地区。如果说中国明清时期的资产阶级一直处于萌芽状态，那么此时日本已经出现作为新的社会阶层的资产阶级。  前面说到过武士的贫困化。由于经济上的困难，不少武士已经从事商业经营或者与商人联姻。还有一部分武士弃武从文，改行教师、医生，其中一些人向兰学家学习，了解到西方思想。正是在上述条件下，外加外部的刺激，日本发生了明治维新。结语  论及中日，人们总是喜欢谈其如何相似，说是同属儒家文明圈。可是，日本自有其自己的文化传统，更重要的是日本的社会结构一直以来是类似西欧的封建社会而与中国大一统的官僚政治相异。五四运动前，陈独秀看到明治维新的日本到处在反封建（建立现代中央集权国家），于是以日为师，认为中国要强大，也必须要要反封建才行，将传统中国各种不好的现象统统冠以封建之名—“建意识、封建专制、封建地主、封建迷信、封建军阀、封建官僚、封建帝王、封建礼教、封建糟粕”。到后来，以至于大家几乎将封建当成落后的代名词了。  然而在世界历史上，现代文明正是从封建社会中诞生的。日本之所以能够面临西方入侵时崛起，正是由于其社会结构与西欧的相似。日本的发展程度也是与其与西欧的相似度成正比的。——————————————————————————————————————————最后一句话补充一点证据，日本社会经济发展水平不仅达到了欧美水准，也超过了像意大利、西班牙、葡萄牙这样的欧洲国家一大截，其根本原因在于日本比这些欧洲国家都要更像英、德。", "answer_votes": "429", "answer_comment": "​131 条评论"}
{"answer_author": "知乎用户", "answer_id": 20109052, "answer_text": "高晓松在《晓说》里提了几句日本，虽然有些不同观点，但有一点还是同意的：大部分所谓“分析”都有马后炮的嫌疑。当然，高晓松解释“日本国运上升、中国国运下降”，我觉得更是马后炮而且更扯。。。看到有几楼已经很受欢迎，也说了不少中肯的话，本人决定从另一个方向解释这个问题：贸易有个现象很有趣：大都市大多是交通要道，但不同的是，古代大都市大多是陆地要道，近现代大都市大多是海港。比如北京，现在北京雾霾可谓世界第一，但究其原因，与地理上三面环山有关。古代不存在雾霾问题，反而要堤防外敌入侵，于是各国选都第一要义是要易守难攻。北京如此、京都（三面环山）、罗马（七丘之城）、巴格达、墨西哥城这些古都都有类似特征。但大航海时代发展起来的国家，比如英国（伦敦）、荷兰（阿姆斯特丹）、葡萄牙（里斯本）、美国（华盛顿、纽约、费城离海都不远），其首都选址基本都在海边，而且一般来说，海岸城市发展速度比内陆城市高出了不止一个数量级，其原因就在于大航海时代带来的贸易资源。日本列岛狭长，全国没有一个地方距离海边超过200公里，天然良港众多，早在日本战国时代，日本就是欧洲各国远东最终目标，据说不少船队来了中国还要再去一次日本才返程。虽然日本在江户时代锁国200年，但幕末大门一开，日本海运优势重新建立起来，日本著名财阀三菱，早期就是靠了西南战役时代（1877）海运业发展了起来。不知大家想没想过一个问题：为什么中国大门由英国打开，而日本大门却由美国打开呢？对英国而言，中国是巨大市场，是商品终端。但对美国而言，中国也是巨大终端，为什么他们不来中国，反而要去日本呢？原因在于，英国在远东早已有一个庞大的东印度公司，而美国却刚刚拿下加利福尼亚，在整个太平洋还是一无所有，若想打通中美贸易圈，必须借助日本做中转站。事实也与此类似，美国南北战争刚刚结束，立刻着手修建横跨东西铁路、购买阿拉斯加、拿下中途岛，到了19世纪末期，又接连拿下夏威夷、菲律宾，其目的便是将太平洋变成美国一个大湖，这盘棋不可谓不大。（现在太平洋基本就是美国内湖了。。。）在19-20世纪交替期，中美两个大国一个是新型工业大国，一个是消费大国，中间必须要有一个做贸易的地方，而日本基本就处于这个中间地带。而且本人有个感觉，中国太大太有魅力，在远东可谓独一无二，所以谁都想占住这块地方。日本对欧洲列强算是远东最东边，还是个小岛国，一点用处都没有，如果大量驻军反而要特别成立军队，费时费力，故而投入精力不会太大；至于美国，日本对他们是中转站，有很大用处，疼还疼不过来。所以一直以来，列强对日本的态度一直没有对中国那么强硬。记得有一条是“内河航运权”，中国是让列强夺了个干净，但日本却一直保有。不信？可以翻看条文，会发现有些很有趣的事情。1854年《日英友好条约》第4条规定：英国舰队进入日本港口，要遵守日本法律。如果指挥官违反日本法律，那么港口可以对英国舰队关闭；如果船员违反法律，必须要受处罚。1855年《日俄友好条约》签订，其中规定日本给予俄国片面最惠国待遇，但3年后却变成了双方最惠国待遇；1858年《日美修好通商条约》（安政5国条约一部分）第2条规定：当日本与欧洲国家出现冲突，美国负责调停（日俄战争最终调停就与此有关）维基有一条把安政5国条约与同一时期的天津条约做了对比，基本是汉字，大家都可以看懂：&lt;img src=\"https://pic2.zhimg.com/50/a839bed91b0810301b5bf97888caece4_hd.jpg\" data-rawwidth=\"881\" data-rawheight=\"233\" class=\"origin_image zh-lightbox-thumb\" width=\"881\" data-original=\"https://pic2.zhimg.com/a839bed91b0810301b5bf97888caece4_r.jpg\"&gt;大体而言，日本明治维新能够成功，与西方管制不严厉甚至有些鼓动情绪很有关系，至于中国太大太招人喜欢，于是很多国家都限制中国太死，反而导致中国不容易成功。大致如此吧。", "answer_votes": "242", "answer_comment": "​36 条评论"}
{"answer_author": "Ryoma", "answer_id": 19542964, "answer_text": "幕府时期的日本虽然闭关锁国但是仍在长崎出岛和西方（主要是荷兰）进行贸易和文化交流，荷兰人每年去江户时不仅要向幕府将军献上奇珍异宝还要报告世界大事，如果说我国明、清时期的闭关锁国是对于自己文明的过分自信，那么幕府的闭关锁国更多是对外面的世界充满着胆怯同时又充满了好奇。随着日本与荷兰的贸易及交流渐渐的一些西方新知识、新发现也被很快的带到了日本，由于最早由荷兰人传入日本所以被叫做兰学，兰学在日本一开始更多的是西方的医学技术，后来西方的物理学和电学也被传入日本。最早由于幕府害怕西洋人在传播新技术同时进行传教，所以一开始兰学受到了政府的抑制。但是随着幕府的渐渐式微各藩为了增强实力对于西洋兵器产生了很大兴趣兰学由此开始迅速发展，很多精通西洋语言和技术的人开办了兰塾。被誉为日本伏尔泰的福泽谕吉在开蒙后也面临着选择汉学还是兰学继续学习的问题，尽管福泽谕吉的生父是位儒学家但是最后他还是前往长崎，学习了兰学。所以虽然同样是闭关锁国但日本在被佩里的黑船敲开国门时，日本的知识分子对于西方并不像中国那样一无所知，此时兰学也在日本传播了两百多年，所以日本在黑船事件后对于西方的学习并非盲目的崇拜，而是来自于对于对手的充分了解，可以说是真正的想要“师夷长技以制夷”。和中国的洋务运动一样日本一开始的学习也只停留在技术层面，佐久间象山也提出了“东洋道德，西洋艺术”这种类似于“中学为体，西学为用”的说法。但是很快日本人就发现文明不仅仅是“楼上楼下，电灯电话”这么表面的东西，福泽谕吉在1872年曾说：“学校、工业和海陆军不过是文明的外部形态，并不难以产生，所需的一切无非是钱。然而还存在一种无形之物，看不见、听不到，无法买卖、难以借贷。它遍及整个国家，影响力强大，如果没有它，学校或其他外部形态将毫无用处。这一极其重要之物，我们必须名之为‘文明的精神’。”附：       “西洋文明流入中日两国的途径大不相同。中国是通过商人流入，日本是通过知识分子流入。为什么西洋文明流入中国时，不通过知识分子，而是通过商人呢？因为中国的知识分子满脑子儒家思想，对西洋文明不感兴趣，他们即使看到了西洋的船舶器械等科技产品，也不为所动，觉得那只是夷狄的奇技淫巧，没什么大不了。……通过中国商人流入的西洋文明，只停留在外观层次，只是让市面上多了一些舶来品，以及让一部分商人学会日常会话用的洋文罢了。换言之，西洋文明的流入并没有对中国产生思想上的根本变化。日本则与此相反。在二百多年的锁国时代，日本的知识分子（兰学者）努力研究西洋学问（兰学），并且借着开班授徒与著书立说把吸收来的西洋学问授给其他日本人。因此，西洋文明可说是通过知识分子流入日本。这些知识分子因为文化水平较高，所吸收的都是西洋文明中最深层的部分，因此西洋文明通过他们流入后，便在日本产生思想上的根本变化。中国引进了西洋文明的肤浅外观，日本则引进了西洋文明的深层内涵，这就是为什么中国的文明化脚步如此迟缓，而日本的文明化脚步却那么快捷的原因。”                                                                                  ——《必须摒斥清国风》 1884 福泽谕吉", "answer_votes": "17", "answer_comment": "​3 条评论"}
{"answer_author": "吴天微", "answer_id": 25469757, "answer_text": "其实问题本身的提出就彰显了提问者知识结构的欠缺，把“发展速度”，偷换为“发展水平”，又把发展水平狭隘地局限在诸如科技创新，人均收入等等微观指标。。。忽略了不同国家起点不一，社会矛盾的结构和强度各异，进行变革的内外部条件也不同等等这些事实\n@姬轩亦 喵喵吐槽了“到底快不快”的问题。。。我就吐槽下“到底打开国门同时与否”的问题。。。（况且“打开国门”不是一个瞬发的魔法，而是一个长期过程，发展的内容也不简单等同于开放吸收外部要素，更重要的是改造原有的社会结构和经济结构）黑船开关是1853年，明治维新是1868年，甲午战争是1895年，日俄战争（此时日本已经初步工业化）是1904年。对应地，《南京条约》是1842年，《马关条约》是1895年，洋务运动是1860年以后，百日维新是1898年，辛亥革命是1911年，五四运动是1919年，国民大革命是1927年左右。看似是同一历史时期，但是要注意，日本是小国，而且是非大一统的小国，本土政治军事经济力量面对入侵者的反抗能力很有限（无论是积极反抗还是消极抵制），几乎不需要在“保守”还是“革新”之间做选择题（不开关就挨揍，江户的将军跑都没地方跑，北京的皇帝可以去西安），而且强势的藩阀可以通过短期的战争掌握政权力量，一旦做出明治维新这样的决策，执行过程中无非就是快慢问题，先打倒幕府，再死一个西乡隆盛，旧武士阶级就差不多了。中国呢？两千年传统的大一统帝国，中央有组织严密决策集中的成熟皇权政治，地方有绵延千年的儒家士大夫集团和配套的宗族体系，国土广大，人口众多，绝对经济力量庞大，入侵者只能蚕食，分割，无法绝对压迫，新的上层建筑也好，技术实践也好，要实施、推广，涉及到的矛盾关系，牵扯到的利益冲突，所必须的启动资源，远远不是一个割据岛国可以比拟的。另外，仅仅从微观社会结构上来讲，古典中央帝国那种扁平化的庶民-官僚社会，相比较日本国那种等级森严、军政合一的军事封建社会，缺乏一支既掌握充分资源、又具备接受信息能力、同时还能控制武装力量的“革命”骨干力量组织（日本的维新武士阶级），而中央帝国的皇权对地方延伸有限（满清还有个民族问题，不展开），士大夫阶级天然不需要变革现有秩序（要变革的部分在一开始不占主流），接受海外文化的新知识分子一开始不掌握足够力量。（这样的集团，要到国民党的“一大”才初步形成，而到共产党延安整风以后才稳定下来并且开始持续发货作用）综上，中国更大、更复杂、更缺乏变革力量，几乎不可能以一场明治维新式的运动（我们就把此后若干年的战争、暴动和暗杀也算作明治维新的一部分好了）来完成政治建筑和社会体系的转型，而只可能在反复的试错、回环中逐渐打开发展道路。“中日几乎同时打开国门”即使在形式上存在，打开国门的积极影响的传递效果却不可能等价。所以现实中的中国，从1840到1911，半个多世纪的古典社会和帝国政权的逐渐崩溃相叠加才导致了形式上的革命，又酝酿了十多年才有1927的国民革命正式开始击碎古典社会的一切组织结构，而这个过程要到1949年才初步完成（到现在远远没有完全完成)。我们就不提1979至今的某些短暂的历史回潮了。我其实很反对把中国，特别是前现代中国，在经济文化上作为一个集体去考虑，去和别的国家比较。北京和四川是一回事？北方和南方是一回事？十八省和边疆地区是一回事？城市和农村是一回事？平原和山区是一回事？当你把中国，比方说，和日本或者别的发达国家，就发展程度进行比较的时候，你是拿东京和北京比？拿上海和大阪比？还是拿你自己的家乡和哪里比？比的对象是数据指标还是主观体验？是整体实力还是局部水平？要是把中国看做欧洲大陆那样的整体，思考问题会简单很多。当然，我不是在鼓吹国家分裂，而是要正视政治大一统并不能直接导出经济和文化的均匀发展这个事实，既然古典社会都不可能均匀化发展，那么往现代性的转型怎么可能像小国一样在几十年的尺度内获得整体成功呢。如果你不知道中国有多大，有多丰富，就请坐一趟北京到广州的普通快车，尽量别睡觉，从窗户往外看，不要做别的，就看，然后记住，然后多想想。", "answer_votes": "125", "answer_comment": "​28 条评论"}
{"answer_author": "知乎用户", "answer_id": 19536984, "answer_text": "日本是单一民族构成的岛国，国土面积不大，地域差异较小。虽然德川幕府制定有闭关锁国的政策，但从历史上看，其经济对外依赖相对较强，也更重贸易；其文化也是输入性和借鉴性的。倒幕运动推翻了幕府统治，破除了革新的阻碍。王政复古，天皇亲政，统治合法性没有异议，保证了政局的迅速稳定，为革新提供了良好的政治条件。        中国国土面积的广阔和地域经济形态的多样性，使中国完全可以做到自给自足。清王朝作为少数民族入主中原的朝代，民族矛盾一直存在。满清贵族对汉族的防范和汉族对满清统治合法性的质疑自始至终从未消失。镇压太平天国后汉族地方势力的崛起对满清贵族统治也形成了挑战。内生的、长期延续发展的儒家文化具有强大的文化惯性，文化认同甚至在一定程度上超越了民族认同。        清王朝内部的民族矛盾，政治紧张，经济的自给自足和文化惯性决定了其难以适应西方文明的挑战，难以作出改变，即使作出改变也三心二意。对于统治者来说，攘外必先安内，一切施政在于维护自身统治，因此才有刚毅的“宁赠友邦，不与家奴”，才有慈禧的“量中华之物力,结与国之欢心。”       辛亥革命虽然革了清王朝的命，但清王朝彼时本就徒具其表，其灭亡反而打破了脆落的政治平衡，形成了权力真空，政治处于混乱之中，谈何发展。－－－－－－－－－－－－以下为看了回复后的一些补充－－－－－－       首先感谢评论中几位的肯定。历史是复杂的，存在不同角度的解读，是正常的也是必然的。但在知乎这样的网站讨论历史问题，最好还是严肃平和。作为非专业人士发表看法，可以粗疏简陋，但不要戏谑不恭。特别是近代史，与当今人、当今事有着千丝万缕的联系，避免预设立场、简单臧否和情绪宣泄，才是有意义的讨论。        对上面几位提到的几个观点，说一下自己的看法，不一定正确，大家探讨。        一是关于朝鲜。的确，朝鲜国土面积亦小，但其与大陆接壤，因此，与日本不同，长期以来，朝鲜从来就不是一个真正意义上的独立国家。近代以来，朝鲜夹在中、日、俄之间，生存尚仰人鼻息，根本不具备革新的条件。此外，日本虽然借鉴了汉文化，但孤悬海外，其实内化形成了自己的特性。而朝鲜受汉文化的影响之深，远胜日本，另起炉灶的阻力必然更大。        二是小国认干爹，发展快。这实际上已经是地缘政治的问题。当然，这在一定程度上可以算作小国易于崛起的条件，但绝非必然。外因发挥作用，必依赖与内因。其实国无论大小，在发展过程中，受到外部制约遏制都是必然存在的。过于强调外因而忽视内因，不免自我开脱之嫌。20世纪两大阵营的意识形态竞争掩盖了许多内在的，本质性的问题，应切忌简单的归因于此。        三是甲午海战。甲午战争起于对朝鲜控制权的争夺，终于日本占领台湾，起于陆战，终于陆战，本就不仅仅是一场海战。黄海海战成为这场战争的象征，是因为号称亚洲第一的北洋水师彻底覆亡的悲剧性。从整个战争的角度来说，军政体制混乱，战略理念、战术素养、后勤保障全面落后的清朝军队必败无疑。即使是海战，北洋水师虽然在战舰总吨位上处于优势，但巡航速度和火炮发射速度则处劣势，远海作战几无胜算。黄海海战失利后，北洋水师主力尚存，退避威海卫，希冀通过陆防、海防、舰队联合作战自保。但怎奈日军沿陆路长驱直入，保卫舰队的防军大多一触即溃，甚至不战而逃，威海卫迅速失陷，北洋舰队被困于自家军港，从而彻底覆亡。北洋舰队和晚清一样，本就大而无当，徒具其表，其近代化的外衣下，掩盖的是整个国家腐朽没落的机体。外强中干，战败几乎必然，战胜才是偶然。 在此，推荐一下宗泽亚的《清日战争》，此书胜在史料丰富，可以帮助我们透过表象，深入思考这场战争。        即使甲午战争清朝战胜（虽然我认为几乎没有可能）。我认为也只会延阻日本的崛起，并不代表中国会迅速近现代化并崛起。阻止中国进入近现代化的内因不会因为一场战争改变。中国内部的矛盾甚至可能会因为战胜而加速激化。晚清，满清贵族已彻底腐朽，政权维系靠的是威权惯性，以及与崛起的汉族地方势力妥协维持平衡。甲午战争，主要依靠李鸿章的淮军和北洋水师，战败固然很痛，战胜朝廷未必不如芒在背，一系列的内部斗争和政治洗牌在所难免。       1876年，日本驻清国公使森有礼赴任时与李鸿章有过一次谈话。李鸿章对日本模仿欧洲风俗穿欧式服装提出质疑。        森有礼在应对中说到：清朝开国最初推行的服装式样，喜欢的人也许并不多。        李鸿章：此乃我国的变革，但绝不掺入西洋的风俗。 森有礼：虽谓之变革，然贵国的变革却是强迫的变革，贵国人民不是经过一段苦痛的忌嫌期吗？        李鸿章：此乃我等为勤皇笃志的结果……请问阁下你对亚洲和欧洲的交际，将来的发展有何高见？ 李鸿章急转话题。此时清朝统治已逾两百年，一些事尚属敏感词，以至直隶总督兼北洋通商大臣避之惟恐不及，中国内部之紧张可见一斑。", "answer_votes": "444", "answer_comment": "​57 条评论"}
{"answer_author": "李飞", "answer_id": 28531024, "answer_text": "关于这个问题，很多人都无视一个事实就是日本在商品经济上在西方人彻底入侵前走的比中国远。首先要提到一个历史事实，就是中国广袤的领土为小农自然经济提供了足够的发展空间，而日本总是在历史上因为土地分配问题而出了大事(廉仓幕府倒台与反蒙作战利益分配不公，丰臣秀吉侵朝战争与统一后功臣土地不够分的关系)，同样中国也存在土地问题，比如王朝末年土地兼并等等，不过日本这个矛盾可比大陆严重多，在16世纪的时候日本就是全世界人口最稠密的地区，日本这个顺风顺水的地方制造了如此之多的人口和这些人口之上如此之多农村武士阶级(丰臣秀吉这种发迹前的炮灰都是武士么)。那么土地不够分，粮食又够吃，结果就是不管平民还是破落武士，大量无地人口涌入市镇，手工业和商业得到了长足发展，而特别是战国期间，像一向宗这种脱离封建组织的武装建立的地盘就有相当的商人参加，而地方上日本商人也是不断寻求政治权利介入日本大名的政治(和欧洲威尼斯那些商人一样，日本商人也依靠钱开始干预着政治)。后来德川幕府时期就更不得了，天下和平下来以后就是日本各路商品的增加和消费。这个时期出现了大坂，京都等地帮忙武士俸禄大米结算成货币的大商人，而且在这个期间日本稻米价格一路跌的滥价而其他商品价格也是涨的一塌糊涂，最终结果是这些做货币结算的大商人靠帮武士买卖和借债给武士，不仅获得了华族的身份还垄断了经济，而这些大商人的发展到现在就是大家熟知的三井，住友之类(反过来中国有过吗？)所以这些商人发展起来，武士土地上收上来的稻米值不了几个破钱，那日本封建制度被更加强大的欧洲商人踹一脚后就彻底崩塌，而起来的就是这些本来就算武士或者贵族里一员的日本商人阶级，仔细看历史就看的出来，比如萨摩蕃早年出兵琉球，其根本目的就是为了和中国做生意，所以在实际控制下却保留他向中国称臣的活动。如果不注意到日本16世纪以来商人阶级的崛起，怕是很难解释日本为何会如此之快模仿西方建立起一个准西方工业文明国家。", "answer_votes": "20", "answer_comment": "​添加评论"}
{"answer_author": "苏菲乐", "answer_id": 25868681, "answer_text": "我现在感觉。。。知乎更适合回答一些科技类、电影音乐类，还有经济类的问题。。。做成豆瓣，可能更好一点儿。。。历史问题，真不适合在知乎这个平台上讨论。。。太可怕。感觉中国人谈历史，很情绪化。。。跟着感觉走，常识和细节，完全不要了。。。", "answer_votes": "13", "answer_comment": "​6 条评论"}
{"answer_author": "火龙果", "answer_id": 26168490, "answer_text": "根据 Michael Mann 的 The sources of social powers，日本在19世纪跟中国比具有多方面的优势。1.日本各地之间联系更紧密，集体行动的能力更强。2.日本的国家建立在一个中央军事力量之上，中国没有。（这意味着中央政府更稳定，只要愿意，也更有能力去推动变革）3.日本人口更集中，更能够进行民族动员。4.当时的日本更为商业化，有更强的文化一致性。5.城乡差别也比中国小6.日本的精英比中国的精英，更能够同时控制中央和地方，因此更有能力施加改革。7.跟中国比，有三十年的缓冲期。美国当时在内战，而英国和俄罗斯都对中国更感兴趣。这几点原因，上面有不少答案也提到了。不过需要进一步说明的是，这几点几乎都可以追溯到基本的地理因素上。而地理因素中最重要的一个就是日本的国家更小。现代历史，基本上就是规模中等的国家把更大和更小的国家打得满地找牙的故事。最早发展起来的国家，都是英国和法国——以及日本——这种中等规模的国家，俄罗斯和中国以及奥匈帝国、土耳其，当然还有印度等等这种更大规模的国家，基本上没有一个不是非常吃亏，非常郁闷的。PS.今天的研究大多着眼于军事、政治结构、经济社会等因素，很少谈什么民族性了。民族性的解释大体上是这个逻辑：A比B本质更好，所以结果更好。这种思考模式太“前现代“了。", "answer_votes": "5", "answer_comment": "​3 条评论"}
{"answer_author": "冷哲", "answer_id": 19588831, "answer_text": "谢谢邀请。这个问题可以分两个角度说：一个是为什么日本转型快，另一个是为什么中国转型慢。日本转型快，有三方面的原因。第一，从学习A转向学习B是很容易的。这里面没有一个心态转换的问题。日本已经习惯了大举借鉴外国制度、文化的政治模式，对此并没有多少抗拒。第二，船小好掉头。说白了就是，日本本身力量并不大，内部势力纠葛相对简单。这不像大国内部利益集团盘根错节，而且实力都不弱。日本的政治力量相互妥协，并推动根本性的变革，也就相对简单。比方说倒幕运动中几个强藩，一开始有的主张保持幕府，有的主张推翻幕府，但其目标其实都是要改革。这几个力量在彼此斗争中很快就联合起来，成功推翻了幕府。如果中国的形势这么（相对）简单，也轮不到袁世凯逼迫清帝退位，太平天国或者曾国藩恐怕都已经把清廷扫进坟墓了。第三，日本当时适逢德川幕府衰微，形成了中央弱而地方强的不稳定格局。强大的地方势力，又基本都是依靠着海上贸易的。他们的流动资金比幕府宽裕，同时也有经济上进行改革的必要性（无论这种改革是用“尊皇攘夷”来完成，还是名义上拥护幕府的“公武合体”来实现）。因此在日本需要大规模改革的时候，恰恰也是其政治不稳定的时期；最强有力的政治势力，恰恰是在对外贸易中赚得最多的政治势力（也就是对外界最为了解的）。这两个要素合并到一起，就促成了倒幕运动以及之后的大规模改革。那么反过来说，中国转型慢，也有几个原因。第一，中国从来都是本地文化的主导者。从来没有过大规模学习外国的经历。这个心态的转变，需要一段时间。实际上中国这个心态的变化花费了至少60-70年时间。这就是三代人的时间差。因此，中国在学习欧美方面自然有劣势。第二，中国当时的统治者是异族。有的事情，本族统治者可做，而异族不可做。这是因为异族统治者天然会受到汉族的怀疑。因此满清一代，总是（至少在表面上）极度尊崇中国传统文化，不敢越雷池半步。这也是为了减少汉族民众对其统治的质疑。这导致了，满清在面临文化激变的过程中会比汉族统治者更加保守，更不愿意改变。第三，很多巨大的政治转变不是说主政者忽然开窍了，把事情改变了。而是说，反对派把主政者推翻了。然后反对派开始执行新的做法。原有的主政者未必不愿意进行相关的改变，但是一个政体的过度成熟会导致内部利益集团盘根错节，任何大的改革都举步维艰。日本幕府倒掉了，因此得以全面转变。而满清几十年在台上，自然无助于激进改革。中国是个大国，要撼动整个政局，是非常困难的。一次巨大的起义，也未必能改变什么。清廷到1900年代中期才开始正经改革，比日本已经晚了40来年。而拖到1912年满清才算彻底倒掉，很多重大的改革这才逐渐推广开。第四，中国是个大陆国家，而不是海洋国家，与对外贸易有关的力量在社会中占的比例太小，不足以像日本那样达到能够立刻改变整个政局的水平。因此，在满清时代，主导性的力量未必对世界有充分的了解，改革的方向自然也很难找准。", "answer_votes": "1.2K", "answer_comment": "​89 条评论"}
{"answer_author": "苦头陀", "answer_id": 20130868, "answer_text": "首先为自己的不成熟惭愧，还是产生了这么一个不够切题的产物。忍不住说理的心，想说一说心中的观点想法。愿我对表达的热爱不违背知乎精神。以上是图穷，现在开始看一点别的，以下的文字是为支持最高的@凯达 的答案而写的，斜体字为引述原文全文，“个人观点”之后为自己所写的部分。日本现在还在纪念打开日本大门的美国海军准将佩里将军，中国在纪念鸦片战争的林则徐个人观点：黑船和鸦片给中日带来的全然不是一个层面的影响，日本收到的掠夺与侵害与中国受到的掠夺与侵害全然不在一个数量级。以此为中国发展速度不如日本的理由，一不服求辩。日本拼命向他的敌人美国学习，中国拼命制造反美情绪非个人观点：日本明治维新学的是欧洲，这个不辩，一指错求改。日本认识到落后不仅是器物层面，关键是制度落后；中国则是天朝大国，“祖宗之法不可变”，五不搞，三个自信日本从明治维新之后就和现代文明接轨，中国五四之后和苏联帝国红色文明接轨，至今仍然游离在世界文明的大门之外个人观点：民治维新后日本进入扩张之路，发动多次对外战争，如果这是与现代文明接轨，何谓现代文明？一不知求解日本不会盲目抵制XX货，而是向虚心对手学习，从而制造出质量更好，价格更低廉的产品；中国不光抵制日货，还砸同胞的日本车，打买日本车的同胞，在此之外可能就只会抄袭了日本1931年已经普及了初中义务教育，中国今天还没普及九年制义务教育日本在战后百废待兴的情况下，花费大量财力投入教育；中国在GDP位居世界前列时呼吁大家为希望工程捐款个人观点：战后百废待兴投入大量财力教育和呼吁为希望工程捐款是两件无关联的事，将二者嫁接起来是有一些瞒天过海的效果的。中国近年来在预算中对教育的开支都有罗列，相较外国有过而无不及。以希望工程为一叶不知欲障何人目？二不知求解日本大地震发现学校最坚固；中国大地震发现政府大楼最坚固个人观点：没找到任何政府大楼比学校坚固的证据，相信楼主不是信口开河以图蒙蔽的人，所以我坚信是我找不到，所以这是第三不知求解。日本每年人均读书超过8本；中国每年人均读书不超过1本非个人观点：第九次全国国民阅读调查中国2011年18—70周岁国民人均读书4.35本。相信答主并非捏造数据以图蒙蔽的无良之徒，此处求解，也可求改。日本明治维新后大力扶植私人企业，甚至贱卖国有资产；中国至今还在努力进行国有资产保值增值个人观点：扶植私人企业包含的企业可有石油军工企业？我不曾见。国有资产保值同时进行的国企市场化先生当真视而不见？以不同的企业产业笼统的一概而论，至少让我有了一种政府只会无良敛财的误解误导。我相信这不是答主所希望达到的效果，所以此处可谓求解，也可求辩。日本人在国会争得面红耳赤，中国人在阶级斗争中斗得你死我活个人观点：在被坚船利炮打开国门的至少80年时间内，中国人没有在阶级斗争中你死我活，日本军部非合法刺杀政见不合，避免战争的大臣事件屡见不鲜。可中国还是在与日本的交锋中显示出了不够先进的一面。这是不是能够说明所谓国会和阶级斗争并不是真正导致两国进步速度不一致的原因呢？此处求解也可求辩。日本在二战后大力发展经济，中国在二战后进行轰轰烈烈的阶级斗争日本二战后充分依靠美国援助，中国二战后非但不要赔款，还要勒紧裤腰带援助亚非拉穷哥们个人观点：援助、赔款不是伸手拿的，而是用实力拿的，实力弱，谈判桌上的腾挪就不及旋踵，所以我们现在以此嘲讽当年的决策，虽然大理昭然，但是扪心自问并不公平。此处内容复杂，不意争辩，出于一时意气出个头。若是其他点辩驳无力，尽可以在此点批判我，我只会认错，不会还嘴。日本二战后努力和世界各国建立改善关系，中国二战后既反帝又反修，最惨的时候只有阿尔巴尼亚等几个朋友日本有着世界最高水平的食品安全体系，中国有着世界最百毒不侵的人民群众日本最大面额纸币印的是思想家福泽谕吉，其次是教育家新渡户稻造，中国纸币上印的谁我就不说了日本人被“篡改”的历史教科书的使用率不超过2%，中国未被篡改的教科书使用率达到100%个人观点：完全没看懂你的意思，不敢多加揣测，希望得到解释后再做理解。求解释日本老兵战后得到国家良好的战争抚恤，死后葬入神社，中国老兵被打成现行反革命，不少镇反被枪毙，苟活下来的也历经批斗，现在生活窘迫---------------------------------------------------------------------------------------------------------------------------------个人爱讲道理，有事实有逻辑我会心悦臣服，承认错误。我的热情会促使我和一切言辞有理有据的讨论问题的人进行交流，不幸的是，我在人身攻击，划定身份，强行分派等方面不甚了解，所以我的能力仅支持与言理言据的人坦诚交流。答毕", "answer_votes": "4", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 26330598, "answer_text": "我想提一件很重要的事是海洋政策。日本在东亚的霸权，可以类比英国在欧洲的霸权。日本海岸线绵长，港口众多。在那个“得海洋者得天下”的时代，因为有大量的渔船商船军船，并经历了甲午战争之后取得了亚洲东部的制海权（其实我想用甲午海战和英国-西班牙海战对比来着），导致在亚洲东部获得了海上霸权。而且作为人口大国，日本的生存根本离不开海洋。成百上千的渔船开出港口，到海上撒网、捞网，带回的海鲜不仅是普通人民碗里的烤鱼，也有江户上流人士享用的生鱼片。更不要说远离大陆、背靠大洋这一点在外交、政治上的优势了。面向海洋的政策反过来使得这个社会更能接受外来的新鲜事物。因为在那个时代，海路是最重要的信息通道。国外的新技术、情报在海上移动的速度远远超越了陆地。此外日本对外扩张第一步就是占领当时的财货流散地——琉球。不知道是不是有意识地在顺着海权这条路子走。//反观中国，因为陆地领土太大，在清末经常在陆权海权两方面顾此失彼。中国内陆的富饶农田已经足以养活这个国家的人口。即便是依赖四川、两湖的稻米，两江的百姓也更宁愿从事利润更高的桑蚕、纺织。当时的中国平民根本没有动力去正视自己的海岸线。即使中国的沿海地区分裂了出来，清朝退回东北并且承认这个新的政权，它还要面对来自内陆的其他地区的威胁。╮(╯_╰)╭至于东北的陆地领土是清朝死守的棺材本、清朝对上沙俄在中亚角逐、叛乱此起彼伏都是很大的题目，但都是围绕着陆地这根主线在转。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "林宏程", "answer_id": 25879173, "answer_text": "日本是贵族制社会，多中心的治理模式比较能够与资本主义生产模式对接。中国是帝国制社会，一统江山的模式与多中心的资本主义模式不相容。其不相容体现在：第一，社会缺乏自生力量和活力，不是有首诗吗，万马齐喑究可哀。第二，权力扭曲了社会生态，使得资源集中于权力而非经济生产，无法形成有实力的商人阶级。第三，社会精英高度堕落，沉迷于权力游戏，无法转变视角，考虑国家发展问题。结果就是，没有人认真研究西方的文明优势。是天朝上国的骄傲吗？核心还是高度集权下的社会，人们的思维和视角都被束缚在权力游戏上，没有人关注真理和现实。换言之，中国社会死水一潭，死猪不怕开水烫，打也打不醒。日本尚保持一个清醒的状态，遇到问题就认真去研究去解决，而社会形态（封建社会）也很容易向资本主义社会过渡。另外，有几种说法值得商榷。一说是日本善于学习，之前学中国，现在学西方，没啥负担。这个说法是想当然的说法。日本学中国，也有一千多年的沉淀，早就形成稳定的社会政治结构，要转变也不容易。说之前反正是学中国的现在学西方没包袱，完全是一种拟人化的描述。还有什么船小好调头一说，借用了企业经营的概念。就社会转型而言，大小不是关键，形态的契合度才是关键。还有一说是中国的文化自大心理。这一说的前提是中国人都是传统文化的恪守者。这太抬举清朝人的政治觉悟了，仿佛人人都是尧舜。就统治阶级而言，绝大多数都是投机钻营的利益分子，压根没有任何信仰。反而像曾国藩之类的坚持捍卫儒家价值的士大夫，对西方保持一种开放和学习的态度。可以说，凡是真正关心国运的社会精英，无不关注西方文明，在关注之后，也无不赞叹其优势，包括政治上的优势。中国之所以没有转型成功，与其说反对力量太大，不如说麻木不仁，丝毫不关心这类事情。从后来公车上书的情况看，中国的知识分子——代表了传统文化的第一捍卫者，丝毫不反对改革，只是以前不关心罢了。", "answer_votes": "10", "answer_comment": "​1 条评论"}
{"answer_author": "知乎用户", "answer_id": 19538700, "answer_text": "其实吧我觉得德川幕府的施政水平高于明清两代政府，这是一个关键因素所以明治一开始就很少包袱，工商业有现成的财阀，士族华族均听话，等等，总而言之，社会结构很始于搞从上而下改革，因为要做的事情其实真的不多。反之明清么，只能说一手烂牌。国运是什么玩意？说到底，其实就是19世纪以来，非西方国家接受近代化的程度。中国为何没有在王朝时代就接受现代化，这一点既复杂又简单，因为中国几乎是距离西方式近代化距离最遥远的国家，这种转型之困难是日本无法相比的。日本在德川时代其实国民经济已经大规模的商阀化了，经济上接受西方近代经济模式并没有根本性的障碍，无需像中国那样借助死路一条的官办-官督商办，国内市场本身已经高度适应于转口贸易（没错，德川时代的日本已经是东亚最大的转口贸易国），相比于中国本身就更加亲近世界市场。要做的只是技术和概念的引入而已，而中国则需要完全改造一套全新的经济体系，在买办经济兴起之前，当时的几大商帮其实都高度依赖于朝廷的特许经营，就全国而已，商业力量在整个国民经济中的影响是相当薄弱的。至于国政，日本本就没有中国王朝式那样无所不在的一元政治结构，由于藩国的存在，其实早在王政之前，地方级别的近代化已经开始了，王政之后要做的只是最上层的变革而已，只要一个新的职能政府建立起来，意识形态上的开放性本身就能导致日本很快的适应这种新的国家形态。而中国政府转变为近代职能化政府有多么困难，清末的历史已经很明确的告诉我们了。而日本很早就处于社会归社会，政治归政治，经济归经济的状态中，这样的国家能够迅速转型不是什么出人意料的事情，其实明治政府的规模很小，哪怕是对应于日本的那点人口，相比之下，我们很难想象清末的北京朝廷能够有效的改组为一个完整的近代职能政府，拥有一套近代的财政和政务体系。军事之类的，说到底只是经济和政治的折射，你以为大清不希望自己有一只完全近代化的现代军队吗，问题有钱吗，有了以后又怎么去管理和使用呢？这就是为什么近代的中国军队诞生于地方，而不是中央的根本原因。这三点下来，中国近代化的难度本就远远在日本之上，所以后者的崛起不过只是前者陈旧和硕大的一种对比而已。", "answer_votes": "11", "answer_comment": "​20 条评论"}
{"answer_author": "星希", "answer_id": 19542349, "answer_text": "其实这个问题，100多年前，福泽谕吉先生早就给出了答案，清清楚楚表达在他的「脱亚论」里：　　随着世界交通的手段便利起来，西洋文明之风逐日东渐。其所到之处，就连青草和空气也被此风所披靡。大致说来，虽说古代和今天的西洋人没有多大不同，但他们的举动在古代较为迟钝，而今天变得活跃起来，无非是利用交通这个利器的缘故。对于东方国家的当务之急来说，此文明的东渐之势十分强劲，如果下定决心来阻止它的话，这样做倒也不是不行，但观察当今世界的现状，就会发现事实上是不可能的。莫不如与时俱进，共同在文明之海中浮沉，共同掀起文明的波浪，共同品尝文明的苦乐，除此之外别无选择。 　　　　文明就像麻疹的流行一样。眼下东京的麻疹最初是从西部的长崎地方向东传播，并随着春暖的气候逐渐蔓延开来。此时即便是痛恨该流行病的危害，想要防御它的话，又有可行的手段吗？我确信没有这样的手段。纯粹有害的流行病，其势力的激烈程度尚且如此，更不要说利害相伴、或利益往往更多的文明了。当前不但不应阻止文明，反而应尽力帮助文明的蔓延，让国民尽快沐浴文明的风气，这才是智者之所为。 　　　　西洋近代文明进入我日本以嘉永年间的开国为开端，虽然国民渐渐明白应该采用西洋文明，气氛也逐渐活跃起来，但在通往进步的大道上，却横卧着一个守旧衰老的政府（这里的政府指德川幕府――译者注）。应该如何是好呢？保存政府的话，文明是绝对进不来的，因为近代文明与日本的陈规旧套势不两立。而要摆脱陈规旧套的话，政府也同时不得不废灭。如果试图阻止文明的入侵，日本国的独立也不能保证，因为世界文明的喧闹，不允许一个东洋孤岛在此独睡。 　　　　对此，我们日本的有识之士，基于“国家为重”、“政府为轻”的大义，又幸运地依靠帝室的神圣尊严（这里的帝室指天皇――译者注），断然推翻旧政府，建立新政府。国内无论朝野，一切都采用西洋近代文明，不仅要脱去日本的陈规旧习，而且还要在整个亚细亚洲中开创出一个新的格局。其关键所在，唯“脱亚”二字。 　　　　虽然我日本之国位于亚细亚东部，但国民的精神已经开始脱离亚细亚的顽固守旧，向西洋文明转移。然而不幸的是在近邻有两个国家，一个叫支那（这里的支那指中国――译者注），一个叫朝鲜。这两国的人民，自古以来受亚细亚式的政教风俗所熏陶，这与我日本国并无不同。也许是因为人种的由来有所不同，也许是尽管大家都处于同样的政教风俗之中，但在遗传教育方面却有不尽相同之处。日、支、韩三国相对而言，与日本相比，支国与韩国的相似之处更为接近。这两个国家一样，不管是个人还是国家，都不思改进之道。 　　　　在当今交通至便的世界中，对文明的事物不见不闻是不可能的。但仅仅耳目的见闻还不足以打动人心，因为留恋陈规旧习之情是千古不变之理。如果在文明日新月异的交锋场上论及教育之事，就要谈到儒教主义。学校的教旨号称“仁义礼智”，只不过是彻头彻尾的虚饰外表的东西。实际上岂止是没有真理原则的知识和见识，宛如一个连道德都到了毫无廉耻的地步，却还傲然不知自省的人。 　　　　以我来看，这两个国家在今日文明东渐的风潮之际，连它们自己的独立都维持不了。当然如果出现下述的情况的话，又另当别论。这就是：这两个国家出现有识志士，首先带头推进国事的进步，就像我国的维新一样，对其政府实行重大改革，筹划举国大计，率先进行政治变革，同时使人心焕然一新。如果不是这样的情况，那么毫无疑问，从现在开始不出数年他们将会亡国，其国土将被世界文明诸国所分割。 　　　　在遭遇如同麻疹那样流行的文明开化时，支、韩两国违背传染的天然规律，为了躲避传染，硬是把自己关闭在一个房间里，闭塞空气的流通。虽说经常用“唇齿相依”来比喻邻国间的相互帮助，但现在的支那、朝鲜对于我日本却没有丝毫的帮助。不仅如此，以西洋文明人的眼光来看，由于三国地理相接，常常把这三国同样看待。因此对支、韩的批评，也就等价于对我日本的批评。 　　　　假如支那、朝鲜政府的陈旧专制体制无法律可依，西洋人就怀疑日本也是无法律的国家；假如支那、朝鲜的知识人自我沉溺不知科学为何物，西洋人就认为日本也是阴阳五行的国家；假如支那人卑屈不知廉耻，日本人的侠义就会因此被掩盖；假如朝鲜国对人使用酷刑，日本人就会被推测也是同样的没有人性。如此事例，不胜枚举。 　　　　打个比方，屋院相邻的村庄内的一群人，在他们出现无法无天的愚行而且残酷无情的时候，即使这个村庄里偶尔有一家人注意品行的端正，也会被他人的丑行所淹没。和这个例子一样，支、韩两国的影响已成为既成的事实，间接地对我外交产生了障碍，这样的事情实际上并不少，可以说这是我日本国的一大不幸。 　　　　既然如此，作为当今之策，我国不应犹豫，与其坐等邻国的开明，共同振兴亚洲，不如脱离其行列，而与西洋文明国共进退。对待支那、朝鲜的方法，也不必因其为邻国而特别予以同情，只要模仿西洋人对他们的态度方式对付即可。与坏朋友亲近的人也难免近墨者黑，我们要从内心谢绝亚细亚东方的坏朋友。 先生之言，时至今日，愈加发人深省。", "answer_votes": "54", "answer_comment": "​16 条评论"}
{"answer_author": "华夏英灵", "answer_id": 36104329, "answer_text": "其实当时的日本就类似于文艺复兴的欧洲，整个社会已经为近代化做好了一切准备，唯一的障碍就是幕府和分裂。我记得日本识字率在经过寺子屋教育多年以后已经超过百分之50，而中国当时男性识字率貌似不到百分之20，女性几乎完全文盲。自工业时代以来，一个国家发展，最重要的就是具备基本文化素养要求的人口数量。这就好比普及了九年义务教育，大学年年扩招的中国可以做世界工厂，印度就不行。很多人容易忽略的一点是，日本其实很早就是人口前几的大国，日本倒幕后的人口数量超过了英法等国的本土人口，配上这样高的识字率，再加上很久以来的商业文化，崛起是非常正常的。", "answer_votes": "3", "answer_comment": "​添加评论"}
{"answer_author": "良知无畏", "answer_id": 66140539, "answer_text": "日本变法图强，而中国固步自封。日本：“毫无可耻之处，我们还以这些变革感到骄傲。这些变革决不是受外力强迫的，完全是我国自己决定的。正如我国自古以来，对亚洲和其他任何国家，只要发现其长处，就要取之用于我国。”（森有礼答李鸿章问）中国：“中国文武制度，事事远出西人之上，独火器万不能及。”（江苏巡抚李鸿章致总理衙门原函）", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 25828360, "answer_text": "嗯，我说一下答案。中国开国门后停滞了快100年没发展，日本发展了100来年，打断两次腿，现在比我们发展的前头也是正理。中国所在地区的文明是一个依靠尽可能不改变基层动员架构的政治制度来确保统治阶级始终拥有资源分配能力的文明。这两千年也就王安石说了“乃教之不畏天变，不法祖宗，不恤人言，则何事不可为也？”。到了异族控制末期，防家贼还来不及呢，哪来得及变革，变革也要主子们先吃肉不是？（1911玩笑般的贵族内阁）", "answer_votes": "5", "answer_comment": "​2 条评论"}
{"answer_author": "知乎用户", "answer_id": 119696469, "answer_text": "因為中國人的思想落後了。这“光辉灿烂的传统文化”，早就变成了废铜烂铁。也不提被列强打了，让蛮族入主两回，已经显示这种思想指导下的所谓正统政权是僵化的，面对外界的军事压力，有的国家会加强军事，有的国家不会加强，只会抱残守缺直到灭亡，中国政权正是后一种。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "huang liu", "answer_id": 76129971, "answer_text": "前言--------不知何以为兴，焉知何以为衰 　　近来的东瀛，热闹得很，修宪称军喊万岁，眼花缭乱，让人不禁怀疑是不是鬼畜米国在四岛上空投了什么兴奋剂、搞了什么生化试验。说起来，战后的日本，脑子里叨念着“皇国”、“皇军”可是好几回了，世人通常把它怪罪为“军国主义思潮”，不过在我看来，这只缘于一个因素，或者说四个字----------“刻舟求剑”。　　在日本人眼里，古代的“神国史”不算，自打近代以来，真正舒坦的只有明治时代-----大正这个呆子治理下的脚盆鸡有了皿煮，可也来了贪腐，经历过的人都骂那是最黑的时候；昭和就不提了，亡国之君有什么可说的。还是明治大帝那光景好--------人才辈出、国威赫赫，打哪儿哪儿服、做啥啥成，几十年把日本从半殖民地搞成世界大国，简直是开了挂啊！自打明治以后，日本人一过得不舒服，就想去找明治大帝看看有木什么精神遗产可挖---------上世纪20年代末，日本人觉得那些鸟政客贪污腐败，弄得国内贫富差距太大，想出的法子是什么？读《古事记》、读西乡隆盛等维新三杰的传记，说白了，就是找明治去；后来到了90年代初，人陷入“失去的十年”，NHK拍了什么纪录片-----------关于“明治人”的，还是找明治。要说现在的日本人想着天皇元首制、想着国防军、想着“帝国”全是因为军国主义，那倒真有点冤枉人家，人家就是想重新过得舒坦点，好像只要人人学“明治人”，日本就又能冒出一堆伊藤博文、大山岩、东乡平八郎来，又能“心想事成”地过上好日子。　　遗憾的是，这其实只是“刻舟求剑”而已，没有战略头脑的鬼子从来就不知道：他们的崛起，从一开始就是非常国际政治、地缘政治和科技背景下的“历史插曲”；他们的的确确只是因为中了一张“历史彩票”，所以才有了那100来年的“大日本帝国”风云；“明治人”只是他们崛起的必要条件之一，还是那占比不太大的一块；他们只看到自己因战而兴、因战而败，只看到30年代的“失策”，而不知道这一切其实都是从他们崛起的那天就定下的宿命。　　一切的一切，都还要从大家在研究这段历史时不那么关注的一个盟约------英日同盟开始说起。一 万里之遥，疆土怎保？----------约翰牛的忧虑　　为什么要说起英日同盟呢？因为事实上，脚盆鸡能有当年，完全是拜大英帝国的霸权所致。 龙腾网 龙腾网 - 倾听各国草根真实声音，纵论全球平民眼中世界　　我们一起来重新回顾一下19世纪的风云激荡吧，19世纪是殖民主义的时代，用彭总的说法就是西方资本主义国家来到欠发达地区，“架起一门大炮，就能统治一片土地”，整个世界都是英、法、西、俄等资本主义强国跑马圈地、违章搭建的大园子。为了殖民地，这些哥们也没少开架，鸦片战争等欺负发展中国家王公们的仗自不待言，从七年战争到克里木战争直到二战，这些哥们自己也没少火并，更没少黑吃黑（普法啊美西啊，大家都懂）。在这些“道上中人”里，地盘最大、声名最响的，莫过于号称“日不落”的大英帝国约翰牛了。　　现在让我们坐在19世纪唐宁街的首相官邸里，以大英帝国首相的身份站在大英皇域图，哦不世界地图面前，开始思考一个问题---------怎样完成19世纪大英首相的任务：拓展并确保大英帝国的全球原材料来源和市场，或者直白地说，是殖民地和势力范围（即半殖民地）。　　先来看看欧洲，请记住，直到19世纪末以前，欧洲大陆基本没有汉斯喵什么事儿，汉斯喵那旮旯主要是充当战场的，当时制霸欧陆的是高卢鸡和KUMA熊，而这两家共同的特点是陆军NB，“左拿帝右彼得”不是假的，盎格鲁撒克逊这帮海盗，玩海战那是一个溜儿，要他们在陆地上玩命，自古证明是不怎么行的（要不英法百年战争怎么最终被法国佬赶回去了？），能为联军贡献一个威灵顿，那就真心了不起了，全世界没听说过陆军要学他的。但为了确保欧陆上不出现又一个“罗马帝国”，他们需要始终保留多数主力军，用来准备随时在高卢鸡和KUMA熊之间插一脚。同时鉴于欧洲是那年头的第一世界，各国造船能力都不错，又是自己家门口，英军始终在家门口和地中海保有相当实力的海军力量。 龙腾网 龙腾网 - 倾听各国草根真实声音，纵论全球平民眼中世界　　再来看看非洲，非洲这些个只会用飞梭和竹枪的土人，不足为虑，但非洲一方面是重要的矿产和人力资源（黑奴们在控诉）产地，更重要的是距离欧洲近，在那个没有灰机的年代，这个地理优势可以说非常重要，而距离欧洲近，就意味着第一世界的主要竞争对手也比较容易抢，所以在非洲，尤其是北非，英帝国也保有相当之军力，同时别忘了，在没有苏伊士运河的时代，好望角就是两洋唯一的沟通点，所以英帝国在南非要费尽心力打布尔战争，也因此好望角也是英帝国海军重要的活动据点。　　然后来看看西亚，要说近东有什么牛国，那是扯淡，奥斯曼土耳其早就不行了，阿拉伯国家那会儿还不是狗大户，都啃沙子放牧呢。不过那地儿倒是三大洲通衢（所以别以为“横跨几大洲”有啥了不起，就近东那旮旯，只要欧洲占个角，埃及占个角，西亚占个角，那就妥妥的“横跨三大洲的大帝国”来着），又能堵住KUMA的出海口，所以那里也向来是英国陆海军布置的一个点，从克里木战争到一战达达尼尔海峡战役，这个旮旯和老毛子没少打，火鸡还雄起过一次（就是达达尼尔海峡战役）。　　现在我要郑重推出英帝国在东半球的“一个中心、两个基本点”中的“中心”和“基本点”-------印度和新马。说起来英属印度那真是个奇迹，大英帝国万里之遥，就凭那么十来万号人，加上一些“土兵”，居然真能把阿三这个上亿人口的民族控制得服服帖帖的，实在是不知应该佩服约翰牛的手腕还是哀叹阿三哥全体兜里没蛋。不过从全球战略来讲，为了这颗“英王皇冠上的宝石”，大英帝国基本耗尽了自己在亚洲所能投送的陆军兵力。而新马作为东南亚地区重要的天然良港，自然成为了英帝国远东海军的最佳活动据点（其实更好的是印尼，不过那是荷兰的地盘）　　最后让我们着眼于东北亚，看着富饶广阔的东亚大陆、大西洋与之相比只能算“游泳池”的太平洋，问题来了------------　　① 大清国固然是一个一打就腿软的主儿，可是大清的腿好像也不像阿三那么软，这不，前一阵儿，法国的茹费理刚就因为广西那破事儿，走人了；大清光靠两门炮，还真吓不住，不能指望大清老老实实照看英帝国的利益。　　② 上大清的欧洲国家着实不少，英法西葡美洋洋不缺，更可怕的是东亚大陆直接和俄国接壤，在西欧和KUMA打也不敢说自己就占便宜，万里之外，陆上怎能和KUMA战痛快？　　③ 太平洋那么大，大英海军虽然NB，也就那么些船，西欧非洲南美全部要罩着，还有东南亚，饶是大英海军世界第一，又哪有那么多船、那么多海员，能给你照看太平洋上的权益？所以，对约翰牛来讲，在它自己无力照看亚洲权益的情况下，它迫切需要找一个“利益照看者”，或者说一条忠犬，为它照看在东亚的利益，防止法、俄做大，防范中国作为一个亚东大帝国爬起来翻身，同时又不会脱离英国的控制而挤压英国在东亚的利益，具体而言，它需要这样一个国家：　　① 国土不大不小，既不能因为太小而全无力量，又不能因为太大而具有完整的自给自足的物质基础（英国看不住美利坚，说白了就是这个道理；同样没人希望中国统一发展，原因也是如此） 　　② 人口不多不少，能正好养得起一支能与远东俄军、清军保持平衡的陆军和能够压制俄国太平洋舰队、牵制法国远东舰队的海军，并且能够支撑为了培养这样一支军队所需的必要重工业以及轻工业，如有必要，最好该国轻工业正好能满足英国在东亚所需低端工业产品，同时最好不要与英国工业发生竞争。　　③ 从民族性来讲，能够服从英帝国的安排，能够接受自己成为英帝国全球霸权中“爪牙”的身份。 　　说到这里，大家或许已经明白了，这是什么国家了。没错，它，就是日本。许多中国人都不明白，日本这么个小地方，在鸦片战争后不久就被美国叩开国门，还挨过九国海军联合炮击，怎么就不像缅甸这种国家被吞了呢？甲午海战，明明是大英的民船吃了日本海军的炮子，怎么大英不但不吭气，还给日本发贷款呢？现在大家要明白：　　日本能在黑船事件、九国海军炮击下关事件后还能保持独立，通过殖产兴业、富国强兵走上富强，固然有明治维新和“明治人”搀和，更重要的因素是它在中国沦为列国跑马场、全球霸主英国限于当时的科技水平、人口限制无力在东亚投送和保持控制东亚大陆和太平洋所需力量的背景下，被全球霸主“钦定”为英帝国在东亚的爪牙，甲午战争是英帝国给自己的狗喂食，日俄战争则是日本这条英国的狗忠实履行其在亚洲的使命，阻挡俄国扩大在亚洲势力范围。二 从“三国干涉还辽”到“朴茨茅斯条约”，看约翰牛的狗链　　日本是一条狗，不过非常遗憾，它从来不是英国佬庄园里温顺的贵宾犬，而是一条恶狗。从一开始，日本的国家战略就和英国为它打造的角色相冲突的---------1890年，日本内阁总理大臣山县有朋向明治天皇上奏《外交政略论》，认为：“国家独立自卫之途有二：一曰防守主权线，不容他人侵害；二曰保护利益线，不失形胜地位何谓主权线，国家之疆土是也;何谓利益线，同我主权线安全紧密相关之区域是也。”而他那条“利益线”显然就是要以日本为中心，扩张殖民利益，这就势必要排斥英国在东亚的权益。既然如此，为何英国还敢“开闸放狗”呢？这就涉及一个日本精英们-------包括那些“维新志士”们从来没看明白的、最终把日本坑死的问题----------资源。　　统管十九世纪的东亚，不难发现，老谋深算的英国充分吸收了咱老祖宗“守险不守陴”的智慧，表面上看，英国东洋舰队基地在新加坡、陆军主力分别集中于印度与新马，似乎把东亚这块肥肉拱手交给了日本这头恶狗来看，其实他们早就给日本套上了狗链，那就是资源。英法两个老牌殖民强国在进军中国的同时，独霸了东南亚的热带专属战略资源-------先是橡胶，后来还加上石油。北边倒是有油，不过您得去问KUMA要。而铁矿等资源主要在华南，正好又是大英的势力范围。同时，日本彼时军事工业还是进口为主，钱都是英国银行贷的，我一停贷，你就要抓瞎。这样一来，无论“大日本帝国”在东北亚多么耀武扬威，敢不听大英帝国？嘿嘿，给你断战略资源，看你能混多久？想战？陆上你想达到北京容易，想一口气打到华南可就难了。后来昭和时代中日军力比有史以来最有利于日本，皇军也不敢说就把华中华南全摆平了，何况当时？要说海上，你稚嫩的皇军海军，船还主要是从我这里买的，和我远东舰队玩？就算你把它磕了，我援兵也来了，你就等死吧。 英日盟约对日本来讲，就是一条绳子--------服从英国时，它可以拿来用，方便自己；如果它吃了豹子胆，敢和英国磕，那这绳子就会困住日本，让它老老实实服从英国利益。在英日同盟的存续期间，日本两次被这根狗链子捆了一把： 　　第一回是“三国干涉还辽”，这事儿大家都清楚，俄法德三国看着日本要独吞辽东，觉得日本做的太过，于是一面外交抗议，一面德、法出装备（给大清），俄国出人（25000多远东俄军），准备和脚盆鸡玩一场。当时脚盆鸡想到了自己的干爹英国，结果呢？“英国照会日本说：‘英国对日本抱有最诚笃之友情，同时也不能不考虑本国的利益。因此不能应日本之请而援助日本。’”历来许多人的解释是英国怕三国，但我们可别忘了，在远东英日陆海军实力加起来，对法、俄可以说构成绝对优势，汉斯喵彼时在亚洲连个立足点也没有，只能派船跟着打酱油，而且如果能够借此机会驱逐除日、俄（因为太近）外列国在华利益，对英国而言也是很大的利好。所以英国不让日本出头，绝不是怕了三国，而是另有所图，其所图的，就是防止日本吞下辽东、推进到满蒙后成为控制不住的恶犬。 　　第二回的“朴茨茅斯条约”就更明显了，三国干涉还辽后日本人憋不住这口气，和俄国在中国东北明争暗斗，终于又搞了一架，这就是日俄战争。说起来日俄战争虽然是日本为了自己打，但客观上也是日本在履行自己作为英国在远东看门犬的责任，可是后来英国人就发现日本干的不对头了，尤其是在奉天会战以后，看样子日本是想把满蒙给独吞了。说起来沙俄时代KUMA熊还真就是个泥足熊，工业水平本身就不行，组织能力更是一塌糊涂，军队居然没有密码，一战开初就有过士兵木棍冲锋这一出。要是日本忍一忍，真把KUMA给赶出去也说不准，可日本还真就没法忍了，怎么回事儿？说白了，就是个钱的问题。根据学者研究，日本当时46%军费来自英国贷款或者在英国金融市场发行的债券，说白了就是英国人养着日军。而日本如果真的把俄国人给赶出去了，将意味着什么呢？英国没有余力投送到中国大陆了，俄国又被赶走了，法国和汉斯喵也没有立足点，中国就成了日本口中的肥肉，这是英国不能容忍的。所以英国佬伙同美国资本家干了一件很简单的事儿---------停止贷款、不买债券。你大日本帝国要自己玩去，爷我不撒钱了。只一招，就只这一手，就让明治的日本停手了。要知道，当时多少日本人等着占了全辽东以后抢来的战利品啊！为了合约的事儿，日本人都闹出日比谷暴动了。你要说“明治人”比“昭和人”聪明在哪儿，也就聪明在这儿：要搁昭和，桂太郎、大山岩一干人等早就被天讨了，而明治人虽然国内吹嘘自己是“大日本帝国”，出了门还是知道自己就是一条狗的，还懂啥叫“见好就收”。阶段小结---------日本崛起的四个条件　　综上所述，日本的崛起需要四个条件：　　（一）中国的虚弱，如果中国不是一个虚弱的国家，那么日本无论是原材料还是市场，都没有拓展的空间，能做一个中等国家，那已经是祖上烧高香了。　　（二）多个强国争夺东亚，如果某一个中日之外的强国已经取得决定性优势，那么就不再需要日本了。具体到明治，如果说俄国直接占据了东亚，或者英国有余力控制中国，哪怕只是扛住俄国，那么日本妥妥的被殖民。　　（三）存在可以依附的域外强权。首先，必须要在域内存在域外强权，因为域内国家不会自己为自己树立强敌，只能指望域外国家。其次，该强权必须能与地头蛇对抗，如果该强权无法给予日本支撑，那么日本不但接不到血管，还很快会被砍掉。　　（四）必须有可能在日本和东亚其余国家之间存在“代差”，也就是能够碾压。因为日本本身国小民寡，如果不能形成足够代差，则力量对比无论如何都无法与中、俄等过相比。而明治时代日本对中国形成完全碾压，对俄国在远东的势力也形成代差优势（俄国远东落后而日本则发达、俄国组织系统混乱而日本组织精良）。", "answer_votes": "6", "answer_comment": "​1 条评论"}
{"answer_author": "知乎用户", "answer_id": 19677082, "answer_text": "呵呵，日本发展的真的快么？发展是一个全面的概念，不仅是经济的腾飞，科技的进步，更重要的是战略思考的成熟。日本正是由于片面地追求了前者，缺失了对西方近代战略思想和中国古典战略思想的承袭，才在二战中丢掉了明治维新后快速获得的一切成果，也在广场协议后丢掉了战后的经济奇迹。我觉得这是一个实实在在的伪命题，除非楼主将这个问题改成日本的经济发展的为什么快？明治维新的起源是倒幕运动，日本传统的封建格局被近代化国家竞争所必须的民族国家需求所打破，明治天皇代表皇室第一次掌握了权力，真正意义上建立起大一统的日本，这个时候日本发展思路还算清晰，击败中俄后暂时获得了东北亚的霸权地位。但是，重点是但是。明治天皇之后的日本皇室很快失去了大一统的权柄，实权开始回落到一些门阀贵族手中，到二战爆发前夕，则通过一次次政变后，彻底落到了一批留过洋的中下层军官手里，集权和战略决策完全缺失，战争狂热彻底吞噬了日本，二战以来，日本的战略决定没有一个是正确的，这一点，难道不值得日本人反思？反观中国，甲午以来，正处于一个大一统王朝的末期，清末，汉末，唐末，明末是类似的情况，政治权力在不断下降，整个国家四分五裂，甲午战败，是李鸿章一个人苦苦支撑下的战败，难道还不够正常吗？接下来的北洋和国民政府，其有效统治区就在首都外围一小片，日本人面对一个进入分裂下降通道的中国，居然玩儿成这个样子，其发展思路和速度，又有什么值得赞许的地方？就目前日本的工业结构来讲，存在严重缺憾，二战战败让日本成了一个被阉割的国家，被美国的全球战略牢牢卡死，已经成为一个战略上的死地（处于中美苏大三角的中心，类似战国时期的韩国），毫无前途可言，其发展的快慢，又有什么讨论的必要呢？战略思维的不同决定了中日两个民族的不同未来。日本是没有见过大世面的，对中国理解停留在皮毛上的，狂妄而不知反省的，中国是每隔几百年就要流血厮杀的，在极端困难的情况下击败了日本和联合国军，一步一步恢复自己在东亚世界的传统地位的。从历史的角度来说，二战占据东北，把一只脚牢牢踏进大陆，是日本改变自己地缘劣势的唯一机会，但是这个千载难逢的机会，就被一伙少佐给葬送了，日本的发展可以用一句话来形容，这是一个把马拉松比赛当成百米跨栏的民族，开始是很爽，反噬的时候，也异常悲惨。我就奇怪了，一战二战乃至冷战时期，中国怎么就从来没有站错过队呢？", "answer_votes": "574", "answer_comment": "​209 条评论"}
{"answer_author": "知乎用户", "answer_id": 19544427, "answer_text": "（我不知道排名第一的答案是怎么被顶上去的，这种民族性优越论的老段子就这么讨人喜欢？妄自菲薄的自虐情节还这么吃香？）\n\n鉴于以前排名第一的答案已经沉下去了，果然知乎的群众眼睛还是血量的。上面这段话不针对冷大的回答。\n日本与中国同时面对先进的世界，最后日本走在了前面，其中既有必然也有偶然。\n\n首先是日本与中国相比，在政治结构上不同于中国的高度中央集权，更接近于西方的封建制。幕府虽然势力强大，但大名和各番仍然享有高度的自治权利。可以拥有武装，可以征税，可以实际统治领地。所以日本私有制，个人财产，权益，领地更受重视。封建领主的存在使得分权，代议，宪政，君主立宪更容易被接受。从这个层面来说，因为封建制所以西方孕育出了民主，因为封建制所以日本容易接受西方民主。\n其次是船小，民族组成单一，人口较少，政治经济结构相对简单使得日本改革难度远小于中国。船小好掉头的是颠扑不破的真理。香港、新加坡、瑞士、北欧诸国都是典型例子。\n第三就是西方列强的政策区别。日本弹丸之地，经济落后，资源匮乏。美国砸开日本的大门之后，开始通商，基本上就没有更多的兴趣了。西方列强对于日本这样的弹丸之地也基本上采取了放任的态度，推行的是互利共赢的路线。然而对于中国，列强推行的就是压制，瓜分，掠夺的政策了。拿破仑的睡狮论大家都知道。西方人虽然看不起中国的落后，但他们深知这个从古典时代延续至今唯一一个文明古国，一个拥有世界五分之一人口的国度，一个数百年间GDP远超欧洲总和的帝国，蕴含着多么恐怖的潜力。对于日本这样的小国可以互利共赢，而对于中国这样的巨兽，这个世界是不可能有共赢的空间的，唯有压制掠夺才是最好的办法。", "answer_votes": "131", "answer_comment": "​33 条评论"}
{"answer_author": "不眠之眼", "answer_id": 56414282, "answer_text": "很简单，日本居危思危，屁大点儿岛国一个，天灾人祸断不了统治举步维艰，冲击一来凡是懂点儿事儿的个个人心思变只不过有的人一开始没找对方向，找对方向精英阶层立刻集体向着近代化跑步前进。中国贵族，在安睡……安睡……安睡……出了事儿拿老百姓血汗骨髓打下卡给外国人还钱然后继续安睡……安睡……安睡，后面你都知道了。穷而警醒和富而懒惰的差异就在这里，这是帝国之死。老佛爷拿军费修了园子，报应照样到不了她这一代，要报也是报在后人身上，所以她就能钱多任性——你让日本幕府或者明治政府的谁谁谁试一下？其他大小诸侯的唾沫不淹死你，街头攘夷武士的刀子也是要捅死你的。中国盘子太大，靠压榨老百姓够上层转嫁成本很久很久，能把麻烦推给穷人，自己当然不动脑筋了，而且也因为太大，外国影响力渗透到内地需要相当时间——最关键是因为太大，所以各国势力及其代理人各占一块儿——so，你不分裂等啥？", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 20124145, "answer_text": "盖古日本文明原甚落后，隋唐以后，僧侣学子群访长安，日本社会制度才开始汉化。然汉唐文物典章如中央集权文官制、考试制度、征兵制度、家族制度……均未必适合岛居小国。日久变质乃与中士原制各行其是。如中国之文官制、征兵制，原均为代替世袭制而设计者，日本试行之，中央集权未成型，反而助长诸侯世袭，军人职业化，而架空了中央，所谓藩幕是也。说者以日本明治维新前之社会结构，实与西欧封建末期之社会结构，极为相似；而此一相同之结构则为欧洲“产业革命”之温床也。日本既有此温床，蓄势待发，因此一经与西欧接触，符节相合，一个东方产业革命乃应运而生矣。此一“欧罗巴社会结构”说，颇能道其契机，故为读者述之。至于我国传统社会之结构则为单纯的“亚洲式社会”，故与欧式经济发展，殊嫌凿枘不投。·······························选自唐德刚《晚清七十年》日本在德川幕府时期有竞争性的诸藩，已有将他们的社会生活和经济生活按照商业条理处置之姿态。各封建领主之下有“藏元”，亦即营业经理。银行业称“两替屋”者，有的尚为幕府汇款，有了几百年历史。批发商叫“问屋”，也构成各种“组”。同业公会称“株仲间”。道路交通网称“五街道”者已将各大都会联结。“宿驿”遍及各地，通信则有“飞脚”。海船之定期航行者称“回船”，又兼理保险事业。所以，构成资本主义贷币管理的主要因素大多已在事前存在。明治维新不过在这种种商业因素之上加了一个总揽一切的政治组织，资本主义的体制即此就绪。··················································选自黄仁宇《中国大历史》日本具备的这些恰恰是当时我们没有的，如今我们也渐渐有了，由此可知，资本主义的康庄大道已经离我们不远了。", "answer_votes": "7", "answer_comment": "​3 条评论"}
{"answer_author": "yolfilm", "answer_id": 26187411, "answer_text": "-一、上层结构不同。先说中国。中国是「君主极权」的「郡县制」，而且满清是历代来最极权的。设立了「军机处」，取消了「三省制」度的超级君主式皇朝。中国历代有哪皇权能到这样水平的，真不多。可偏偏，在面临国家需要剧烈变革的时代，几个晚清皇帝都有大问题。道光是个嗇皮，小气到极点的古怪家伙，为了省钱，竟把太庙的供品馒头，换成木头刻的。你以为他禁烟，其实他是舍不得银子流失，此君的省吝贪财，直可写成「信不信由你」的奇书。咸丰是早产子，从小就是个病体奄奄，爱吐血，不堪政务的皇帝（我怀疑他有结核病）。同治早早得了花柳，多大年纪？就叫梅毒整死了。死状之惨，叫人不忍覆述。他的皇后後来自尽，都说是「殉帝」，我觉得也是被传染了性病，不得存活。光绪，则是个阿斗，扶不上墙的烂泥。戊戌三月，连发208道诏书，分明白痴。更不要说最後的宣统，竟然跑去认贼作父，另立了满州国。改革国政，靠接连这五个奇葩 + 怪胎，能有个啥盼头？所谓「集权、极权」体制的恶劣，由这五人，可以为明证。反观日本。日本几千年来实行的封建制度，即使德川家也不能独裁天下。几千年来，「下克上」的传统从未断绝，作日本的统治者，不像清朝皇帝一般安逸 。比如明治维新前後的幕府「德川庆喜」，说不上明君，也说不上蠢笨。但他有下面的压力，谁也不能给他好日子。长州，萨摩，土佐，肥前。这几个西南大藩，逼著幕府得变革，彼此是竞赛关系。试想，中国的皇帝，如果得跟地方诸候竞争？（满清中国，只有数不尽的内乱，农民、回民、教民叛变，没有诸侯的竞敌。）「嗯嗯，北京直隶的皇帝老爷，最近改革成效不行呀。」「比不上两江的刘坤一搞工业，比不上两湖的张之洞搞教育。」「比不上两广的李鸿章搞外交，比不上山东的袁世凯练新军。」诸如此类，试想中国有如日本，上下交相变革比赛，你看中国会是如何的面目？要不是上层结构的僵化腐败，中国改革，又岂会如此糜烂？二、是下层结构不同。日本一直不缺民间的「企业」，为了打仗，大名给地方的商人借钱，培养出来多少官商。而且，因为多年的「倭寇」传统，「海贼」和「国际贸易」系统齐备。有商人，有起码的手工业雏形，加上尊重商人财产的传统，还有贸易路线的建制。这些中国完全付之厥如。中国的底层结构之空虚空洞，最好的例子：中国人整天洋洋得意，自称发明了活字印刷术。可中国的第一家印刷厂，竟然是老外在民国初年建立的。中国人的脑子里，只有科举二字，所有下层结构（农民），一心只想科举，要爬到上层结构去。数千年的历史，读书的聪明人下海作商业的，屈指可数，晚清比较著名的例子是「张謇」。他在南通的种种作为，到现在，还影响了後世，整个江苏南部的经济荣景，几乎就是他带头打下。（想更多知道的人，可查「张謇」，知乎不是写论文的所在，只是路引，还请自查。）试想，中国要多十个、百个，千个万个张謇，晚清的改革，又是何等面貌？再去比较日本，数数日本的维新人才，各色人等：有医生，有武士，有剑客，有书生，有浪人，有官员，有商人，有佣兵……，甚至还有救火队，更有地痞，有流氓。中国的下层结构，人才稀少。只靠少数上层结构的官员来推动，甚至依靠孙文、黄兴这种留洋的人才，哪有成事的可能？看日本明治维新的兴奋感，就是小小四岛，人才如过江之鲫，前扑後继。中国呢？请容许我再举一个最常举的例子，那个人，叫「袁世凯」。晚清中国，好不容易有个懂「练兵」的袁世凯出来了。这厮，无耻至极，身为国家军事重臣，整个清末民初所有的内外战争，都被他撇的一乾二净，没有一场战争的胜负和他有关（朝鲜之败，其实他脱了不关系），但，阻止新军革命的是他，逼迫满清瓦解倒台的，是他，民国被废，想当皇帝的，是他，军阀的内战根由，还是他。袁世凯是最好的例子呀。全靠上层结构，既得利益份子来改革，又岂有成功可能？这些历史罪人，为公是假，谋私才是真的。李鸿章在前面打甲午，儿子李经方在後面卖米给日军，清末历史，全是这种叫人吐血的情节。中国出不了伊藤博文，出不了吉田松阴，出不了坂本龙马，出不了高杉晋作，出不了西乡隆盛，出不了木户孝允，出不了大久保利通……。晚清中国能出的，你读史就知道，只出袁世凯一流货色，私欲比天高的垃圾人物。奢谈改革。-", "answer_votes": "259", "answer_comment": "​44 条评论"}
{"answer_author": "kulja", "answer_id": 168965117, "answer_text": "好问题，其实答案很简单啊，两国制度不一样。日本是封建社会，中国是专制极权社会，所以日本模拟欧洲国家从封建社会到资本主义社会没有压力，而中国就很困难了，首先要打破专制极权，这就要了赵老爷的命了，所以改革肯定没戏。制度不同，那么权力的逻辑，社会各阶层的行事风格和目标都不一样。", "answer_votes": "1", "answer_comment": "​4 条评论"}
{"answer_author": "知乎用户", "answer_id": 24381254, "answer_text": "倒幕运动扫平了一切能阻碍明治天皇脚步的力量，天皇的导师西乡隆盛本身又是军事现代化的极力拥护者。但是保皇派也不见得就是开明派，尊皇倒幕的原因是德川幕府要跟西洋人签署通商协议，为了反对幕府与美帝签不平等条约，他们搬出了大权旁落八百年的天皇（保皇派中除了萨长二藩的开明派，大多数武士的本意是建立以天皇为核心的新封建政权，与西方帝国主义彻底撕破脸），日本人民等于是发动了一场反帝运动，顺便反封建了。王政复古的明治天皇摆脱了幕府枷锁，想怎么折腾就怎么折腾，幸好他走了一条比较正确的道路，日本才腾飞了。我大清就没这么幸运了，因为我国的最大反帝组织就是清政府，最大的反封建社团就是洋人。洋人一心想在中国获取平等的贸易权，而大清把开设通商口岸都当做是屈辱，对于中国社会的中坚力量士人团体来说，反帝和反封建任务无法统一，要么沦为洋人买办，要么继续在清朝官场摸爬滚打，如果你告诉他们封建制才是导致中国被帝国主义欺凌的原因，同盟会成立以前恐怕没人能绕过这个弯。倒幕时的日本人也不一定明白这个逻辑，但他们就是撞了这个大运。明治维新是一场豪赌，贫瘠的日本要想积累财富实现工业化，必须要先积累资本，大英帝国海军打遍全球，剥削全世界来养自己的工业，美国地大物博，有的是资源可挖，日本什么都没有，所以明治维新，对内是严酷压榨普通人的剩余价值，对外大举借外债，为了赚外汇，日本还搞过十万妇女下南洋的卖淫大军。可以说，明治维新是一段不堪回首的过去，整个国家的人都在为赚外汇而自我牺牲，而他们的其中一个目标就是：组建海军。直到甲午战争之前，日本都跟清朝的国力差了好几个数量级，当日清开战时日本的国债在伦敦证交所卖五折都没人要，因为谁也不相信日本能打赢，日本只要输了，毫无疑问就要举国破产，但是日本奇迹般的赌赢了，如果说什么时候日本超越了中国，就是从马关条约签署那一刻起吧，马关条约的赔款相当于日本20年的GDP总量，也就是说甲午一战，为日本省了至少二十年时间，这还不算朝鲜和台湾两个殖民地对日本的意义。而马关条约和随后的辛丑条约彻底把大航海时代以来流入中国的白银抽光了，对于一个实行银本位的国家来说，两个条约抽走六亿五千万两白银是什么概念？全身粉碎性骨折。中国本来就缺乏现代金融体系来稳定形势，这两次敲骨吸髓般的痛，基本上到了共和国建立后才过去。甲午战争，粉碎的不光是洋务运动，而是中国欣欣向荣的工业化之路。虽然洋务运动不是真正的资本主义改革，但是官办和民办的厂子一多，自然会发展出资本主义性质的经营模式，中国手里握有大量白银，不用像日本那样剥削自己国民，中国的工业化之路本可以走的无比平缓。所以让洋务运动失败的不是北洋水师的覆灭，而是朝廷再也拿不出钱来投资工业化建设了，除了朝廷之外中国其他的力量也掏不起这笔钱。驱逐鞑虏，恢复中华也就是个口号而已，鞑虏是驱逐了，但是孙大炮也恢复不了中华的荣光啊，因为没钱！国家无法用硬通货稳定经济形势，于是枪炮成了最靠得住的硬通货，话说民国之前的上一次藩镇割据都可以追述到五代十国，绝迹了快一千年竟然在20世纪上演，可以说甲午之后中国非但没进步，反而在开历史倒车。", "answer_votes": "4", "answer_comment": "​1 条评论"}
{"answer_author": "顺煎包咂", "answer_id": 35681602, "answer_text": "简而言之大地人多惯性强罢了，中国的中央集权论规模和深度是日本能比的么，你小车能轻松飘移掉头，一汽大卡能么。更不用说那时候处于资本主义商品输出阶段，大工业带来的产能继续市场来消化，列强盯着中国市场呢，一个小小的日本市场，差不多得了。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 25855519, "answer_text": "条驳某民科：「日本转型快，有三方面的原因。」「第一，从学习A转向学习B是很容易的。这里面没有一个心态转换的问题。日本已经习惯了大举借鉴外国制度、文化的政治模式，对此并没有多少抗拒。」----借鉴文字礼仪服饰起居，不等于借鉴制度。大化革新学来的，很快就还回去了。平城京的规划仿效唐长安，但对日本城市史而言，至多也只是一种外来的修辞。民科显然是单方面的历史书看多了。「第二，船小好掉头。说白了就是，日本本身力量并不大，要推翻当时主导日本的统治力量，所需的力量也不大。太平天国这种动员能力的运动，放在日本也能把政局打乱，促成开放。在中国就不行。」----已经没法吐槽了。大陆吏治国家同民众的原子化相表里，日本改革前社会的组织性资源是中国不能比的，组织资源对应着有序，体现在有如西方的契约精神和荣誉心，而非吏治国家利出一孔下无休止的扯皮推诿和内斗内耗。甲午战争之前，日本一没钱二没矿，就能打出一场现代的战争。而民科的意思，似乎太平军那种level，就算「动员」了，然后就直接可以和「开放」挂钩。这话无论正着理解还是反着，无论是把太平军的「动员」能力奉作「开放」的希望，还是把太平军「动员」带来的「政局打乱」看作「开放」的前提，都森森的散发出一种「农民起义是推动社会发展的动力」的朴素味儿，好人薅掉了坏人，于是国运就变好了。嗯，这游戏贼高端呢。另外多说一句：集齐10个封王的外省太平军，只要是花县、广西和罗大纲天地会系统之外的外省人即可，不，5个即可，集齐了我就送你一个苹果。用5个你就可以说服我他们不是裹挟而已，是真的「动员」呢。「第三，日本当时适逢德川幕府衰微，主要反对派力量中，有不少是搞海运贸易的。他们的流动资金比幕府宽裕，同时也有经济上反对幕府的必要性。因此在日本需要大规模改革的时候，恰恰也是其面临改朝换代的时期；最强有力的反对派，恰恰是在对外贸易中赚得最多的政治势力（也就是对外界最为了解的）。这两个要素合并到一起，就促成了倒幕运动以及之后的顺利改革。」----民科不知道有倒幕的藩，也有拥幕的藩，并且这两对头因为仇怨的偶然，因为势力的消长，还玩过角色互换吧？海运贸易，日本哪个藩不靠海，利益有那么稀罕么同学？何况西乡隆盛怎么死的？讲的就好像倒幕的赢家就是改革的推手，无缝对接一样。「那么反过来说，中国转型慢，也有几个原因。」「第一，中国从来都是本地文化的主导者。从来没有过大规模学习外国的经历。这个心态的转变，需要一段时间。实际上中国这个心态的变化花费了至少60-70年时间。这就是三代人的时间差。因此，中国在学习欧美方面自然有劣势。」----罗马人可以自认是罗马帝国的主导者，而Chinese想自认是清帝国的主导者，却要先犹豫一下资格。汉人说汉文化是清帝国的主导者，不比藏人说藏传佛教是清帝国的国教更严肃。不肯学习就怪到自己骄傲太久了就够了，不用再暗示说我值得骄傲好多年。「第二，中国当时的统治者是异族。有的事情，本族统治者可做，而异族不可做。这是因为异族统治者天然会受到汉族的怀疑。因此满清一代，总是极度尊崇中国传统文化，不敢越雷池半步。这也是为了减少汉族民众对其统治的质疑。这导致了，满清在面临文化激变的过程中会比汉族统治者更加保守，更不愿意改变。」---- 这个猜想倒还不错，但「极度尊崇」未免天真，编四库全书的用心还用我再说么？说他们祖宗之法不可变是「为了减少汉族民众对其统治的质疑」，不比说今之朝堂坚持马列毛是「为了化解基层群众对其领导的质疑」更高妙。「第三，很多巨大的政治转变不是说主政者忽然开窍了，把事情改变了。而是说，反对派把主政者推翻了。然后反对派开始执行新的做法。原有的主政者未必不愿意进行相关的改变，但是一个成熟的政体会导致内部利益集团盘根错节，任何大的改革都难以推进。日本幕府倒掉了，因此得以全面转变。而满清几十年在台上，自然难于进行激进改革。中国是个大国，要撼动整个政局，是非常困难的。一次巨大的起义，未必能改变什么。」----你让射杀吴起的楚太子、车裂商鞅的秦太子、弃市晁错的汉景帝情何以堪。好人才能办好事、先把坏人踹下台的幼稚园史观，可以歇歇了吗。至于「一次巨大起义」，就不再重复了，有人的认识，还停留在太平军是推动历史的契机上面，只恨还不够巨大，还没能颠覆。「第四，中国是个大陆国家，而不是海洋国家，与对外贸易有关的力量在社会中占的比例太小，不足以像日本那样达到能够立刻改变整个政局的水平。」---- 奥斯曼土耳其是海洋国家？从奥斯曼帝国崩溃，到凯末尔立国用了多久？人问为什么中国比日本慢，你还真就找着个不同就当原因了。", "answer_votes": "374", "answer_comment": "​114 条评论"}
{"answer_author": "李绍唐", "answer_id": 19540709, "answer_text": "简而言之就是，换个老大做小弟，简单；不做老大做小弟，难矣。————————日本是个小弟，看到别的大哥厉害，于是跪倒了拜个新大哥，虽然换了衣着，变了腔调，但马屁拍的紧点，日子确是更加滋润，尤其当他看到过去的老大还因不肯放下尊严而潦倒。而中国，被另一个老大打败了，自然重新开始反思自己，彷徨到底是跪着把钱赚了，还是站着一身潦倒，毕竟已经做了千年的老大。但老大毕竟是老大，即便做了另一个人的小弟，也总有些桀骜不驯，眼中的凶光偶然让他的老大有些畏惧。也许正是他有作为一个老大的倔强与坚持，当初才能成为老大，现在也无时无刻不想着成为老大中的老大。", "answer_votes": "67", "answer_comment": "​26 条评论"}
{"answer_author": "兰时", "answer_id": 25792015, "answer_text": "姬轩亦君又开始否认事实、篡改历史了。题主问:“为什么中国日本同时被打开国门，日本发展得快？”姬轩亦君打滚想让我们相信在打开国门后，我们比日本发展更快。听起来真酷炫，我们民族真dio，要不是理智有排斥反应我真心想成为“姬大”的一名粉丝来听其布道，一起解释我们怎么在被打开国门后发展比日本更快的。首先，姬君说：“明治天皇之后的日本皇室很快失去了大一统的权柄，实权开始回落到一些门阀贵族手中，到二战爆发前夕，则通过一次次政变后，彻底落到了一批留过洋的中下层军官手里。”对日本史有所了解的朋友应该明白其中硬伤多大了吧？首先就是天皇何时有了“大一统权柄”？其次撤蕃之后原各蕃主家就淡出政治中心了，日本政府也怕这批人东山再起而加以控制，不知道姬君这段话根据在哪又指的哪些人。要是说蕃阀和民党，可以查查家谱嘛，哪来的大门阀？而二战之前下层军官策划的刺杀的确多，但五一五、血盟团、二二六的最终结果都是打击了政党政治，导致军部掌权。而皇道派在二二六之后基本被驱逐出了权力中心，何所言“下层军官掌权”呢？此即“只知其一，不知其二”啊。再者，姬轩亦君说:“二战以来，日本的战略决定没有一个是正确的，这一点，难道不值得日本人反思？”经济计划、列岛改造、旧金山講和等等都被吃了？一个“战略决定没有一个是正确的”国家，居然能在战后一片废墟上发展到今日的发达程度，一举成为世界第二大经济体，真令人啧啧称奇。姬轩亦君还说:“接下来的北洋和国民政府，其有效统治区就在首都外围一小片，日本人面对一个进入分裂下降通道的中国，居然玩儿成这个样子，其发展思路和速度，又有什么值得赞许的地方？”我深深为祖先在抗日战争中取得胜利而自豪，但是，咱还是别忽略国际形势和各自的盟友好不好？中国是在积贫积弱的情况下，面对一个强大的敌人，在盟友的帮助下付出了大量的牺牲取得了艰难的胜利。去查查抗日战争，中日战损比简直触目惊心。中国政府在日本全面侵华的前五年都不敢对日宣战，怕宣战后就没有回旋余地，遭至灭国。直到珍珠港事件发生，美国参展后中国才对日宣战。但是姬轩亦君的解释让我感到耳目一新，似乎我们非常dio，对手很弱智。我们在有那么多问题的情况下还打赢了他们，他们也太蠢了。这逻辑怎么和手撕鬼子那么像呢？至于原因，我倒是觉得相当一部分来自于少数民族的统治。日本是单一民族面对外部势力的反弹（暂且不提阿伊努人），而中国但凡提到改革满族统治者先要想会不会被汉人动摇，凡事畏首畏尾。而在满清统治的三百年中，通过文字狱等一系列措施，将这个民族的人敏培养得狡猾而自私。而后先是满汉互打，继而全国内战，自然没有好事儿了。", "answer_votes": "229", "answer_comment": "​141 条评论"}
{"answer_author": "灌茶员", "answer_id": 22112239, "answer_text": "地理环境决定前途。沿海比内陆富裕是当代普遍规律。\n日本，韩国，台湾，香港，新加坡的土地几乎都沿海。人口都能算沿海人口。中国沿海也富裕，但中国内陆太大，人口大部分是内陆人口。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 26057605, "answer_text": "在京都的酒店里面，我坐在大堂里面闲逛，因为没什么事，对墙壁一角花花绿绿的旅游宣传手册感了兴趣。因为不通日语，也是随便看看，有一张类似音乐会还是演出的海报让我注意了，上面是一个人的剪影，身后乃一大船，写着：纪念米国黑船来袭***周年。我一查什么是“米国黑船来袭”，顿时明白了。为什么日本要隆重纪念这个事件呢？甚至还有“黑船节”这搁在中国，是奇耻大辱啊！我不认同日本有被虐欲，我倒以为，中国才有深层次的被虐欲，你看，对满清皇朝的那根辫子，有多大感情啊，汉族同胞说起满洲八旗和蒙古骑兵，纷纷露出羡慕的神色。我以为，真正的原因在于，日本和英美是真刀真枪，硬碰硬的交过手，彻底明白了人家非止船坚炮利这么简单，早已深得西方工业文明之精髓，故此无需再有不服输的傻乎乎顽固。这好比，你真的玩了游戏，得了精髓，你才不会像那些没玩过游戏，只会道貌岸然，傻乎乎在一边胡说什么“游戏毒害青少年”的大妈大爷们。因为这些大爷大妈根本不知道游戏是怎么回事呢！只有道听途说，一知半解，这一点和我们对西方的认识一模一样。近日听《冬吴相对论》，吴伯凡先生讲：为何总有大公司衰落？吴先生说，大公司决策人总是从“做正确的事”，逐渐演变成“做正确的人”。一开始，对事情本身的关注很大，只要意见正确，无论是谁的想法，只要对事情发展有利，是正确的，就采纳。等公司做大了，创业者逐渐膨胀，这个时候，他的心态开始变化成这么一种想法：“我总是正确的，因为我总是正确的，所以公司做的很大，我现在更加关心我的权威是否还在？我是否被人质疑，我是不是能做到永远正确。”说到底，他更关心自己的形象和位置。其实中国很类似，千年帝国之后，我们现在还不愿意承认自己是错的，错的不仅在工业技术，错的更离谱的是典章制度。我们更在乎自己的形象和老大帝国的位置，所以逐渐走向颟顸昏庸，顽固不化。日本就无此包袱。", "answer_votes": "390", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 19544933, "answer_text": "我怒了，知乎客户端怎么还不能存草稿？右滑一下写的东西就全没了。。。---------------------排名第一的答案虽然读起来刀刀见血，但只怕还不到实质，我更倾向于在地缘角度里理解这个问题，从而衍生文化政治看法。华夏文明所处的地理环境始终是一个与世隔绝的状态，内部又有足够空间折腾。这导致了华夏历代政权更迭始终停留在内部斗争和抵抗蛮族身上，也就奠定了传统汉人看待国难的基调：外排蛮夷，内除奸佞。不难看出，保守派始终喜欢从这两点做文章，包括了义和团之类的运动。制度思想上的问题，极少被正视。内陆足够多适合农耕的土地养活了大量的人口，这意味着无论洋人与革命党折腾得多欢，在自给自足的经济环境下，海风吹不到的地区总是在稳定输出保守派。农业文明天生讨厌变数，稳定的天气带来稳定的收成，天灾人祸被归为「灾变」。而商业文明恰恰在变数中才能得到最大的利润。这些思维方式直到今天还烙印在我们脑海里。回来看日本，狭小的岛国让人们很容易看清现状，而这个国家始终挥之不去的资源匮乏让他们没有封闭的可能，始终笼罩的火山地震阴影则赋予了大和民族普遍的危机意识。尽管深受华夏文明影响，但是日本统治者对世界局势并非一无所知，早在江户时代就有兰学流传。参见维基百科条目蘭學日本人1811年就出版了首部电力学著作《阿兰陀始制エレキテル究理原》，由桥本宗吉写成。书中记载了许多电力学的知识，如发电裝置、人体的导电性，及1750年富兰克林有关闪电的实验。还有三十年，中国才开始第一次鸦片战争。所谓船小好掉头，大致如是了。另外从文化来说，历史上的唐化时期给了日本人学习外来文化的经验，而汉人历史上极少去有意识的学习什么。回顾结果，从扭扭捏捏欲拒还休到奉若圭臬亦步亦趋，华夏文明对学习西方文明的把握远没有日本人妥当，我想这就是经验的问题。日本人花了上千年去练习的事情，我们在如此短暂而不稳定的时间里根本无法做到同样举重若轻。从政治上来说，日本存在天皇这样一个既被广泛承认（万世一系），又有足够维新理由（夺权幕府）的天下共主，实在是国民之幸事。反观中国，满清政府始终无法亦不肯调动民族主义热情，更看不得汉族力量过度膨胀，也就注定在踟蹰中自我消亡。剩下一盘散沙的汉人，袁世凯浪费了他拯救国家的机会，以后的岁月直到毛建国基本就是决出天下共主的过程，国运凋零让人唏嘘。中国其实也有与天皇处于类似地位的衍圣公，奈何孔子历来就是以贤臣而非明君的身份出现。所以存在天皇这一天然的变革推动者实在是日本人可遇而不可求的好运。（从另外角度来说，中国适合内斗的地理环境也无法容忍天皇的存在，商周世系秦汉就绝嗣了，只有衍圣公这样的政治工具才能传承下来）足够多愚昧的国民+金戈铁马中杀伐出的领导人，这便是共产主义的干柴烈火，诸君不可只见火种而不见如山之干柴，华夏此劫几乎命中注定。所谓风水轮流转，也许一亏一盈本该如此。", "answer_votes": "46", "answer_comment": "​13 条评论"}
{"answer_author": "珏瑶", "answer_id": 25801836, "answer_text": "光腳的不怕穿鞋的。而落魄貴族，嘿嘿...除了等死，想要翻身得多使把力，還得使對地方。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "Soningga Zhang", "answer_id": 35670815, "answer_text": "苏联和中国同样是改革开放，为什么中国渐渐走向帝国，苏联从帝国走向分裂？ 答案是:战争中最先倒戈的，总能在瓜分昔日盟友的过程中分得一杯羹；而死扛到最后的，要么独享胜利，要么孤孤单单地承受失败。", "answer_votes": "3", "answer_comment": "​添加评论"}
{"answer_author": "生沅承", "answer_id": 25933006, "answer_text": "日本小", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "彭博", "answer_id": 19581799, "answer_text": "      回答之前，首先纠正题主那句“同时打开国门”。 第一次鸦片战争与南京条约是在1840年，而日本黑船事件是在1853年，相差13年的时间。这也是中日命运迥异的第一个，也是我个人认为非常重要的因素 —— 冲击的先后。五大原因：    日本受洋人冲击比中国晚    日本有兰学    日本没有科举    日本的“士”和中国的“士”不一样    中国自负的“文化优越感”1.冲击先后          为什么日本比中国晚受到西方冲击呢？原因在于洋人们来到东方抢东抢西抢地盘时，自然拿最大的肥肉先开刀 —— 当时不论原料还是市场，中国能提供的都比日本多太多。后来美国人要日本人开国的首要原因之一，除了想拿日本做捕鲸的中转站之外，是因为那时在中国已经有了太多列强不好下手。         日本人面对美国人的威胁时很容易就被说服了，原因很简单 —— “你看看人家大清。不想变得那么惨就听话和我们合作。” 这是外国人威逼利诱日本人签条约时最有效的大杀器。相对的，日本人也不亏 —— 比如英国答应不引进鸦片等。        此外，这个时间差也让日本人有机会醒悟并接受这样一个道理：盲目攘夷是没有出路的，想要攘夷就必须开国，向洋人学习，保持国家完整同时学习洋人的技术以期日后真正赶走洋人。当然其中还有萨英战争、四国军舰征长等事件的推动，让日本人以相对中国而言比较小的代价，体验到了洋人和洋学的厉害。2. 兰学       日本和中国一样锁国，但又有些不一样，就是留了个长崎同中国人还有荷兰人做生意。       贸易同时自然带动文化知识上的交流，一些日本国内的开明之士也主动向荷兰人学习，荷兰成为了日本人了解外部世界的一个通道，虽然学习兰学的日本人不过，渠道也只有荷兰一个，但对于日本而言却是弥足珍贵的。        尤其是在黑船事件、幕末期间，学习兰学成为越来越多的志士的选择，比如早期的福泽谕吉。在学习兰学之后，有的人做翻译，引进西方书籍，启蒙国内；有的人开办私塾，讲授兰学。这也是日本人观念能迅速转化的原因之一。列举下受过兰学熏陶的杰出人物：       坂本龙马、吉田松阴、岛津齐彬、胜海舟、桥本左内、福泽谕吉、大村益次郎。       而这些人的学生们有多牛呢？卖个关子，自行百度吧。       这就好比物理学上的加速度 —— 日本比中国启动地快。决定中日两国命运的关键点，是双方在面对洋人入侵时，谁更能先搞清楚状况。3. 科举        从遣唐使以来，日本从中国学习了无数东西，但唯有一样从没有引进，那即是科举。具体理由此处不详述，但这样却在机缘巧合下给后代日本人留了个好礼物 —— 日本的知识分子不需要科举以做官致仕，他们的思想也就相对于中国知识分子更加活跃些。       从孔孟到汉书唐律，对于中国读书人而言是要用来混饭吃的东西，对于日本的知识分子而言，只是个人修养的一种。一个日本人会写汉诗的话，他会被认为很有修养，但不会写也不会怎么样。但中国知识分子不会八股文的话，就意味科举不能高中，也就意味着做不了官吃不饱饭，没有颜如玉。       所以同样是接触“夷狄”之后，中国读书人仍然专心圣贤书，不闻天下事，而日本的“士”则相对而言更加热心地关心起国家大事来，他们应对夷狄的思想武器也更加丰富，不局限于汉学。4. 士      再来说说“士”。 中国的“士”是士大夫，文人。而日本的“士”是武士，从战国时期的武人历经江户200多年和平后，虽然不再征战打仗，但与战争相关的本领仍是要学的。而且文化上也并不差。最重要的是，作为“武士”的那些人，一直保持着捍卫国家的使命感，还有面对时代的“参与感”。      日后日本维新的主要功臣们，绝大多数都是武士出身。比如维新三杰的桂、西乡隆盛还有大久保利通。5. 文化优越感    中国从统治者到知识分子，经长久累积，形成了根深蒂固的中国是文明上国，世界中心的想法。以至于在屡次败给洋人，吃尽苦头后，仍然不能醒悟，抱守祖宗家法不放。    而日本从遣唐使以来，就一直是以学习中国先进文明的学生的身份自居，面对中国，难说没有一种文化上的自卑感。但正是这样的自卑感，让日本人得以在看到中国被洋人打败之后，立即转身投向洋人的怀抱。其实本质上没有变，同样都是拜师而已。所以萨摩藩在败给英国后，反而不打不相识和英国建立密切关系，日本整体也迅速抛弃“不见效”的中国汉学，转而学习坚船利炮的洋学，以至于几十年后到了马关战争时，面对中国，日本既感叹中国时运不济，又鄙视中国的固步自封。-------简单说了5个原因，基本围绕着幕府末期、维新初期而展开的，因为个人觉得幕末之后几十年的事情，虽说或多或少仍能反应中日命运差别，但毕竟时日太远，所以还是聚焦其时吧。", "answer_votes": "13", "answer_comment": "​5 条评论"}
{"answer_author": "周子", "answer_id": 19539809, "answer_text": "我就是来反驳前面几位同学的回答的。仅仅从戏谑的角度来回答近代以来日本经济高速发展乃至甩出曾经老师中国一大段的这种情况。首先，大和民族人数少，历史短，好调头。中华民族则不然，我们有时候骄傲地说五千年文明，可知按照辩证法角度五千年文明带来的荣光也会是负担。有时候我们可以看到在没有战乱的时候 ，中华文明是以一种十分缓慢的速度向前发展着的，没有东周列国，井田制没有那么快崩塌，没有五胡乱华，也迎不来唐王朝的兼容并包。近代的中国的局面是，和平的太久了，满清作为历史上最长寿的王朝已经和平两百多年了，把作为封建集权最高峰的明王朝算进去，已经和平了近500年，中间的战乱时间几乎可以不计，况且满清统治者一直以中原王朝的正统自居（比元王朝好太多了人，大清律令是部好法律）突然的外族入侵根本不知道怎么回事，和平麻痹了人们的思想，就像一个人阔了500年，有人饱揍了他一顿，他会怎么样，继续回家当老爷啊。但大和民族不一样，大和民族一直是学生，除了江户时代和平了300多年，其余一直在战乱，社会比较动荡，阶层流动十分频繁，不恰当比喻，就像一个长久没吃饱饭的乞丐，忽然被人揍了一顿，揍完之后他发现原来老师也被揍了，好像跟着揍自己的人有饭吃，不管怎么样，太饿了，吃饭要紧，况且也没什么历史负担，走，跟着那个叫美国的佩里混去！还有，民族性格不一样。大和民族处处散发出的是崇强凌弱，崇拜强大的力量，谁牛x谁就好，还有点赌徒心理，这种性格在当时的国际社会多好用，好东西就学，就搬，然后打赢了几场赌国运的大战，甲午战争还日俄战争，想不发都难啊！但中国秉承的是儒家和理学思想，虽然已经变成统治者愚民工具，当当时的人们觉得君子难道就应该威武不能屈么？蛮夷入侵算不了什么，就算你们能把我们揍趴下，把我们的王朝推翻，但最后还不得被我们的文化给同化么？最后你们建立起来的王朝不还得尊孔孟之道，用的还是我们汉文化么？这条定律用了几千年，但这次用错了，最让中华民族知识分子恐惧的不是器物，是背后的文化居然比我们中华文化还要牛x？！！于是等到中华民族意识到这点时，其实大和民族早就在正确发展道路上走了好久。最后，有人会问，那么这两个民族未来发展前景哪个好？不同的支持者给出不同的理由。我认为未来还是属于中华民族，原因太多了，最重要的是中华的文化比大和的文化强大太多了。大和的文化崇拜强者，中华文化不崇拜只学习，要求不卑不亢，不学习强者只学习先进的。而且反思能力也比大和民族强。中华民族至少没有赌徒心理，一路发展到现在，没有出现所谓赌国运都是一步一个脚印发展上来的，因此我觉得未来属于中华而非大和（日本地方那么点，环境那么恶劣，经济严重外向，对外依存度那么高，还有驻军不是一个正常国家和邻居关系都处于一种很难化解的差，起码不是用钱嫩打发的差，老龄化社会严重，创新不足，怎么跟中华民族比拼未来啊）", "answer_votes": "14", "answer_comment": "​6 条评论"}
{"answer_author": "白绕", "answer_id": 19670435, "answer_text": "最重要的一点：日本当时的社会结构形态，与即将工业化前的欧洲是非常相似的；而中国则是完全不同的另一种结构。", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "陌志祺", "answer_id": 35704899, "answer_text": "日本小，单拿深圳这一片区域来说，速度也是很快的。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 19537677, "answer_text": "因为它小。人口、面积、历史均小，易于从落后的东方文明中走出来，调头西化，现代化。而中国太大了，人口、面积、历史、文化。包袱太重太重。", "answer_votes": "3", "answer_comment": "​5 条评论"}
{"answer_author": "ShanghaiBeauty", "answer_id": 19554973, "answer_text": "这种问题显然是要陷入铁血超大大战网易凯迪，自干五围观公知美粉的节奏中的。你再怎么冷静客观都没用，人家心里早就有标准答案了（恐怕题主心里也是有一份标准答案的）。在自干五眼里，中国落后要么是因为清朝大辫子们打断了中华文明进步的脚步，要么是常凯申和国民党的王八蛋们只知地图开疆日记爱国，欧美列强先进是因为殖民时代抢劫了全世界，什么贩卖黑奴啦、种族灭绝啦、圈地运动啦，如果是日本韩国台湾那肯定是因为美国爸爸的大腿，香港是特殊年代加上吸大陆的血。那现在中国为什么发生了经济奇迹呢？当然是CPC的英明领导，可笑公知精英们还整天批判政府这个不对那个不对，显然你要是买不起房看不起病上不起学肯定是你自己是个loser，又懒又馋还要整天怪政府。反正你敢说政府一点不是，要么是有干货么，要么是别有用心，要么是loser，要么谷歌一堆材料告诉你某国更烂，要么直接请你滚出中国。总之兔子永远是腹黑的，阿三永远是吃亏的，白头鹰（美国）制造业真空负债累累又穷兵黩武，分分钟就要解体完蛋的，毛熊（俄罗斯）是个教训，欧洲更是养着一群好吃懒做的白皮猪马上要通通绿化另外欧盟也会扯皮内耗到四分五裂的。只有我兔威武，房价永远不跌，军费永远上涨，海军永远下饺子，四代机也要白菜化，很快小日本就会朝我们俯首屈膝，西太平洋是我们的，非洲是我们的，印度洋也会是我们的，体制不倒千千岁，党国长命万万年。至于公知美粉么，更简单，永远都是老三样，CPC、体制、国民性。现在网络上只要是政治军事外交话题，看都不用看，往下一拉，全是这种垃圾货色。屁大点事辩论几十页，全是些陈词滥调，劣币驱逐良币，有水平的人要么自觉离开，要么“用户已被屏蔽”。到哪都是机器人一样的众口一词，星巴克事件一出毫无意外地有人捧央视臭脚，放屁都能这么口径一致，真是佩服。希望以后知乎不会是这么个景象：问：为什么上海的房价比湾区还贵？XXXX小区XXXX元VSXXXX小区XXXX刀答1，因为上海丈母娘比湾区丈母娘不好惹答2，我兔经济飞速发展，GDP2020前肯定会超过美帝，上海作为世界第一大港口……等等世界第一大，房价高有什么稀奇？答3，觉得房价高说明你活得太loser，我朋友XX岁已经XX车，年入XX万了答4，湾区房价便宜你去湾区啊，走你一个中国就崩溃啦？答5，呵呵，XXXX小区XXXX元你怎么不说，那个XXXX小区XXXX刀又被你吃了？来，大家帮题主顶500下让他进去。哎，真是幼稚。", "answer_votes": "41", "answer_comment": "​8 条评论"}
{"answer_author": "tian tiantian", "answer_id": 28576388, "answer_text": "没想到这个问题这么火了。我作为一个非历史系的历史爱好者也来凑凑热闹。这个问题我觉得一个从地域，文明，历史，上三方面说明，然后得出结论。  日本是一个海洋国家，海洋国家的通性就是扩张性，由于本土的狭小向外扩张也就成了必然手段。不过日本倒霉日本的数次夸张都因为遇上了中国被打回去了，所以日本作为一头狼时时刻刻盯着周围一旦有机可乘必然就会对周围的国家形成威胁。  上面的讨论看似跟中日近代的发展不太相关，但是却决定了两个国家的发展态度。中国发展的第一目标就是保证中国现有体制不变，其次才是领土。所以1840年后中国上层一直在回避外界的所有压力。皇帝仍然做着天朝上国的美梦，偏偏不愿意向外面看上一眼。  日本这个国家，历史上从来都是学习外来文化来冲击本国文化，唐朝时候日本败于中国，第二年就派出遣唐使全面学习中国文化，全面接受唐朝的一切。这也就是为什么日本能够全面接受西方的一些文明，而日本本土的文明没有形成大的抵触。  中国的本土文明太强，历史上中国的文明还没有真正被外来文明征服过。所以对外来文明往往带有怀疑态度。即便引进的外来文明，往往在实施之前就被本土文明改的面目全非，改得本来的意义。  日本本来就是靠全面引入外来文明发展起来的，所以对外来文明的抵触性相对弱小。所以当中国还在讨论中西文明优劣的时候日本已经将外来的西方文明全面移植近的日本社会。  社会上一直有句话叫态度决定一切，反观中日发展就是态度的差异，一个全面接受迅速发展，在发展中外来文化被本土文化过滤形成特殊的文化，一个还没有引进的挑挑拣拣，还没有实施就改的面目全非，就算最后引进了外来文化也被改的面目全非。中日今日差异可见一斑。当日本全面引进西方技术迅速发展的时候，中国还在说“中国文武制度远处西方，唯火器万不能及”。甲午一战而败，事实上甲午战争才让中国真正认识到自己。认识到自己究竟该发展什么。而不是鸦片战争。也正是甲午战争才让中国从单方面发展“火器”到想要改革制度。到日俄战争，中日已经不可同日而语了。连慈禧老娘们都意识到，实施宪政的国家必然击败社会制度落后的未宪政 国家。  假如让我所中日究竟差距是什么，就是日本是一个懂得服输的国家，甚至是无条件服输的国家，一旦你战败了他，他会认为你什么都是对的，把敌人的东西不管好的坏得都无条件的移植过来，然后在实践中过滤改变适合本国的制度。  中国是一个骄傲的国家，基本战败仍然保持高傲，因为高傲我们瞧不起外来的文明，因为高傲让我们即便引入外来的先进文明仍然中国文明的高傲去打量他们，去改变他们，这也就是为什么自1840年鸦片战争历次改革仍然不能触及灵魂。其实中日之间的发展有太多的相似了，其实还有很多可谈，不过这不是论文就写到这吧。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "fullsail", "answer_id": 25894226, "answer_text": "前面，很多兄弟回答了很多，但居然没有回回答应该翻看一下黄仁宇先生《资本主义与二十一世纪》 和 《中国大历史》两本书。降低了知乎的形象呀。我来说几个，我首先的观点是别从局部看历史，比如我们到甲午战争并不落后等，其实到甲午战争的时候，中日的体制上，日本就已经明显领先了。1.从发展基础上，日本的很多特质更加适合发展起资本主义，包括财阀（有经济基础），封建地方势力（并不太集权，下层集团希望改革），大家族（有些人有钱），海上对外贸易发达（比中国好），人民渴望变革（老百姓不反对），喜欢学习优势民族。而对比中国当时，庞大，集权，优越感，内部矛盾巨大（太平天国），异族管理，重农轻商。2.中国一直以来，都是以自己的文化为骄傲的民族，主动学习意识非常差。其实也只有到甲午战争后，中国被日本击败后，中国的精英们才明白，哦，老祖宗这套真不行了。我们要学习人家，其实也只有到了5.4时期，中国才开始有了一些。当然后来为了抄捷径，结果又学错了对象。3.一个小轿车掉头，半径3米，一个加长货柜车掉头，半径20米，结果pang,还把车头撞了。所以中日的起点真不一样，同样的问题也包括俄国，所以把，推荐大家看看黄仁宇先生的那几本书吧。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "戴威", "answer_id": 46762363, "answer_text": "日本：船小好调头中国：大有大的难处", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 25936272, "answer_text": "中国自有文字记载的文明开始，就是一个以中原文化为核心的文明体。这个核心自上古传说开始，由部落的来往、交锋、结盟，演变为王朝，文明也从中孕育，直到周朝，形成有体系有记载的人类社会模式，用天子分封诸侯的方式使得核心往外滚动，中国国土雏形开始出现。后来经过汉唐的发展，初具规模。到了明清的扩展和巩固，基本形成一个自成体系的东方大帝国。这个帝国自明朝开始，逐渐闭关自守，形成一个类似于今天地球一样的循环系统。外部文明要想攻破这个体系，入侵并取代原有的文明，几乎是不可能的。然而这一切，被一个叫工业革命和资本主义的东西给彻底摧毁了。欧洲的历史，基本围绕着罗马帝国转的。早期罗马在王政时期过渡到共和国，再到帝国，帝国伴随着基督教慢慢开始席卷整个地中海沿岸，终于发展成和东方汉朝不相上下的文明。公元395年，中国正处于东晋灭亡后的一个大混乱时期，而此时的罗马帝国也一分为二，以今天土耳其首都伊斯坦布尔为中心的君士坦丁大帝建立了东罗马帝国，和西罗马帝国分庭抗礼。到了公元476年，西罗马帝国的最后一个皇帝被废除，欧洲开始进入中世纪。中世纪直到1453年拜占庭帝国灭亡才算结束，这时中国已经是明朝中期了。拜占庭帝国灭亡后，欧洲对内开始了文艺复兴、宗教改革、工业革命，对外开始了大航海时代，地理大发现 - 热门问答，走出了黑暗的中世纪 - 热门问答，经济、商业、文明在几百年内交叠上升发展，最终形成了现代文明。而这时候的中国，还是沉睡在天朝上国自给自足几百年原地踏步的状态。工业革命的技术发展早期，带来的生产力还是有限的，这跟高度分工的农业文明大帝国还是无法抗衡，而早期的欧洲也还没到列强的地步。直到19世纪初，当欧洲的工业文明发展到一定的高度，对原料、市场的极度渴求，以及中西方贸易的极度不均衡，终于使得英国人开始用印度的鸦片来平衡中英贸易中被中国吸走的大量白银。这最终导致了清朝政府的禁烟运动，从而引发了鸦片战争。第一次鸦片战争，清朝还不以为然。二十年后爆发了第二次鸦片战争，同样被打得一败涂地，天朝上国被震动了。开始了洋务运动，当时也叫自强运动。即便如此，还是被保守派强烈抵制。洋务运动算是中国第一次的工业化运动，而日本类似的运动是8年后的明治维新。但是，到了1895年，也就是洋务运动34周年的时候，爆发了中日甲午战争，这也是检验中日自强运动的成果。结果清朝依旧是一败涂地。为什么洋务运动比明治维新要早，规模要大，建成了当时亚洲第一海军——北洋水师，结果还是不如日本呢？根源就是出在了洋务运动是只搞经济改革，不搞政治改革。当时的口号是：中学为体，西学为用，师夷长技以制夷。清廷认为，西方再怎么强，也只不过是一些奇技淫巧，要论牛叉，当然是我堂堂中华几千年文明牛啦！所以么，体是不能丢的，至于雕虫小技，在打不过人家的情况下，可以引进来，让我用一用。也就是说，在搞洋务的时候，内心依旧是鄙视瞧不起洋人的东西，更不要说对洋人的先进文化有什么认真对待的态度了，制度层面的改革就提都不要提，想都不要想：祖制不可改。反观日本呢？在明治维新之前，日本进行了倒幕运动，推翻了几百年来的江户幕府。明治天皇登基后，其实是实行了君主立宪制，而不再是原本的封建制度。也就是说，日本是先搞了政治体制改革，然后才进行了经济体制改革。这样的经济体制改革，就有了制度保障。磨刀不误砍柴工，日本全国上下一心，短短不到30年，就先后赶超了清朝和沙俄，把这两者打得落花流水，荣登世界列强宝座。清朝在甲午战争失败后，也开始了反思。官僚体制内部也出现了一些开明的声音，认为洋人的厉害，不仅仅表现在船坚炮利，而是在于其背后的一整套制度，要自强，就必须从体制上改起。即便如此，统治者内部仍然是各种意见纷乱不决。期间经历了戊戌变法，失败后，直到1908年，才扭扭捏捏颁布了一个《钦定宪法大纲》，开始了挂羊头卖狗肉式的宪政改革。最终这样的假政改在全国的反对声中不了了之，最后也导致了大清帝国的湮灭。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "谢浩然", "answer_id": 25846243, "answer_text": "春天出去玩儿的时候，在火车上读了一本初读起来异常通俗易懂的小书。对文明的发展，对人民智德与国家法制都做了「一读就懂」的阐述。没错，是日人福泽谕吉一百多年前写的这本《文明论概略》。读完这本书，再加上附录的一篇短文《脱亚论》，我想这个问题也就大致明白了，再深入也不是太必要了。下面附上《脱亚论》这一篇的文言及白话翻译本……——————————————————文言版————————————————————前日游徜网络，偶遇林思云先生，蒙先生信赖，嘱余将其所译福泽谕吉宏文《脱亚论》还为文言，流水匆匆而就，惟恐疏漏，特请吾兄「饕餮」「西北狼」诸先生校验，是为题记。 -----译者----------------------------------       近世以来，交通便捷，西洋文明之风乃借此东渐，其势遒劲，所向披靡，虽草木清风竟不免。概而论之，古今之西人殊无大异，且远古之西人颇称愚钝，然今世反得灵通，盖因借交通之利器也。东方诸国视此西风东渐，倘阻之以螳臂，似未为不可，然放眼四海，洞见五洲，则万不可行也。阻之无益，何若因势疏导，同沐文明之和风，扬帆东海，共享其利，舍此别无他途也。西洋文明恰如疹疫之蔓延也，东京之疹疫，先发于关西之长崎，借春风而东，旋即弥散，当此时也，虽恨其之毒，然防御之策安在？余曰：无良策也。所谓百害之疫，其势汹汹如此，况利大于弊之西人文明乎？故螳臂之阻不可为，惟推波助澜使之广，期国民早得沐此文明之风，诚智者所必为之者也。       西人近世文明入我国，以嘉永元年始，虽民心早有所向，然肉食者鄙，循守旧制，奈何？彼等拒之千里，与西洋文明势同水火，如脱旧制，彼等无存，若留彼等，国将不国，幸我朝有识之士，秉「国为重」、「肉食者为轻」之大义，更赖帝室尊严，断然废旧制，立新政，朝野一心，革除旧弊，举凡一切均效法西方列强，以图傲视亚洲诸国。其核心者，唯「脱亚」二字而已。我国虽处东亚，然国中早有脱亚而入欧之民意。所不幸者毗邻二国—中国、高丽，此二国因循亚洲旧俗，本与我国旧制无异。或人种之异，或虽同师所授，所得不同，三者相较，彼二国何其相似乃尔，民众并国家，均不思进取之属。       处当今之世，于文明之风熟视无睹，实与掩耳盗铃无异。然仅见闻尚不足以动人心，概因循守旧实为人之常情。若论新旧之争，必伐所谓之「儒教」，其号虽称「仁义礼智」，实徒具其表，无分毫真知灼见，如无耻之徒，傲然尚不自省。       愚以为，彼二国者，于今文明东渐之际，保全疆土尚力有未逮，若非突起智者义士，效法我朝，革旧弊，聚民心，则不出数年，彼定国将不国，自裂其土以供文明诸强分而食之。       当西洋文明如疹疫流行之际，彼二国逆天而行，杜言防川以自闭，实属不智。虽云「唇亡齿寒」，然彼于我无丝毫之助。非特如此，盖因地理相连，西人或将我与彼二国等量齐观，是故鄙彼即非我也。如彼无法可依，西人疑我亦无法也；二国无知，西人谓我亦如此；彼等卑屈无耻，西人则视我之侠义为无物；韩人刑酷，西人思我亦然；凡此种种，不胜枚举。比如邻庄之人皆无法无天，愚昧残暴，偶有一二品行端庄者，亦不免受其累也。如斯例也，今之彼二国於我，有百碍而无一利，此乃我国之大不幸也。唯今之计，我当决断，与其坐待彼等昌明，共兴亚洲，莫若早脱其列，携手西洋诸国，待彼二国，则如西人即可，子不闻近墨者黑乎？是故，我国势必拒此东方之恶邻于心念也。译者：流水成溪　贴于猫眼看人——————————————————白话版————————————————————       随著世界交通的手段便利起来，西洋文明之风逐日东渐。其所到之处，就连青草和空气也被此风所披靡。大致说来，虽说古代和今天的西洋人没有多大不同，但他们的举动在古代较为迟钝，而今天变得活跃起来，无非是利用交通这个利器的缘故。对于东方国家的当务之急来说，此文明的东渐之势十分强劲，如果下定决心来阻止它的话，这样做倒也不是不行，但观察当今世界的现状，就会发现事实上是不可能的。莫不如与时俱进，共同在文明之海中浮沉，共同掀起文明的波浪，共同品尝文明的苦乐，除此之外别无选择。       文明就像麻疹的流行一样。眼下东京的麻疹最初是从西部的长崎地方向东传播，并随著春暖的气候逐渐蔓延开来。此时即便是痛恨该流行病的危害，想要防御它的话，又有可行的手段吗？我确信没有这样的手段。纯粹有害的流行病，其势力的激烈程度尚且如此，更不要说利害相伴、或利益往往更多的文明了。当前不但不应阻止文明，反而应尽力帮助文明的蔓延，让国民尽快沐浴文明的风气，这才是智者之所为。       西洋近代文明进入我日本以嘉永年间的开国为开端，虽然国民渐渐明白应该采用西洋文明，气氛也逐渐活跃起来，但在通往进步的大道上，却横卧著一个守旧衰老的政府（这裏的政府指德川幕府――译者注）。应该如何是好呢？保存政府的话，文明是绝对进不来的，因为近代文明与日本的陈规旧套势不两立。而要摆脱陈规旧套的话，政府也同时不得不废灭。如果试图阻止文明的入侵，日本国的独立也不能保证，因为世界文明的喧闹，不允许一个东洋孤岛在此独睡。对此，我们日本的有识之士，基于「国家为重」、「政府为轻」的大义，又幸运地依靠帝室的神圣尊严（这里的帝室指天皇――译者注），断然推翻旧政府，建立新政府。国内无论朝野，一切都采用西洋近代文明，不仅要脱去日本的陈规旧习，而且还要在整个亚细亚洲中开创出一个新的格局。其关键所在，唯「脱亚」二字。       虽然我日本之国位于亚细亚东部，但国民的精神已经开始脱离亚细亚的顽固守旧，向西洋文明转移。然而不幸的是在近邻有两个国家，一个叫支那（这里的支那指中国――译者注），一个叫朝鲜。这两国的人民，自古以来受亚细亚式的政教风俗所薰陶，这与我日本国并无不同。也许是因为人种的由来有所不同，也许是尽管大家都处于同样的政教风俗之中，但在遗传教育方面却有不尽相同之处。日、支、韩三国相对而言，与日本相比，支国与韩国的相似之处更为接近。这两个国家一样，不管是个人还是国家，都不思改进之道。       在当今交通至便的世界中，对文明的事物不见不闻是不可能的。但仅仅耳目的见闻还不足以打动人心，因为留恋陈规旧习之情是千古不变之理。如果在文明日新月异的交锋场上论及教育之事，就要谈到儒教主义。学校的教旨号称「仁义礼智」，只不过是彻头彻尾的虚饰外表的东西。实际上岂止是没有真理原则的知识和见识，宛如一个连道德都到了毫无廉耻的地步，却还傲然不知自省的人。       以我来看，这两个国家在今日文明东渐的风潮之际，连它们自己的独立都维持不了。当然如果出现下述的情况的话，又另当别论。这就是：这两个国家出现有识志士，首先带头推进国事的进步，就像我国的维新一样，对其政府实行重大改革，筹画举国大计，率先进行政治变革，同时使人心焕然一新。如果不是这样的情况，那么毫无疑问，从现在开始不出数年他们将会亡国，其国土将被世界文明诸国所分割。       在遭遇如同麻疹那样流行的文明开化时，支、韩两国违背传染的天然规律，为了躲避传染，硬是把自己关闭在一个房间里，闭塞空气的流通。虽说经常用「唇齿相依」来比喻邻国间的相互帮助，但现在的支那、朝鲜对于我日本却没有丝毫的帮助。不仅如此，以西洋文明人的眼光来看，由于三国地理相接，常常把这三国同样看待。因此对支、韩的批评，也就等价于对我日本的批评。       假如支那、朝鲜政府的陈旧专制体制无法律可依，西洋人就怀疑日本也是无法律的国家；假如支那、朝鲜的知识人自我沉溺不知科学为何物，西洋人就认为日本也是阴阳五行的国家；假如支那人卑屈不知廉耻，日本人的侠义就会因此被掩盖；假如朝鲜国对人使用酷刑，日本人就会被推测也是同样的没有人性。如此事例，不胜枚举。       打个比方，屋院相邻的村庄内的一群人，在他们出现无法无天的愚行而且残酷无情的时候，即使这个村庄里偶尔有一家人注意品行的端正，也会被他人的丑行所淹没。和这个例子一样，支、韩两国的影响已成为既成的事实，间接地对我外交产生了障碍，这样的事情实际上并不少，可以说这是我日本国的一大不幸。       既然如此，作为当今之策，我国不应犹豫，与其坐等邻国的开明，共同振兴亚洲，不如脱离其行列，而与西洋文明国共进退。对待支那、朝鲜的方法，也不必因其为邻国而特别予以同情，只要模仿西洋人对他们的态度方式对付即可。与坏朋友亲近的人也难免近墨者黑，我们要从内心谢绝亚细亚东方的坏朋友。", "answer_votes": "6", "answer_comment": "​2 条评论"}
{"answer_author": "赵扶风", "answer_id": 19542118, "answer_text": "最高票回答莫名其妙，原问题答案的侧重点应该在“明治维新和戊戌变法同时期发生，为何日本发展得快”扯二战后日本的话，没有美国的扶持，它能有现在的国力？别瞎说了成不？空列毫无意义的对仗句有何用？果然是黑CPC的答案容易骗赞么？求各位珍惜手中的赞票，别像qq空间低级众被人拉着走好不？-历史充满了偶然，导致日本发展比中国快的原因太多，短篇幅说不清楚，我想主因大致以下几点：（中日之差可谓天壤之别）1. 历史传统中国近两千年大部分时间处在专制状态，大一统政府对国家的控制力很强，民众习惯了逆来顺受，历史包袱太重2. 资源中国资源丰富，自然经济自给自足的优越感使国人缺乏思变的动力3. 领土面积中国疆域辽阔，政令传递成本高，改革阻力重重4. 民族矛盾清政府以外族身份统治国家，国内民族矛盾汹涌-有空再展开，求诸位多思考，别被人带着走了。。。", "answer_votes": "17", "answer_comment": "​1 条评论"}
{"answer_author": "匿名用户", "answer_id": 19539279, "answer_text": "中国一直有一句被奉为圭臬的话:”祖宗之法不可变”后来祖宗之地都没了。再后来，没了。其实商鞅有一句话:”治国不一道，便国不法古。”不过他又不是孔老二，没人记得。", "answer_votes": "19", "answer_comment": "​32 条评论"}
{"answer_author": "knight hell", "answer_id": 25800068, "answer_text": "因为我们中国人不努力，不低头认真从琐碎小事做起，老爱找个什么主义做捷径，不想吃苦", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "liu Grayson", "answer_id": 79400508, "answer_text": "原因有三1.维新失败日本是未被殖民过的单一民族国家中国是被满清殖民过的多民族国家 且当时政府是满清皇权政府从民族上讲 无向心力 无维新的政治基础补充一下 如果是宋明汉中 那么中国就会比日本变法更加早或成功 则不需要外来入侵倒逼满清不敢开大门 是畏惧外来人口 西方人的威胁 外部汉族人的威胁 说白了就是对自己的政权没自信 对自己的政权的正当性没自信 满族人是十分自卑的民族 并不是包容性民族 有容乃大 汉族就是太过包容了 被反低等种族反噬2.民族众多 矛盾无法调和3.殖民文化根深蒂固 民智陨落", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 19541052, "answer_text": "唯一的原因是，日本没资源。", "answer_votes": "6", "answer_comment": "​2 条评论"}
{"answer_author": "知乎用户", "answer_id": 26351198, "answer_text": "你想太多了，日本是自己开的门。而且人家是放下身段，不断学习的。", "answer_votes": "3", "answer_comment": "​1 条评论"}
{"answer_author": "知乎用户", "answer_id": 19545227, "answer_text": "很奇怪现在得分最高的第一名@凯达格兰大道 的答案为什么这么获得赞同。我倒是觉得那是很有公知范儿的答案，微博上的段子还没看够？我们从来不应该妄自菲薄抑或狂妄自大。都不是接近客观事实的好办法。对于日本的崛起，以前我和朋友稍微讨论了一下，个人观点总结如下：•二战后经济技术转移      不可否认二战结束之后，米国对日本增加了各个方面的援助，其中就有技术援助。•外交阻力。面对于赤色的中国日本一直是亚洲战略的桥头堡，在冷战格局下日本是融入在北约集团中。这则代表了不像中国那样受到层层封锁可以搞到任何他们需要的技术和材料，这点我认为很重要•无军事负担看看冷战时期铁幕双方的军费比重吧Overall，我觉得日本的崛起是在一个恰当的时期抓住了其自身的优势做到的。它的成功特点对于有赤色成分的天朝具有不可复制性。天朝的崛起还是要依靠诸君努力。手机打字", "answer_votes": "4", "answer_comment": "​5 条评论"}
{"answer_author": "灰灰酱", "answer_id": 19544171, "answer_text": "最近刚好在看各种关于日本经济的文章。关于这个问题，如果要好好写要写太多了，因为这个问题太大了。简单拆分一下，可分为，1、为什么日本发展那么快 2、为什么中国发展那么没那么快后者和前者密切相关但也有特殊因素，大家对本国国情比较熟悉，请联系对比日本各种情况自行求解。日本为什么发展的那么快？简单来说，1、资本积累：当时甲午战争前，日本是根本无法买设备来进行生产的，没钱。甲午战争的赔款是一个契机，让这个国家突然有了一定的资本积累来进口机械设备进行生产2、产业政策：日本在很长一段时间内，全国的企业都由政府指导在一定的计划下进行；同时主导capital insentive的生产形式进行规模化生产3、利用战争和国际贸易进一步加速资本积累：日本在一战期间利用低价格原材料进口-加工的战略初步建立起某些成熟的工业，并逐步在某些产业赶超欧美4、美国的战后扶持：懂的大家…不赘述5、重视人力资本，即教育：日本能够在很长一段时间内获得增长，单靠capital不够的，日本企业甚至社会都重视human capital的投资。6、岛国人民的性格：危机感看到楼上的大多从social或者culture这一角度来分析，我觉得可能从经济的角度来分析更有说服力一些吧", "answer_votes": "5", "answer_comment": "​2 条评论"}
{"answer_author": "知乎用户", "answer_id": 96107273, "answer_text": "除了制度，历史，和地理的差距。还有人的差距吧？当然，提了人的差距，你就成了种族主义者", "answer_votes": "0", "answer_comment": "​添加评论"}
