{"question_id": "22753268", "question_text": "", "question_title": "武汉大学在国内的影响力如何？", "question_commet": "​6 条评论", "answer_number": "51 个回答", "question_followers": "422", "brower_number": "282,120"}
{"answer_author": "知乎用户", "answer_id": 102666398, "answer_text": "第一次更新内容：1）增加了教育部学位和研究生教育发展中心的数据，但需要注意的是这个评估是高校各学科自愿参评的，存在部分学科未参评的情况，且学位和研究生教育发展中心仅是事业单位性质，不具有行政管理权。采用这个数据主要是因为它有各个学科的评分和排名，方便比较，仅供参考；2）历史部分的情况可参考武大校史记录，仅是读大学时有所积累，我知道武大有校史学会，并与吴骁学长有过几次简短地交流，我本人不是校史协会的，如有出入欢迎指正。平时工作比较忙，在凌晨1点到5点匆匆写下这个文章，主要是想把我的思路和看法和大家交流，并非一个严肃的大学评价报告，不能穷尽这个话题的所有内容，内容也有待进一步完善，希望大家理解，不要武断下结论也不要带有偏见做评价。———————————————————————————————————————————以下为原文———————————————————————————————————————————第一次来知乎回答，献给母校。主要是想借这个版面，说一下对一些问题的看法。可能和题目的相关性稍差，希望大家理解。先自我介绍一下，男，来自中西部省份，我是2003年参加高考的，高考发挥失常，估分填志愿，想去文理综合性大学，当年清华、浙大、交大等学校是不在我省招文科生的，不想去天津和南京，于是排除了南开和南京大学，填了复旦，复旦招生老师答应给我加5分参与专业排名，家里人商量来商量去，还是求个保险，于是连夜改成了武大，武大招生的老师给我留下很好的印象，同时高中老师希望为班级留一个重点大学的升学指标，说即使不想去到时候不去就行了。不过人只要给自己留了后路，很多时候就少了前进的勇气。后来成绩出来后，是全省文科60名，不算很好的成绩，但是除北大外的学校都能上。可能是临近高考，最近关于高考、择校、大学排名的问题又好像讨论多了起来，于是想来知乎看看大家如何评价，但很遗憾，看了之后却令人感到很压抑。我所理解的武汉大学，和网民心中的形象相去甚远，于是希望通过这个平台，把我的感受跟大家交流一下。一、关于对武大的质疑翻阅了几篇文章，大家对武大的主要质疑来源于排名和高考分数线的差距。一些排名让武大的同学感到骄傲和自豪，而其他一些觉得被低估的学校的同学则觉得武大名过于实。网上少不了一些争吵。对这个问题，我觉得应该这么来看待：第一：大学排名不能与高考分数线划等号大学排名可以依据的标准有很多，当然可以以高考分数线作为排名的依据，但这仅仅从一个维度刻画了一个大学的形象。大学，是教学和研究的场所，因此除了教育的功能外，还有一个很重要的功能是科研。简单来看，又可分为人文社会科学和自然科学的研究。那么在这个研究领域内对各个大学进行排名，与高考分数存在差异是很正常的事情。我们只需要看这个排名和评价的主要指标是什么就可以了。我们可以接受按照高考分数线排名，武大在相对靠后的位置，我们也需要在看到把衡量校友表现作为主要指标的排行榜结果的时候保持一份理性。我觉得这种认知度首先是要有的。第二：影响武大高考分数线的结构性因素这里我们先不讨论学校声誉对分数线的影响，单说除此之外的其他结构性因素。首先是中国的地域因素，这个自然不必多说，东部沿海地区比中部地区具有优势是显然的。武大对东部考生的吸引力较弱，自然在东部省份的分数线较低，但武大对中西部考生的吸引力仍然是不错的。因此，武大比其他同类型大学在招生人数上更倾斜中西部地区。实际上，我的同班同学中也有好几个中西部省份的高考前十名。其次是规模因素，除了浙江大学、吉林大学外，主要的排名靠前的大学，除合并医学院外，并未进行大规模的扩张，而武汉大学在2000年合并了三所大学，这三所大学都在不同程度上增加了武大在相应学科领域的实力，把武大从一个单纯的文理科大学，拓展成为包含工科和医学的大学，招生人数较其他大学要多两倍以上。随着招生人数的扩大，自然分数线要比未扩张人数之前要进一步降低，这是个容易理解的道理。第三：大学排名怎么看刚才提到应该用一种理性的态度来理解大学排名和生源之间的区别，生源质量一定程度上只能反应高中生对大学的认知，高中生对大学的认知，或者高中老师、家长、社会大众对大学的认知，他们的认知是很有限的，有的时候是比较片面的，或者是带着传统的观念的。不足以代表真实的大学科研水平。此外，我一直认为综合的大学排名没有意义，学科上的差异影响是非常大的。武大以人文社科、基础科学、部分工科为主，其中尤其以人文社科为主，这就造成了如果以全部大学综合来看，武大相对于完全的文理科综合性大学，排名会稍微靠前（例如相对于南开、厦大等），因为优势工科学科给武大加分不少，而这些学校没有相应的学科，而同时，由于武大人文社科的优势更明显，而这些学科通常没有可以量化的指标，造成了武大会比一些以理科、理工科为主的大学的排名要低，例如南大、中科大等。因为武大合并的水利电力大学及测绘科技大学并非完全门类的工科大学，在各自的学科领域内非常优秀，所以暂时先将武大定位为文理综合性大学，我按照教育部对文理一级学科的打分情况进行加总排名，在文理科这个领域的教学科研实力情况是：北大>南大>复旦>武大>北师大>南开>中山>厦大。&lt;img src=\"https://pic3.zhimg.com/50/e94570c4376df14a8d6c6c8b6ffc7333_hd.jpg\" data-rawwidth=\"461\" data-rawheight=\"460\" class=\"origin_image zh-lightbox-thumb\" width=\"461\" data-original=\"https://pic3.zhimg.com/e94570c4376df14a8d6c6c8b6ffc7333_r.jpg\"&gt;数据来源：教育部学位与研究生教育发展中心《2012年全国高校学科评估结果》根据网友建议，增加了这个数据来源，北大的数据就不用贴了哦，大家感兴趣可以去找来看看。北大和南大的优势非常明显，南大也远好于复旦，比复旦高了350多分，但是往后的排名，武大与复旦（比复旦低75分）、武大与北师大、南开、中山的差距都不大，高于上述高校100多分左右，与厦大稍大一些（比厦大高244分）。南大在很多理科专业，比如天文学、物理学、大气科学、地质学、生态学上明显好于其他学校，其他学校基本上在上述学科都是缺失的，造成了南大在文理科研究实力上远远强于其他高校。而同时，南大在中文、外文、社会学等学科的表现上也较优，因此拉大了与其他学校的差距。从武大自身的学科优势来看，世界史、地理学、地球物理学、生物学、公共管理、图书情报、新闻、理论经济学、法学上表现优异。在以上文理学科排名的基础上，把工科、农业、医学等学科加进来，那么一些传统理工科学校，清华大学、上海交通大学、浙江大学会排在前面，而复旦由于在一些工科及医学上的学科优势也能保持在前列，南大凭借文理科的综合实力，以及部分工科的优势，比如计算机，地质工程等，也能保持在前列。武大加上电气工程、水利工程、测绘科学与技术，口腔医学等学科的优势，排名应该在南大之后，中山、南开、北师大之前。由于一些理工科高校缺乏人文社科，而一些人文社科类高校，如人大、外语、财经类院校等，缺乏理工科，一些文理科综合性大学缺少工科实力，综合考虑下来，我认为武大学科实力在全国前十没有问题，由于我没有做全部学科的加总分数汇总，所以这里没有这个数据，但大家也可以做一个印证。至于知乎里面讨论的南大和武大的比较，从数据上来看，南大在文理科综合表现上好于武大，南大在理科的表现上较优，而武大在人文社科方面的表现更优。我觉得没有必要去和任何一个高校讨论排名的高低，知道自己的优劣势就好了。这一点我始终抱持这个观点。二、关于武大的影响力我回到这个问题上来，其实影响力这个东西很难去衡量，这个影响力可以体现在学术研究影响力、对高中生的影响力、对考研生的影响力、对政经的影响力、对业界的影响力等等，这个要做一个评价可就太难了，需要一个科学评价的标准。但我想就自己的认识说几点看法，还可以继续讨论。（一）从历史上来看，武大的影响力中国现代大学的起源是从清末民初开始的，主要是1900年前后。那个时候大学主要有三类：国立大学（以清政府最高学府京师大学堂，和洋务派主导的南洋公学为代表）、中国的私立大学（以中国公学、复旦公学为代表）、教会大学（以燕京大学、圣约翰大学为代表）；从地域分布上来看，上海的大学最多，北京次之。这个时候，清华学校、南开学校都还没有自己的大学部，还仅仅是中学校。武大的雏形还仅仅是地方学堂改造的现代书院。从区域上来看，上海和北京的大学的影响力是很大的，京师大学堂是国家的最高学府，影响力自然是最高的，而燕京大学、圣约翰大学的影响力也很大，交通大学作为国立工科大学，担负着民族复兴的希望，地位也较高。而私立大学的影响力则较小。辛亥革命以后，建立民国，开始准备在全国建立自己的国立大学，首先是从师范学校的改造开始的，在全国范围内的中心城市成立了六个高等师范学校，分别是在北京、南京、武汉、杭州、广州、沈阳、成都。名称都叫做XX高等师范学校，简称XX高师，这些高师成为国民党建立中心国立大学的基础。先预告一下，这些高师演变成了现在的北京师范大学、南京大学、武汉大学、浙江大学、中山大学、东北大学、四川大学。可见，这些高校也成为现在重点大学的雏形。宁汉合流之后，国民党成为全国的执政党，南京国民政府提出新的教育方针，蔡元培正式提出建立大学区制度，设立六大学区，并在每个学区内重点建设一所大学。虽然这个想法并未真正实施下去，但是从那个时候开始，国民党统治下的国立大学的雏形就越来越明显了。于是在1928年左右，以上这些高师纷纷改名为国立中央大学、国立武汉大学、国立中山大学等等。清华、同济等外国人建立的学校也在1928年左右也纷纷改为国立。至此，中国的国立大学的力量开始加强，国立大学里通常强调国学考据和各种文理基础学科的研究，当然还包括国民党党化教育，但国立的工科大学例如交通大学则不一样，比较强调科学。国立大学形成了北京大学+六大学区中心大学+交通大学的主要格局，而六大学区中，以南京、杭州、武汉、广州的影响力较大。因此北京的北大、清华、上海的交大依然是影响力最大的国立大学，而中央大学的影响力开始逐渐增大，国立武汉大学、国立浙江大学、国立中山大学旗鼓相当。而此时，中国人的私立大学发展也较快，但这些私立大学普遍强调实用科学，主要为了就业，学费通常较高，被讽刺为“文凭工厂”，学术研究实力基本上没有，复旦大学是当时私立大学里面声誉最大，此外还有南开大学和厦门大学。这些学校以教授实用性学科为主，因此我们现在看到复旦的新闻、财经等等实用性学科至今仍有很好的传统和声誉。复旦是一所中国传统士绅阶级建立的大学，属于中国新兴的资产阶级的大学，因此与教会大学、国立大学的区别较为明显。从学术声望上来说：国立大学》教会大学》私立大学从生源上来说：顶尖国立大学和教会大学差不多，优于私立大学从地域影响力上来说：北京的北大清华燕京是全国性的大学，声望和影响力在全国都很大，上海的圣约翰大学吸引上海本地及周边的富裕家庭的子弟，交通大学也吸引南方的学生较多。复旦主要吸引南方十几个省的学生，由于私立大学没有招生地域的限制，所以可以覆盖较广的区域。而武汉大学此时属于影响中部各个省区的主要大学。补充一下，武汉大学实际上是蔡元培从北大挑选的一些教授来协助建设的大学，因此武汉大学在某种意义上与北大有比较深的渊源，我入校那年校庆发言上，北大副校长的发言明确提到了这一点，当然他没有说那么明白，但是稍微研究过那段历史的人都会有所了解。李四光是国立武汉大学筹备委员会负责人，他是北大地质学的教授，他亲自挑选了现在珞珈山校区的地址，此外，武大的同学们都知道珞珈山上有十八栋别墅，知道郭沫若曾经在那里住过，但是这些别墅一开始都是给从北大来的教授建的，当时从北大来了很多学科的教授，具体名字我不记得了，大家可以去查。当时胡适接受采访时说过一句话：要看中国今日之发展，去武昌珞珈山下看看武汉大学的发展便知道了。武大在初期的发展壮大与北大的支持是有关系的。而像中央大学等则是国民党重点建设的大学，南开则接受了来自洛克菲勒基金的投资，其理科，比如物理化学，社会科学中的经济研究所，都得到了美国人的支持。厦门大学则从南洋的华侨那里筹集资金，复旦大学则是在上海次于交通大学、圣约翰大学的民族资产阶级大学。所以总结来看，武汉大学对学生的影响力主要集中在招生覆盖的区域，但是由于是国民党重点建设的区域性中心大学，在学术研究实力和人才吸引上是有很大的优势的，是明显高于私立大学的。抗日战争开始之后，所有的大学都开始内迁，国立大学的声望和影响力这个时候达到了顶峰，相继形成了民国四大高校（西南联合大学、中央大学、浙江大学、武汉大学）和民国五大高校（北京大学、清华大学、中央大学、浙江大学、武汉大学）的说法，因为这几个学校经常一起招生考试。1949年以后，中国的大学格局则发生了翻天覆地的变化，首先是院校调整，将原来的学校学科体系弄得七零八落，但也有借机迅速发展的例如复旦大学（但需要澄清的是复旦大学在此之前也是很优秀的中国民族资产阶级的私立大学的代表，并非野鸡大学），其次是确定全国的重点高校，国民党时期的国立大学除了北大清华，其余的一直到第三批第四批才入围，武大、浙大还行，在第三批入围了，南大比较惨，在这之后才被列为重点大学。民国时期高校的发展备受打击，而共产党的高校，人民大学等发展非常迅速。历史上武大的影响力和全国大学的格局我大致说到这里，不继续展开了，说这些的原因主要是从一个历史的角度来看待影响力这个问题。在1949年前后，武汉大学无疑是具有非常高的影响力，但院校调整和之后的政策改变了这个格局，武大工学院为主体，组建了华中工学院，农学院为主体组建了华中农学院，水利系为主体组建了武汉水利电力大学，部分优势学科还整体并入其他高校。此后的事情想必大家也都知道了，80年代开始，各个高校开始重新进入轨道发展，南大发力SCI论文，武大则开始轰轰烈烈的高校改革，文理科发展蒸蒸日上，但人才流失也较为严重，中文系程千帆去了南大，将南大的中文系影响力大幅提升，诸如此类，略去不表。（二）现在来看武大与其他东部高校的差距排名的因素上面已经分析过了，这里不展开了。大学，最主要还是在人才，几十年前清华大学的梅贻琦校长就说过，所谓大学者，非谓有大楼之谓也，有大师之谓也。因此，大学的差距主要还是教研人员的差距，从学科来看，人文社科类学科仍然有一席之地，理科起色不大，测绘和水利电力的影响力则非常大，不仅是学术上，也表现在相关的行业领域，电力行业、测绘、导航等领域都有武大的身影，我国北斗导航系统建设不乏很多武大的毕业生。学校的资源上来看，与北京的北大清华人大有较大的差距，主要是在政策制定机构，高端人才资源上的差距，比较大。与上海的复旦交大等在社会、商业资源上差距交大。其他的高校我认为其实差距并不会特别大。（三）在武大读书的体验说到自己的体验，就是感觉武大偏安一隅，学生不那么浮躁，安心做学问的人会比较纯净，学生没那么多功利性的机会，于是想法都很理想化，很单纯。课程设置其实跟其他大学没有太大差异，我读的是经管院，与北大光华、清华经管有些差异，其他学校差异不大，大一大二有一些课是英文的教材和试卷，有几门课老师还用英文讲授，不过英文没那么好就是了。周围有蛮多高分不得志的考生，最后都对武大充满了特殊的感情。现在工作了，感觉大家对武大的认知是认为是一所不错的综合性大学，但比北大清华人大复旦交大要弱，其他的感觉差不多，虽然承认武大的地位，但普遍认为如果你上武大，那么你高考可能不是最拔尖的那个位次。高校之间交流较少，学生活动的设施、活动的水平一般，缺乏高水平的文化艺术科学活动。一些老师的水平感觉一般，很难把一个问题讲得很有趣并且让大家听懂。考试题感觉很简单，只要考前多看，基本上都没什么问题。学分制感觉形同虚设，大部分都是必选课，只有公共选修课有选修的感觉，好的课程很难选上。院内的课程开放选修的很少。最后，总结一下武汉在人才吸引力上本身就要弱于东部地区，由此带来的对生源、科研人才的吸引力较弱，这个必须要承认现实，如果武大在人才吸引上不下功夫，差距就会越来越大。我觉得承认这个差距没有什么不好意思的，有了差距才能看到需要补足的地方，然后才能想尽一切办法去弥补这些不足。当年芝加哥大学也是一无所有，仅用了20年时间，洛克菲勒家族就使得他跻身于世界一流大学之列。当然这个是个很难去改变的事情，旧的人、体制、观念、利益，各种牵绊。这个留待一群热心武大发展的仁人志士去思考，去解决。有点仓促了，快通宵了，得赶紧去睡觉了，脑子已经不转了，有新想法再及时来交流吧，今天先到这儿了。", "answer_votes": "309", "answer_comment": "​48 条评论"}
{"answer_author": "贺仙", "answer_id": 25535417, "answer_text": "如果你喜欢文学，自由，美景，历史，丰富的公选课以及在极端天气情况下幸存武大不会让你失望的", "answer_votes": "71", "answer_comment": "​19 条评论"}
{"answer_author": "赤赤的世界", "answer_id": 67821248, "answer_text": "12年夏天，高考出成绩报志愿时，我：妈，我报了武汉大学。妈：哦，好。一个月后，妈：你那个什么。。。重庆大学？录了吗？什么时候开学？PS：山东人。PS：感觉选得很对。", "answer_votes": "22", "answer_comment": "​16 条评论"}
{"answer_author": "王二", "answer_id": 22505337, "answer_text": "这个问题好大，回答起来如坐针毡，感觉无论是学者、老师、学生、ZF官员都有着可能截然不同的评价，我就从四年本科的体验，从最深刻的印象来说吧。————————————————分割——————————————————无论是从略广识的远亲，还是从坊间传闻，11年以前的武大给人感觉是逐渐衰败的，从凶杀案、腐败案的暴露，到政府规划与其背道而驰，都例证了这一观点。甚至在新生游的校园中，带队学姐还调侃道“别的学校负面新闻，报道通常是 某大学，而武大被报道从来都是指名道姓，让人感觉坏事层出不穷似地”。从不好的地方来说吧。臃肿------这绝对是武大的特色，无论是校区大小，还是招生人数全在全国前列，特别是2000年四校合并（湖北医科大学、武汉水利水电、武汉测绘科技大学武汉大学），虽然地皮曾今就是武大的，因为效仿苏联大学模式，才分出去了专业专攻性质的大学，现在又效仿欧美办学模式，走综合性大学的路子。这折腾来去，对于领导班子的调整就显得尤为重要，人员 不好辞退的后果就是人浮于事，办事效率下降。其中后勤集团听说家大业大势力大，贪污腐败当然是必然中的必然了。这也是最让外界所诟病的一点了，不过换句话说，哪所大学敢说自己清白？人民大学招生就业处处长被抓引爆高招黑幕可怜--------无论是院系调整还是财政支持，武汉大学总是得不到什么便宜，曾今首屈一指的哲学去往北大，工科拆分为华中理工成为当今名校（经Yifen Hao在评论中的提醒，此处华中理工-华中科技大学的前身，并不完全由武大工学院拆分而来，而是并入了许多国内其他高校的工科专业）。虽然和前任校长与政府关系处理不当有关系，可是武大人更愿意自嘲说这是因为 国立武汉大学 的“国”惹得麻烦。以上两点除了政策上的不幸运，总的来说就是内不能安下属，外不能靠政府。好在晓红哥重庆空降武大，一位实干派的校长努力挽回这样的颓势。无论是改造住房条件、安抚老职工待遇、建立学生-管理层交流平台、进行后勤集团改组、积极调解政府关系，都给古老的武大带来了新的势头。所以在今天，当有人还在持4年前的观点，说武大在颓势，想必我是不会苟同的。儿不嫌母丑，武大的好，才是真正让我铭记的。自由-------我所认为武大的自由，是充满矛盾的自由。一方面，社团活动的丰富程度、活跃程度全国首屈一指。合唱、辩论、挑战杯比赛等活动中在全国高校领先。（对了...还有DOTA战绩榜，不玩DOTA,但是貌似武大战绩还不错）丰富的社团活动来源于学校对个人对自己时间安排的充分尊重，虽然院系政策多有不同，但是就我所经历。没有早操晚自习，除了体育课点名也不频繁，给你充分的自由安排自己的时间，做自己想做的事情，应该包括打DOTA拿战绩- -。另一方面，在意识形态的管控相比于其他高校还是比较严格，也有称呼为华中第一党校。可能是因为在“国立”上吃了亏，今后关乎此类问题更是小心翼翼，敏感的教授讲座取消等事件也有所亲历。可是同时马列毛邓三系列课程上，也常有愤青老师畅抒胸怀而未曾被严肃处理。武大华科作为华中地区两所实力比较强的大学，经常互相对比互相调侃，而用人单位的评价也常被人传播。有听老师讲到：用人单位普遍对两校毕业学生的对比，华科学生基本功扎实、可以“出活”，属于标准的技术人才。而武大的毕业生普遍都有些小资情结，偏向于选择自由自在的潇洒生活，适合搞管理。总的来说，自由，带给了武大生动活泼的校风和不拘一格、母校情节深厚的学生。校园-------虽然说，大学之大，不在于大楼，而在于大师。但一个独具风格历史悠久的校园建筑，一个绿树丛荫的校园生态。相比于开阔平地全现代化建筑的标准“人造”校园，这样的校园从环境中，潜移默化的影响着学生、学风。浪漫洒脱追求自由无不能从其中找到源流。如何评价尚不敢遑论，仅从自身体验、亲身了解，给予一定描述吧。最后...装逼性的结尾...本文利益相关：笔者为武大本科生", "answer_votes": "96", "answer_comment": "​44 条评论"}
{"answer_author": "pOldBrush", "answer_id": 36810582, "answer_text": "近几年武汉大学整体在明显变好，既然要谈大学就要谈她的教育和科研。生活环境啥的前面的答主有说过了我就不再重复，不过食堂真心难吃。教育方面，每个学院都有自己的特色，好的专业有很多大牛，比如说测绘地理信息类，一般的专业也还过得去，比如说计科，也有一些比较差的专业。共同点是教学基本处于放养状态，老师很少点名，学习真的靠自觉，所以自制力差的就不要来武大了。学习资源相当丰富，几乎是你想学什么就能找到相应的资源。科研方面，我只了解我这个专业的，我读的是地理信息系统，说白了就是写用于空间信息的代码。因为专业全国第一的原因，科研也挺厉害，各种国家级项目。有个国家重点实验室在武大，前段时间又有个全球仅有五家的卫星导航什么中心落户武大。别的专业我就不清楚了。让我感觉特别好的一点就是我们学院没有听说过老师和领导的负面消息，奖学金评选和各种奖项的评选全靠硬实力，而且过程公开透明。研究生推免也从未听说过有不良操作的案例。光这一点就比绝大多数高校要强了。最让我感动的一点就是，几乎每个老师，无论是讲师还是教授甚至是院士，上第一节课的时候都会讲：如果有同学在学习或者生活上有什么困难，如果你觉得我可以让你信任，你可以来找我，我会尽我所能帮助你。大三代码菜狗就不匿了。", "answer_votes": "23", "answer_comment": "​12 条评论"}
{"answer_author": "李高高", "answer_id": 100897189, "answer_text": "华中地区大哥大华东地区还行吧华南地区凑合吧华北地区武大是啥呀", "answer_votes": "6", "answer_comment": "​24 条评论"}
{"answer_author": "杨辉", "answer_id": 38486211, "answer_text": "武大在国内的影响力到底怎么样，其实各种排行榜可以参考下。从地域来讲，在南方比较有影响力，在北方则稍微弱一些，不过武大的北京研究院还是很给力的。", "answer_votes": "1", "answer_comment": "​1 条评论"}
{"answer_author": "匿名用户", "answer_id": 100362554, "answer_text": "武汉大学距离世界一流大学有多远？其实只差一个刘道玉", "answer_votes": "18", "answer_comment": "​8 条评论"}
{"answer_author": "Desu", "answer_id": 102851198, "answer_text": "我只能说武大这种自由的环境，既能出经天纬地济世人才，也可以出碌碌无为平庸之辈。当然，后者居多。因为学生差异实在太大了，体现在思想，行动上。 那些想依靠母校影响力的人，为何不曾想一下，何时你可以为母校争光？", "answer_votes": "14", "answer_comment": "​3 条评论"}
{"answer_author": "永远的谭大柱", "answer_id": 25543584, "answer_text": "找工作而言，在南方就够了。其实比武大好的学校也确实屈指可数，无非就北清复交，其他的诸如南大浙大究竟能好到哪儿去呢？虽然浙大排名那么高。环境而言几乎是我见过学校里面最自由的，几乎不会有太多的管制，这点哪怕和爱在华师相比都轻松很多，更别说死在华农和埋在地大了。学术影响力学渣不知道，看排名应该不差。这么说吧，单纯从学校而言，whu是我目前唯一有感情的母校。因为这几年的生活有记忆", "answer_votes": "34", "answer_comment": "​55 条评论"}
{"answer_author": "匿名用户", "answer_id": 25594141, "answer_text": "学大汉，武立国武大的学生因此多少都是有点理想抱负的。负面影响就是脚踏实地方面略逊于基友华科。因此造成的影响就是，名气是有的，但是毁誉参半，不像其他名校更集中于正面形象。", "answer_votes": "12", "answer_comment": "​6 条评论"}
{"answer_author": "匿名用户", "answer_id": 90391012, "answer_text": "一流的校园环境，二流的学生，三流的教师资源，四流的硬件设施，五流的管理水平。。。", "answer_votes": "14", "answer_comment": "​10 条评论"}
{"answer_author": "匿名用户", "answer_id": 138488681, "answer_text": "不想在无谓的争论上花太多时间了。非黑，武大的某些学生太厉害，我如果不承认武大的影响力在国内前几，只怕要被一直喷下去，关评论了。—————————————————————&lt;img src=\"https://pic1.zhimg.com/50/v2-7e138e344ab179f982f9b9b40d205335_hd.jpg\" data-rawwidth=\"720\" data-rawheight=\"1280\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic1.zhimg.com/v2-7e138e344ab179f982f9b9b40d205335_r.jpg\"&gt;一位武大的同学提了三个质疑。回复他需要打很多字，我就直接更新在答案里了。首先，原答案是否客观，大家可以自己到下面去看。我没有说武大的文科不好，也没有对武大最有影响力的测绘学科（我认为是，应该也不会有人反对）避而不谈。我说的每一句话，一定都是有依据的。这个问题问的是武大的影响力。那么影响力强弱的标准是什么？首先是学科实力，其次就业质量。如果要说一所高校的某某学科在全国有影响力，那至少得是全国前五或者前十。按这个标准的话，武大的文理科尚好，医科和工科排到十几二十名毫不夸张。医学有八大校，工科的话西交大哈工大往下一直排到西工大哈工程，影响力都不是盖的。关于三个质疑。第一，武大确实不及华五。浙大上交的工科，南大科大的理科，复旦的医学和商科，都是除了清北之外全国最顶尖的，要说影响力，武大显然只有个别学科能达到这几个学校的层次。第二，武大的经管不如中大厦大。经管经管，武大的经济类和中大厦大肯定是一个档次，管理类的话要差不少。就业的话，我也在这一行，公认的是中大厦大的学生横扫广州深圳，武大相对差一点，应该也有地域原因吧。第三，不要老想着把华五拖下来。自从我写了这个答案，就不断有人在评论区里喷，当然，也有武大的同学给我点了赞。怎么说呢，感觉国内年轻一代普遍存在的毛病就是，听不得实话还有批评，只要不合自己心意的，通通一笔抹杀。武大当然是不错的，但除了前面的清北华五人，和武大同档次的学校只怕不下十所，而武大在其中也并不突出。我说句影响力一般，至少不该被喷吧？以下是原答案和吐槽:一般。不是武书连把武大排到前十，影响力就能变成前十。武大在全国范围内有影响力的，主要还是测绘，图书馆学这些小众学科。文科还好，理科的话国内基本只认清北华五，南开、北师大等校也都比武大高。经管的话，远不如清北复交和两大财经，甚至比起同档次的中大厦大也差不少。医学和工科不多说了，一个十多名，一个二十多名。平心而论，武大是一所综合性够强但略显平庸的大学。（又看了一遍，我还是没觉得有什么毛病。某些喷子有脑子吗）PS:发了不到一天引来了不少武大的同学啊，有的给我点了赞，更多的是来喷我的。关于答案，我觉得自己说得已经很中肯了，所以，请某些人不要太玻璃心了。", "answer_votes": "38", "answer_comment": "​91 条评论"}
{"answer_author": "T44的弹药架", "answer_id": 107538159, "answer_text": "湖北省第二差的985高校", "answer_votes": "18", "answer_comment": "​3 条评论"}
{"answer_author": "游走红尘", "answer_id": 49358163, "answer_text": "以我当年高考，学生们对学校的认识度和分数线来看清华大学，北京大学中国科技大学，中国人民大学。。。。。。。。。。。。。。。。。。上面是我们一直认为的四大校复旦大学，上海交通大学，南京大学，武汉大学，华中科技大学，浙江大学。。。。。。。。。。。。。。。。。这六所是我们认为的仅次于四大校的大学六虎将四川大学，西安交通大学，厦门大学，中山大学，北京理工，中山大学，南开大学等等。。。。。。。。。。。。。。其他大学。。。。。。。。。。。。。。。。。。。。。虽然知乎上，因为武汉大学进了校友会第四名，被黑惨了但是我要说的是，虽然，武汉大学确实进不了前五，但是进前十是有这个实力的。武汉大学，以及华中科技大学，好好加油吧！", "answer_votes": "31", "answer_comment": "​46 条评论"}
{"answer_author": "24sir", "answer_id": 85070855, "answer_text": "大多数广东人不知道，真滴！", "answer_votes": "1", "answer_comment": "​6 条评论"}
{"answer_author": "知乎用户", "answer_id": 67795199, "answer_text": "老家辽宁。高一时候考了班级20名，由于算错了总排名，误以为自己总排相当于当年武汉大学，当时连武汉是哪个省的都不知道，更不知道武大，以为是野鸡大学，伤心了好一阵。后来，我高出一本线96分压线来到这里。现在感觉除了气候不习惯，其他的也没什么。大学，靠自觉。不喜勿喷。......短小的分割线......2016.7.18现在想想，如果武大是贵党一手建立的，当初也就不会被拆得稀碎……说不定，我也就考不上了呢", "answer_votes": "4", "answer_comment": "​35 条评论"}
{"answer_author": "匿名用户", "answer_id": 102794837, "answer_text": "和厦门大学并列，是300分想逆袭少年的最爱目标。", "answer_votes": "13", "answer_comment": "​22 条评论"}
{"answer_author": "知乎用户", "answer_id": 25545937, "answer_text": "不管怎么说这两年的武大给人感觉还是越来越好的。", "answer_votes": "10", "answer_comment": "​添加评论"}
{"answer_author": "小白杨", "answer_id": 138635659, "answer_text": "利益相关从湖医转到武水在读武大电气大三狗今年看到某某排行榜把武大排到第三名，票圈着实炸了一波，去年的第四到今年的第三，大家大部分都以看戏的心态来看这个排名的，票圈言论一致，下一次我们就是第一啦但是有种东西叫做母校，只能我黑不能你黑&lt;img src=\"https://pic2.zhimg.com/50/v2-d67cdb5835c116071171559ebd42058b_hd.jpg\" data-rawwidth=\"960\" data-rawheight=\"1706\" class=\"origin_image zh-lightbox-thumb\" width=\"960\" data-original=\"https://pic2.zhimg.com/v2-d67cdb5835c116071171559ebd42058b_r.jpg\"&gt;武大可能第三的名次，稍微有点名不副实，在教育实力上还有些欠缺的但是你没看到它的努力嘛！医学部今年又与一家医院进行合作水利水电依旧全国第一作为一个电气狗，虽然电气已经没有那么抢手了，但是南方电网在职领导人，还是大部分从我电气出去的我测绘遥感全国第一不是浪的虚名法学全国第三新闻全国第五作为一个综合类大学，文法理工农医，每一部分都有自己的成就还不算上集体婚礼，樱花大道这种层出不穷的buff就单论123年校史就足以我们为之倾倒当然，我武有许多不足，比如说全开放式校园的安全问题等等所以2017大家一起加油吧，为我武我是个经不起批评的人，你批评我我就骂你我就喜欢武大，你打死我啊&lt;img src=\"https://pic4.zhimg.com/50/v2-ec3beef8f4350fa2a8cded69c7142fe5_hd.jpg\" data-rawwidth=\"394\" data-rawheight=\"394\" class=\"content_image\" width=\"394\"&gt;同时，祝自己考研加油", "answer_votes": "10", "answer_comment": "​4 条评论"}
{"answer_author": "村里的小方", "answer_id": 37479955, "answer_text": "别的不说。测绘导航地球物理，遥感水利思想政治，舍我其谁(^_^) ", "answer_votes": "8", "answer_comment": "​16 条评论"}
{"answer_author": "匿名用户", "answer_id": 103853471, "answer_text": "告诉我有多少人想到武大就想起黄灿灿这个人？作为一个武大学生，我真是看到这个人的名字就烦。", "answer_votes": "6", "answer_comment": "​7 条评论"}
{"answer_author": "匿名用户", "answer_id": 82718240, "answer_text": "简单说几句(๑•ั็ω•็ั๑):反正来了以后挺佩服自己当初挑大学的眼光，哈哈，开玩笑。自高考那年以后武大的录取分数线(在天津)直线上升，综排首次进了前五，当初肤浅地认为自己赚了(现在仍然肤浅着)。不过不可否认，它在北方的知名度不高，综排相对于录取分数线也有些高。原来乃至现在我一直认为中国大学的前几名是这样的(我是文科生):清北人复中科上交南浙，除此以外应该就是武大了吧。当然还有很多大学也都特别棒，我只是谈了一下自己的看法，毕竟有些主观情感无法全部剔除。总而言之，还是不错的，它也越来越好。今天武汉下雪了，雪中的武大很美。&lt;img src=\"https://pic2.zhimg.com/50/675b015f274c2a391b49ce8cb9fdef5c_hd.jpg\" data-rawheight=\"1440\" data-rawwidth=\"1080\" class=\"origin_image zh-lightbox-thumb\" width=\"1080\" data-original=\"https://pic2.zhimg.com/675b015f274c2a391b49ce8cb9fdef5c_r.jpg\"&gt;", "answer_votes": "7", "answer_comment": "​1 条评论"}
{"answer_author": "魏子敬", "answer_id": 139925300, "answer_text": "感觉武大很浮夸。", "answer_votes": "3", "answer_comment": "​4 条评论"}
{"answer_author": "匿名用户", "answer_id": 67196352, "answer_text": "比关山口的三本好太多了。根叔火遍全国的那年，“原来根叔是你们校长，我还以为得是个好大学的校长呢”", "answer_votes": "5", "answer_comment": "​5 条评论"}
{"answer_author": "匿名用户", "answer_id": 37455886, "answer_text": "都是几个学生在这答，没有比较得不出任何结论更新:毕业生五年后平均薪资全国70开外，有啥好吹的，这才是实实在在的东西啊，你们以后会明白的，不说了都是泪", "answer_votes": "3", "answer_comment": "​2 条评论"}
{"answer_author": "匿名用户", "answer_id": 233888373, "answer_text": "坐标河北—————————————————————————放假日常一邻居：在哪读大学呀？我：武汉大学邻居：噢……武汉哪个大学？我：就是武汉大学邻居：是几本？我：……一本（os:你开心就好）—————————————————————————放假日常二邻居：在哪读大学呀？我：武汉大学邻居：噢……嗨没事儿，别灰心，有个学上不就行了吗我：是啊 哈哈哈（os:我谢谢您的安慰……）—————————————————————————邻居是泛指，包括但不限于。在我的家乡河北，武大在很多人心里是比不上省内河北大学、燕山大学的。如果他们同时听到湖北大学和武汉大学，肯定觉得我们武大这个“市级大学”被比到不知道哪里去了。我妈经常被其他同龄学生家长秀优越，不过现在已经习惯了，很淡定。感谢我武时不时当次网红，现在我身边怀疑武大是二三本以及专科的好像少了一些。", "answer_votes": "2", "answer_comment": "​1 条评论"}
{"answer_author": "陈钰", "answer_id": 152648603, "answer_text": "知乎首次认真回答献给我武。影响力还可以，因为我校文科尤其新闻还不错。但是，但是，但是，（重要的事情说三遍）我校数学物理不行啊。。。数理差对综合性大学真心是硬伤。所以个人认为未来10年我校应该把主要经历放在这两块上…这点最该学习USTC，所以期待窦校长……至于个人，本人的主要体会是 做事尽量靠谱点，不要给我武丢人就好", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "春日", "answer_id": 144586762, "answer_text": "武大啊太自由了自由的第一天上学我以为自己已经在这里住了好多年了", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 139542509, "answer_text": "我是华科的，北方同学说每次回家的时候，亲戚问在哪个学校读书，一般懒得跟他解释华科是什么、好不好吃，直接说“我在武大上大学”。。。", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "TF不是TFboys", "answer_id": 138707911, "answer_text": "不怎么样………个人看法～在国内来说，清北是一流，华五+人大+国科大是二流，武大算是三流大学吧…可能在三流里稍微排名靠前一点…在北美来看，北清科一流，华五剩下的是二流，武大继续算是三流…最近几年把武大排前五的排名好像都是来自中国校友网。校庆+李晓红校长的积极推动+各位八九十年代杰出校友对母校的捐助，这应该是武大在中国校友网的排名中靠前的一个原因吧。希望各位校友看到武大排前五的新闻都能一笑而过，然后把这个当作目标然后一起为之努力吧～", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 71293126, "answer_text": "比武汉知名度高。", "answer_votes": "2", "answer_comment": "​1 条评论"}
{"answer_author": "单韦", "answer_id": 27685684, "answer_text": "最近和某老师聊天，当然某老师和校领导关系密切，得知，未来武大将逐步减招本科生扩招研究生，我就对武大的教学未来感到十分堪忧了，现在武大只是研究生一年就招8000人，已经超过本科生人数了，清华一年招的硕士加博士不过四千多，所以啊，只能呵呵呵", "answer_votes": "4", "answer_comment": "​15 条评论"}
{"answer_author": "贾逸君", "answer_id": 140203257, "answer_text": "武大？我是武测的", "answer_votes": "2", "answer_comment": "​4 条评论"}
{"answer_author": "南望山野人", "answer_id": 103588510, "answer_text": "我今年参加武大的夏令营，那个给我们培训的老师是中山大学毕业的，他给我们说了一句话：自古以来在南方武大第一，中大第二，也欢迎各位同学报考中大。", "answer_votes": "2", "answer_comment": "​11 条评论"}
{"answer_author": "匿名用户", "answer_id": 25541664, "answer_text": "现在桂圆的路修好啦～这学期发现一件事，中科院各研究所都非常希望招到我们院的人去，这也算影响力的一种吧------------------------------------不是问影响力么…首先说，我是武大某理科弘毅班的大一学生，以下的答案可能会有失偏颇学术上来说，我们院的教授们确实个个都在自己研究方向有所成就的。每个月的讲座也很多，有很多接触到大牛的机会。我想这个影响力应该能排全国前十。但作为学生我对武大不是很满意，所谓自由呢，确实是矛盾的自由。至少我们专业的排课一点都不自由，有一种还在读高中的感觉，领导们觉得我们应该学什么就学什么，而且时间也很不灵活。我们都在按部就班地走院里规划的路线，而在这条路上，老师觉得数学，统计，物理，对我们这个学科来说不是特别重要……至于意识形态，确实是………哎呀不多说还有就是…为什么不能把排水系统整修一下，桂园老宿舍的路给填平…一下雨就成海这真的不太好。", "answer_votes": "1", "answer_comment": "​11 条评论"}
{"answer_author": "空雨落阳", "answer_id": 115521615, "answer_text": "我2016届，通知书到了过了一周我去复印交学校，门口有个阿姨年50开复印店，此为背景“复印正反1块袄，怎么才到”“来晚了”“什么大学”“武大，武汉大学”“都几号了，二本吗”“武汉大学”“一本还是二本”“一本”说完也复印完了，交完钱老子就他妈走了，nmd&lt;img src=\"https://pic2.zhimg.com/50/1df581765d9e15911b07ffe152cffe01_hd.jpg\" data-rawwidth=\"1280\" data-rawheight=\"2276\" class=\"origin_image zh-lightbox-thumb\" width=\"1280\" data-original=\"https://pic2.zhimg.com/1df581765d9e15911b07ffe152cffe01_r.jpg\"&gt;", "answer_votes": "1", "answer_comment": "​2 条评论"}
{"answer_author": "知乎用户", "answer_id": 43420349, "answer_text": "我们老师讲，北有北大，南有武大。隔壁说，中国只有三所大学，清华，他科，其他大学。", "answer_votes": "5", "answer_comment": "​7 条评论"}
