{"question_id": "23259302", "question_text": "本题已加入知乎圆桌 »「机器学习 · 学以致用」，更多「机器学习」相关话题讨论欢迎关注。我之前面试一些公司的机器学习或者数据挖掘工程师的职位。感觉自己准备的不够充分。想了解下一般会问哪些问题，考察哪些方面的东西。相关问题：如果你是面试官，你怎么去判断一个面试者的深度学习水平？ - 知乎 ", "question_title": "如何准备机器学习工程师的面试 ？", "question_commet": "​4 条评论", "answer_number": "44 个回答", "question_followers": "9,297", "brower_number": "524,615"}
{"answer_author": "周开拓", "answer_id": 24857674, "answer_text": "机器学习方面的面试主要分成三个部分：\n1. 算法和理论基础\n2. 工程实现能力与编码水平\n3. 业务理解和思考深度 \n1. 理论方面，我推荐最经典的一本书《统计学习方法》，这书可能不是最全的，但是讲得最精髓，薄薄一本，适合面试前突击准备。\n\n我认为一些要点是：\n统计学习的核心步骤：模型、策略、算法，你应当对logistic、SVM、决策树、KNN及各种聚类方法有深刻的理解。能够随手写出这些算法的核心递归步的伪代码以及他们优化的函数表达式和对偶问题形式。\n\n非统计学习我不太懂，做过复杂网络，但是这个比较深，面试可能很难考到。\n\n数学知识方面，你应当深刻理解矩阵的各种变换，尤其是特征值相关的知识。\n\n算法方面：你应当深刻理解常用的优化方法：梯度下降、牛顿法、各种随机搜索算法（基因、蚁群等等），深刻理解的意思是你要知道梯度下降是用平面来逼近局部，牛顿法是用曲面逼近局部等等。 \n2. 工程实现能力与编码水平\n机器学习从工程实现一般来讲都是某种数据结构上的搜索问题。\n\n你应当深刻理解在1中列出的各种算法对应应该采用的数据结构和对应的搜索方法。比如KNN对应的KD树、如何给图结构设计数据结构？如何将算法map-red化等等。\n\n一般来说要么你会写C，而且会用MPI，要么你懂Hadoop，工程上基本都是在这两个平台实现。实在不济你也学个python吧。 \n3. 非常令人失望地告诉你尽管机器学习主要会考察1和2\n但是实际工作中，算法的先进性对真正业务结果的影响，大概不到30%。当然算法必须要足够快，离线算法最好能在4小时内完成，实时算法我没搞过，要求大概更高。\n\n机器学习大多数场景是搜索、广告、垃圾过滤、安全、推荐系统等等。对业务有深刻的理解对你做出来的系统的结果影响超过70%。这里你没做过实际的项目，是完全不可能有任何体会的，我做过一个推荐系统，没有什么算法上的高大上的改进，主要是业务逻辑的创新，直接就提高了很明显的一个CTR（具体数目不太方便透露，总之很明显就是了）。如果你做过实际的项目，一定要主动说出来，主动让面试官知道，这才是最大最大的加分项目。\n\n最后举个例子，阿里内部机器学习挑战赛，无数碾压答主10000倍的大神参赛。最后冠军没有用任何高大上的算法而是基于对数据和业务的深刻理解和极其细致的特征调优利用非常基本的一个算法夺冠。所以啥都不如真正的实操撸几个生产项目啊。", "answer_votes": "921", "answer_comment": "​50 条评论"}
{"answer_author": "晓宇我喜欢你", "answer_id": 24300412, "answer_text": "我面试过5-6家互联网公司的数据挖掘和分析、机器学习相关职位的工程师。被问到下面一些问题。SVM的原理，SVM里面的核K-means，如何用hadoop实现k-meansnaive bayes和logistic regression的区别LDA的原理和推导做广告点击率预测，用哪些数据什么算法推荐系统的算法中最近邻和矩阵分解各自适用场景用户流失率预测怎么做（游戏公司的数据挖掘都喜欢问这个）一个游戏的设计过程中该收集什么数据如何从登陆日志中挖掘尽可能多的信息这些问题我回答的情况，分几种。一种是在面试官的提示下，算是勉强完成了答案。一种是在面试官的提示下，答了一点但是答得不够好。一种是面试官不提示也没有反馈，我回答了但是我不知道回答得怎样。我非常后悔的一点是我现在才想起来总结。有一个题是游戏玩家流失率预测，我被问过两次。但是每次我都说是个分类问题。最近我突然想起来去网上查了下，有两个点，数据不平衡问题和时间序列分析。我网上查到是一个大学教授和人人游戏合作的课题。我然后查了下这个老师的publication。没发现相关的论文。可能公司不让发表吧。这些问题的特点是很基础很简单，因为实际中很少用复杂的算法，复杂的算法不好控制，而且理论要求高。另一个特点是注重考查实际工程能力，我经常被问到自己实现了哪些算法。还有的问题很契合实际。我觉得如果现在再给我准备的机会。我会准备下面几点。首先是计算机基础知识和算法，这些都是会正常考察的。有些公司考的少，有些公司正常考察。针对机器学习这部分，需要理论扎实，还需要自己动手实现代码。另外hadoop，mpi，最近比较火的spark，应该都是加分项。另一个是接触下实际的数据分析系统。我在学校里面看的论文，都是讲算法的多，讲应用系统的少。这个可以靠之前的实习，也可以看些比较实用的论文。PS 我是题主，自问自答下。PS2 我面试的都是国内互联网公司和游戏公司。", "answer_votes": "410", "answer_comment": "​40 条评论"}
{"answer_author": "牛客网", "answer_id": 219153454, "answer_text": "最好的办法就是看看别人是怎么准备的，通过别人的面经来反思自己如何准备。针对应届生校招面试 “机器学习” 相关岗位的情况，牛妹为大家整理了一批面经，供参考：2018届校招面经精选1、菜鸟图像图形算法 内推 一面2、机器学习算法面经3、百度面试一面4、京东云算法工程师一面分享5、京东算法工程师一面面经6、京东云机器学习面试分享7、京东 AI 与大数据部面经8、华为优招面试机器学习面经9、大量面经总结(包括牛客网的和我听来的)10、华为814留学生专场，研发类（大数据，技术研究）11、拼多多+猫眼+京东云+猎豹移动机器学习面试分享12、美团猫眼电影机器学习工程师一面题目分享13、360中科院专场--大数据中心数据开发工程师面经14、唯品会电面--算法工程师15、远景能源面经（电面）大数据岗2017届校招面经精选1、数据方向学渣的春招总结2、腾讯【基础研究面经】，4-27才接到电话拿到offer3、2017腾讯基础研究实习生面经，已拿到offer4、头条大数据一面5、网易邮箱数据挖掘，滴滴数据工程师，均跪的面经6、百度实习面试（三面，搜索rank）7、阿里机器学习四轮面试反馈一波8、机器学习实习面经分享（蚂蚁金服，微信，美国亚马逊，完美）9、菜鸟网络一面面经 数据挖掘岗10、百度面经：谨以此纪念五挂百度_笔经面经_牛客网11、百度机器学习岗位123面面经_笔经面经_牛客网 12、南京美团面试--机器学习岗_笔经面经_牛客网 13、百度一面面经_笔经面经_牛客网 14、新鲜的美团面经，机器学习岗_笔经面经_牛客网 15、招银科技电话一面面经_笔经面经_牛客网 16、百度 北京 机器学习/数据挖掘 提前批 17、关于面试一点感触_笔经面经_牛客网 18、好未来三面面试经验-数据挖掘岗-武汉现场面_笔经面经_牛客网 19、内推京东金融算法工程师_笔经面经_牛客网 20、滴滴腾讯算法岗面经分享_笔经面经_牛客网 21、阿里、百度、腾讯、华为面经（均已拿到offer）_笔经面经_牛客网 22、数据挖掘/数据研发面经分享_笔经面经_牛客网 23、2016年面试总结（c++，机器学习），希望给同学们一点帮助_笔经面经_牛客网 24、非CS专业小硕的机器学习/数据挖掘岗位秋招经验_笔经面经_牛客网 25、美团机器学习一轮失败经验_笔经面经_牛客网 26、百度机器学习数据挖掘_笔经面经_牛客网 27、非CS专业小硕的机器学习/数据挖掘岗位秋招经验_笔经面经_牛客网 28、美团面经（面的晚...发的晚）_笔经面经_牛客网29、百度机器学习数据挖掘_笔经面经_牛客网 30、【数据挖掘面经】腾讯+百度+华为（均拿到sp offer）以上", "answer_votes": "389", "answer_comment": "​15 条评论"}
{"answer_author": "李庆斌", "answer_id": 121283012, "answer_text": "可以参考我的这篇文章《机器学习面试的那些事儿》，有时间再补充点其他的内容。假设我们做过一个垃圾邮件分类器的项目。为了建立这个分类器，我们首先对数据进行清理及预处理，如缺失数据的处理、数据的归一化等。在获得初始特征向量后，用PCA进行了特征选择。利用特征选择得到的特征向量及对应数据，训练一个随机森林的分类器作为我们的垃圾邮件分类器。针对的这样一个项目，有这样几个点可以进行挖掘和准备。1. 项目简介如何向面试官介绍你做过的项目，这是一个非常基础、非常常见但是又充满技巧的问题。首先，项目简介不应过于冗长，力争用最短的几句话勾勒出项目的框架。其次，数据科学相关项目通常是业务与技术并存，因此，既要突出项目过程中解决的技术难题及应用的相关技术，又应该兼顾项目带来的业务上的影响。2. 模型简介这类问题同样是机器学习面试中最普遍最常见的一类问题，面试的形式一般为介绍一个你最喜欢的模型，或是介绍项目中应用的某种模型。与项目简介相同，模型简介也应力求简洁，用最简短的几句话，讲清楚模型是用了什么样的原理完成了怎样的目标。wikipedia中关于随机森林的定义给我们提供了一个非常好的学习模板，可以用来借鉴：Random forests is a notion of the general technique of random decision forests that are an ensemble learning method(怎样的方法) for classification, regression and other tasks(解决了什么问题), that operate by constructing a multitude of decision trees at training time and outputting the class that is the mode of the classes (classification) or mean prediction (regression) of the individual trees(基本原理).但是，wikipedia中大部分模型的描述更偏书面化的表达，并不适合原封不动地照搬到面试中。我们需要将它转化为更口语化的表达。3. 模型的优缺点模型的优缺点与模型简介是紧密相关的，可以将两个问题结合起来一起准备。比如之前我们谈到了什么是随机森林，紧接着可以谈一下随机森林有什么优点，如：a. 对于很多数据集表现良好，精确度比较高；b. 不容易过拟合；c. 可以得到变量的重要性排序；d. 既能处理离散型数据，也能处理连续型数据，且不需要进行归一化处理； e. 能够很好的处理缺失数据；f. 容易并行化等等。同时，将理论与实践结合也是非常好的切入点，如随机森林的诸多优点是如何体现在垃圾邮件分类器项目中，这样的结合能更好的展示出面试人对于模型的理解及掌控。4. 模型原理及相关技术细节模型简介与模型优缺点的问题属于概念性问题，偏向于考察面试人是否了解某种模型，而更进一步的则是对于模型原理及相关技术细节的考察，比如模型假设、目标函数、优化过程、算法收敛性等。所谓知其然，又知其所以然，这是对于面试人的进一步要求。例如，在模型的优缺点中，我们提到了随机森林可以对变量重要性进行排序。相应地，我们应该能够解释随机森林是如何对变量重要性进行排序，有哪几种常见的排序指标，比如利用OOB误分率的改变或者分裂时信息增益的变化等。当然，问题并非到此终止，基于上面提到的两种常见的变量重要性排序指标，又可以衍生出新的问题。例如，针对OOB误分率这个指标，解释一下什么是OOB，随机森林中OOB是如何计算的，它有什么样的优缺点；针对信息增益，同样会有很多与之有关的问题，如什么是信息增益，如何计算信息增益，什么是熵，什么是GINI指数，他们之间的区别是什么，他们之间的区别会对建树产生怎样的影响等。再如，在垃圾邮件分类器项目中，有一部分数据存在缺失，而随机森林具有处理缺失数据的优点，建模的过程中我们充分利用了这一特性。那么，与之相关的问题可能会是，随机森林为什么会有这个优点？随机森林是怎样对缺失数据进行训练及预测？5. 模型的横向比较模型原理及相关技术细节的考察属于对机器学习知识深度考察的范畴，与之对应的是机器学习知识广度方面的考察。广度上的考察主要有两大部分，一方面是从理论上对不同算法进行横向比较，如模型假设，优化方法等。另一方面，是结合实际案例对不同算法进行横向比较，这要求面试人不仅仅要熟知不同模型的原理及技术细节，更需要将抽象的理论与具体的实践结合，在实际案例中对算法进行比较。在垃圾邮件分类器项目中，随机森林被用作最终的分类器模型。面试官可能会就此提出以下问题：为什么选择随机森林而非其他模型，比如朴素贝叶斯或者支持向量机。一般来说，面试者可以从数学理论和工程实现两个方面进行比较回答。从理论上讲，数据表现出来的特征，以及模型所基于的假设都是很好的突破口;从工程实现上讲，实现的难易程度，是否易于scale都是可以考虑的点。6. 开放性问题除了对机器学习知识深度和广度上的考察，开放性问题也是面试中经常会遇到的问题，对于初学者来说这也是最难准备的一类问题。一方面这类问题很难在教科书中见到，没有固定的问题清单；另一方面，这类问题没有标准答案，很多时候是对过往经验的总结。针对这一类问题，更多的是靠平时工作学习过程中多思考、多总结、多积累，临阵抱佛脚很难起到效果。再次回到垃圾邮件分类器项目，这个项目中有多个开放性问题可以被提问。比如，1. 邮件数据存在缺失，通常情况下，如何对缺失数据进行处理？2. 垃圾邮件分类是一个非平衡数据集分类的问题，针对这一类问题，我们应该如何进行建模。3. 项目中，PCA被用于特征选择，除此而外，还有哪些方法可以用来进行特征选择？7. 准备材料在准备机器学习的过程中，我主要用了如下的材料：A. Stanford CS229 Machine Learning. B. CMU 10-701 Introduction to Machine Learning. C. The Elements of Statistical Learning. By Trevor Hastie, Robert Tibshirani and Jerome Friedman.D. Pattern Recognition and Machine Learning. By Christopher Bishop.A.和B.是Stanford和CMU机器学习课程的课件，里面涵盖了各种常用算法，应该力求掌握这些算法。C.和D.是经典中的经典，难度适中，内容没有太理论，语言也没有太晦涩，是机器学习内功修炼的不二法门。关于材料再说句题外话，我之前是个资料收集整理爱好者，总是在努力充实自己的资料库，总是担心遗漏任何有用的材料。但是后来才逐渐意识到，资料求精不求多，存在脑子里面的叫知识，存在硬盘里叫文档。", "answer_votes": "212", "answer_comment": "​12 条评论"}
{"answer_author": "王养浩", "answer_id": 24294685, "answer_text": "抛砖引玉，在读硕士，半个月前去面了某公司机器学习intern铩羽而归了。机器学习部分一个面试官问了我一个小时，我估计如果真正能上的人光机器学习部分应该还会多来几轮。首先介绍自己的研究经历。会随机问一些细节。我面的推荐，问了各类协同过滤的好与坏。然后我说我做过LDA，问我，Dirichlet Distribution的定义和性质，并问我，为什么它和multinomial distribution是共轭的，顺便问了我啥叫共轭分布。问了一个很有意思的问题，现实应用中的Top-N推荐问题和学术研究中的评分预测问题之间有什么不同。问我ItemCF的工程实现，面对大数据如何实现，又追问了有没有什么工程优化算法。这个问题我没答好，一开始我说了一个MapReduce模型，他问能不能更快一点，我就卡那了。。。最后面试官告诉我，不能只从算法角度分析，要从系统设计分析，利用内存来减小MapReduce的吞吐量。（当然也许从MapReduce那一刻开始我就输了也不一定）最后考了我一个基本概念，什么叫判别模型什么叫生成模型。回忆以前有一个去百度做广告业务的师兄分享的面试经历，记得没问什么高深算法，马尔科夫系列？现在工业界的机器学习业务也不会太多，公司不是学术界在学术研究灌水上有多少追求，算法可实现，能可扩展高效分布式运行才是重点。所以个人认为，机器学习工程师的核心还是在于工程师的能力，实际应用的问题分析能力和算法的实现能力很重要。机器学习的算法并不是重点。PS1，各种研究院（微软雅虎IBM之类）的正式员工另当别论。PS2，我只面过一个公司，和打听过一些情况，和听过一些算法工程师的技术分享去推断它们的工作状态和需求，一面之词，抛砖引玉。PS3，国内PS4，题主也请分享面试经历。", "answer_votes": "70", "answer_comment": "​19 条评论"}
{"answer_author": "Naiyan Wang", "answer_id": 48222586, "answer_text": "看了一下各位回答，我要去面试妥妥跪了。。。借用一下@Filestorm当年的一句话，原话记不得，大概意思是熟练工一天做完的，我们可能需要三天。但是我们一年做完的，熟练工永远做不完。以上各位答主都是在招熟练工吧。。。", "answer_votes": "128", "answer_comment": "​73 条评论"}
{"answer_author": "冯沁原", "answer_id": 101657527, "answer_text": "录制过一些解读的视频，分享一下。完整版在这里：http://www.bittiger.io/blog/post/r7s58dHkzLjCm7agm数据科学（数据分析＋机器学习）入门如何入门机器学习数据科学家在公司做什么机器学习的分类该不该转型机器学习应用广告搜索搜索广告内部原理精华版搜索广告内部原理完整版深度学习大规模深度学习的应用深度学习与无人车／机器人Google在机器学习的探索推荐系统如何做好推荐系统AppStore之推荐系统（一）／（二）Airbnb大数据预测Airbnb机器学习实战Airbnb大数据预测（一）／（二）／（三）／（四）／（五）／（六）图像问答实战深度学习之图像问答用户分析实战R语言用户分析", "answer_votes": "148", "answer_comment": "​1 条评论"}
{"answer_author": "知乎用户", "answer_id": 256743256, "answer_text": "面过七家公司的机器学习工程师岗位，包括诸如BAT这样的大公司，头条这样的成熟创业公司，商汤这样的初创期创业公司。机器学习工程师岗位面试主要看机器学习掌握得如何，自己做的相关项目，以及coding能力。机器学习大概问过lr，svm，pr曲线，朴素贝叶斯的assumption，ensemble方法，决策树节点用哪个特征进行划分，gbdt原理，random forest原理，pca和lda降维原理，写k means和gmm公式，特征选择的方法有哪些，cnn与rnn的区别，你所知道的距离度量方式，你所知道的loss function，蓄水池抽样。具体可以看看https://zhuanlan.zhihu.com/p/30420494。过了简历说明你做的项目跟面试官所在团队做的东西相似度比较高，所以面试官一般会比较懂你做的项目。在问的时候，面试官会问你一些他觉得该项目的难点，以及你是如何解决的，比如样本不平衡问题，负样本如何挑选等问题。面试前一定要好好过一下自己做的项目，想一想你是面试官你会问自己什么问题。最后就是基础的coding能力。背包问题，lcs，lis，编辑距离，最长回文子串等dp问题；链表反转，递归和非递归解法，判断是否有环等链表问题；树的前序，中序，后序遍历，判断镜像，判断是否是完全二叉树或者满二叉树，求树的深度，lca等树的问题；快排，堆排序，归并排序，最大k个数，时间复杂度等排序问题；实现atoi等等。具体可以看看这个总结https://zhuanlan.zhihu.com/p/29731623。", "answer_votes": "83", "answer_comment": "​4 条评论"}
{"answer_author": "xiao ma", "answer_id": 28827862, "answer_text": "数据结构算法水题+常用机器学习算法推导+模型调优细节+业务认识", "answer_votes": "34", "answer_comment": "​2 条评论"}
{"answer_author": "陈恩加", "answer_id": 256560298, "answer_text": "趁着写这个答案的同时也顺带梳理一下平时收藏的一些面试题（不过这些题目比较偏向Data Scientist，问题和答案是分快写的，所有题目均有比较可信的出处，回答内容不定期更新。）：一  来ANALYTICS VIDHYA：40 Interview Questions asked at Startups in Machine Learning / Data Science （这些问题并没有要求你写出具体的推导公式，主要考察的是机器学习如何具体应用。挑了几个比较有意思的贴出来）<img src=\"https://pic4.zhimg.com/50/v2-7b9366a5e877695da168d723bce6c803_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"600\" data-rawheight=\"400\" class=\"origin_image zh-lightbox-thumb\" width=\"600\" data-original=\"https://pic4.zhimg.com/v2-7b9366a5e877695da168d723bce6c803_r.jpg\">以下是Question模块：Q1 关于在有限内存情况下如何对数据进行降维（这个问题挺有意思的，而且文章给的答案很详细，答案中也给出了所提到方法的更为详细的解释的链接，赞一个！）You are given a train data set having 1000 columns and 1 million rows. The data set is based on a classification problem. Your manager has asked you to reduce the dimension of this data so that model computation time can be reduced. Your machine has memory constraints. What would you do? (You are free to make practical assumptions.)Q2 你在一个用于cancer detection的数据集上使用的分类模型达到了96%的精度，但“你不是真正的快乐”，为啥？该怎么做？（关于性能度量的基础题）You are given a data set on cancer detection. You’ve build a classification model and achieved an accuracy of 96%. Why shouldn’t you be happy with your model performance? What can you do about it?Q3 如何处理回归模型中的多重共线性问题After analyzing the model, your manager has informed that your regression model is suffering from multicollinearity. How would you check if he’s true? Without losing any information, can you still build a better model?Q4 如何选择重要特征While working on a data set, how do you select important variables? Explain your methods.Q5 在时间序列数据集中，应该使用何种交叉验证方法？What cross validation technique would you use on time series data set? Is it k-fold or LOOCV?以下是Answer模块A1 （重点加粗，下同）Processing a high dimensional data on a limited memory machine is a strenuous task, your interviewer would be fully aware of that. Following are the methods you can use to tackle such situation:1.Since we have lower RAM, we should close all other applications in our machine, including the web browser, so that most of the memory can be put to use.2.We can randomly sample the data set. This means, we can create a smaller data set, let’s say, having 1000 variables and 300000 rows and do the computations.3.To reduce dimensionality, we can separate the numerical and categorical variables and remove the correlated variables. For numerical variables, we’ll use correlation. For categorical variables, we’ll use chi-square test.4.Also, we can use PCA and pick the components which can explain the maximum variance in the data set.5.Using online learning algorithms like Vowpal Wabbit (available in Python) is a possible option.6.Building a linear model using Stochastic Gradient Descent is also helpful.7.We can also apply our business understanding to estimate which all predictors can impact the response variable. But, this is an intuitive approach, failing to identify useful predictors might result in significant loss of information.Note: For point 4 & 5, make sure you read about online learning algorithms & Stochastic Gradient Descent. These are advanced methods.A2 If you have worked on enough data sets, you should deduce that cancer detection results in imbalanced data. In an imbalanced data set, accuracy should not be used as a measure of performance because 96% (as given) might only be predicting majority class correctly, but our class of interest is minority class (4%) which is the people who actually got diagnosed with cancer. Hence, in order to evaluate model performance, we should use Sensitivity (True Positive Rate), Specificity (True Negative Rate), F measure to determine class wise performance of the classifier. If the minority class performance is found to to be poor, we can undertake the following steps:1. We can use undersampling, oversampling or SMOTE to make the data balanced.（注：我原先不知道SMOTE这个技术，中文名叫“合成少数类过采样技术”，意思就是对少数类样本进行分析并根据少数类样本人工合成新样本添加到数据集中）2. We can alter the prediction threshold value by doing probability caliberation and finding a optimal threshold using AUC-ROC curve.3. We can assign weight to classes such that the minority classes gets larger weight.4. We can also use anomaly detection.Know more: Imbalanced ClassificationA3To check multicollinearity, we can create a correlation matrix to identify & remove variables having correlation above 75% (deciding a threshold is subjective). In addition, we can use calculate VIF (variance inflation factor) to check the presence of multicollinearity. VIF value <= 4 suggests no multicollinearity whereas a value of >= 10 implies serious multicollinearity. Also, we can use tolerance as an indicator of multicollinearity.But, removing correlated variables might lead to loss of information. In order to retain those variables, we can use penalized regression models like ridge or lasso regression. Also, we can add some random noise in correlated variable so that the variables become different from each other. But, adding noise might affect the prediction accuracy, hence this approach should be carefully used.Know more: Regression（注：关于多重共线性问题还可以参考这篇博文--->对于多重共线性的简单理解）A41. Remove the correlated variables prior to selecting important variables  2. Use linear regression and select variables based on p values  3. Use Forward Selection, Backward Selection, Stepwise Selection  4. Use Random Forest, Xgboost and plot variable importance chart  5. Use Lasso Regression  6. Measure information gain for the available set of features and select top n features accordingly.A5 Neither.In time series problem, k fold can be troublesome because there might be some pattern in year 4 or 5 which is not in year 3. Resampling the data set will separate these trends, and we might end up validation on past years, which is incorrect. Instead, we can use forward chaining strategy with 5 fold as shown below:fold 1 : training [1], test [2]fold 2 : training [1 2], test [3]fold 3 : training [1 2 3], test [4]fold 4 : training [1 2 3 4], test [5]fold 5 : training [1 2 3 4 5], test [6]where 1,2,3,4,5,6 represents “year”.二 来自Quora“20 questions to detect a fake data scientist”：1 What is the life cycle of a data science project?2 How do you measure yield (over base line) resulting from a new or refined algorithm or architecture?3 What is cross-validation? How to do it right?4 Is it better to design robust or accurate algorithms?5 Have you written production code? Prototyped an algorithm? Created a proof of concept?6 What is the biggest data set you have worked with, in terms of training set size, and in terms of having your algorithm implemented in production mode to process billions of transactions per day / month / year?7 Name a few famous API's (for instance Google search). How would you create one?8 How to efficiently scrape web data, or collect tons of tweets?9 How to optimize algorithms (parallel processing and/or faster algorithm: provide examples for both)10 Examples of NoSQL architecture?11 How do you clean data?12 How do you define / select metrics? Have you designed and used compound metrics?13 Examples of bad and good visualizations?14 Have you been involved - as an adviser or architect - in the design of dashboard or alarm systems?15 How frequently an algorithm must be updated? What about lookup tables in real-time systems?16 Provide examples of machine-to-machine communication.17 Provide examples where you automated a repetitive analytical task.18 How do you assess the statistical significance of an insight?19 How to turn unstructured data into structured data?20 How to very efficiently cluster 100 billion web pages, for instance with a tagging or indexing algorithm? （最后补充的一个问题，比较开放性） If you were interviewing a data scientist, what questions would you ask her?三 来自ANALYTICS VIDHYA（专门针对Regression的45个问题）：45 questions to test a Data Scientist on Regression (Skill test - Regression Solution)四 来自Data Science Central（100+ Common Data Science Interview Questions）：100+ Common Data Science Interview Questions它包含了以下六个模块的题，覆盖面还是非常广的：1. Statistics2. Programming：General，Big Data，Python，R，SQL3. Modeling4. Behavioral5. Culture Fit 6. Problem-Solving五 来自ANALYTICS VIDHYA：30个关于NLP的笔试题（题目还是不像最后那个一样贴出来了否则这个回答真的太长了你们会不耐烦的，给个介绍）30 Questions to test a data scientist on Natural Language Processing [Solution: Skilltest – NLP]IntroductionHumans are social animals and language is our primary tool to communicate with the society. But, what if machines could understand our language and then act accordingly? Natural Language Processing (NLP) is the science of teaching machines how to understand the language we humans speak and write.We recently launched an NLP skill test on which a total of 817 people registered. This skill test was designed to test your knowledge of Natural Language Processing. If you are one of those who missed out on this skill test, here are the questions and solutions.Here are the leaderboard ranking for all the participants.这是参加这个笔试的participants的得分，做完可以对比下<img src=\"https://pic1.zhimg.com/50/v2-e414cb73246de281fb759bf88cfe4ef3_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"498\" data-rawheight=\"261\" class=\"origin_image zh-lightbox-thumb\" width=\"498\" data-original=\"https://pic1.zhimg.com/v2-e414cb73246de281fb759bf88cfe4ef3_r.jpg\">六 来自ANALYTICS VIDHYA（45个关于Tree Based算法的题目，包括决策树，随机森林和XGBoost）：45 questions to test Data Scientists on Tree Based Algorithms (Decision tree, Random Forests, XGBoost)七 来自ANALYTICS VIDHYA（25个与图像处理有关的题目，非深度学习导向）：https://www.analyticsvidhya.com/blog/2017/10/image-skilltest/IntroductionExtracting useful information from unstructured data has always been a topic of huge interest in the research community. One such example of unstructured data is an image, and analysis of image data has applications in various aspects of business.This skilltest is specially designed for you to test your knowledge on the knowledge on how to handle image data, with an emphasis on image processing. More than 300 people registered for the test. If you are one of those who missed out on this skill test, here are the questions and solutions.八 最后是来自ANALYTICS VIDHYA（这里的40题应该算是机器学习笔试题，不过也很值得一读）：40 Questions to test a data scientist on Machine Learning [Solution: SkillPower – Machine Learning, DataFest 2017]（先写到这儿了，有空再补充。如果这些题目对你有启发，希望点个赞~）1) Which of the following statement is true in following case?A) Feature F1 is an example of nominal variable.B) Feature F1 is an example of ordinal variable.C) It doesn’t belong to any of the above category.D) Both of theseSolution: (B)Ordinal variables are the variables which has some order in their categories. For example, grade A should be consider as high grade than grade B.2) Which of the following is an example of a deterministic algorithm?A) PCAB) K-MeansC) None of the aboveSolution: (A)A deterministic algorithm is that in which output does not change on different runs. PCA would give the same result if we run again, but not k-means.3) [True or False] A Pearson correlation between two variables is zero but, still their values can still be related to each other.A) TRUEB) FALSESolution: (A)Y=X2. Note that, they are not only associated, but one is a function of the other and Pearson correlation between them is 0.4) Which of the following statement(s) is / are true for Gradient Decent (GD) and Stochastic Gradient Decent (SGD)?In GD and SGD, you update a set of parameters in an iterative manner to minimize the error function. In SGD, you have to run through all the samples in your training set for a single update of a parameter in each iteration. In GD, you either use the entire data or a subset of training data to update a parameter in each iteration. A) Only 1B) Only 2C) Only 3D) 1 and 2E) 2 and 3F) 1,2 and 3Solution: (A)In SGD for each iteration you choose the batch which is generally contain the random sample of data But in case of GD each iteration contain the all of the training observations.5) Which of the following hyper parameter(s), when increased may cause random forest to over fit the data? Number of TreesDepth of TreeLearning RateA) Only 1B) Only 2C) Only 3D) 1 and 2E) 2 and 3F) 1,2 and 3Solution: (B)Usually, if we increase the depth of tree it will cause overfitting. Learning rate is not an hyperparameter in random forest. Increase in the number of tree will cause under fitting.6) Imagine, you are working with “Analytics Vidhya” and you want to develop a machine learning algorithm which predicts the number of views on the articles. Your analysis is based on features like author name, number of articles written by the same author on Analytics Vidhya in past and a few other features. Which of the following evaluation metric would you choose in that case?Mean Square ErrorAccuracyF1 ScoreA) Only 1B) Only 2C) Only 3D) 1 and 3E) 2 and 3F) 1 and 2Solution:(A)You can think that the number of views of articles is the continuous target variable which fall under the regression problem. So, mean squared error will be used as an evaluation metrics.7) Given below are three images (1,2,3). Which of the following option is correct for these images?A)<img src=\"https://pic2.zhimg.com/50/v2-fa7fcf1d09d9b01d0b3942fd982ce621_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"486\" data-rawheight=\"303\" class=\"origin_image zh-lightbox-thumb\" width=\"486\" data-original=\"https://pic2.zhimg.com/v2-fa7fcf1d09d9b01d0b3942fd982ce621_r.jpg\">B)<img src=\"https://pic3.zhimg.com/50/v2-c9a53371d5aa98052c11685ddeb27077_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"571\" data-rawheight=\"339\" class=\"origin_image zh-lightbox-thumb\" width=\"571\" data-original=\"https://pic3.zhimg.com/v2-c9a53371d5aa98052c11685ddeb27077_r.jpg\">C) <img src=\"https://pic1.zhimg.com/50/v2-9a5d4d8416b68f36e32ed8724a7f9c4c_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"391\" data-rawheight=\"300\" class=\"content_image\" width=\"391\">A) 1 is tanh, 2 is ReLU and 3 is SIGMOID activation functions.B) 1 is SIGMOID, 2 is ReLU and 3 is tanh activation functions.C) 1 is ReLU, 2 is tanh and 3 is SIGMOID activation functions.D) 1 is tanh, 2 is SIGMOID and 3 is ReLU activation functions.Solution: (D)The range of SIGMOID function is [0,1].The range of the tanh function is [-1,1].The range of the RELU function is [0, infinity].So Option D is the right answer.8) Below are the 8 actual values of target variable in the train file.[0,0,0,1,1,1,1,1]What is the entropy of the target variable? A) -(5/8 log(5/8) + 3/8 log(3/8))B) 5/8 log(5/8) + 3/8 log(3/8)C) 3/8 log(5/8) + 5/8 log(3/8)D) 5/8 log(3/8) – 3/8 log(5/8)Solution: (A)The formula for entropy is  <img src=\"https://pic3.zhimg.com/50/v2-0bdaba534822d3bc9e1f72d8bd1463ca_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"141\" data-rawheight=\"33\" class=\"content_image\" width=\"141\">So the answer is A.9) Let’s say, you are working with categorical feature(s) and you have not looked at the distribution of the categorical variable in the test data.You want to apply one hot encoding (OHE) on the categorical feature(s). What challenges you may face if you have applied OHE on a categorical variable of train dataset? A) All categories of categorical variable are not present in the test dataset.B) Frequency distribution of categories is different in train as compared to the test dataset.C) Train and Test always have same distribution.D) Both A and BE) None of theseSolution: (D)Both are true, The OHE will fail to encode the categories which is present in test but not in train so it could be one of the main challenges while applying OHE. The challenge given in option B is also true you need to more careful while applying OHE if frequency distribution doesn’t same in train and test.10) Skip gram model is one of the best models used in Word2vec algorithm for words embedding. Which one of the following models depict the skip gram model?<img src=\"https://pic3.zhimg.com/50/v2-f9f22d2edc0b4aca13a4c014eab9a622_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"550\" data-rawheight=\"340\" class=\"origin_image zh-lightbox-thumb\" width=\"550\" data-original=\"https://pic3.zhimg.com/v2-f9f22d2edc0b4aca13a4c014eab9a622_r.jpg\">A) AB) BC) Both A and BD) None of theseSolution: (B)Both models (model1 and model2) are used in Word2vec algorithm. The model1 represent a CBOW model where as Model2 represent the Skip gram model.11) Let’s say, you are using activation function X in hidden layers of neural network. At a particular neuron for any given input, you get the output as “-0.0001”. Which of the following activation function could X represent? A) ReLUB) tanhC) SIGMOIDD) None of theseSolution: (B)The function is a tanh because the this function output range is between (-1,-1).12) [True or False] LogLoss evaluation metric can have negative values.A) TRUEB) FALSESolution: (B)Log loss cannot have negative values.13) Which of the following statements is/are true about “Type-1” and “Type-2” errors?Type1 is known as false positive and Type2 is known as false negative.Type1 is known as false negative and Type2 is known as false positive.Type1 error occurs when we reject a null hypothesis when it is actually true.A) Only 1B) Only 2C) Only 3D) 1 and 2E) 1 and 3F) 2 and 3Solution: (E)In statistical hypothesis testing, a type I error is the incorrect rejection of a true null hypothesis (a “false positive”), while a type II error is incorrectly retaining a false null hypothesis (a “false negative”).14) Which of the following is/are one of the important step(s) to pre-process the text in NLP based projects?StemmingStop word removalObject StandardizationA) 1 and 2B) 1 and 3C) 2 and 3D) 1,2 and 3Solution: (D)Stemming is a rudimentary rule-based process of stripping the suffixes (“ing”, “ly”, “es”, “s” etc) from a word.Stop words are those words which will have not relevant to the context of the data for example is/am/are.Object Standardization is also one of the good way to pre-process the text.15) Suppose you want to project high dimensional data into lower dimensions. The two most famous dimensionality reduction algorithms used here are PCA and t-SNE. Let’s say you have applied both algorithms respectively on data “X” and you got the datasets “X_projected_PCA” , “X_projected_tSNE”.Which of the following statements is true for “X_projected_PCA” & “X_projected_tSNE” ?A) X_projected_PCA will have interpretation in the nearest neighbour space.B) X_projected_tSNE will have interpretation in the nearest neighbour space.C) Both will have interpretation in the nearest neighbour space.D) None of them will have interpretation in the nearest neighbour space.Solution: (B)t-SNE algorithm consider nearest neighbour points to reduce the dimensionality of the data. So, after using t-SNE we can think that reduced dimensions will also have interpretation in nearest neighbour space. But in case of PCA it is not the case.Context: 16-17Given below are three scatter plots for two features (Image 1, 2 & 3 from left to right).<img src=\"https://pic1.zhimg.com/50/v2-b85d5a65f7bab49b72adbbe34e6674bb_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"534\" data-rawheight=\"211\" class=\"origin_image zh-lightbox-thumb\" width=\"534\" data-original=\"https://pic1.zhimg.com/v2-b85d5a65f7bab49b72adbbe34e6674bb_r.jpg\">16) In the above images, which of the following is/are example of multi-collinear features?A) Features in Image 1B) Features in Image 2C) Features in Image 3D) Features in Image 1 & 2E) Features in Image 2 & 3F) Features in Image 3 & 1Solution: (D)In Image 1, features have high positive correlation where as in Image 2 has high negative correlation between the features so in both images pair of features are the example of multicollinear features.17) In previous question, suppose you have identified multi-collinear features. Which of the following action(s) would you perform next? Remove both collinear variables.Instead of removing both variables, we can remove only one variable.Removing correlated variables might lead to loss of information. In order to retain those variables, we can use penalized regression models like ridge or lasso regression.A) Only 1B)Only 2C) Only 3D) Either 1 or 3E) Either 2 or 3Solution: (E)You cannot remove the both features because after removing the both features  you will lose all of the information so you should either remove the only 1 feature or you can use the regularization algorithm like L1 and L2.18) Adding a non-important feature to a linear regression model may result in.Increase in R-squareDecrease in R-squareA) Only 1 is correctB) Only 2 is correctC) Either 1 or 2D) None of theseSolution: (A)After adding a feature in feature space, whether that feature is important or unimportant features the R-squared always increase.19) Suppose, you are given three variables X, Y and Z. The Pearson correlation coefficients for (X, Y), (Y, Z) and (X, Z) are C1, C2 & C3 respectively.Now, you have added 2 in all values of X (i.enew values become X+2), subtracted 2 from all values of Y (i.e. new values are Y-2) and Z remains the same. The new coefficients for (X,Y), (Y,Z) and (X,Z) are given by D1, D2 & D3 respectively. How do the values of D1, D2 & D3 relate to C1, C2 & C3? A) D1= C1, D2 < C2, D3 > C3B) D1 = C1, D2 > C2, D3 > C3C) D1 = C1, D2 > C2, D3 < C3D) D1 = C1, D2 < C2, D3 < C3E) D1 = C1, D2 = C2, D3 = C3F) Cannot be determinedSolution: (E)Correlation between the features won’t change if you add or subtract a value in the features.20) Imagine, you are solving a classification problems with highly imbalanced class. The majority class is observed 99% of times in the training data.Your model has 99% accuracy after taking the predictions on test data. Which of the following is true in such a case?Accuracy metric is not a good idea for imbalanced class problems.Accuracy metric is a good idea for imbalanced class problems.Precision and recall metrics are good for imbalanced class problems.Precision and recall metrics aren’t good for imbalanced class problems.A) 1 and 3B) 1 and 4C) 2 and 3D) 2 and 4Solution: (A)Refer the question number 4 from in this article.21) In ensemble learning, you aggregate the predictions for weak learners, so that an ensemble of these models will give a better prediction than prediction of individual models.Which of the following statements is / are true for weak learners used in ensemble model?They don’t usually overfit.They have high bias, so they cannot solve complex learning problemsThey usually overfit.A) 1 and 2B) 1 and 3C) 2 and 3D) Only 1E) Only 2F) None of the aboveSolution: (A)Weak learners are sure about particular part of a problem. So, they usually don’t overfit which means that weak learners have low variance and high bias.22) Which of the following options is/are true for K-fold cross-validation?Increase in K will result in higher time required to cross validate the result.Higher values of K will result in higher confidence on the cross-validation result as compared to lower value of K.If K=N, then it is called Leave one out cross validation, where N is the number of observations.A) 1 and 2B) 2 and 3C) 1 and 3D) 1,2 and 3Solution: (D)Larger k value means less bias towards overestimating the true expected error (as training folds will be closer to the total dataset) and higher running time (as you are getting closer to the limit case: Leave-One-Out CV). We also need to consider the variance between the k folds accuracy while selecting the k.Question Context 23-24Cross-validation is an important step in machine learning for hyper parameter tuning. Let’s say you are tuning a hyper-parameter “max_depth” for GBM by selecting it from 10 different depth values (values are greater than 2) for tree based model using 5-fold cross validation.Time taken by an algorithm for training (on a model with max_depth 2) 4-fold is 10 seconds and for the prediction on remaining 1-fold is 2 seconds.Note: Ignore hardware dependencies from the equation.23) Which of the following option is true for overall execution time for 5-fold cross validation with 10 different values of “max_depth”? A) Less than 100 secondsB) 100 – 300 secondsC) 300 – 600 secondsD) More than or equal to 600 secondsC) None of the aboveD) Can’t estimateSolution: (D)Each iteration for depth “2” in 5-fold cross validation will take 10 secs for training and 2 second for testing. So, 5 folds will take 12*5 = 60 seconds. Since we are searching over the 10 depth values so the algorithm would take 60*10 = 600 seconds. But training and testing a model on depth greater than 2 will take more time than depth “2” so overall timing would be greater than 600.24) In previous question, if you train the same algorithm for tuning 2 hyper parameters say “max_depth” and “learning_rate”.You want to select the right value against “max_depth” (from given 10 depth values) and learning rate (from given 5 different learning rates). In such cases, which of the following will represent the overall time?A) 1000-1500 secondB) 1500-3000 SecondC) More than or equal to 3000 SecondD) None of theseSolution: (D)Same as question number 23.25) Given below is a scenario for training error TE and Validation error VE for a machine learning algorithm M1. You want to choose a hyperparameter (H) based on TE and VE.<img src=\"https://pic2.zhimg.com/50/v2-65591eeee2e63533bc56c2b83ad3637d_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"670\" data-rawheight=\"210\" class=\"origin_image zh-lightbox-thumb\" width=\"670\" data-original=\"https://pic2.zhimg.com/v2-65591eeee2e63533bc56c2b83ad3637d_r.jpg\">Which value of H will you choose based on the above table?A) 1B) 2C) 3D) 4E) 5Solution: (D)Looking at the table, option D seems the best26) What would you do in PCA to get the same projection as SVD?A) Transform data to zero meanB) Transform data to zero medianC) Not possibleD) None of theseSolution: (A)When the data has a zero mean vector PCA will have same projections as SVD, otherwise you have to centre the data first before taking SVD.Question Context 27-28Assume there is a black box algorithm, which takes training data with multiple observations (t1, t2, t3,…….. tn) and a new observation (q1). The black box outputs the nearest neighbor of q1 (say ti) and its corresponding class label ci. You can also think that this black box algorithm is same as 1-NN (1-nearest neighbor).27) It is possible to construct a k-NN classification algorithm based on this black box alone.Note: Where n (number of training observations) is very large compared to k.A) TRUEB) FALSESolution: (A)In first step, you pass an observation (q1) in the black box algorithm so this algorithm would return a nearest observation and its class.In second step, you through it out nearest observation from train data and again input the observation (q1). The black box algorithm will again return the a nearest observation and it’s class.You need to repeat this procedure k times28) Instead of using 1-NN black box we want to use the j-NN (j>1) algorithm as black box. Which of the following option is correct for finding k-NN using j-NN?J must be a proper factor of kJ > kNot possibleA)  1B) 2C) 3Solution: (A)Same as question number 2729) Suppose you are given 7 Scatter plots 1-7 (left to right) and you want to compare Pearson correlation coefficients between variables of each scatterplot.Which of the following is in the right order?<img src=\"https://pic3.zhimg.com/50/v2-58c60e7f36b47a77edaa2c9bb82faf27_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"664\" data-rawheight=\"92\" class=\"origin_image zh-lightbox-thumb\" width=\"664\" data-original=\"https://pic3.zhimg.com/v2-58c60e7f36b47a77edaa2c9bb82faf27_r.jpg\">1<2<3<41>2>3 > 47<6<5<47>6>5>4A) 1 and 3B) 2 and 3C) 1 and 4D) 2 and 4Solution: (B)from image 1to 4 correlation is decreasing (absolute value). But from image 4 to 7 correlation is increasing but values are negative (for example, 0, -0.3, -0.7, -0.99).30) You can evaluate the performance of a binary class classification problem using different metrics such as accuracy, log-loss, F-Score. Let’s say, you are using the log-loss function as evaluation metric.Which of the following option is / are true for interpretation of log-loss as an evaluation metric?  <img src=\"https://pic2.zhimg.com/50/v2-fec6fab8346d195fcd620e5f289b4b87_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"521\" data-rawheight=\"74\" class=\"origin_image zh-lightbox-thumb\" width=\"521\" data-original=\"https://pic2.zhimg.com/v2-fec6fab8346d195fcd620e5f289b4b87_r.jpg\">If a classifier is confident about an incorrect classification, then log-loss will penalise it heavily.For a particular observation, the classifier assigns a very small probability for the correct class then the corresponding contribution to the log-loss will be very large.Lower the log-loss, the better is the model.A) 1 and 3B) 2 and 3C) 1 and 2D) 1,2 and 3Solution: (D)Options are self-explanatory.Question 31-32Below are five samples given in the dataset.<img src=\"https://pic2.zhimg.com/50/v2-60fdcb362c59a56966a5ba346edbeb0a_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"188\" data-rawheight=\"155\" class=\"content_image\" width=\"188\">Note: Visual distance between the points in the image represents the actual distance.31) Which of the following is leave-one-out cross-validation accuracy for 3-NN (3-nearest neighbor)?A) 0D) 0.4C) 0.8D) 1Solution: (C)In Leave-One-Out cross validation, we will select (n-1) observations for training and 1 observation of validation. Consider each point as a cross validation point and then find the 3 nearest point to this point. So if you repeat this procedure for all points you will get the correct classification for all positive class given in the above figure but negative class will be misclassified. Hence you will get 80% accuracy.32) Which of the following value of K will have least leave-one-out cross validation accuracy?A) 1NNB) 3NNC) 4NND) All have same leave one out errorSolution: (A)Each point which will always be misclassified in 1-NN which means that you will get the 0% accuracy.33) Suppose you are given the below data and you want to apply a logistic regression model for classifying it in two given classes.<img src=\"https://pic3.zhimg.com/50/v2-fa0aef0672b4731fa0e9cea54fcb5b6a_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"335\" data-rawheight=\"283\" class=\"content_image\" width=\"335\"><img src=\"https://pic3.zhimg.com/50/v2-fa0aef0672b4731fa0e9cea54fcb5b6a_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"335\" data-rawheight=\"283\" class=\"content_image\" width=\"335\">You are using logistic regression with L1 regularization.<img src=\"https://pic2.zhimg.com/50/v2-d8ddf2f61fd59aeb500dbee4488920d7_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"377\" data-rawheight=\"75\" class=\"content_image\" width=\"377\">Where C is the regularization parameter and w1 & w2 are the coefficients of x1 and x2.Which of the following option is correct when you increase the value of C from zero to a very large value?A) First w2 becomes zero and then w1 becomes zeroB) First w1 becomes zero and then w2 becomes zeroC) Both becomes zero at the same timeD) Both cannot be zero even after very large value of CSolution: (B)By looking at the image, we see that even on just using x2, we can efficiently perform classification. So at first w1 will become 0. As regularization parameter increases more, w2 will come more and more closer to 0.34) Suppose we have a dataset which can be trained with 100% accuracy with help of a decision tree of depth 6. Now consider the points below and choose the option based on these points.Note: All other hyper parameters are same and other factors are not affected. Depth 4 will have high bias and low varianceDepth 4 will have low bias and low varianceA) Only 1B) Only 2C) Both 1 and 2D) None of the aboveSolution: (A)If you fit decision tree of depth 4 in such data means it will more likely to underfit the data. So, in case of underfitting you will have high bias and low variance.35) Which of the following options can be used to get global minima in k-Means Algorithm?Try to run algorithm for different centroid initializationAdjust number of iterationsFind out the optimal number of clustersA) 2 and 3B) 1 and 3C) 1 and 2D) All of aboveSolution: (D)All of the option can be tuned to find the global minima.36) Imagine you are working on a project which is a binary classification problem. You trained a model on training dataset and get the below confusion matrix on validation dataset.<img src=\"https://pic2.zhimg.com/50/v2-1ce601ea2412b4714bbac763d5ca8a0c_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"429\" data-rawheight=\"214\" class=\"origin_image zh-lightbox-thumb\" width=\"429\" data-original=\"https://pic2.zhimg.com/v2-1ce601ea2412b4714bbac763d5ca8a0c_r.jpg\">Based on the above confusion matrix, choose which option(s) below will give you correct predictions?Accuracy is ~0.91Misclassification rate is ~ 0.91False positive rate is ~0.95True positive rate is ~0.95A) 1 and 3B) 2 and 4C) 1 and 4D) 2 and 3Solution: (C)The Accuracy (correct classification) is (50+100)/165 which is nearly equal to 0.91.The true Positive Rate is how many times you are predicting positive class correctly so true positive rate would be 100/105 = 0.95 also known as “Sensitivity” or “Recall”37) For which of the following hyperparameters, higher value is better for decision tree algorithm?Number of samples used for splitDepth of treeSamples for leafA)1 and 2B) 2 and 3C) 1 and 3D) 1, 2 and 3E) Can’t saySolution: (E)For all three options A, B and C, it is not necessary that if you increase the value of parameter the performance may increase. For example, if we have a very high value of depth of tree, the resulting tree may overfit the data, and would not generalize well. On the other hand, if we have a very low value, the tree may underfit the data. So, we can’t say for sure that “higher is better”.Context 38-39Imagine, you have a 28 * 28 image and you run a 3 * 3 convolution neural network on it with the input depth of 3 and output depth of 8.Note: Stride is 1 and you are using same padding.38) What is the dimension of output feature map when you are using the given parameters.A) 28 width, 28 height and 8 depthB) 13 width, 13 height and 8 depthC) 28 width, 13 height and 8 depthD) 13 width, 28 height and 8 depthSolution: (A)The formula for calculating output size isoutput size = (N – F)/S + 1where, N is input size, F is filter size and S is stride.Read this article to get a better understanding.39)  What is the dimensions of output feature map when you are using following parameters.A)  28 width, 28 height and 8 depthB) 13 width, 13 height and 8 depthC) 28 width, 13 height and 8 depthD) 13 width, 28 height and 8 depthSolution: (B)Same as above40) Suppose, we were plotting the visualization for different values of C (Penalty parameter) in SVM algorithm. Due to some reason, we forgot to tag the C values with visualizations. In that case, which of the following option best explains the C values for the images below (1,2,3 left to right, so C values are C1 for image1, C2 for image2 and C3 for image3 ) in case of rbf kernel.<img src=\"https://pic3.zhimg.com/50/v2-a68750dd79098cc4bb30444033c58a5a_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"652\" data-rawheight=\"202\" class=\"origin_image zh-lightbox-thumb\" width=\"652\" data-original=\"https://pic3.zhimg.com/v2-a68750dd79098cc4bb30444033c58a5a_r.jpg\">A) C1 = C2 = C3B) C1 > C2 > C3C) C1 < C2 < C3D) None of theseSolution: (C)Penalty parameter C of the error term. It also controls the trade-off between smooth decision boundary and classifying the training points correctly. For large values of C, the optimization will choose a smaller-margin hyperplane. Read more here.", "answer_votes": "77", "answer_comment": "​3 条评论"}
{"answer_author": "100offer", "answer_id": 254406158, "answer_text": "谢邀。机器学习工程师在100offer后台中的确是一个比较热门的岗位，但是同时也是一个要求比较高的岗位。这里特地整理了最近在咱们的知乎LIVE中，从事这个领域工作的陈村关于面试的心得。分享包括以下几个部分：面试流程优秀面试者特质面试技巧算法面试题分享1.面试流程一般面试官会根据求职者写在简历上的项目经验开场，这里的考察点一般就是：项目的难度和求职者对项目的主要贡献。通过这些可以了解求职者的真实能力和技术水平，还可以推测求职者未来加入目标公司的行为模式。项目中的一些技术知识也会顺便考察下。之后会进行一些扩展，有些求职者可能说到自己的项目说的非常流畅，这可能就是准备的比较好，但是一些新的项目可能就不知所措了，但是问到的这些新的问题，完全可以套用之前项目的方法，但是很多求职者到这边就挂了。2.优秀面试者的特质（1）基本功扎实基本功非常扎实，在学校的排名比较高，有较好的学术论文和项目，在基础算法的回答上非常准确，编写无误。（2）思维聪明如何判断面试者的思维是否“聪明”，体现在以下两点：第一，求职者能够很好的和面试者进行交流，我跟他交流会非常愉快。其次，他能够很好的了解面试官考察的内容，并表现出很好的问题分析能力。同时，当面对一些有难度的问题的时候，能和面试官进行比较好的交流，一起逐步完成。（3）态度端正最后是要态度端正，会对对方留下比较好的印象。简历上不能夸大，不能造假，交流要谦逊，不卑不亢。3.机器学习面试技巧（1）简历一定要精简首先，简历一定要精简，不要过多的堆砌一些不重要的。（2）简历项目描述要精准的描述出项目技术难点，并且包含准确的评价数字。一份好的简历中的项目描写应该要精准的描述出项目技术难点，并且包含准确的评价数字。比如说：我用Tensor Flow 的密性，在公开的MNIST的数据上，得到了96%的准确率。这样就会显得很专业，也会加深的项目的可信度。（3）对面试官的问题精确回答，不要做过多的辩解对于面试官的问题，我希望做精确的回答，不要摸索，不要做过多的揭示和辩解，过多的解释，要么代表你没有理解我的意思，不懂我要问什么，会说一些无关紧要的话，要么就是有点紧张底气不足。所以对于面试官的问题要谨慎作答，不要过多的解释，节省大家的时间。4.算法面试题在算法的面试中，可以采取以下的节奏：首先，要先复述一下面试问题，澄清题意，来代表你理解这个问题并且没有错误。同时，你要保持和面试官的不断的交流，不要把他当成面试官，而要把他当成未来团队成员，先和未来的团队成员一起想办法讨论问题，解决问题，然后临时给出一个基本的可运行版本。即使算法和运行效率看起来特别差，但是先给出一个基本的可运行的版本，然后再和面试官讨论。这也是我们工作过程中的基本的工作模式，先给一个基本的运行版本，然后再慢慢迭代改进。面试过程中，最忌讳的就是闷头做题，给了题目之后二话不说就开始写代码，写了20分钟之后发现，思路不对或者题目看错了，这是非常糟糕的一件事情。相关Live内容：NLP 算法工程师的学习、成长和实战经验机器学习工程师的进阶之路 | 知乎 Live 笔录相关干货内容：我们找了 4 家大数据公司技术 Leader，聊了聊算法和数据挖掘工程师的机会和选择从技术 Leader 的招聘需求看，如何转岗为当前紧缺的大数据相关人才？", "answer_votes": "49", "answer_comment": "​3 条评论"}
{"answer_author": "姚凯飞", "answer_id": 174467341, "answer_text": "本问题，周开拓老师有了很好的总结与参考书目推荐，建议大家可以先移步周老师先行阅读，这里给到的是相关具体可能会被问及的问题(编程、基础算法、机器学习算法)。从本次关于算法工程师常见的九十个问题大多是各类网站的问题汇总，希望你能从中分析出一些端倪，文末附了部分参考的答案《 机器学习、大数据相关岗位职责及准备（转） 》: 机器学习面试的职责和面试问题(转) - 知乎专栏《 机器学习经典算法优缺点总结》: 机器学习经典算法优缺点总结 - 知乎专栏其中的关于推荐系统的入门介绍可以查看专栏文章:什么是推荐系统(个性化内容分发)？ - 知乎专栏其中的关于用户画像的入门介绍可以查看专栏文章比你更了解你，浅谈用户画像 - 知乎专栏也欢迎大家参加我的知乎live-《推荐算法那点事》:知乎 Live - 全新的实时问答《 推荐算法那点事（二）：细节 》:知乎 Live - 全新的实时问答欢迎大家关注后续的文章1.struct和class区别，你更倾向用哪个\n 2.kNN，朴素贝叶斯，SVM的优缺点，朴素贝叶斯的核心思想，有没有考虑属性之间不是相互独立的情况\n 3.10亿个整数，1G内存，O(n)算法，统计只出现一次的数。\n 4.SVM非线性分类，核函数的作用\n 5.海量数据排序\n 6.项目中的数据是否会归一化处理，哪个机器学习算法不需要归一化处理\n 7.两个数组，求差集\n 8.开放性问题：每个实体有不同属性，现在有很多实体的各种属性数据，如何判断两个实体是否是同一种东西\n 9.写程序实现二分查找算法，给出递归和非递归实现，并分析算法的时间复杂度。\n 10.用C/C++实现单链表的反转。\n 11.python读取文件，写代码\n 12.python计算一个文件中有N行，每行一列的数的平均值，方差，写代码\n 13.C++求两个一维数组的余弦相似度，写代码\n 14.SVM详细过程，支持向量，几何间隔概念，拉格朗日函数如何求取超平面，非线性分类\n 15.海量数据中求取出现次数最大的100个数。16.字符串翻转，手写17.快排，手写18.KNN（分类与回归）、CART（回归树用平方误差最小化准则，分类树用基尼指数最小化准则）、Logistics（推导）、GBDT（利用损失函数的负梯度在当前模型的值作为回归问题提升树算法中的残差的近似值，拟合一个回归树）、随机森林（Bagging+CART）19. 非递归的二叉前序遍历 && 两个字符串的复制（除了字符串地址重叠的情况，也要注意判断字符串本身的空间足够不足够，对于异常情况要考虑全面）20.一个概率题目： 6个LED灯管，找整体旋转180'后仍然是一个正常输入的情况（考虑全即可）\n 21. 给一个情境，考察你对于机器学习算法的了解程度以及常用情境的了解（要特别注意思维要开阔，我就是陷入某一个）22.一个数组，如果存在两个数之和等于第三个数，找出满足这一条件的最大的第三个数（设为x+y =c）23.聚类和分类有什么区别？分类是事先知道类标的，而聚类事先不知道类标。24.快速排序，怎样将二叉排序树变成双向链表，且效率最高，从栈里找最小的元素，且时间复杂度为常数级，25.神经网络,plsi的推导，还有float转string,判断一棵树是否是另一棵的子树。26.写写SVM的优化形式、推导SVM27.在一个n*n的矩阵中填数的问题，那种转圈填数，上网搜搜有\n 28.链表存在环问题，环的第一个节点在哪里？\n 29.几个排序算法，必须写出30.用拉格朗日公式推导SVM kernel变换31.数据结构当中的树，都有哪些？32.推荐系统33.输出一个循环矩阵，这个我想的有点复杂了，简单的循环即可实现，我用了递归\n 34.翻转字符串，《剑指offer》原题\n 35.确定链表中环的起始位置36.N个数找K大数那个题,堆解释了一遍,比较满意,问还能怎么优化O(Nlogk)的方法，并行方面想37.一个班60个人怎么保证有两个人生日相同,听完后有点奇怪,①为什么是60个人?②为什么是保证?,反正没管这么多就是概率嘛,算就完了.\n 38.问一个字符串怎么判断是邮箱比如:vzcxn@sdf.gre.有限状态自动机,然后要我画状态转移图.\n 39.快排的空间复杂度,答O(n).归并的空间复杂度,答O(n).他让我好好想想,我想了会,难道空间复杂度的常数不能省吗?然后做了修改,快排是O(n)归并是O(2n).\n 40.给10^10个64位数,100M内存的空间排序,感谢队长刚好在去的前一天教过我一个求中位数的方法.用文件操作来做了,像快排一样,二分选个数统计大于那个数的数量和小于那个数的数量,如果能用100M的空间排序就把那些数排了,如果不能继续.直到能排为止.\n 41.main(argc,argv[])里面两个参数什么意思\n 42.kmp算法\n 43.电梯问题\n 44.一个应用题，考察hash算法45.求最大字段和，用动态规划和分治法两个方法，时间复杂度怎么算\n 46.写了一下二分查找算法的代码47.统计字符串中出现的字符个数，忽略大小写，其中可能有其他字符。\n 48.一个文件2G内容是userid,username 一个文件3G内容是username,userpassword\n 要求：输出userid,userpassword 8核cpu 2G内存49.贝叶斯概率、卷积50.寻找二叉树的公共父节点51.通过寻找两条路径，然后寻找最后一个公共节点。52.SVM核函数，合并两个文件的问题53.b+ b-树、红黑树、要求写出排序算法54.判断两条链表是否交叉。55.归并排序，random指针的链表复制等56.树的广度、深度遍历，57.L1和L2的区别58.生成与判别模型59.隐式马尔科夫60.SVM：中文分词61.关联分析、aprior62.各类算法优缺点、模型调优细节63.特征提取的方法（无关键词也是一个特征）64.稳定与不稳定排序65.RBF核与高斯核的区别66.Python实现LogReg67.ROC与AUC68.K-means起始点69.深度学习和机器学习的区别、数据挖掘和人工智能的区别、测试集和训练集的区别kmeans，FCM，SVM算法的具体流程、如何优化kmeans算法70.二叉树前序遍历非递归实现，大家总结一下前序，中序，后序遍历的非递归实现，尝试多几种方法会有不一样的收获。71. Deep CNN, Deep RNN, RBM的典型应用与局限，看Hinton讲义和Paper去吧72. 有哪些聚类方法？73. 判断一个链表是否存在环？回 答：通过两个指针，快慢指针进行遍历。74. 正则化是怎么回事（L1和L2）75.PCA76. 学校食堂如何应用数据挖掘的知识77. 哪些模型容易过拟合，模型怎么选择78. 什么是模糊聚类，还有划分聚类，层次聚类等79. 最长上升子序列啊，两个大小相同的有序数组找公共中位数80. 并行计算、压缩算法81.SVD、LDA82. naive bayes和logistic regression的区别\n 83.LDA的原理和推导\n 84.做广告点击率预测，用哪些数据什么算法\n 85.推荐系统的算法中最近邻和矩阵分解各自适用场景\n 86.用户流失率预测怎么做（游戏公司的数据挖掘都喜欢问这个）\n 87.一个游戏的设计过程中该收集什么数据\n 88.如何从登陆日志中挖掘尽可能多的信息89. 统计学习的核心步骤：模型、策略、算法，你应当对logistic、SVM、决策树、KNN及各种聚类方法有深刻的理解。能够随手写出这些算法的核心递归步的伪代码以及他们优化的函数表达式和对偶问题形式。90. 梯度下降、牛顿法、各种随机搜索算法（基因、蚁群等等）部分答案的参考答案整理1.struct比class有更多的限制，详见下面链接http://angeson1987.blog.163.com/blog/static/1625900902010728035209/2. 朴素贝叶斯核心思想利用先验概率得到后验概率，并且最终由期望风险最小化得出后验概率最大化，从而输出让后验概率最大化的值（具体概率与先验概率由加入拉普拉斯平滑的极大似然估计而成的贝叶斯估计得到），特征必须相互独立。file:///C:\\Users\\kaifei.yao\\AppData\\Local\\Temp\\msohtmlclip1\\01\\clip_image001.jpg3.方案一：分拆然后分布式，方案二：对应每个数有三个状态，01代表出现一次，统计10亿以内数据，然后看最终哪些是01状态4.应对非线性分类问题5.bit 位操作6.量纲问题：归一化有利于优化迭代速度（梯度下降），提高精度（KNN）7. 实操，算法流程：从数组1的尚未比较的元素中拿出第一个元素array1(i)，用array1(i)与array2(j)进行比较（其中j>i且j<array2的长度），可能出现下面两种情况，1． 数组2中找到了一个与array1(i)相等的元素，则将array2(j)与array2(i)进行交换，I 加一，进行下次迭代2． 数组2直到结尾也没找到与array1(i)相等的元素，则将array1(i)与尚未进行比较的最后一个元素array1(k)进行交换，i不加一，进行下次迭代。8.重写equals方法，对类里面的对象进行属性比较9.实操10. 实操： 为了反转这个单链表，我们先让头结点的next域指向结点2，再让结点1的next域指向结点3，最后将结点2的next域指向结点1，就完成了第一次交换，顺序就变成了Header-结点2-结点1-结点3-结点4-NULL，然后进行相同的交换将结点3移动到结点2的前面，然后再将结点4移动到结点3的前面就完成了反转，思路有了，就该写代码了：　每次都将原第一个结点之后的那个结点放在list后面，下图是原始的单链表。file:///C:\\Users\\kaifei.yao\\AppData\\Local\\Temp\\msohtmlclip1\\01\\clip_image002.jpg11.12.13.14.实操15. 处理海量数据问题，无非就是，详细见链接http://blog.csdn.net/flyqwang/article/details/7395866：分而治之/hash映射 + hash统计 + 堆/快速/归并排序；双层桶划分Bloom filter/Bitmap；Trie树/数据库/倒排索引；外排序；分布式处理之Hadoop/Mapreduce。16. 实操：将原数组看成 ab，需要转换成 ba，先单独对子数组a进行反转得到a'b（a'表示a反转后的结果），同理单独反转b，得到 a'b',最后将得到的 a'b' 一起进行一次反转可得 （a'b'）',而这就是最终结果 ba了17.18.实操19. 实操：http://ocaicai.iteye.com/blog/104739722.先排序，然后遍历数组，每次遍历的元素求是否是前后两个元的和，小于则左边前进，大于则右边后退23. 分类是事先定义好类别 ,类别数不变， K-均值聚类算法、K-中心点聚类算法、CLARANS、 BIRCH、CLIQUE、DBSCAN等24. 实操：http://m.blog.csdn.net/blog/wkupaochuan/8912622，http://blog.163.com/kevinlee_2010/blog/static/169820820201092091554523/25.实操，子树问题分两步：找值相同的根结点（遍历解决）判断两结点是否包含（递归：值、左孩子、右孩子分别相同）26.实操27. http://www.docin.com/p-19876385.html28. http://blog.csdn.net/kerryfish/article/details/2404309929.30.实操31. 二叉查找树（二叉排序树）、平衡二叉树（AVL树）、红黑树、B-树、B+树、字典树（trie树）、后缀树、广义后缀树。详见下面链接http://www.cnblogs.com/dong008259/archive/2011/11/22/2255361.html32. http://baike.baidu.com/link?url=ECsYE4xe1gguMd3R5X4x5V7eQX54NkFp0PJ0FYbAvgJIFPDiaCdD_PuftDAYZTuzH0EuIobF1vDa2Vx2rj6Dda33. 实操 34.见16，实操  35.见2836. http://www.douban.com/note/275544555/37.1减去50个人生日不同的概率≈100%38. http://zhidao.baidu.com/link?url=DAnewo2j-Jz2u3WwyhFb4kYpnI3QZzfBqsQXdzVG9R061hcBTCUu01WXtoX5T89SmiiMJ_eWIkXOAAe1lhDFM0S7OPjnL_zTEX3Mm1ARc-a39. 空间复杂度：快排是O(n)归并是O(2n).40. http://blog.csdn.net/guyulongcs/article/details/752046741. args是Java命令行参数，我们在DOS中执行Java程序的时候使用“java 文件名 args参数”。args这个数组可以接收到这些参数。当然也可以在一个类中main方法中直接调用另一个类里的main方法，因为main方法都是static修饰的静态方法，因此可以通过类名.main来调用，这时就可在调用处main方法中传入String[]类型的字符串数组，达到调用的目的，也可不传入参数。42. http://www.cnblogs.com/goagent/archive/2013/05/16/3068442.html43. http://www.cnblogs.com/BeyondAnyTime/archive/2012/06/06/2538764.html44. http://www.360doc.com/content/13/0409/14/10384031_277138819.shtml45. http://blog.csdn.net/wwj_748/article/details/891983846.47.实操48. http://freewxy.iteye.com/blog/73757649. http://book.51cto.com/art/201205/338050.htmhttp://www.guokr.com/post/342476/50. http://blog.csdn.net/zcsylj/article/details/6532787http://www.cnblogs.com/chlde/archive/2012/10/26/2741380.html51.52. 53.实操54. http://m.blog.csdn.net/blog/yangmm2048/4492499755.实操56. http://driftcloudy.iteye.com/blog/78287357.实操58.生成是先P(X,Y)再P(Y|X),判别是P(Y|X)59.实操60.LDA提取特征，再用SVM做分类61.62.63.实操64.a1与a2值相等，排序完以后两者顺序仍然没变则是稳定排序，稳定排序有插入、冒泡、归并65.一样66. http://blog.csdn.net/zouxy09/article/details/2031967367. http://www.tuicool.com/articles/q6zYrq68. http://www.cnki.com.cn/Article/CJFDTotal-DNZS200832067.htm69.实操70.见1971.实操72. K-均值聚类算法、K-中心点聚类算法、CLARANS、 BIRCH、CLIQUE、DBSCAN等73. http://m.blog.csdn.net/blog/lavor_zl/4278424774.75.76.77.实操78. http://blog.csdn.net/xiahouzuoxin/article/details/7748823http://www.cnblogs.com/guolei/p/3899509.html79. http://blog.csdn.net/zcsylj/article/details/6802062http://www.cnblogs.com/davidluo/articles/k-smallest-element-of-two-sorted-array.html80. http://www.doc88.com/p-1621945750499.html81.实操82. http://m.blog.csdn.net/blog/muye5/1940961583.实操84. http://bbs.pinggu.org/thread-3182029-1-1.html85. http://www.doc88.com/p-3961053026557.html86. http://www.docin.com/p-1204742211.html87. 88.http://www.docin.com/p-118297971.html89.90.实操", "answer_votes": "259", "answer_comment": "​23 条评论"}
{"answer_author": "且听风雨", "answer_id": 24977132, "answer_text": "面试过百度和阿里数据挖掘   算法有svm  em算法  都要推导证明 因为我做过文本主题  所以问了很多lda的知识其它的就比较扯了  ", "answer_votes": "13", "answer_comment": "​13 条评论"}
{"answer_author": "Oyster Kwok", "answer_id": 28388275, "answer_text": "多扶老奶奶过马路多攒人品。先总结几点，再谈个人经历。1. 基本的Model要懂Kmeans必须懂 KNN懂原理不用写 SVM、MR和Pagerank多看看，遇到问题多用这些方法讨论（不关乎信仰，面试官都懂）2. 高层次的Model是关乎信仰的，不需要浪费时间在上面比如LDA。以前信贝爷，觉得高大上。做过才知道坑有多深，出paper搞点黑数据可以，真正业界要用效果甚不稳定。HMM可以做语句分析优化，别的地方用也不显著。绝大多数时候搞个word net，做个tf idf就足够了，不行自己再加些hardcode，效果也比所谓的model好，性能也高。另一说就是面试官不期望你懂这么高级的模型，就跟他们不能因为你不会拉小提琴而觉得你智商不够把你拒掉一样。3. 人品、自信、反客为主的面试思路以我的个人经历（Observation）（详见文末），不懂但人品好就拿到了Offer，懂但人品不好就拿不到Offer。（请随意Predict）个人比较成功的面筋是看好面试官的cd间隔放大招：比如看简历沉没的时候主动说high light一下，有条件就把线上的project拿出来秀；代码写完主动说说能有什么改进思路，把面试官拐跑，就不会被他带到挖好的坑上来了。4. 数据敏感性比如预估数据规模和运行时间。经历过以下几种case，不知是否match。1. 10年，北京，刚毕业。申请国外phd跪了。魂友指明路去T大某ML实验室历练。提前两周看了下，感觉最懂的也只有贝叶斯公式了（其余只知道个缩写看着眼熟）约了时间也只能硬着头皮去了。结果老板就看了看简历，只问我啥时候可以过去。=_=2. 一年半后，在美读硕。经济压力山大，暑假前就开始找实习（真心困难，因为当时招ML或者Data Scientist的都只招Fulltime或者经老板介绍的PhD）简历投了也没人鸟，感觉还是懂iOS Android的吃香。好不容易遇到个start-up，面试时候我主动展示之前做的项目，挺满意，让我写个Page Rank，30分钟拍好Over。（允许看wiki看公式）老板不懂/不信LDA，反正SVM各种搞。3. 有同学拿到EBay电面，抓我去帮忙递纸条，问的概率论基础，线性回归，码字符串处理，都是基本功。4. 后来面了次Yelp，电面第二轮，代码拍太快了，导致他有时间问了第二个Follow up question，投票统计相关，我提了两种normalize方案，都不太完善，后来就不要我了。5. FB一直没理我，估计是之前在Graph上面抓数据超了两次limit被封过ID（他们自己文档不写清楚）Google问的都是基本码农问题，跟ML关系不大。因为面的Test，码完让我自己出数据，我出多了，被鄙视，锯。6. 去面Bing。Super Day面了6个人，前面问算法，后面吃着混沌面问的Query分析。最后没给Offer，因为收了N记2万5员工用完招人名额。（据说还给EVP打了报告，没批。算了）最后忠告：攒人品。信自己的数学和逻辑直觉，不要信Model。信不信贝爷和得不得永生是相对独立事件。所以“信贝爷得永生”在贝爷的公理范围内至少是悖论。", "answer_votes": "81", "answer_comment": "​16 条评论"}
{"answer_author": "ff Ale", "answer_id": 45005647, "answer_text": "关于考察方面，上面已经讲得很详细了，直接给你贴几个面试数据挖掘实习生经验贴，都是15年崭新的血与泪啊。（网站是100块钱的国外虚拟空间，没有进行什么优化处理，所以网页打开会非常慢，请见谅。）百度数据挖掘实习工程师一、二现场面试（深圳）阿里巴巴电话面试2面总结（数据挖掘，天猫事业部）百度NLP电话面试总结如何准备面试呢？个人经验：1. 代码算法：基本算法（如快排等，需要熟练掌握） + 剑指Offer（面试经常出相似的题） + LeetCode（剑指Offer的补充，增强动手能力）2. 机器学习：李航《统计学习方法》（读3遍都不为过啊！） + Coursera Stanford《Machine Learning》（讲得很基础，但是没有告诉你所以然） + Coursera 台湾大学《机器学习高级技法》（里面详解了SVM，Ensemble等模型的推导，优劣）3. 请详细地回忆自己做过的项目，项目用了什么算法，为什么用它，有什么优缺点等。如果没项目经验可以参加天猫大数据比赛和Kaggle比赛。4. 教你如何迅速秒杀掉：99%的海量数据处理面试题。（基本每次都有一道海量数据处理的面试题）PS：终于拿到某互联网公司的数据挖掘实习工程师的Offer啦，好开心啊~~~", "answer_votes": "206", "answer_comment": "​33 条评论"}
{"answer_author": "曹荣禹", "answer_id": 46127276, "answer_text": "1 决策树的模型很重要，不会问你ID3这些简单的，甚至CART都不会，不过会问GBDT，随机森林。2 SVM不可能不问。3 理解得很深才能给面试官讲明白。", "answer_votes": "12", "answer_comment": "​添加评论"}
{"answer_author": "如今我已剑指天涯", "answer_id": 152583057, "answer_text": "点滴积累。下面是我积累的资源...机器学习面试准备（持续更新）--- 优秀博文传送门，收集优秀资源 - 做一枚优秀的程序猿 - 博客频道 - CSDN.NET", "answer_votes": "19", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 62751814, "answer_text": "会逻辑回归就够了，其他的大致看看，编程扎实一点，特征怎么抽怎么处理的详细了解一下，就够了，没那么多扯犊子东西。主要靠练，准备的话看看C加加，熟悉一下自己的项目。", "answer_votes": "2", "answer_comment": "​3 条评论"}
{"answer_author": "王浩然", "answer_id": 105000141, "answer_text": "最近在Quora上看到了一个相关回到，于是搬到这里来。链接在此 quora.com 的页面搞机器学习的阅读英文肯定毫无压力了，就不翻译了-----以下是原回答------First, here is my list of all skills I might want to see for this position:AcademicCS courseworkStats and linear algebraSome ML coursework, covering at leastregressionclassificationclusteringrecommendationgraphical modelsData Collection ToolsHadoop-based tools like Flume / SqoopText munging languages like Python, or maybe PerlBasic SQLData Modeling ToolsA library like scipy / numpy or WekaA tool like R (or commercial equivalents like SAS, SPSS)Model Serving Tools(Ideally) some familiarity with PMMLBasic knowledge of a NoSQL storeSystems language skill, like JavaBusiness SmartsCommunication skillsSome facility with a visualization tool, even if gnuplot or ExcelDomain knowledge relevant to my businessYou certainly don't need all of that. In fact, for an internship, you can't be expected to have most of it. I assume you are in school, so I would expect you to have much of the academic background, and would like to see that you have some of the tool skills. I would not expect business skills, but believe me, communication skills are a big differentiator.So what to focus on? First, academics. If I were interviewing you I would probably ask about this as a filter. If you're not able to explain the very basics, like what linear regression does, that means there's a big lack of either knowledge or communication skills. So I would feel comfortable with the very basics. I'd ask you to explain one moderately advanced algorithm and why it works, of your choice. Same reasoning, if you can't pick something out of everything you know to explain reasonably, probably not going to proceed.Unfortunately I do think a lot of interviews focus too much on the math and algorithms like it was an exam. I would not want to work at places that think that's the important thing. I personally would want to see that you're smart and communicate well and know the basics. Chances are that whatever math is relevant to my business is something you'll need to learn (more) anyway.I know you're asking about tools though. The tools that are relevant really depend on the kind of place you're applying. A classic research department is going to focus mostly on modeling tools. Since you can't get SAS / SPSS easily, focus on R and Weka as a skill.At the other end of the spectrum, say, a small startup, the requirement is broader and shallower. They won't need you to know R. They will need you to quickly understand a business problem and put together a production-ready system to solve it. So it's much more about data collection, munging, a little modeling, and then integration. For that I would make sure you know how to get data out of a DB or log files, into a modeling tool, and then how to transform a model into some code someone could put in a web server. So: basic SQL, Python or Java, and whatever DB / web serving tools the company uses.Kaggle is great practice although it will not 'test' your data collection skills or the serving side of things. But it will challenge you to understand a business problem, munge real data and model it. I would look favorably on an intern who had taken the time to solve a Kaggle problem and done reasonably well.", "answer_votes": "13", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 24156736, "answer_text": "常用模型和算法，至少有那么一两个能推导，能说出适用范围，能自己实现，有过应用。\n另外，要有算法工程师的气质，那种对任何事物都愿意且能够深入思考的倾向。\n据说，如果是应聘大公司初级工程师的话，刷题貌似有那么一丢丢用处，仅仅是一丢丢。", "answer_votes": "13", "answer_comment": "​1 条评论"}
{"answer_author": "知乎用户", "answer_id": 265065362, "answer_text": "背景介绍：坐标上海，年底裸辞，一周半时间，收到7家面邀，面了5家，4家聊的都很好，最后谈下2家offer。关于知识点，楼上各位已经说的很详细了。所以就来说一些面试心得吧，包括但不限于机器学习面试：不要裸辞！更不要在年底裸辞！给自己预留一个月找工作的时间，不要慌！简历真的重要，简历排版也很重要！有个人技术博客会加分。强调自己的背景很重要，学cs的？还是学数学/统计的？让面试官对你有个预期。小公司可以强势一点，大公司主要看发展。对自己的职业规划有一个清晰的认识很重要！面试的谈吐，神情，逻辑流畅性可以增加面试官好感。每次面试前将重要的知识点（算法，项目经历等等）过一遍。接上一条，将最想去的公司放在最后面，以最好的面试状态去应对。尽量将两次面试的时间错开，因为你永远不知道面试官会和你聊多久 = =让面试官觉得你很有实力，有潜力，有趣很重要。以上", "answer_votes": "31", "answer_comment": "​35 条评论"}
{"answer_author": "盐一层", "answer_id": 48122048, "answer_text": "看了这里的回答，我很想哭", "answer_votes": "22", "answer_comment": "​4 条评论"}
{"answer_author": "放浪者", "answer_id": 216701403, "answer_text": "欢迎机器学习、图像识别等方面寻求一线公司ai职位的私信联系作为一个开发转ml的，我打算扬长避短, 废话不要说，给我写代码。嗯，不要用啥库，用基本的代码实现最简单的一个ml模型，然后加条件看怎么优化实现。如果对只有一轮的面试，我觉得光coding这一步已经可以筛掉一大帮子光说不练调api的了。不喜欢动不动说要问啥“核心思想”的，机器学习有个毛线的思想，就是为了变着花样调参；random forest/gbdt/xxxBoost把一堆模型变着花样放一起猜哪个好，cnn/vgg/alexnet/whatever加几层减几层还不是靠猜和不断试验，和股评家差不多，结果出来了再扯原因。。。*****************************************讲讲实际面试效果，目前只面了4个人，全部是985的硕士包括一个清华的：ml基本理论基本都能说清楚，比如各种模型用来干嘛，具体原理，BP的推导（求导）等等，充分体现了我国理论教育基础的扎实。CNN/VGG/Mobilenet等基本就是直接套，连参数都基本没调，只有一个对YOLO其中一层有过修改，也没啥好问了。最多时间耗费在实现简单单层网络上，磨磨蹭蹭能实现出简单的单层结构（有个用C++做的还是有点surprise），perceptron那种. 然后又只知道用sigmoid，用了在实现求导的时候就卡壳了，反复建议换个简单的activation function也可以，我只是看思路。。。对方都听不懂，晕，之前还侃侃而谈能根据实际情况选用不同的激活函数，现在的实际情况就是选一个你知道怎么实现求导的最简单的啊，就不会了。。。其它985学校的还好，清华哥哥比较郁闷，说他们上课的时候就是讲数学，讲完直接套现有框架，没有实现过底层的。。。说他之前的面试这方面都是谈对机器学习／深度学习思想的认识和理解，动口不动手的。。。作为马工出身的我倍感惭愧，居然直接上来叫人写代码实现，这不是变得跟徐晓冬这种低俗的人一样了么。*********************************************打个广告，在机器学习/深度学习算法研究，或者机器学习工程体系(machine learning pipeline)方面有相当经验的朋友，如果对相关技术在游戏领域的应用（不光是什么代替游戏内部AI这种）研究感兴趣，欢迎私信本人私聊，本人所在部门长期招聘相关人才，待遇和国内一线公司持平（因为本来就是一线公司～～～）", "answer_votes": "66", "answer_comment": "​39 条评论"}
{"answer_author": "Maxbin", "answer_id": 93659447, "answer_text": "看完大神们的回答，我的人生感觉一片灰暗。。生无可恋.jpg", "answer_votes": "10", "answer_comment": "​3 条评论"}
{"answer_author": "王建周", "answer_id": 26073606, "answer_text": "一、一些常见的机器学习算法1. 如果有背景，item和cf协同过滤的优缺点，如何从计算公式证明，各种情况的惩罚，hadoop上mr的实现，包括各种情况的惩罚。2. 线性回归的梯度下降和牛顿法求解公式的推导3. 贝叶斯分类器的优化和特殊情况的处理决策树的的训练……二、单机的算法如数据结构1.最简单的top n2 偶尔会有一些简单的poj3.数据结构三、系统设计，包括算法和工程系统1. 如一个热门微博排行榜等. ", "answer_votes": "8", "answer_comment": "​1 条评论"}
{"answer_author": "匿名用户", "answer_id": 43788121, "answer_text": "去面了下深圳的大公司，连续两个面试官问我朴素贝叶斯的推倒，忘记了，还有kmeans的，还有一些基本代码，没有一个写的自己满意的，估计给挂了", "answer_votes": "5", "answer_comment": "​3 条评论"}
{"answer_author": "匿名用户", "answer_id": 30461057, "answer_text": "1. 实现一个分布式的矩阵向量乘的算法。。。好吧 这个我学过 blabla讲了一堆 也不知道对不对 2. 最速下降法和共轭梯度法 wolfe条件 最速下降法和共轭梯度法的收敛速度如何判断。。。两种方法的概念答上来了 wolfe条件没准备到 收敛速度大概回答了一下 我印象中只记得共轭梯度的误差估计了   3. 约束优化的KKT条件 KKT条件在边界区域的搜索行为的物理意义是什么。。。KKT条件ok 物理意义没答上来 4. 实现一个分布式的topN算法。。。topN看过 不过分布式嘛。。。 就是追着你问 问到你不会为止5. 为什么可以使用logistic回归。。。这个我不懂。。。 好吧 hr让我去看看《离散选择方法》这本书。。。 算是学到了6. 你了解的机器学习算法有哪些。。。这个简单。。。7  选一个你熟悉的算法 详细推导公式过程。。。推公式我在行 不过hr貌似不感冒 8  一个实际应用的问题 因为没有背景 所以只好放弃然后就没有然后了还是好好看书吧", "answer_votes": "6", "answer_comment": "​7 条评论"}
{"answer_author": "知乎用户", "answer_id": 38442732, "answer_text": "七月问答ask.julyedu.com推荐一下July~", "answer_votes": "5", "answer_comment": "​3 条评论"}
{"answer_author": "知乎用户", "answer_id": 34719150, "answer_text": "看完这么多回答，我还是乖乖的做业务得了，理论基础不硬朗，什么推导公式之类的我肯定挂了，代码能力又不行，只能写写简单的knn之类的，而且没有任何速度上的优化的，哎，要跪了……", "answer_votes": "1", "answer_comment": "​2 条评论"}
{"answer_author": "数据嗨客", "answer_id": 250575886, "answer_text": "最近一直在做面试，谈一下个人的一些体会，给有志于机器学习的小伙伴们做参考。1.基本的算法要吃透，比如数据挖掘十大算法这个level的，理论上可以手动推导(白板推导)，代码上要可以熟练调包(案例分析)。2. 简历上的项目要熟悉，最起码要自圆其说。还有就是，简历上写算法要谨慎，要谨慎，要谨慎，重要的事情说三遍，不然就是给自己挖坑。3. 纯粹的编程题也不能落下，刷题还是有必要的。如果是Python, 那么pandas numpy 还有sklearn的常用函数和操作 还是要熟悉的。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "涂图", "answer_id": 219657793, "answer_text": "作为一家专注于图像识别和人脸识别领域的公司，机器学习是我们很重要的一块，所以在人才的选择上也会更加慎重，然而具体面试如何，就不清楚啦，一般都是CTO或者CEO直接面试哒。O(∩_∩)O哈哈哈~", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 217298428, "answer_text": "文武两个方面吧，武的方面：传统的bp,cnn，lstm 基本代码要能用python和c++写下来，他们肯定会问的， 传统的机器学习方式，随机森林、决策树、逻辑回归、svm、gbdt 贝叶斯也都有可能问，但是最讨厌的就是问工程经验，很多学生没有好机器，可能连块gpu的卡都没有，这个跟公司比不了，比如我之前去intel实习AI，什么都随便用，就是有钱。文的方面：不用跟面试官讲自己发过什么论文，人家不care，尽管那可能是你读博或读硕士的辛苦结晶，主要是这些人可能听不懂，当他们觉得在你面前讲论文没底气的时候，就会逼着你把bp推导一遍找找面子，也有可能让你推导一下lstm的前向后向,如果这些没有难住你，就会让你写贝叶斯公式，讲svm，这些都是我们面试时要面对的，不要抱怨背下来应付就行了。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "51AIjob", "answer_id": 175901789, "answer_text": "求问题主现在在干啥？", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 175742923, "answer_text": "近段时间也算了面试了好几家公司的机器学习相关的intern，最终结果算是开心吧。以我的感觉来说，小公司主要关注项目经历，大公司则会关注数学基础和数据结构，和对算法的理解，当然项目经历也是关注点，编程笔试题也会有，但不难。我觉得如果是秋季招聘想拿大厂offer，应该是不错的数学基础(主要是线性代数和概率论）数据结构  然后就是对机器学习常用算法的理解 一个或者多个顺手的编程语言 自己实现过的项目 当然论文或者kaggle之类的比赛是plus。我要加紧练功，希望秋招拿到大offer吧。因为有同学也玩知乎，避免装逼的嫌疑，匿了&lt;img src=\"https://pic1.zhimg.com/50/v2-893cbcfaf15485cc3c6927fe6a3c879c_hd.jpg\" data-rawwidth=\"918\" data-rawheight=\"598\" class=\"origin_image zh-lightbox-thumb\" width=\"918\" data-original=\"https://pic1.zhimg.com/v2-893cbcfaf15485cc3c6927fe6a3c879c_r.jpg\"&gt;", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "自兴人工智能", "answer_id": 272356314, "answer_text": "对企业来说，机器学习工程师需要能针对待解决的问题设计机器学习算法，测试和调节算法的参数使其最优。所以，需要掌握常见机器学习算法的原理、应用对象、算法参数影响。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "哦好吧", "answer_id": 266310351, "answer_text": "哦老婆老婆极品热11", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 258060416, "answer_text": "给大家提个醒：knn与kmeans不要搞混了。因为这个问题我们部门刷过一个本科top2硕博斯坦福", "answer_votes": "0", "answer_comment": "​1 条评论"}
{"answer_author": "火星土豆丝儿", "answer_id": 230842007, "answer_text": "还有leetcode也要准备 数据分析面试太心累", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "喵呜", "answer_id": 191057251, "answer_text": "看到一个面试官角度的分析：如果你是面试官，你怎么去判断一个面试者的深度学习水平？ - 知乎", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "Moujiker", "answer_id": 166780089, "answer_text": "看了大神们的回答，感觉自己还是回去写if else得了", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 129769162, "answer_text": "好大一个坑 ，要慢慢填了。专注AI领域的猎头。。。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "李团辉", "answer_id": 103525733, "answer_text": "正在找数据挖掘实习，学习啦", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "Nemo", "answer_id": 28380382, "answer_text": "面试机器学习相关岗位的工程师的一个好处是“不需要写代码，貌似大家都是用现成的包，谁也没写过……", "answer_votes": "10", "answer_comment": "​5 条评论"}
{"answer_author": "张雨龙", "answer_id": 222992402, "answer_text": "不知道该说什么了。。。。。。。。。。。。。", "answer_votes": "0", "answer_comment": "​添加评论"}
