{"question_id": "24289445", "question_text": "", "question_title": "怎样评价邓晓芒的学术水平？", "question_commet": "​2 条评论", "answer_number": "40 个回答", "question_followers": "728", "brower_number": "117,256"}
{"answer_author": "飞奔的马达", "answer_id": 119568365, "answer_text": "虽然非利益相关，但是几个回答中答主的态度实在有些让人看得不舒服。所以不吐不快。首先，无论从德国古典哲学的造诣，还是康德三大批判的翻译水准，邓老师作为国内的业界翘楚的地位是不容置疑的。特别是在本科学习需要自学哲学专业德语的阶段，邓老师翻译的纯批一直是我离不开的参照书，也正是这种德语原文对照着邓老师的翻译一起阅读的方法，对于本人专业德语的进步有着不可替代的作用。从这个角度上说，我无疑也是邓老师学术成果的受益者，感激不尽。但是，在其他回答中大有给邓老师戴高帽，无限拔高其学术水平的嫌疑。其中有两点最不能忍：第一，就是这种“知乎还没有人能有资格评论邓老师”的论调。很难想象任何一个有认真学习逻辑学的哲学专业学生会说出这种话，因为这种论断的内在逻辑其实就是“你行你上啊”，潜在的含义就是：什么？你敢说邓老师水平不够高？有种你去翻译康德或写本研究黑格尔的书啊？你算老几？！然而作为论证，这句话的水准非常之糟糕，具体糟糕在哪里可以自己体会。无论如何，邓晓芒老师有一个缺陷是显而易见，第三人称可得知的。那就是他几乎没有任何发表在国际高水平期刊上的研究成果。这就使得他和其他诸如叶峰，刘闯，徐明，朱菁，钟磊甚至唐浩等华人高水平哲学工作者的差距瞬间变得十分明显。任何无视这一点的，要么是无脑吹，要么就是基本不了解国内哲学这个小圈子的情况了。第二，就是强行将邓晓芒老师变成世界领先的康德和黑格尔专家。是的，邓老师德国古典哲学造诣极深，但是直接吹成“国际上其他学者的水准远不如他”，实在很难不让人相信有一种钦定的感觉。别的不提，就说两点。首先，本校就有邓晓芒老师曾经的研究生在此读博呢（康德方向）。要真是邓老师的水准全球首屈一指，何必选择出国读博呢？再次，即使是作为某一位知名哲学家的研究者，理论创新和再解读的能力也是必不可少的。如何让康德，黑格尔的理论在二十一世纪焕发新的活力，这一点恰好正是邓老师的软肋。相比之下，原法兰克福大学的Axel Honneth教授，就在黑格尔的法哲学思想中提取出了主体间相互承认，市民社会以及对社会契约论自由观的批判等要素并加以现代化，得出了他自己的承认关系和社会自由理论，并在英美主流政治哲学界有一定影响力。或许，这样的“黑格尔专家”更能显示出其学术实力和作为专家的价值。最后，必须再说一句。一代人只能做一代人的事。邓老师作为那个特殊年代走出来的知识分子，在他所能及的工作，即对西方传统哲学思想的引入与传播，之内，已经做得几乎无可挑剔了。而作为后来人，享有比邓老师当年要好近百倍的学术环境和资源，理应做得更好，超越前辈，做出我们这一代人该做出的理论贡献。", "answer_votes": "400", "answer_comment": "​28 条评论"}
{"answer_author": "卒子", "answer_id": 119122401, "answer_text": "正如上面学兄提到的，在其《西方哲学的文化背景》一文似也有逻辑上的问题", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "黄家蔚", "answer_id": 106798185, "answer_text": "他译的三大批判在很多年之内都是难以超越的。", "answer_votes": "3", "answer_comment": "​2 条评论"}
{"answer_author": "慧小田哲思学", "answer_id": 119142138, "answer_text": "前几天有幸采访到邓晓芒老师，主要也是关于黑格尔哲学的问题向他讨教，邓老也亲口说，他的「自否定哲学」主要来自黑格尔和马克思。虽然他已年近七旬，但那种从骨子里透露出来的睿智和为学术毫不妥协的决绝让人叹服，兹列举几例加以说明：问：您当初为什么想做德国古典哲学的句读工作？邓：我的初衷是，让德国古典哲学的爱好者和学习者能够像查字典一样查阅自己在学习过程中碰到的问题。「我的几部句读，是国内从未有人做过的一件细致的工作」，对于解决一些阅读中的疑难问题有非常实际的意义。问：中国是否有可能创立或发展一种自己的现代哲学以适应未来的生活？邓：中国人当前急需建立一种自己的哲学，这种心态可以理解，但性急吃不了热稀饭。我们学习西方哲学，当然还是为了这个目标，否则学什么呢？但首先你要把人家的意思搞懂，在这一过程中吸收本民族文化中缺乏的东西，训练自己的思维能力，为自己的哲学建构和思想建构打下过硬的基础。否则一切大话都是空话，妄自尊大而已。问：钱钟书先生说，「黑格尔哲学好比一间大房子虽然宏伟但不住人」，您怎么看？邓：钱先生说的都是聪明话。西方哲学只要是形而上学，岂止黑格尔哲学，哪间房子住人？那是住神的房子，我们中国人不屑于这种不能住人的房子，只说明我们没有信仰，只有小聪明。黑格尔的晦涩是出了名的，文德尔班说，能够理解黑格尔的那一代人已经死绝了，其实按照黑格尔自己的说法，就连那一代人也没有能够理解黑格尔的。现代德国人没有人愿意搞懂他，只想从他那里捞一点油水。但就这点油水就已经很了不起了，海德格尔、伽达默尔、哈贝马斯，法国的柯耶夫、萨特、梅罗-庞蒂、德里达，吃的都是黑格尔的饭。问：您怎么看现在一众年轻群体对分析哲学的热情？邓：分析哲学是“技术活”，比较适合于中国人的技术主义视野（科学技术“是第一生产力”嘛），而中国人的形而上方面在现代已经没落，它与西方形而上学格格不入，只能留给「对故纸堆感兴趣的国学迷们去提气了」。其实西方分析哲学的技术考量和西方形而上学自古以来并不冲突，而是相辅相成的，它是逻各斯精神的体现，在黑格尔的哲学中有广泛的运用。你读一读我对《精神现象学》的句读就会发现，黑格尔那种咬文嚼字的分析技术不亚于任何现代分析哲学家，但比他们更深一个层次，如果你到不了他那个层次，你会觉得他处处矛盾，但只要你突破这一层，你会看出他在逻辑上其实滴水不漏。所以他才敢于把自己的主要哲学著作命名为《逻辑学》，现代分析哲学虽然标榜自己是逻辑上的严格主义者，其实是数学思维，所谓数理逻辑就思维方式来说是数学而不是逻辑。我不反对年青人对分析哲学感兴趣，有更多的人受过分析哲学的训练是中国思想界的进步，但这毕竟只是工具性的，问题在于用这种工具要干什么。通常他们掌握了这门工具后便四顾茫然，发现自己学了一门“屠龙之术”，顶多可以用来打嘴仗，要不是有英美哲学撑腰，差不多要尽弃前学，另起炉灶了。但如果他们真能找到自己的用武之地，即用来进行康德式的“纯粹理性批判”和形而上学重建，进入到思辨理性的层次，那他们将是很厉害的。问：您的“‘自否定’哲学原理”是来自黑格尔么？邓：自否定哲学当然来自黑格尔，也来自马克思，我自己的创造其实很少，无非是想说得更透一点，尤其是立足于中西哲学和文化的比较的视角，这一点是前人所没有的。其实从哲学史上看，一个哲学家从来都是站在前人的肩膀上，自己能够贡献一个概念都是很了不起的，所以怀特海说整个西方哲学史都是柏拉图的注脚。黑格尔讲的，柏拉图、亚里士多德都讲过，他不过讲得更加系统一些，方法意识更强一些；马克思是接着黑格尔讲，他的辩证法小册子始终没有写出来，恐怕不光是没有时间，也是没有什么更多好写的。我比较怀疑那种动不动宣称自己前无古人、颠覆了前人哲学的庞大体系，这通常都是一些读书不多的浮躁之辈，读得多了你会发现，毕竟两千多年了，差不多所有的地盘都已经被别人占了，你只能接着别人的话讲。现在还有一个地盘没有人占，这就是中西哲学比较，这方面我们中国人有优势，但如果你的西学不强，这种优势也会变成劣势，变成束缚。我想让黑格尔的思想在中国生根发芽，长成一棵中国的大树。问：您怎么评价自己写的文章，以及互联网上对您个人无端的指责和谩骂？答：我历来写两种文章，一种是难懂的，纯学术性的，没有经过专业训练比较难以进去；另一种是通俗的，感悟性的，甚至文学性的，这方面，我比刘小枫、汪晖他们要通俗易懂得多。再就是大量介于两者之间的文字，我的目标不是迁就读者，而是要让读者跳一跳，够得着，实在够不着，也要让他们看得见，知道那里还有东西。但我从不故弄玄虚，也不掉书袋，我只希望那些认真读我的书或文章的读者能够比未读之前有所提高。至于那些网上的谩骂和指责，我从来没当回事，甚至有些得意。据说有国学教师在课堂上给学生开了一张“不要读的书”的清单，第一名就是我，这不是分明为我炒作吗？文革时最有名的书就是那些禁书，我其实还够不上那个档次，有人却把我抬上了那个级别。比如对我个人的批判文集现在至少已出版了两部共120万字了，我已经享受到当年胡适和刘少奇挨批的级别了，惭愧啊！问：黑格尔给您最大的吸引是什么？答：自由。为了讲清楚什么是自由，黑格尔几乎穷尽了当时的一切知识，建构了一个庞大的体系。人们都指责他想当上帝，但是，谁不想当上帝？不想当上帝的哲学家不是好的哲学家。当然，以为自己真能当成上帝的哲学家也不是好的哲学家，但至少你要试一试，这种尝试就造成了人类思想的进展。否则人人都假装谦虚，害怕自己搞一个体系会被后人推翻，于是干脆不搞体系，顾左右而言他，以为这样就不会犯错误，像后现代一样，那哲学就用不着发展了，被窒息了。况且，这种态度恰好是把自己当成了上帝，因为只有上帝才不犯错误。黑格尔兴之所至，一不小心搞成了一个封闭的体系，他是在舍身炸碉堡啊！我们真应该佩服他的勇气，他未必把自己当成了上帝，但他敢于让你们去推翻他，他也有得让你们推翻的，比起那些乡愿之徒来，他倒是个自由人。", "answer_votes": "195", "answer_comment": "​29 条评论"}
{"answer_author": "曲经纬", "answer_id": 133914395, "answer_text": "我是哲学系毕业的，邓老师的书我粗粗浅浅都读过（包括译著、讲演），首先必须要感恩的是，邓老师对于我们哲学系学生当初进入德国古典哲学（尤其是康德哲学）是颇有帮助的，而能否进入康德哲学，恰恰是区分专业哲学学习者和哲学爱好者的重要分水岭，从这个角度说，邓老师对康德不遗余力介绍、翻译、讲演与推广，直接或间接带领了许多哲学系学生登堂入室——而我现在看来，这也确实是哲学学习的一条正路。邓老师对于德国古典哲学传播、教育上，有着其他书斋中学者不具备的影响和贡献，这是不能否认的。此其一也。其二，这也是答案中一直争论的焦点，就是邓老师的学术专业水平，要评论界定一个人的专业水准，至少自己也要在这个领域中浸淫爬滚多年，对这个领域有相当的了解和深刻的思考，才能做出相应中肯的评价，我并非专业研究德国哲学，更不懂德语，当然不敢回应这么专业的问题，好事者自可从诸多论争中分析比较拾人牙慧。邓老师专业深浅我不清楚，但就我自身精神体验而言，他所理解的古典哲学，当是一条正路，从他的论文、讲演中，的确可以体会到启蒙哲学中“自我规定”的自律性主体的力量——虽然这只是就常识泛泛而论，但能让读者、学生，感受到这样一种思辨的力量和魅力，一定是学有所依托的。其三，我认为最为关键的一点，学术并不是相互比拼、实力较量的竞技性游戏，如果只进行一些技术性的衡量，那一代学人不可能拥有我们这代学人这样优越的学习环境，他们在最应该求学的年纪遭遇时代变革，单就学力积累而言，不可能比这代学人更好——这个当是普遍的现实。然而对于那代人，学术不是成名成家的终南捷径（何况并不捷），也不是玩弄概念的智力体操，而是对自身生命意义安放和时代问题回应的话语表达，因此，我记得看过邓老师的采访，他称自己“其实是搞中国哲学的”，如果我们仅仅限于将学术作为一种竞技的技术性游戏，是不可能理解这个话的，如果能够了解邓老师所寻求的那套启蒙话语，最终还是来回应中国最深刻的问题，可以避免很多意气性的争论与情绪化的表达。其实，读过邓老师这么多书，我最喜欢的一部，反倒与康德黑格尔没有直接关系，恰恰是他关于文学评论的部分——推荐《文学与文化三论》（《灵之舞》、《人之镜》、《灵魂之旅》三本的合集），我反倒认为这部书才算代表了其“学术的最高水平”。最高层次的学术，一定是那个时代精神的精华，思想的浪潮过后，无力者只能拾其余绪，偏安于象牙塔之一隅，不复感受到学术话语与现实人生的激荡震颤。因此，70后、80后的学人，比起邓老师那代学者，自然有他们求学治学的优越条件，当然也有他们无力的深沉悲哀。回归问题，我们要谈学术，就当知学者有思想家式的学者，和专家式的学者，专家再专，不是要回应一个时代最深刻的问题，单纯的专家不需要表达切身的反思，不必要升华自己的苦难，他只需要在越来越小的问题上知道得越来越多，我并不是漠视学术训练的必要性，但不得不说，这个层面再精再专，充其量叫八流开外的哲学工作者，连给最末流哲学家提鞋都不配。&lt;img src=\"https://pic2.zhimg.com/50/v2-ba4ed8bda8e273c3ca2b5e120e3e2984_hd.jpg\" data-rawheight=\"355\" data-rawwidth=\"250\" class=\"content_image\" width=\"250\"&gt;", "answer_votes": "35", "answer_comment": "​20 条评论"}
{"answer_author": "刘镇锐", "answer_id": 120319037, "answer_text": "给几位票数较高的答案做个注解：某些人（曾经的高票怎样评价邓晓芒的学术水平？ - 行之的回答）啊……不知道当代的华人高水平哲学工作者是哪些人就不说了，居然连百度都不会用……我瞅了一下他说的几个人，第一个是北大研究心灵哲学的教授，后面几个百度都百度不出来，也不知道是哪个犄角旮旯的小人儿。被拉出来凑数。用来回复的是目前的高票答案怎样评价邓晓芒的学术水平？ - 飞奔的马达的回答中的这个内容：&lt;img src=\"https://pic4.zhimg.com/50/f433fb623f474ce349eb35faeb04e46a_hd.jpg\" data-rawwidth=\"638\" data-rawheight=\"100\" class=\"origin_image zh-lightbox-thumb\" width=\"638\" data-original=\"https://pic4.zhimg.com/f433fb623f474ce349eb35faeb04e46a_r.jpg\"&gt;叶峰：叶峰个人主页刘闯：http://web.phil.ufl.edu/faculty/main/index.html?id=liu徐明：武汉大学哲学学院（不知道他的研究，没读过他的《符号逻辑讲义》，至少在中国学哲学应该听说过《符号逻辑讲义》这本书吧）朱菁：中山大学 -  朱菁\n钟磊：Philosophy Department, CUHK唐浩：唐浩这些就是你口中的“百度都百度不出来，也不知道是哪个犄角旮旯的小人儿。被拉出来凑数。”？……和这些“百度都百度不出来，也不知道是哪个犄角旮旯的小人儿。被拉出来凑数。”相比，他邓晓芒之流的该算是哪个犄角旮旯的大人儿，被拉出来凑数啊？……一个人把邓晓芒捧到天上去却不知道他们，还要称之为“百度都百度不出来，也不知道是哪个犄角旮旯的小人儿。被拉出来凑数。”……真是吓到我了……（在PhilPapers上可有一定数量的这些“百度都百度不出来，也不知道是哪个犄角旮旯的小人儿。被拉出来凑数。”的论文呢，而他邓晓芒貌似一篇都没有）……让我们看看被此人奉为神明的邓晓芒是如何点评Peter Singer（和整个英语哲学界）的：最糟糕的是，就是这些半吊子的黑格尔批评者却在英语世界中形成了一种批评的定式，几乎所有的人都在重复着比如说罗素在其《西方哲学史》中所定下的调子；而且这同时也影响到那些只读英文文献的中国学者们，他们中百分之九十的人一听到“黑格尔”三个字，就要露出鄙夷不屑的神色来。加上这些年来我对以英文出版的康德研究越来越失望，我简直怀疑同出于日耳曼语系的这些英语世界学者是否还具备真正把握德意志思维方式的能力。 目前这本小册子的作者彼得•辛格并不是什么知名的大人物，毕业于牛津大学的这位澳大利亚学者的确也不想摆什么大人物的架子。且不说他邓晓芒是否有资格点评整个英语哲学界好了……让我们来看看Peter Singer是谁……Peter Singer、Peter Singer、Peter Singer、http://www.biography.com/people/peter-singer-39994、Peter Singer……“并不是什么知名的大人物”……真是个好点评啊……如果他邓晓芒有资格点评Peter Singer乃至整个英语哲学界的话，那我们点评他也一点都不奇怪……更何况本来英语哲学界就没有什么点评Peter Singer的资格问题……任何一个学习哲学的人，连点评Peter Singer的资格都有了，还点评不了他区区一个连顶刊都没发过的邓晓芒？……这人的答案里还有这么一段：1,从感情道义上说，论语里面讲“君子有三畏，畏天命，畏大人，畏圣人之言。”邓老师就算称不上圣人，但也无论如何能称得上“大人”了，问这种问题的人是什么居心？？除了“无知者无畏”，我不知道该怎么理解了。一个敢于点评刘闯、徐明、朱菁、钟磊、唐浩为“百度都百度不出来，也不知道是哪个犄角旮旯的小人儿。被拉出来凑数。”，敢于支持邓晓芒说Peter Singer“并不是什么知名的大人物”，敢于支持邓晓芒说“怀疑同出于日耳曼语系的这些英语世界学者是否还具备真正把握德意志思维方式的能力”的人……按照他自己这种说法，又是什么居心？……我学习伦理学的课程的时候是经常惹教授生气的……不过让我们教授生气得最厉害的一次是我们居然在讨论的时候想要去查查看其他哲学家的意见……用他的话说——其他哲学家是怎么理解的关你P事，关我们现在在讨论的问题P事，和你自己深思熟虑得出的思想相比，他们的算个P……我觉得，这年头，连一点这种精神都没有的人，还学个P哲学呢……", "answer_votes": "36", "answer_comment": "​38 条评论"}
{"answer_author": "我的心不是席子", "answer_id": 120363553, "answer_text": "「先知覺後知，先覺覺後覺」。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "切力哦", "answer_id": 34616824, "answer_text": "稍微偏开只是提醒一点。我本身对从欧陆传统出来的思辨文化并没有什么偏见，但我对于不少热心于复杂思辨的人确实戒备心挺大的。动物包括人类，自古以来就有通过追求复杂和无用的东西来彰显自己的优越，正是嫁接在这种历史逻辑上才延伸出如艺术、宗教这些东西。而思辨哲学又与艺术和宗教有着非常紧密的联系，使得从事这方面的人很容易赋予一些单纯是技术或是直觉的东西以多余的意义和「身份象征」。举个很常见的例子，当一个人试图观察世界时，他很容易会意识到世界万物之间的互相作用和联系，如果他没有被在先的意识教条控制住，这个人就很容易从中直觉到一种万物一体的可能，从而把世界包括自己看作一个和谐的整体以构想出一种天人合一与世界化为一体的境界。而从这种一元论出发回归到个人就很容易发展出一种以反抗理性建构而追求人之本性的伦理学立场，也就是现在多少已经有点庸俗化了的所谓「真性情」。拥有这种体验往往是一个人能够进行独立思考的标志，而达到这个层次的我见过最小的有00后，最老的也有三四十岁的样子。然而拥有这种独立性仅仅是思考的第一步，在这之后都是个人具体的选择了。我非常反对的一类是那些就此萌生出一种优越感将其视为一种「智慧的象征」然后把自己的追求永远限制在这种直觉中，然后不断通过类似的思辨加强这种优越感的人。很多深受思辨文化影响的人都掉进了这种＂智慧陷阱＂里，想来真是蛮可惜的。", "answer_votes": "2", "answer_comment": "​4 条评论"}
{"answer_author": "怀剣", "answer_id": 120330152, "answer_text": "利益相关：中山大学本科生，觉得朱菁老师学术和人品都很好所以本回答戾气很重。I'm ANGRY！！我瞅了一下他说的几个人，第一个是北大研究心灵哲学的教授，后面几个百度都百度不出来，也不知道是哪个犄角旮旯的小人儿。被拉出来凑数。我真服了。贵邓不愧是身为国师的城里人，从不用跑去国际期刊发论文，更不用到处跑着开学术会议，仗着研究康德的一点功底，在城里喊一喊第三次启蒙就行了。连带着贵邓的粉丝们，也在城里无限风光。我大山中学这犄角旮旯的朱菁唐浩确实挺辛苦的，村里没啥好期刊，发论文一般要出村去发，要参加个什么学术会议吧，也还是得出村。唐浩之前在武汉大学任教过，不知道能不能沾一点你邓“城里人”的风光。至于Peter Singer，那就连村都不是了，那是蛮夷之地的家伙。蛮夷之地，自然是更比不上城里了。对不对？其次，至于某人指出邓老师没有发过顶级文章，所以学术水准有限。呵呵，如果学术水平等于学术影响力。学术水平当然不等于学术影响力啦。我老家山里有个农民，水平高得突破平流层，你邓老眼昏花抬头看不清。他没在期刊上发过半篇文章，但他时不时就从外面捧一些哲学书回来，用本地方言读给我们听，我们都很高兴。他还会把他写的文章贴在村头的公共栏上呢~我们乡最懂哲学的就是他啦，你们说他厉害不厉害~邓老师认同马克思的观点，认为黑格尔哲学的基础是《精神现象学》，我们学校那位认为是《小逻辑》。想评价他们，至少请把这两本书撸过了再谈吧？知乎上几个人看过？读过？读通了？读懂了？叶峰刘闯唐浩朱菁徐明，你读过他们几个字了？徐明的《符号逻辑讲义》，知乎几个人读完了刷完习题了？一边说别人不够格评价，一边拿机关枪扫射其他学者，下次能不这么干吗？", "answer_votes": "24", "answer_comment": "​11 条评论"}
{"answer_author": "陈昆廷", "answer_id": 30404032, "answer_text": "在学术期刊上看到过邓老的一篇论文，其中有两段话让我有一种醍醐灌顶、豁然开朗的感觉，当时就给摘抄下来——“好不容易建立起来的信心一旦被摧毁就无所适从了，这说明你创造力贫乏，你的想象力受限制，你的胸襟不够开阔。你要有那种开阔的胸襟，你要能容得下犯错误。自己犯错误没关系，你不要满足于某些具体的命题和概念，你要给未来的可能性留下足够的空间。所以我们相信某一个观点，但不要迷信，这才是科学的态度。不要以为这个才是唯一的标准，然后就用它来衡量一切，很可能你那个标准是错误的。”“我知道这个是自欺，但是我必须得相信，我必须要相信，不相信我会什么也做不成。做任何事情都要有一定的信念，都要有一定的信仰，我要相信它能做成才能做成，但是我又知道我的这种信念是有限的，我的知识是有限的，我的信仰可能不是那么回事儿，但是我现在需要有个信仰，所以我就去相信它。”由此我们可以一定程度上地看出邓老的学术态度。上面有大神自称不及邓老百万分之一，而我这个门外汉就更是亿万分之一都怕赶不上了。才疏学浅，不敢贸然评论，这个回答只是给大家提供一个了解的角度罢了。（^_^）同等专业人士回答。_(:з」∠)_", "answer_votes": "43", "answer_comment": "​5 条评论"}
{"answer_author": "匿名用户", "answer_id": 58844842, "answer_text": "看你指的学术水平是什么了。如果说的是翻译水平，邓老师对康德的翻译应该算是国内顶尖水平。如果说是对哲学的了解程度，邓老师在德国古典哲学这一块可以说是国内一流水平，国际上至少也是中上水平。但如果说是哲学水平，邓老师在哲学上应当是没什么太大贡献的。国际上排名前列期刊上发文数量目测为零（前50的应当是没有一篇的，具体数据没有详细考证），也没有什么有影响力（国际上）的著作。说白了，邓老师研究的主要是康德黑格尔哲学，研究的再透彻始终还是比不上西方的本土哲学家。哲学做的好坏与否很大程度上取决于你写的东西有多少哲学家在讨论，在研究你的想法，但邓老师却没有什么引起了国际哲学界注意力的作品，大多数还只是停留在国内学者。", "answer_votes": "20", "answer_comment": "​59 条评论"}
{"answer_author": "書風月", "answer_id": 67562436, "answer_text": "咳，不要像个傻瓜一样一会儿评价这个一会儿评价那个，邓老师的以下三篇文章如果你能细细读一遍，收获要比问或者回答这个问题大多了。晓芒学园宣言《回应底层的呼唤：中国当代的第三次启蒙》邓晓芒：评刘小枫的“学理”邓晓芒：究竟是“世界一流大学”还是“世界一流衙门”", "answer_votes": "17", "answer_comment": "​7 条评论"}
{"answer_author": "3rdAn", "answer_id": 30364122, "answer_text": "把一套三大批判翻译得如此好，就已经是功德无量", "answer_votes": "57", "answer_comment": "​2 条评论"}
{"answer_author": "李思凡", "answer_id": 57820967, "answer_text": "赞同@陈昆廷。我就是看了邓老师的《灵之舞》之后把邓老师近些年写的所有的书几乎都买来读了。甚有启发。帮助很大。读邓老师的书，让我的思维能力得到了巨大的提升。在配合巨大的阅读量，我的思维能力从比一般同学强很多提升到直接碾压我认识的绝大多数人。高考的时候作文也是借鉴了邓老师的文章，得了高分。邓老师的文章是我读过的最具有说服力的文章。尤其是与对手辩论的文章，玩弄另一方不费吹灰之力啊。不但把自己表现得谦谦君子，还不知不觉的给对方都贴上气急败坏的小人嘴脸的标签。最绝的是一点诡辩都没有。", "answer_votes": "9", "answer_comment": "​8 条评论"}
{"answer_author": "匿名用户", "answer_id": 145643766, "answer_text": "&lt;img src=\"https://pic4.zhimg.com/50/v2-9f183bd995f926dde63d9943e477f6ff_hd.jpg\" data-rawwidth=\"540\" data-rawheight=\"960\" class=\"origin_image zh-lightbox-thumb\" width=\"540\" data-original=\"https://pic4.zhimg.com/v2-9f183bd995f926dde63d9943e477f6ff_r.jpg\"&gt;在这老邓没有明白黑格尔的个别性是什么意思告诉你们吧老邓胡扯普遍与个别的统一是概念黑格尔这里说不能当个别对象，而是普遍的个别，就是概念上的个别，概念的个别本身就是普遍，个别性是包含普遍性的，老邓这里胡扯。概念三个环节，普遍，特殊，个别都是普遍性的概念。所以黑格尔说普遍的个别，根本不是所谓普遍与个别的结合。看到这里我知道老邓对逻辑学理解到什么程度，概念本身三个环节是非常难的。概念是普遍和个别的统一，扯我后面不看句读了，看示要跟书，只在个别难点参考一下句读，太花时间了，烦死了。第三卷快读完了，学习了不少，感谢老邓，暂时又要拜拜了，没有让人一次读完的欲望，读读停停翻翻…… 普遍，特殊，个别，我的理解普遍是无限，后两者是有限。但在概念里，因为相互渗透，它们三者都是真无限。普遍是共相，中介，特殊是特定形态，阶段，个别是两者统一，何新理解准确，他们可以对应不同层次，从纯概念上来说，何新的历史概念是最好的例子。如果分开看，普遍是坏无限，特殊与个别是有限。但它们三个放在一起，做为推理的过程，共同隶属于概念的情况下，每一个又都是真无限。普遍是模型，特殊是特定条件，个别是特定条件下根据模型制作的事物，比如圆圈公式是普遍，半径就是特殊，具体圆就是个别。半径一米的圆是个别，但是对应感性事物他是普遍的，一米的圆是铁的，木的各种可能。普遍，特殊，个别在感性确定性与知觉部分对应，感性确定性就是认识个别而达到普遍，两者结合就是特殊，所以知觉认识的是特殊，事物的属性。精神现象学是符合概念的转换的，知性达到返回自身的同一性，实际上进入本质认识。不过是抽象的同一，对应抽象自我意识，后面发展到自我意识就是意识与同一的同一。真理是个别通过特殊而与普遍相同一。逻辑是对精神现象学的严格化抽象，最好再去改造精神现象学，里面对应关系非常明显，理解了就发现其实逻辑结构一样，只是精神现象学比较具体，很多文化背景知识。半径一米是一个确定的圆，是圆中的个别，但是还是一个普遍，所以我说老邓说概念是普遍与个别的统一是扯谈。具体概念，个别就是具体概念，对应无数个别的感性对象，圆是抽象的，没有落实大小，一米的圆是具体的，圆可以随意想，一米的圆是固定的，现实经验做一个圆门，要落实。你如何测量一米？就要确定半径，因此需要具体概念，不能只是圆的就行，这太抽象，现实是有效即可。存在本身不存在，圆本身才是现实中比如一个圆桶的真实存在，是其真理所在，哲学探讨的是这个。真实不真实也看从那个角度说，圆筒可以消失，圆的概念具有持久性，站在感性存在来说，事物是真的，站在设计理念上来说，模型，概念是真的。设计，理念比具体单个产品值钱多了不懂的人画不出圆的，掌握理念才能更好实现，没有理念只能模仿，照葫芦画瓢，没有创新。真正的圆谁也画不出来，当然上帝可以……黑格尔在《哲学讲演录》（第4卷）中说：对物理性存在的概念空无性解构，是进入哲学思维之门的第一步，是理解哲学思维的起点。他曾经讽刺而幽默地说：不理解这种物理虚幻性的人还不如一头驴，因为驴并不相信物理世界之存在的真实和绝对性。如果面对一槽草料，驴子不会执着于认为它们的物理存在是永恒的，它会吃掉它，使得这些草料变成“无”——从而证明这种物理存在本体上的虚幻性。画出来的圆就像这堆草料，现实中一个圆桶的存在也如同这堆草料，因它的虚幻性而最终成为“无”，这么想，所有东西都是草料……&lt;img src=\"https://pic8.zhimg.com/50/v2-169dc79f3b5786fe4170700697295a28_hd.jpg\" data-rawwidth=\"540\" data-rawheight=\"960\" class=\"origin_image zh-lightbox-thumb\" width=\"540\" data-original=\"https://pic8.zhimg.com/v2-169dc79f3b5786fe4170700697295a28_r.jpg\"&gt;还有一点阅读，精神现象学，坚决拿下，让老邓吹不起牛逼来！学习他，然后超过他更我想明白了，邓就“概念是普遍和个别的统一”，这种说法是对的。因为他说的个别是推理之前的个别，即空洞的自身抽象同一性，即大多数人知性里的个别。些时，还不是经过推论后的已形成具体概念里的个别。只要做以这样的一种区分就清楚了。别外，个别只有通过特殊才能与普遍相同一，从而形成具体的概念。但邓不说这一中介过程，直接就出结果也是可以的，联系上下文是一种更简洁的正确说法。普遍的个别 ，只是说的不是那么好，普遍就是一个限制词，说成普遍与个别的统一反而让人误解。就是 普遍的个别，个别在自身中认识到或达到了普遍，就是这样的个别，黑格尔就叫做普遍的个别。自我意识的阅读麻烦在于宗教背景，老邓帮了我这一点老邓的书只是一句一句字面意思说说，逻辑性与思辨性精华丢失了不少黑格尔最精致的就在于里面的思辨与逻辑，这是真正的思维智慧老邓能够引领我们到达哲学的门口，这已足够。剩下的就是我我们自己的事情了，不能让老邓代替我们自身去哲学思维。每个意识的提升究竟是如何提升的，老邓还没有搞得特别清晰，可能还没有特别突出这些，主要是纯去努力搞懂黑格尔的每句话的意思。从老邓的翻译以及所有句读来看，他对经典有迷信，对西方哲学很迷信。什么康德一个字都不能改，当然他可能只是想原样解读下，管他们本人的思想是否完善，表达是否好，所以是完全本着一种研究哲学的态度，比较少哲学家的态度。精神现象学下册表达就比较不清晰，上册表达也只有前面几章还可以，还不是很严格表达，比如比较多，实际上意识进展没有搞得很清晰，拖沓重复不少，你们看过的应该知道，意识形态为何那么过渡是有些模模糊糊的……读句读让人立马进入苦恼意识，句读关于苦恼意识大多是废话，只需要一句：读句读的意识状态就是苦恼意识，OVER思维的普遍性与各种啰嗦的矛盾让人想看精神现象学，又畏惧繁琐，不看又担心普遍性丢失，这就是苦恼意识，在普遍性与个别性之间无法取舍，两者不统一，哲学思维的普遍与表达的清晰简洁不能统一。个别性没有普遍性贯通，普遍性理解为纯粹的精神与普遍的逻辑，而他的表达确实不够纯粹普遍，老邓的表达是个别的，我们读者的意识恰好要去读，不能不理他，不理他是斯多葛派哲学或者是怀疑派，随意否定老邓学术成果。所以苦恼意识就是不能舍弃，但是又得不到统一，对象是精神的，在对象是找不到普遍与个别的完美统一，多少有些苦恼，苦恼意识是意识到自身的矛盾的意识，是求而不得的意识。投身句读，这句读就是我的意识，句读的不统一，就是我的意识的内部矛盾。而主客体合一就是灵性了。物质世界就是主客体分离的，苦海的本质就是分离的痛苦。我要写一篇博文，借批句读说明苦恼意识，“是”作为逻辑原子，剪断了人和神的脐带，却点燃了文明的星星之火。这里我对苦恼意识理解又深入了一层……理解了就超越了解决办法就是快读与选择性读苦恼意识后是理性了，快乐过后恢复理性。提升个别到普遍，肯定自己的个别性与普遍性的统一，超越老邓也许句读志不在此。黑格尔哲学所包括的存在论、本质论、概述论三部分，大致说来，可概括为，存在论说的是事物自身即自身，即事物的一种独立性，它以直接性的方式显现自身，因此与世界之间的关系是一种感知的方式；本质论说的是一事物的存在依据于他物，是一与多、自身反思与他物反思的关系系统，建立了试图理解世界的一个观念系统，因此它与世界的关系是间接的理解的关系。概念论说的是一事物的存在，不是由他物，而正是由自身所决定的，但这种自己决定自己是间接的，但不是以他物而是以自身为中介建立起的，一个自由的世界，除此这外，别无二物。因此，它与世界的关系是绝对地自己与自己的关系，从而是自由的关系。打字好累，一点心得于大家评说。", "answer_votes": "3", "answer_comment": "​6 条评论"}
{"answer_author": "陈博泉", "answer_id": 129051827, "answer_text": "看过他写的几本书，厚脸皮说两句。哲学入门的指导大家，这是称赞。但是你看第一本还行，看到第三，四本就没味道了而且出的书(比如句读系列)是演讲的录音，跟文本严谨性差几个层次。这不是说他学术水平不行，可能是他还未展现他的水平也说不定对于我国哲学的一些分析是从他那里受教的", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "梨李", "answer_id": 30352770, "answer_text": "第一次答题，邓晓芒老师本来是武大的老师后因在武大遇到了学术的巨大阻力及其妻子的关系等来到华科。我不是哲学班的，虽然同在人文学院，也只有幸听过邓老一节课，还是在法学院蹭的哲学导论，属于很基础的平台课，就是老师泛泛而谈，学生随性听听那种，但仍然觉得深有感悟。哲学是一门很深奥的艺术，邓老是有其个人学术魅力的好学者，他对中哲的研究或许不深刻，但在西哲尤其是德国古典哲学方面，造诣精深，在美学研究方面也颇有建设，在如今国内，真正的美学研究几乎没有，对中国人来说，从古至今都没有美学这个概念，也并不重视美学，邓老的《西方美学研究史》可以看一看，是美学概论课的教材。据说真正的哲学家都是疯子，大概吧，读老庄也觉得自己都要变成疯子，更何况像邓老这般沉迷学术研究，如果真的要用什么修饰词去形容邓老的学术水平或是用什么标准去衡量，也许就要让专业人士来评判了，抑或无法评判，毕竟在现下国内和邓老在同领域学术水平相当的人，甚少。以上，一个不专业人士的回答，期待更好的解释。", "answer_votes": "25", "answer_comment": "​21 条评论"}
{"answer_author": "Jessie zou", "answer_id": 30989440, "answer_text": "我在看纯批，作为一个自学者，是听了邓晓芒的课，才一步步前进。我没有资格评价，但觉精深博大。", "answer_votes": "2", "answer_comment": "​4 条评论"}
{"answer_author": "星星宋", "answer_id": 81779050, "answer_text": "水平尚浅，但哲学入门时曾读邓老师的《西方哲学史》，至今仍觉发人深省。邓老师的哲学是怀有深厚人文情怀的哲学，深深感动于他对真理的思考。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "乘桴", "answer_id": 106796841, "answer_text": "邓晓芒教授的学术水平在吾辈看来实在渊深难测，我不敢妄加评判。因为我不是哲学专业学生，所以对于他的著作和翻译的作品大多不曾读过，只看过他写的《西方美学史纲》，读完觉得受益匪浅。邓晓芒教授令我印象最深的事却是和武大的郭齐勇教授的“撕逼”，邓晓芒和郭齐勇都是令人非常喜爱的教授，他们打了很多年的笔墨官司，争的是《论语》中的一句话：父为子隐，子为父隐，直在其中矣。这句话是孔子说的，父亲犯了错误，孩子包庇不告发，孩子犯了错误，父亲也包庇孩子，亲亲相隐，互相包庇，孔子认为“直在其中”，无可厚非。郭齐勇教授认为亲亲相隐有其中的道理，是儒家伦理中重要的一部分，强迫人们大义灭亲反倒不妥，亲亲相隐与现代法律也是相容的。郭齐勇本身就是武汉大学国学院的院长，关于此问题写的文章都非常精彩。邓晓芒教授正面硬刚，他认为这是对法制精神的亵渎，即便是亲人也不能互相包庇，并给出了许多学理扎实言之有物的观点。两方可谓都很有道理，一直争论不休，诞生了《也谈“子为父隐”与孟子论舜》、《再议“亲亲相隐”的腐败倾向—评郭齐勇主编<儒家伦理争鸣集>》、《对柏拉图<游叙弗伦篇>的一个惊人的误解——评郭齐勇主编<儒家伦理争鸣集>》等等一系列非常精彩的文章，二人前前后后你来我往，也卷入不少其他学者加入这场笔墨官司，以至于他们在杂志上公开辩难的文章就有30多篇。这个我不太好评价对错，看完那些文章，只是觉得二人引经据典的辩论非常好看，作为一个打辩论的人，看到这么高质量的笔墨官司也是很令人激动的。他们从2002年开始撕了十年。这件事推动了我国法制建设，后来国家也采纳了郭齐勇教授的意见，在2012年修改了法律条文。现行的《刑事诉讼法》中作出规定：《刑事诉讼法》第一百八十八条 经人民法院通知，证人没有正当理由不出庭作证的，人民法院可以强制其到庭，但是被告人的配偶、父母、子女除外。也即现在法律规定，人们对于亲人犯罪，可以选择不出庭作证，而法律并不能强制你。这避免了人们陷入“大义灭亲”的道德困境。这个问题其实还有待进一步讨论，我在这里不展开，毕竟两位教授已经展开了几十篇文章，有兴趣的同学可以去看看，真的是非常精彩。以前诸葛亮说，儒有君子小人之别，小人之儒专攻翰墨，笔下虽有千言，胸中实无一策，对国家起不了任何作用，而君子之儒，泽及当时，名流后世。二位先生本都不是法律专业的，可是为中国法制操透了心，十多年时间引经据典探讨法理问题，最后也促进了法制建设。这大概算是很了不起的君子之儒了。", "answer_votes": "30", "answer_comment": "​14 条评论"}
{"answer_author": "赵洛颉", "answer_id": 30402594, "answer_text": "谢邀 虽然我是华科哲学系的学生，但因研究方向不是德国古典哲学，故与邓老师接触的机会不多。说到评价，觉得自己的学术水平不及邓老师百里之一毫，故谈不上有可以评价的资格。收到邀请的时候没有贸然回答，而是向几位系里外哲方向的同学、学长，或是向邓老师的研究生与博士生询问了一下（几乎没有人用知乎，故没法邀请他们作答），得到的答案均是自身水平有限评价不了…有时间再来填坑", "answer_votes": "8", "answer_comment": "​7 条评论"}
{"answer_author": "匿名用户", "answer_id": 122270595, "answer_text": "&lt;img src=\"https://pic4.zhimg.com/50/v2-1992b70a0558fd2a3d388ca4f4f65dd9_hd.jpg\" data-rawwidth=\"600\" data-rawheight=\"564\" class=\"origin_image zh-lightbox-thumb\" width=\"600\" data-original=\"https://pic4.zhimg.com/v2-1992b70a0558fd2a3d388ca4f4f65dd9_r.jpg\"&gt;&lt;img src=\"https://pic3.zhimg.com/50/v2-4a4114366502f0b3cfdc40fbb1860655_hd.jpg\" data-rawwidth=\"300\" data-rawheight=\"241\" class=\"content_image\" width=\"300\"&gt;", "answer_votes": "10", "answer_comment": "​2 条评论"}
{"answer_author": "匿名用户", "answer_id": 30384705, "answer_text": "当时看周国平翻译尼采的作品，同时看邓晓芒翻译黑格尔的作品，觉得周国平弱爆了，就是这种感觉～", "answer_votes": "13", "answer_comment": "​4 条评论"}
{"answer_author": "千手关叔", "answer_id": 147657354, "answer_text": "好话，诸位在此已说甚多，并不过。他对国内民众启蒙是有贡献的，让许多非哲学专业的人（不限于青年）能更准确、通俗地理解德国古典哲学。坏话，我来说几点，也不算过。以下内容改自拙文：知乎专栏一、自以为是马后炮他在《纯粹理性批判句读》中，把物自体解释为逻辑假设出来的抽象概念。有些自学的人就拿着这权威根据，把康德哲学完全当成主观唯心主义，乃至唯我论。可康德自己怎么说的？“我承认在我之外有物体存在”。（[德]康德：《来形而上学导论》，庞景仁译，商务印书馆1997年版，第50页）“外在的很多属性并不属于自在之物本身, 而仅仅属于自在之物的现象。这些属性在我们的表象之外没有单独的存在性, 这样说并无损于外物的实际存在性”。（同前书，第51页）若物自体是概念，就在理性中，如黑格尔《逻辑学》上卷导论中所说，理性居然不能认识理性的东西？我在第一次见他的讲座结束后问他，为何把物自体解释成抽象概念，他哈哈一笑，说，这就是康德的本意。他在2008年11月8日的讲座上，大谈“自我意识的自欺本质”，但这观点和主要论证，萨特在《存在于虚无》中早有详述，并贯穿全书。但他通篇没有提到萨特对此的贡献。他是连这么有影响力的著作，这么与众不同的理论都不懂，还是明知自己所述和前人雷同，却故意不提前人，只吹自己？那次讲座上，他扬言要建立“自否定”哲学体系。我在第一次见他的讲座结束后问他，这个体系何时建立好？他又是哈哈一笑，答，正在建立……二、见风使舵墙头草他当年写过不少关于马克思哲学的论文，对马克思的哲学颇有研究，并赞赏有加。尤其是《马克思的人学现象学思想》和《马克思论“存在与时间”》，对国内而言，是很有创见的。让人以为，他日后会从这一视角，在理论上进一步发展马克思的哲学。但时至今日，再无后文。去年初，他在《关于黑格尔〈精神现象学〉的几个问题》一文中，又宣称要建立一门“马克思主义的精神现象学”，说马克思“第一个完全把握了黑格尔的精神”，甚至说“真正能够读懂《精神现象学》、完全把握的，除了马克思之外，至今还没有。”且不说若至今只有马克思真正读懂《精神现象学》，那么他邓晓芒就还没读懂，又怎么知道马克思读懂了；就说去年下半年，他写了篇长文驳斥刘小枫的“新国父论”，对马克思主义的态度，和之前简直判若两人。对此，我在本科毕业论文的注释中有详述：但2013年因“宪政”引发的论战中，他狠批刘小枫（参见邓晓芒：《评刘小枫的“学理”》），认为刘小枫说“文革”理念之罪，可追究到西方启蒙思想，是错的；并用毛泽东同志“十月革命一声炮响”那段话，暗指是马列主义的错。他说，卢梭不会主张人民随时可以推翻自己制定的宪法，并引用卢梭所言（参见[法]卢梭：《社会契约论》，何兆武译，商务印书馆2003年版，第158页）证明，卢梭设计了防止人民代表滥用职权的程序；但由于法国当时被国外军事干涉，国民也未经民主程序训练，所以“学理和法理上说”，不能怪卢梭，“换一个环境，例如在美国，卢梭的理论就得到了更好的实行。”还说，刘小枫把自由主义鼻祖霍布斯解释成专制思想，也是错的；又引用霍布斯所言（参见[英]霍布斯：《利维坦》，黎思复、黎廷弼译，商务印书馆1985年版，第十一章。）证明，霍布斯认为人民有“天赋自卫权”，并解释说，主权者若不能保卫人民，人民就无义务服从主权者。实际上呢？法国大革命主要问题是人民滥用公意，而非人民代表滥用职权，引用卢梭那段话作甚？因为客观环境，不能怪理论本身，这听起来像是他前边讽刺的马列主义里的历史唯物主义呢？但历史唯物主义并不否认社会意识反作用于社会存在。他文中也提到了其推崇的康德道德哲学，难道康德道德哲学主张，应把责任都推给“环境”？（参见[德]康德：《实践理性批判》（注释本）第一部分第一卷第一章，李秋零译注，中国人民大学出版社，2010年版。）而美国主要落实的其实是孟德斯鸠的“三权分立”，卢梭反而是反对把主权分割成南北战争前美国那样的联邦。（参见前引卢梭书，第33页）至于霍布斯，从霍布斯认为人民有天赋自卫权，能得出那样的推断？是不是进一步还能推出，人民有权推翻主权者？多看几页书（参见前引霍布斯书，第十八章，二、四，第134-136页。）再论断也不迟吧？总之，从邓晓芒这篇“雄文”可以看出，他已从理论上的马克思主义者，蜕变为不懂装懂，还乱叫乱骂的“公知”。别怪我言辞不敬，看看他那篇文章里都是什么言辞，什么口气？在我第一次见他的讲座上，他也说自己和“公知”是友军，战场不同而已。他那篇文章里，驳斥刘小枫企图把自由主义鼻祖霍布斯，说成也搞专制的；但我去听的这三次讲座，他都说霍布斯搞专制。", "answer_votes": "3", "answer_comment": "​7 条评论"}
{"answer_author": "左右", "answer_id": 119310303, "answer_text": "以民哲的角度看下就是：恍若天人(我的评价)", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "甘庭", "answer_id": 132442757, "answer_text": "        邓晓芒先生主要的研究方向是德国古典哲学，但是对马克思主义哲学的研究也非常深，而且也一直关注马克思主义哲学新动向，胡塞尔现象学，中国哲学也有涉猎。        古典哲学方面，你要以哲学家的标准来说的话，邓晓芒“自己的创造其实很少，无非是想说的通透一些”（邓晓芒语）。但是邓晓芒的著作中清楚了很多人对黑格尔哲学的误解（参照《思辨的张力》），要知道黑格尔哲学是非常难正确把握的，太多人没有理解黑格尔就反对黑格尔，对康德黑格尔的解读可是说是的中国对德国古典哲学的理解上了一个台阶，翻译了康德“三大批判”，这些都属于学术贡献，是不是学术水平呢？也许你觉得不是，但是我认为这能直接体现一个人的学术水平，一个有学术水平的人才能做出学术贡献。        学术方面如果你指的是理论创新的话：邓晓芒在中西方哲学比较方面做出了贡献，将黑格尔哲学与中国哲学比较提出中国这些缺少努斯精神和罗格斯精神，提出建立马克思主义“人学现象学”，从“实践”角度建立美学观 ，对儒家文化进行现象学还原等等，都是他的学术水平的体现。大家可以看看邓晓芒的著作《实践唯物论新解：开出现象学之维》", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "符号与本质", "answer_id": 288005517, "answer_text": "@刘镇锐  已把我拉黑，我无法回复。（说来奇怪，把我拉黑还回复我）我只好另开答案尝试交谈。我对你本人没有意见，不要会错意。另外，我非邓粉，更非黑粉。在我眼里，没有大师，不要以你的眼光来评价我。我最多算半个康德粉（我也经常批判康德）。另外，人身攻击不好，真的。你说你喜欢批判康德，我倒是很希望拜读大作，能增长一下我批判康德的经验。（我看你说黑格尔根本不值得批，Peter的还有资格被你批一下，我也很好奇你的批判，真心求教。）你的答案我觉得槽点也是有点多，我怀疑你到底有没有看过Peter Singer的《黑格尔》。我觉得你不是在黑邓晓芒，你是在黑Peter Singer。首先，你第一个搞错的地方，邓晓芒是序言作者，译者是张卜天。其次，你断章取义。邓晓芒对Peter的评价很高，他在序言里说的原话:“他对黑格尔的理解远超当代英美学者”，“这本小书在精确性上其实胜过许多大部头的专著”，“尽管谦卑地承认受益于牛津的那些权威大师，他在这本不到六万字的小书显现了不少独特的见底。”怎么到你这里，就变成“狂妄的邓晓芒不识泰山贬低大洋学者”?学术之争，见解不同，可以理解。歪曲事实，空口就谈，既不求证，也不接受意见，这是什么意思?要不是我刚好买了这本《黑格尔》实体书，就被你这个胡扯的答案给忽悠了。要不要我把书中原话拍成照片给你看?另外，康德和莱布尼茨也是大陆理性派中人（虽然我既不信欧陆也不信英美），你敢不敢骂一下?邓晓芒对维特根斯坦赞誉不低（自己去看他得上课视频），也喜欢引用他的话语，这个怎么说?我就没搞懂，学哲学能学出党同伐异，交朋交党，也是无语。你这立场先行的答案我看得还真是蛋疼，你也别自诩自己“喜欢踢神话了”，不好意思，我也喜欢。送你一句话，没有调查就没有发言权。你要骂人，最起码要知道他干了些什么。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "Claude Cui", "answer_id": 270908333, "answer_text": "哲学是我灵魂暗淡时候的一道光，而邓晓芒是我学习哲学的引路人。真正的大师，深入浅出剖析晦涩的哲学，然后优雅地批判时代的弊病。立了flag，下次回国去华中科技大学拜访一下。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "逝水", "answer_id": 253601898, "answer_text": "理科生，完全没学过如何思考问题。最近细读《人之镜》。总得来说，《文学与文化三论》很适合青年人哲学入门。关于中西方表演人格的探究，文化的比较和反思。这种看似风马牛不相及的比较，看完一章或许会认同这种比较，或者有意识模仿这种方法。给我有很大帮助吧。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 134187210, "answer_text": "我个人持保留态度，他最为得意的《辩证法新探》中认为黑格尔的“存在”是“能存在”的意思，似乎把海德格尔的此在来解释黑格尔的“存在”了。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "ni mang", "answer_id": 125299914, "answer_text": "必须要说，翻译三大批判，杨祖陶先生的功劳比邓要大，帮他校不知花了多少功夫，后来大家都以为是邓独立翻译的，真不公平。为这事师生闹得非常不愉快。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "天为人纲", "answer_id": 153917309, "answer_text": "邓晓芒再怎么扯谈，也摆脱不了孔子所概括的“爱之欲其生，恶之欲其死，既欲其生，又欲其死，是惑也。”的永恒人性，更摆脱不了上帝永恒创世这个永恒天道，这是这个反儒狂人最悲哀的地方。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "莫问吾名", "answer_id": 143397535, "answer_text": "我吐槽一下，大家可以下载一个txt格式的邓晓芒译《纯粹理性批判》，再用记事本打开并查找“物自体”“物自身”“自在之物”，你会发现同一本书中竟然出现了对同一词（Ding an sich）的三种不同翻译。", "answer_votes": "0", "answer_comment": "​1 条评论"}
{"answer_author": "查下山人", "answer_id": 120332841, "answer_text": "我大二的时候配合邓晓芒老师的《纯粹理性批判句读》读导言，随随便便就找出了两三处解释不通还强行解释的地方。", "answer_votes": "1", "answer_comment": "​1 条评论"}
{"answer_author": "知乎用户", "answer_id": 36955757, "answer_text": "我觉得学术上不如人大的李秋零教授，但是在国内研究德国哲学的学者中依然是佼佼者，而且在学术圈外名声也挺不错的。但是说实话，正如前面一个答案提及的，研究有一点脱节了。所以我更喜欢李秋零教授的书，但他们两位都是我所敬佩的。", "answer_votes": "4", "answer_comment": "​13 条评论"}
{"answer_author": "朱伟", "answer_id": 120134023, "answer_text": "对于我这种哲学爱好者来说，强大的吓人。通过他的书了解了点康德、黑格尔，感觉真的有一种叫半神的物种。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 119709447, "answer_text": "跑个题。至少对哲学系学生的帮助非常大w很感谢他！", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 106914761, "answer_text": "这个问题下面基本没有人在回答关于邓“学术水平”的问题，不过无所谓，要有专业回答了知乎还是知乎？邓的那个精神现象学句读直接拿讲课内容放到上面，也把书修修剪剪一下，真讨厌。而且内容刻意俗化，不过考虑到这是给学生的作品...", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "佩长铗兮", "answer_id": 119231873, "answer_text": "差别太大，不敢妄言。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "刘洋", "answer_id": 117018015, "answer_text": "《中国二十世纪启蒙的缺陷》精确的指出了中国两次启蒙运动失败的本质原因，对“启蒙”本质的理解误差，直接导致了启蒙失败。脱离了人性知性的逻辑理性和脱离了哲学指引的政治法律一样，都是造成中国民智现状的本质原因。“启蒙”不是灌输一套管理方式，价值观念，而是通过教育启发群众利用自我人性知性进行思考判断的能力。", "answer_votes": "0", "answer_comment": "​添加评论"}
