{"question_id": "24568283", "question_text": "我是广东人，文科生，如果读大学的话，中山大学和武汉大学哪个好？也就是说找工作的话，哪个学校看起来会更有竞争力？它们的录取分数线都差不多。", "question_title": "中山大学和武汉大学哪个更好？", "question_commet": "​6 条评论", "answer_number": "48 个回答", "question_followers": "228", "brower_number": "400,601"}
{"answer_author": "退乎了", "answer_id": 28565084, "answer_text": "看你想读什么。中山大学了解不多，武汉大学读了四年，还是了解一些的。武汉大学大概在国内都是有些特别的，宽松自由程度在武汉学校中无出其右者，估计在全国都是很少有如此自由的学校。自由是好事也是坏事，很可能会让你几年里一无所获，但也可以让你有更多空间去思考、去学习更多你想知道的东西。我一直觉得读大学就是为了开阔思路、开拓视野，武汉大学提供了很多这样的机会，在校园中，只要你从宿舍中走出来，就有很多去实现他的机会，但如果你只是一直流连于游戏、自控力很差，沉迷于各种娱乐，那到武汉大学可能会浪费很多光阴。不管怎样，在武汉大学的四年都会是一段难忘美好的经历。不过在人生中到底这段经历会有何种影响，到现在我还不太确定附带一个知乎上以前看到的问题，其实好像有各种这个系列的问题：在武汉大学就读是怎样一番体验？http://www.zhihu.com/question/24349296搜一下，可以找到在国内各个大学就读的体验哦", "answer_votes": "11", "answer_comment": "​25 条评论"}
{"answer_author": "归伶昌", "answer_id": 76650719, "answer_text": "忽然好想答这题啊！四年前的故事。有次坐地铁回学校，有个小孩凑过来想玩我的iPad，就给他玩了。后来他忽然问我“大哥哥你哪个学校的呀？”（我好想回答执信怎么办XDD）我说，中大的。他瞬间眼睛放光“哇中大好厉害啊！我梦想的学校耶！你怎么那么厉害可以考上那么好的学校啊！”（下略崇拜一万字）我心想，贵广州，中大学生不是满地走吗，有啥稀奇的。。。广州人，搞不懂。你看我们南宁人多淡定：“你哪个学校啊？”“中大”“哦，海珠区那个啊”尼玛简直了！问一句，校园里的猫们还好吗？", "answer_votes": "29", "answer_comment": "​33 条评论"}
{"answer_author": "对不起我是个好人", "answer_id": 230621084, "answer_text": "中大起码不会停水everyday", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 88467593, "answer_text": "江苏人，为什么我08年填志愿的时候，武大文科线全方面碾压中大？当年我的分数可以报中山大学岭南学院，但是在武大只能选一个普通专业，连英语专业都没报上去( ˃᷄˶˶̫˶˂᷅ )我还后悔当初没去中大上个好专业，当然可能也是我在武大没有积极转专业的原因。", "answer_votes": "3", "answer_comment": "​4 条评论"}
{"answer_author": "匿名用户", "answer_id": 182424401, "answer_text": "补：2017年是两年一次的院士增选年，今年中山大学又一次无一位教授当选中国科学院院士或中国工程院院士。中山大学上一次有教授当选院士是在2009年。相较之下，武汉大学在2011年5位教授当选院士，2015年一位教授当选，2017年两位教授当选。有人评价说中山大学发展快，后劲足，但似乎在院士数量这个重要且客观的指标上，看不到相应的表现。————————————————————比较两所大学是很复杂的事情。比如评价谁更有名，不同地方的人看法可能截然相反。但是既然是大学，学术水平肯定是最重要的评价标准。国内武书连、校友会、邱均平、上交的排行榜公信力存疑，洋人的QS，USnews，泰晤士也似乎不了解国情，常有些非顶尖的学校忽然冒出来排名甚高，但隔年又不见了。评判各校水平如何，一般来说还是应该以教育部学科评估为主。2012年学科评估两校第一，前三，前五，前十学科数中山大学：1   3   12   23武汉大学：4   8   14   23对比两校，前十的数目一样，第一前三前五的数量武汉大学要多。从对比中可以看出两校规模相近，但是中大缺少类似武大马克思、地球物理、测绘、法学之类的顶尖学科。学科评估的分数也可以说明这一点。---------------------------------2012年教育部学科评估985高校的最优10科加总，1.清华大学                （前10门总分946） 2.北京大学                （前10门总分926） 3.中国人民大学         （前10门总分916） 4.中国农业大学         （前10门总分888） 5.南京大学                 （前10门总分882） 6.复旦大学                 （前10门总分880）6.武汉大学                （前10门总分880） 8.北京师范大学         （前10门总分879）9.上海交通大学         （前10门总分875）10.浙江大学               （前10门总分875） ……17.中山大学              （前10门总分843） -----------------------------------------985高校的最优20科1.清华大学                 （前20门总分1838）2.北京大学                 （前20门总分1813）3.浙江大学                 （前20门总分1712）4.南京大学                 （前20门总分1708）5.复旦大学                 （前20门总分1703）6.人民大学                 （前20门总分1701）7.武汉大学                （前20门总分1696） 8.上海交通大学          （前20门总分1689）  ……13.中山大学                （前20门总分1627）以上引自匿名小怪: 985高校的最优10科和最优20科（按教育部学科评估得分）【中华城市吧】_百度贴吧学科评估四年一次，2016年的评估结果还未公布，因此在此引用的是2012年的数据。我下面一个一个分析，以便使各位b乎看客对中国顶尖大学到底什么水平有一个大致了解。从最高20科总分的前几名可以看出，最高是清华与北大，这完全符合中国老百姓的预期。这两个学校毫无疑问是中国最好的大学，为什么清华在前北大在后？清华比北大强吗？这其实这并不能说明这一点，这只是排名方式的问题。如果按拥有第一名学科的数目来排名，北大就在清华的前面。北大是文理类大学，基础学科多，基础学科即便第一要得高分也相对较难。清华北大两校是中国高等教育的标杆。再往下，比较前20科总分，可以发现2、3名之间有100分的鸿沟。这说明无论是所谓清北复交，还是清北浙、清北科，都不成立，这么说只是某些学校抱大腿，自抬身价。清华北大自成一档，其他任何学校与这两校差别都非常大，不能相提并论。浙江大学、南京大学、复旦大学、上海交通大学以及中国人民大学是除清华北大外中国最好的大学，这几个学校水平伯仲之间，公认为第二档。从学科评估的分数可以看出，武汉大学的综合实力和这几个学校相当，处于清华北大之下的第二档。这可能也是为什么国内榜常常把武大排的很高的原因。有一个学校值得一谈——中国人民大学。人大水平非常高，但偏科太厉害，学科面有局限，只有人文社科。它的水平高到什么地步？比较北大人大两校都有的学科，人大可以和北大一争长短，单论社科人大可能还要更胜一筹。什么叫社科，经济，法学，新闻传媒……这些现在很火的学科北大都干不赢它，但是sci，院士数量，三大奖，科研经费这些东西要靠理工农医，人大没有，现在国内外的大学评价又特别看重这方面，所以有些排行榜上看不见人大的位置。前20科总分，文理综合类的南复比武大高10分左右，说明两校的尖端学科比武大要强，从分数可以看出，主要位于各校最高分学科第11-20名这个区间，因为比前十南大只高武大两分，复旦与武大相同。网友喜欢评论谁吊打谁，单从2012年学科评估看，说南复吊打武大不能成立，只是略强。浙交是以工科为主向综合性大学转变的学校，浙大除了顶尖的工，还多了一个大家都没有的农，所以在这一层次浙大综合水平最高，整体实力最强。武书连把浙大排前三，不纯粹是母校情节。比较中大与武大，武汉大学的总分比中山大学高69分。两校同为文理综合性大学，分差如此之大，确实让人吃惊。至少从学科水平的角度看，我们难说两校是同一个层次的高校。很多人认为中山大学水平很高，号称直插“华五”，这是想当然。根据上表可以看到，第二梯队平均领先中山大学70分。那为什么中山大学又在国排行际榜上经常被排的很高？因为洋人的评价系统有问题，什么招生分数、历史底蕴、社会影响、校友成就……这些很重要的方面他们都不太能够搞清楚。洋人给大学排名比较看重所谓的硬指标比如说“高水平论文”，这恰巧是中山大学表现突出的地方。一方面，中山大学合并了一个高水平的中山医科大学，医学是比较容易出论文的方向，这一点看历年医学在整个中山大学高影响因子论文的比例就知道了。另一方面，广东省是富裕地区，最近这些年对教育开始重视，对中山大学的投入很多。中大用这些资源招聘了大量能发文章的青年学者，这样一来，不止原本就强势的医科，很多其他学科水平也进步很快。因此，从各种青千人数、高引用论文、自然科学基金资助额等数据看，中山大学确实比较强。但是，真正的顶尖高校不是一朝一夕就能办成的，要靠时间的积淀。为什么这么说，因为真正评价大学的影响应该看它的校友，我想真正的名校能够通过它杰出的校友推动社会进步，这样学校也因此享有崇高的声望。中山大学这方面表现非常一般。论及校友中院士、长江学者的人数，企业家捐赠的金额，或者能够有重大影响力的政府官员的人数，中山大学在全国基本都是15名以后。中大12年全职院士人数只有6人，不如同期的川大8人，和山东大学相同。只是最近几年出大价钱挖了一些牛人，才号称现在全职院士已达10人，不过与浙南复交还是有相当大的差距，跟武大比也落后一些。中山大学历史比较悠久，学科门类也比较齐全。最近几年政府支持力度大，发展势头良好。但顶尖学科数量少，现阶段综合实力应该只属于国内的第三档，武汉大学明显比中山大学强不少。-----------------------------------------------------------------------------------------------------------------------以下为补充内容：最后一个学校有必要谈一谈——中国科学技术大学。先看学科评估（前面的数字为排名，后面的数字为得分），1 物理学                       90 1 科学技术史               90 2 安全科学与工程        886 化学                           87 1 地球物理学               85 5 生物学                       84 4 数学                           832 天文学                       82 9 管理科学与工程        812 核科学与技术            80  9 计算机科学与技术    79 9 力学                           78 8 统计学                       785 地质学                       77 14 信息与通信工程      77 14 环境科学与工程      7613 软件工程                 7517 控制科学与工程      7523 材料科学与工程      7527 生态学                     71前10门总分850，位列全国高校第15名。前20门总分1611，同样位列全国高校第15名。同样偏科，中科大在理科方面的水平要比人大在人文社科领域差不少，有人不相信，但这是数据分析的结果。为什么中科大的社会评价会明显高于他的实际水平？本人猜想首先是因为中国社会重理轻文的价值取向。中科大在理科——特别是作为基础和主干学科的数理化生四门水平都不错。其次，中国科学院的声誉与实力不用多说，中科大原来作为唯一直属中国科学院的大学声誉自然也高。中科大、中科院、原来的中科大北京研究生院、中科院遍布全国的各研究所，这些机构相互之间有着错综复杂的关系。有人讲中科大有上百个院士，清华加北大都望尘莫及，你说中科大不牛？事实上，这是把各研究所的院士都算上了，除了唬人，没有什么意义。这些院士可能多少年都不会去合肥一趟。网大统计中科大真正的全职院士只有二十人左右，比武大多，和浙南复交少一些。这个数目应该能够比较真实的反映各校理工科水平。", "answer_votes": "12", "answer_comment": "​16 条评论"}
{"answer_author": "刘莲", "answer_id": 88591602, "answer_text": "利益相关，珞珈山职业学院毕业。目前广州工作。论排名和知名度什么的武大好。还是建议你去中山。如果你想回家。毕竟校友会资源更重要。而且中山离家近。离开武汉放弃了经营四年的资源会觉得很遗憾。最好能在你想工作的地方读书。以上~祝好。", "answer_votes": "3", "answer_comment": "​3 条评论"}
{"answer_author": "UIUC", "answer_id": 81758336, "answer_text": "3作为一个在武大就读的广东人，我觉得有几点你要先想好，第一，你是文科生，那么要想找工作好的话只能选经济类的，文史哲这方面的就业前景不太好，除非你想当老师。如果是经济的话，武大有经管，中大有岭南，这两方面实力相差不大，不过岭南学院的分数好像会高点，因为广东人都不太喜欢出省。第二，你要考虑环境适应问题，感觉大学新生第一年，在武大湖北人会占优势，比如英语分班考试，好像进快班的都是湖北的。分班考试类型和湖北高考一样的，想碰到听力这种题，广东人只能载了，毕竟我们高考是考口语的，侧重点不同。还有就是饮食环境，湖北会比较重口味，吃的比较干，热，辣。天气的话，夏天会比广东热，冬天其实还没有广东冷，广东会刮风，这边基本不会，而且北方的干冷真心不冷。如果你高考分数足够，建议来武大，广东出省分数会比较值，而且世界那么大，出来看看好，不过武大的文科投档线会比中大&lt;img src=\"https://pic3.zhimg.com/50/73ababc0467e8998a0dd0e912f1b7a12_hd.jpg\" data-rawheight=\"355\" data-rawwidth=\"355\" class=\"content_image\" width=\"355\"&gt;高。现在想那么多也没用，你现在的首要任务就是刷分，分数高了选择空间就会更大。补充一句，无论是校园颜值还是校园里面学生的颜值，武大都完爆中大。&lt;img src=\"https://pic2.zhimg.com/50/f83629ea6ae6b47b9090641be83209e6_hd.jpg\" data-rawheight=\"444\" data-rawwidth=\"705\" class=\"origin_image zh-lightbox-thumb\" width=\"705\" data-original=\"https://pic2.zhimg.com/f83629ea6ae6b47b9090641be83209e6_r.jpg\"&gt;&lt;img src=\"https://pic3.zhimg.com/50/eecf53ea05ce766333c8172a3b200c29_hd.jpg\" data-rawheight=\"285\" data-rawwidth=\"500\" class=\"origin_image zh-lightbox-thumb\" width=\"500\" data-original=\"https://pic3.zhimg.com/eecf53ea05ce766333c8172a3b200c29_r.jpg\"&gt;[img=2137948167看想要比到很多人想要说武大的录取分数比中大低，我就笑笑不说话，中大在广东理科是641，武大是646，中大省排前六千就可以进，武大要四千多。附上一张一五年的录取线排名图&lt;img src=\"https://pic2.zhimg.com/50/d8bf07e05a8c957ad925c1a5d6f6470b_hd.jpg\" data-rawheight=\"340\" data-rawwidth=\"559\" class=\"origin_image zh-lightbox-thumb\" width=\"559\" data-original=\"https://pic2.zhimg.com/d8bf07e05a8c957ad925c1a5d6f6470b_r.jpg\"&gt;16年，广东省文科省排500多才能进武大，中大已经是一千开外了。理科广东省排3900+才能上武大，省排六千多就能上中大，谁好谁坏，家长和考生还会不清楚吗？不用告诉我说广东中大招生比武大多，就算在湖北，武大文理也是双杀中大。简单讲就是，主客场双杀。武汉高教实力显然在广州之上，武大强于中大，华科强于华工，华中师强于华南师，华中农强于华南农，中南财强于广外贸，剩下的武理工和地大也强于广工和暨南大学。", "answer_votes": "46", "answer_comment": "​52 条评论"}
{"answer_author": "杨尼玛", "answer_id": 28503096, "answer_text": "我觉得从学校角度来讲没有什么差距，但是从城市角度讲广州真是强于武汉太多了，环境 气候 发展 人口素质，我觉得用完爆这个词不过分。当然对于广州我只是走马观花的玩儿了几天，去中大溜达了两圈，所以欢迎反驳。对大学城校区印象不错，能每天在那里环岛跑步一定很幸福。但是如果我是广东人的话，我会毫不犹豫选武大，见见外面的世界总是好的。-----------------------------------补充一点，我口味偏清淡，武汉对我来说太咸了。。。广东的话就不错", "answer_votes": "22", "answer_comment": "​38 条评论"}
{"answer_author": "suzyrinn", "answer_id": 28455542, "answer_text": "作为一个广州人我觉得中大也没有上面的人说的这么差啦读大学的话 成绩好就挑学校之后挑专业 专业方面中大也有好过武大的专业 经济学管理学人类学等都是全国顶尖的 比如说你想学经济类的 该专业上中大师资等方面好过武大 那你就可以选择中大但总体上来说武大的确是要好过中大 中大分高也有本地人不想去外地读而扎堆报考中大拉高了分数的原因 但中大其实挺好的喔 如果你愿意去外面闯闯 感受下外省的环境能读武大也是很好的呢我觉得主要要看专业排名啊 要看你的专业来选择了吧希望回答能对你有所帮助(●'◡'●)", "answer_votes": "14", "answer_comment": "​3 条评论"}
{"answer_author": "Kevin WU", "answer_id": 50427311, "answer_text": "我想说在招聘人员的手里，这两所大学的含金量是差不远的。更多的差异是你的专业，你的简历上面的其他东西。就找工作这个问题来说，两个学校外部环境有很大的差异。首先，从城市的发展，生活环境，名企数量，就业状况等等来说，广东都要好于武汉。但就两所学校在广东的知名度来说，中大明显知名度会更高一点。毕竟整个华南地区，能有点江湖地位的也就厦大和中大。其次，如果你读经济类专业，我也推荐中大，因为广东的企业多，经济好。广东又只有这么一所经济比较好的高校，可以说中大的MBA在这方面有着很大的优势。教师和企业的交流也会比较多。一些校友也经常会回来分享他们的经历。而且广东很多企业的老板和高层都会到中大读MBA来镀金，作为校友相信招聘上也会有点优势。第三，我目前不在广东，我在南方一个城市。我认识很多各个学校的校友。我个人认为在南方，中大的知名度和名气还是高于武大的。再说你个人，毕竟是广东人，大抵上还是不会留在武汉工作的。广东人恋乡情节还是蛮重的。从个人阅历角度，我建议你去武汉看看。但是从就业角度来说，我觉得还是中大好一些。", "answer_votes": "9", "answer_comment": "​6 条评论"}
{"answer_author": "匿名用户", "answer_id": 85748256, "answer_text": "其实这种问题根本不用争来争去，都是名校，只不过中大现在是中国高校第二阵营的排头兵，由于国家教育部和广东省的大力发展与扶持，正在向第一阵营迈进，而武大是第二阵营的普通一员而已，这是教育部长曾经说过的，不信的可以百度一下。老实说，二者差距不是很大。只不过中大发展的比较迅猛和内涵而已，之所以中大在北方知名度不够高，就是太低调导致的。", "answer_votes": "24", "answer_comment": "​1 条评论"}
{"answer_author": "ryan林", "answer_id": 37057633, "answer_text": "&lt;img data-rawheight=\"3264\" data-rawwidth=\"4912\" src=\"https://pic2.zhimg.com/50/7ff253d444c11497f68332bf0a48076d_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"4912\" data-original=\"https://pic2.zhimg.com/7ff253d444c11497f68332bf0a48076d_r.jpg\"&gt;本科武大，硕士中大。交流过其他学校，也旅游去过很多国内外高校。中大不错，但武大更好一些。原因我慢慢写吧。本人很懒，没稿费就不爱写或者瞎写。十分抱歉。1、校园环境2、学科优势3、校风氛围4、学生素质视野5、校区整合度6、名师大家7、地理位置8、就业形势9、其他", "answer_votes": "23", "answer_comment": "​29 条评论"}
{"answer_author": "manzhun Ng", "answer_id": 39599072, "answer_text": "最低分根本不能说明问题好不好？中大在大部分省份的平均分都是比武大高的", "answer_votes": "8", "answer_comment": "​1 条评论"}
{"answer_author": "jim", "answer_id": 231480963, "answer_text": "武大就读的广东人前来答题。 1.转专业见到别人说转专业容易，想提醒一下，要转去经济学院的高考数学分数要求满分80%以上，转去数理金融的85%以上，此为硬性指标，详见学院网站。 2.就业 个人觉得想在广东工作的秒选中大除非你想去测绘水利遥感，不打算在广东工作的话武大在全国范围内更出名。 3.校园环境 不要因为学校的颜值影响了你的志愿，生活四年没有那么多的诗意风景看惯就没什么了，而且武大好多地方都挺破挺旧的，特别是工学部信息学部，让你怀疑进了假的武汉大学，当然漂亮的地方还是很漂亮的。 4.地理位置\n不用说了 5.针对广东人讲下 如果你嘅普通话唔错，食得辣，想见识下外地，甘武大 如果你有强烈的故乡情结，而且普通话系广普，甘中大(呢句话讲左好似无讲甘:) 仅供参考", "answer_votes": "3", "answer_comment": "​2 条评论"}
{"answer_author": "王钰", "answer_id": 35249495, "answer_text": "得具体看专业，只有适合不适合，没有什么大学一定好，什么就不好一说。武大氛围很轻松，基本是属于放养状态。适合自我规划能力强的人。中大就不了解了。", "answer_votes": "4", "answer_comment": "​14 条评论"}
{"answer_author": "匿名用户", "answer_id": 101423116, "answer_text": "去年广东高考文科表示武大比中大高了十几分好伐ˊ_>ˋ", "answer_votes": "4", "answer_comment": "​5 条评论"}
{"answer_author": "乾乾", "answer_id": 119212603, "answer_text": "简单地说，在广东的话就去武汉，在湖北就去中山。原因：性价比高。", "answer_votes": "2", "answer_comment": "​5 条评论"}
{"answer_author": "Sherryhyx", "answer_id": 107622090, "answer_text": "我在武汉上学。两所大学都是好大学，都是985，我觉得都可以考虑。不过就说城市建设环境，我觉得还是广州吧。武汉的交通太堵了......而且某层楼说广州比武汉冷确定不是搞笑?武汉本地人都说了武汉冬天太冷又没有暖气，冻得不行 ️", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 258407815, "answer_text": "广东人 武大本科 南大硕 。上大学就是为了体验不一样的世界 躲在自己本土能有啥大成就。而且广东除了广州 还有个城市叫深圳 这里武大势力绝对力压中大 所以上武大 来深圳 没毛病 ：D", "answer_votes": "2", "answer_comment": "​4 条评论"}
{"answer_author": "舒泽宇", "answer_id": 228184033, "answer_text": "法学去武大，经管去中山（虽然我和这两个学校都差得远）", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 152853816, "answer_text": "中大，不用想了，你不仅仅要选学校还要选城市，广州比武汉好太多。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 105654467, "answer_text": "个人感觉啊，文科能选算比较好的专业是商科和法律吧。武大经管跟中部某财经类211为什么毕业生很多去深圳，校友遍地呢？其实没啥历史渊源或者情结，说白了就是供需关系… 跟中科大的出国率有点像吧。 中大跟武大都是当地最好的学校，但你在武汉能找着最好的实习跟在广深能找着的最好的实习肯定不一样，中等档也是。学术实力我不知道跟普通专业的本科生关系多大，但人才引进、院系发展的话背靠广州市和广东省支持比起武汉跟湖北肯定不算差吧。提问的人本身来自珠三角，这就不谈了。我当年看高考指南就有点奇怪，因为我省提档线中山、武大、厦大差不多，我就稍微不太理解… 欢迎指正。", "answer_votes": "1", "answer_comment": "​1 条评论"}
{"answer_author": "Seraphie", "answer_id": 56569419, "answer_text": "如果以后考虑在广东发展的话，可以考虑中大，会相对有优势，以及发展事业比较方便一些。只是相对和一些，也纯属个人意见。", "answer_votes": "1", "answer_comment": "​1 条评论"}
{"answer_author": "匿名用户", "answer_id": 50522527, "answer_text": "廣東人當然來中大啦", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "kart", "answer_id": 37145032, "answer_text": "我觉着，中山大学更适合你，因为你未来最终可能还会选择回到家乡生活。因为你是广东人的因素吧。另外，从就业方面来说，中大在广东还是所向披靡的。当然，武大也很不错！", "answer_votes": "1", "answer_comment": "​3 条评论"}
{"answer_author": "匿名用户", "answer_id": 96510219, "answer_text": "作为一名广州人，劝你去武大。我不是认为武大一定比中大强。只是你想，广东学子大多会回家乡工作的，毕竟广东经济比湖北强，就业更优。如果你在广东读大学，又在广东工作，你就失去一个在外地生活的机会了。这种在外省生活的体验，不是在去外面旅游几天能够相提并论的。我当年高考，分数也够中大了，但我选择去了西安，从没后悔。不要担心什么校友资源，我回广东后，外省的经历从来不是障碍，反而是优势。知道为什么吗？因为中国人有一句话：外来的和尚好念经。", "answer_votes": "2", "answer_comment": "​2 条评论"}
{"answer_author": "Xie fangxi", "answer_id": 90295218, "answer_text": "高中生的话，好好刷分是王道……报考哪家学校的问题，打算在那里找工作就报那里。找工作的时候由于校友富集在本校附近所带来的区位优势相当大。", "answer_votes": "1", "answer_comment": "​1 条评论"}
{"answer_author": "知乎用户", "answer_id": 87397935, "answer_text": "地理上无疑是广州好呀 校园景色的话武大本部有樱花的时候略胜于中大 据说中山大学某些院说合并就合并了 这个执行力比武大强多了 我在的时候说合并说了一年半了还是没动静食堂半斤八两 中山的西红柿炒鸡蛋比武大强 不过这种评价谁更好这种问题 每个人看法肯定都不一样的啦", "answer_votes": "1", "answer_comment": "​1 条评论"}
{"answer_author": "Louis Miyamori", "answer_id": 286501339, "answer_text": "第四轮教育部学科评估结果已经出来了，比某些民间野榜或国外排行榜可信多了。请仔细看看下图，哪所高校更好不言而喻。&lt;img src=\"https://pic2.zhimg.com/50/v2-7465b8798be9da9b4f5019c781f5e774_hd.jpg\" data-rawwidth=\"1145\" data-rawheight=\"8819\" class=\"origin_image zh-lightbox-thumb\" width=\"1145\" data-original=\"https://pic2.zhimg.com/v2-7465b8798be9da9b4f5019c781f5e774_r.jpg\"&gt;", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "neo", "answer_id": 265964584, "answer_text": "中大，你觉得武汉能跟广州比吗？武汉还需要房子补贴来吸引大学生就业。", "answer_votes": "0", "answer_comment": "​4 条评论"}
{"answer_author": "轻淡", "answer_id": 265962101, "answer_text": "广东的话，我觉得中大吧，比较武汉太远", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "黄鹤楼", "answer_id": 265953797, "answer_text": "我小孩在省生物竞赛拿过一，明年想自主招生报中大，现高三每月联考600分上下，原本想报武理，希望各位能给个建议", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "唐谷歌", "answer_id": 258498395, "answer_text": "这类同档次学校大比拼的题目真是经久不衰啊。某康乐园养了四年老的人冒昧说几句吧，希望能有点帮助。工作竞争力看专业吧。你会发现在同一个学校不同专业就业状况很不同（比如是不是你校就业优势专业，或者众所周知的好就业专业如cs）。在学校档次和专业相近时主要看自己，能为自己能力和简历提升做些什么。地理位置嘛，当然更想去哪里就业就在哪读书更舒服，毕竟有人脉和四年熟练度加成。要是做互联网相关来中大吧，嗯，你会发现...离深圳比较近，实习方便。做学术就看学科排名呗。学校和地理位置次要考虑。做学术起码都得出国的，但综合来说这两个学校出国竞争力应该区别不大，都比不上清北和除此之外C9中某几所。别太纠结，反正都是一档次学校，比上不足比下还行。ps:要是通过以上分析后还考虑不清，那就武大吧。你是广东人，老是窝在自己省多大出息。换个地读开开眼界也好。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "致物记", "answer_id": 250813248, "answer_text": "中大合适一些 不过也水，老婆中大毕业的博士，那里面形式主义很厉害。武大地理环境不行", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "英杰", "answer_id": 244852978, "answer_text": "我是中大毕业的广东人。我妹妹武大毕业的。都是过来人了。现实点看世界。个人感觉广东人绝对选中大。除了湖北人外其它省份的应该也选中大不选武大。不是我黑武大。而是广州这城市比武汉强太多了。换个角度来说你毕业了找工作在广州比在武汉前途好很多！其它省份的来中大读也可以提前4年慢慢融入这城市。你一个广东人不可能说准备毕业了会在湖北工作吧……还得回广东。大学排名这东西太虚了！我觉得学习是靠自己的。两间学校差不多实力的情况下能学成怎样可以说都是你自己的本事！你要是硬说要看重排名哪个学校高。我觉得你连北大清华都不用去了。你看广东有多少个状元跑清华北大的。就香港就两家排名比他们高的顶在那里。你直接考进去得了。", "answer_votes": "0", "answer_comment": "​1 条评论"}
{"answer_author": "zwei", "answer_id": 236821315, "answer_text": "&lt;img src=\"https://pic2.zhimg.com/50/v2-e8c59c99b6774d31b74cd2aec4874706_hd.jpg\" data-rawwidth=\"1080\" data-rawheight=\"1920\" class=\"origin_image zh-lightbox-thumb\" width=\"1080\" data-original=\"https://pic2.zhimg.com/v2-e8c59c99b6774d31b74cd2aec4874706_r.jpg\"&gt;見上圖：作為雙一流大學，中山大學與武漢大學是11比10。高下立見中山大學暫時比武漢大學領先！", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "没有意义的大咸鱼", "answer_id": 186689357, "answer_text": "不谈专业或者职业规划，我只能回答各有千秋（摊手）", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "ZombieJH", "answer_id": 182193873, "answer_text": "武大和中山，综合实力一个层次的。体验一下不一样的生活，文化。我是武大的本硕。欢迎你来。", "answer_votes": "0", "answer_comment": "​添加评论"}
