{"question_id": "25563993", "question_text": "读杜甫诗有感。", "question_title": "李白在他的诗中向多少位诗人表白过？", "question_commet": "​16 条评论", "answer_number": "11 个回答", "question_followers": "503", "brower_number": "66,846"}
{"answer_author": "匡靖", "answer_id": 39781787, "answer_text": "我来啦。其实，不仅杜甫很忙，李白对同性好友也非常繁忙，在诗里，李白哭过日本人晁衡，哭过酿酒的纪老头，与好友夏十二登岳阳楼，又给好友王十二写诗，还想与当官的卢虚舟快乐神仙游，他几乎每到一个地方，就要借景对一位男人抒发感情。总之，表白的主题都是有你真好、真的好想你、离别我怕啥、你贬了你死了不要啊、政坛真没劲我们云游吧我们归隐吧我们一起吧么么哒。【比如有你真好】1、岑夫子（诗人） 《将进酒》君不见，黄河之水天上来，奔流到海不复回！ 君不见，高堂明镜悲白发，朝如青丝暮成雪！人生得意须尽欢，莫使金樽空对月。天生我材必有用，千金散尽还复来。烹羊宰牛且为乐，会须一饮三百杯。岑夫子，丹丘生，将进酒，杯莫停。与君歌一曲，请君为我倾耳听。钟鼓馔玉不足贵，但愿长醉不复醒。古来圣贤皆寂寞，惟有饮者留其名。陈王昔时宴平乐，斗酒十千恣欢谑。主人何为言少钱，径须沽取对君酌。五花马，千金裘，呼儿将出换美酒，与尔同销万古愁。作于天宝年间，当时李白与友人岑勋和元丹丘在嵩山对饮，李白喝大了，作诗一首，诗中深情地呼唤两位老友，岑夫子，丹丘生，来吧我们继续喝，不喝是小狗，我顺便再说几句，我想醉，圣贤都醉，陈王也醉，别说我没钱，我有钱，把你们儿子叫出来买酒，五魁首啊，六六六。作为一枚酒鬼，提及友人不说爱，只消劝酒，“都在酒里了”，一定是深爱。PS：夫子在古时多指文人，想必应该是诗人。2，孟浩然（诗人） 《赠孟浩然》吾爱孟夫子，风流天下闻。红颜弃轩冕，白首卧松云。醉月频中圣，迷花不事君。高山安可仰，徒此揖清芬。第一句便提纲挈领，想想李白如此赤裸地对一个比他大12岁的男人说出：“我爱你”的时候，那画面略微有点美，加之作这首诗时李白大约30岁上下，按常理表达情感应该内敛，这一诗却是通篇的爱意，第二句讲的是孟浩然，你小时候很帅，你老了也很帅，第三句是你醉了也帅，你不从政也帅，最后一句是所以你像高山，惹人敬爱........3，元演，汉东太守，紫阳真人（参军、太守、道士）《忆旧游寄谯郡元参军》忆昔洛阳董糟丘，为余天津桥南造酒楼。黄金白璧买歌笑，一醉累月轻王侯。海内贤豪青云客，就中与君心莫逆。回山转海不作难，倾情倒意无所惜。我向淮南攀桂枝，君留洛北愁梦思。不忍别，还相随。相随迢迢访仙城，三十六曲水回萦。一溪初入千花明，万壑度尽松风声。银鞍金络到平地，汉东太守来相迎。紫阳之真人，邀我吹玉笙。餐霞楼上动仙乐，嘈然宛似鸾凤鸣。袖长管催欲轻举，汉东太守醉起舞。手持锦袍覆我身，我醉横眠枕其股。当筵意气凌九霄，星离雨散不终朝，分飞楚关山水遥。余既还山寻故巢，君亦归家渡渭桥。君家严君勇貔虎，作尹并州遏戎虏。五月相呼渡太行，摧轮不道羊肠苦。行来北凉岁月深，感君贵义轻黄金。琼杯绮食青玉案，使我醉饱无归心。时时出向城西曲，晋祠流水如碧玉。浮舟弄水箫鼓鸣，微波龙鳞莎草绿。兴来携妓恣经过，其若杨花似雪何！红妆欲醉宜斜日，百尺清潭写翠娥。翠娥婵娟初月辉，美人更唱舞罗衣。清风吹歌入空去，歌曲自绕行云飞。此时行乐难再遇，西游因献《长杨赋》。北阙青云不可期，东山白首还归去。渭桥南头一遇君，酂台之北又离群。问余别恨今多少，落花春暮争纷纷。言亦不可尽，情亦不可及。呼儿长跪缄此辞，寄君千里遥相忆。分四次对毫州参军元演表白了心迹，对元演的不说，其中对汉太守和紫阳真人的描摹，可谓是十分微妙，“邀我吹玉笙”，“手持锦袍覆我身，我醉横眠枕其股”，醉后，李白睡在太守的大腿上，太守脱下锦袍为其披上，啊，好一副感人肺腑，欲飙涕泗的场景！忍不住搬小板凳了呢。【比如真的好想你】1、谢玄晖（诗人） 《金陵城西月下吟》金陵夜寂凉风发，独上高楼望吴越。白云映水摇空城，白露垂珠滴秋月。月下沉吟久不归，古来相接眼中稀。解道澄江净如练，令人长忆谢玄晖。《秋登宣城谢朓北楼》谁念北楼上，临风怀谢公。以前以为最后三字，谢玄晖，乃谢谢太阳........后来方知是个人名，前一句“澄江净如练”乃其所作，谢玄晖是南齐诗人，一生和李白相似，总之是清苦流离不得志，李白登高看景生愁，想起了谢玄晖的际遇，此表白是艾玛我和你一样惨，好队友，么哒。2，杜甫（诗人）《沙丘城下寄杜甫》我来竟何事？高卧沙丘城。城边有古树，日夕连秋声。鲁酒不可醉，齐歌空复情。思君若汶水，浩荡寄南征。想起来和杜甫欢快玩耍的日子，很是沉重，对比自己小十来岁的杜甫，感情表达深沉，此时李白已经比写赠孟浩然那首诗那时老了十岁，表白总算稳重许多。【比如离别我怕啥】1，汪伦 （县令）《赠汪伦》李白乘舟将欲行，忽闻岸上踏歌声。桃花潭水深千尺，不及汪伦送我情。私以为这首诗跟送给孟浩然比，差距太大，你看李白准备走了，汪伦屁颠颠地去追他，李白在船上一听，咿，怎么有声音，汪伦带领一票人边唱边跳就过来了，画面太美他不敢看，李白那个尴尬啊，垂下了眼看了会桃花潭，最后才勉为其难地把汪伦名字带出来，这能和第一句就是孟浩然我爱你.....能比吗？2，孟浩然（诗人）《黄鹤楼送孟浩然之广陵》故人西辞黄鹤楼，烟花三月下扬州。孤帆远影碧空尽，唯见长江天际流。李白目送孟浩然的凄美画面，翘首盼，浩然，君在那头，我在这头，唯有长江流。3，杜甫（诗人）《鲁郡东石门送杜二甫》醉别复几日，登临遍池台。何时石门路，重有金樽开。秋波落泗水，海色明徂徕。飞蓬各自远，且尽手中杯。喝吧，蠢货，我舍不得你，只有喝酒方能表达了。【你贬了你死了不要啊】1，王昌龄（诗人）《闻王昌龄左迁龙标，遥有此寄》杨花落尽子规啼，闻道龙标过五溪。我寄愁心与明月，随风直到夜郎西。王昌龄遭贬，李白遥寄诗一首表示情谊，上部分说事下部分说情，这个月亮很厉害，月亮代表他的心，此表白放在现代即是“月亮之上，有多少梦想在自由地飞翔，昨天遗忘，风干了忧伤，我要和你重逢在那苍茫的路上，生命已被指引，潮落潮涨，有你的远方，就是天堂”。2，贺知章（诗人）《对酒忆贺监二首（并序）》其一四明有狂客，风流贺季真。长安一相见，呼我谪仙人。昔好杯中物，翻为松下尘。金龟换酒处，却忆泪沾巾。其二狂客归四明，山阴道士迎。敕赐镜湖水，为君台沼荣。人亡余故宅，空有荷花生。念此杳如梦，凄然伤我情。贺知章和李白相差四十岁哦，结为忘年交，贺知章病逝后作诗追忆初识好友时，句句痴心。比如政坛真没劲我们云游吧我们归隐吧我们一起吧么么哒。1、刘十六（未知）《白云歌送刘十六归山》楚山秦山皆白云，白云处处长随君。长随君，君入楚山里，云亦随君渡湘水。湘水上，女萝衣，白云堪卧君早归。诗名即表白，这个叫刘十六的人运气很好，获得一次李白真情冠名的机会。诗中表达李白送刘十六归隐，婆婆妈妈地絮叨，白云伴你归隐，湘水也伴你归隐，隐者服女萝衣也伴你归隐，啊你还是早点归隐。诗中只见刘十六是隐者，是不是诗人难说。算下来大致6位吧，有意思的是，和李白出生和去世日期相近的，也颇负盛名的有王维，明明是同一时期的俩人，李白却没有对他表白过，这是为什么呢？----------------公众号：匡靖", "answer_votes": "1.2K", "answer_comment": "​127 条评论"}
{"answer_author": "花燃山色", "answer_id": 39808187, "answer_text": "哎，答 @匡靖  问，为啥李白、王维二人基情不彰呢？这是为毛呢？因为，王维念佛，李白修仙，他二人一见面就掐，一见面就掐，哪还能好好玩耍？话说一日……【大明宫中】 帝：太白，摩诘，方今之世，万方神魔，何人可称至圣？二位爱卿，可为朕言之， 王维：我佛如来李白：我仙太上真君 王：我佛慈悲 李：我仙潇洒 王：啊呀，我佛慈悲，但亦有霹雳手段，信不信我夜半三更，打你个一头菩提子？ 李：咦唏，汝敢打老子？想我先师，庄公闲游，出趟城西，树木琅琳有高低，西出函谷，化汝天竺，尔之诸天菩萨，皆我老子徒子龟孙…… 王：哼，我佛门经典，是猴子八戒保着唐僧费老鼻子劲取来的，与你老子何干？再说了，老子老子的，汝再说一遍？ 李：老子老子老子………我就是你老子！ 王：哎呀呀，啊呀呀，吃我一记大力金刚掌！佛门狮子头！妈咪妈咪哄，妈妈咪呀…… 李：来得正好！天灵灵，地灵灵，太上老君显圣灵！祭出我的桃木剑，掏出我的面纸巾，我画上一道引雷符，兀那秃驴贴脑门，pia！ 帝：(⊙o⊙)休得胡闹！二位爷，要斗法速去花园，别引雷劈着我大殿啊！这烧着了岂是玩的？\n杨贵妃：不嘛不嘛，奴家要看~~ 却说这二位大师斗法，毕竟后事如何，且听下回分解。请叫我，脑洞王……脑洞一开，势不可挡，还有续集，不妨关注。&&&&&&&&&&&&&&&&&&&&&&&&更新【次日，王、李二人同上早朝】大路通天，各走一边，李：哼！王：哈！李：切！王：吁！李：呸！王：呀呀呸！呼~喝~~~呸！李：你瞅啥？王：瞅你怎的？话不投机，二人当场揪耳朵扯胡子，滚作一团，王维的假发套都拽掉了，李白的肚兜……玄宗：二位君子~二位君子！要文斗，不要武斗！李：哼！就是，我乃堂堂谪仙也~不和你这凡夫俗子一般见识！王：哎哟哟，谪仙是吧？犯错误的仙人了不起啊？我二弟八戒就是谪仙，但不知，你这神仙被谪，是调戏娘娘，还是偷吃蟠桃？李：啊呀呸！你这贼秃，辱我太甚！说话间轻舒衣袖，亮出一支青釭宝剑，顺势挽了个剑花，抖一抖，如神龙探海，颤一颤，似星点万千。王：好小子，你个贱人，朝堂之上，因何耍剑？李：贱人说谁？王：贱人说你！说时迟，那时快，李白抢上一步，直欲刺出，却见那王维嗬嗬大笑，从袍中甩出一柄大铁棒，砰然坠地，把那大理石砖，一连震碎三块，皇帝心疼得心里一紧，王：嗬哈哈哈，洒家早有所备，这正是我佛门法器：金刚伏魔杵，重二百八十斤，专治尔等邪魔外道！帝插话：且慢，且慢，二位爱卿文武双全，实乃我朝之幸，要打架，去门外空地，这边花花草草的，碰坏了不好，寡人舍不地……李白：哎你个秃驴，戏法不错啊？恁大物事，怎么塞进裤裆里的？掀开我看还藏着鱼缸没？说话间二人来到院内，只见李白左手捏个剑诀，忽地一个纵云梯，平地而起，飘飘摇摇，直落到大殿檐角之上，衣袂飘飘，真恍如天外飞仙，引得后宫佳丽，欢呼一片：小白~小白白~~欧巴~~我爱你~~我要给你生娃~~~（玄宗面色铁青）这时王维拖着个铁杵也缓步走将出来，一眼望去凛然渊停岳峙，看那袍张袖鼓，气息流转，亦是不凡，但怎奈那伏魔杵太过沉重，尽全力纵了一纵，却哪得飞起半分，不由破口大骂：兀那贱人，有种下来战个痛！李：楼上清风习习，杨柳依依，不下不下就不下，有种上来！如此叫骂了几个来回，围观群众暗暗着急，正有力使不上，帝曰：搬梯子！好一个王维，架稳扶梯晃一晃两臂似有千钧之力，将铁杵扛在背上一路爬上房檐，已是累得气喘如牛，正待开口，却见那李白冷笑一声，轻撩袍角，一个鹞子翻身，忽忽悠悠，一个筋斗却又翻下楼来，稳稳落地，尘土不动，鸟雀无声，又惹得围观宫女好大个满堂彩~~回转身顺脚把梯子给踢出三丈开外……（玄宗泪奔：我的梯子……）", "answer_votes": "58", "answer_comment": "​25 条评论"}
{"answer_author": "匿名用户", "answer_id": 39803163, "answer_text": "我才发现是表白的诗人→_→再见→_→（你倒是给我举个例子什么叫给诗人表白）----------这是我原来跑题的答案----------接着靖哥哥的答案答吧，李白从未向王维表过白（表白应该是示爱吧），是为什么呢？因为他俩不仅不会有爱情，还是情敌→_→版本一：两人同争玉真公主（就是唐玄宗的妹妹）因受道教影响，玉真公主曾在青城山修炼，自此结识李白。当然结识的还有一个人，就是李白的小基友东严子（元丹丘），见李白自叙：“与逸人东严子隐于岷山之阳(就是青城山)”。表白诗之一：《玉真仙人词》玉真之仙人，时往太华峰。清晨鸣天鼓，飙欻腾双龙。弄电不辍手，行云本无踪。几时入少室，王母应相逢。这是李白在开元十七年时，和玉真公主见面时所作。不过目的是求举荐还是表白大家自己体会～当然王维也有一篇《奉和圣制幸玉真公主山庄因题石壁十韵之作应制》，你们可以去对比一下～本来李白和玉真公主相识肯定会发生许多的故事啦，可惜王维这时候进来插了一脚。王维擅长音律，所以被有同样爱好的歧王（是的，就是杜甫经常在他宅子里见到李龟年的歧王）推荐给了玉真公主，于是两个人在音乐中擦出了爱情（？）的火花→_→当然后来王维被贬又出了一摊子事儿以后的故事就暂且不表了。反正王维的出现，让李白很郁闷。当时又因遭张氏父子冷遇被晾在了玉真公主别馆，于是李白又开始抒发自己没人赏识的苦闷：《玉真公主别馆苦雨赠卫尉张卿二首》（其一）秋坐金张馆，繁阴昼不开。空烟迷雨色，萧飒望中来。翳翳昏垫苦，沉沉忧恨催。清秋何以慰，白酒盈吾杯。吟咏思管乐，此人已成灰。独酌聊自勉，谁贵经纶才。弹剑谢公子，无鱼良可哀。大概意思就是我日子苦啊，没鱼吃啊，没人赏识啊，求搭理啊～然后玉真公主就心软了，于是李白就被举荐到了唐玄宗那，就出现了“调羹”“脱靴”的一系列事儿。反正就是贵妃也得罪了，宠臣也招惹了。天宝三年就被“赐金放还”了。玉真公主不高兴了，自请去除公主名号，去安徽宣城修道去了。修道的地方呢，就是敬亭山。咦？这个敬亭山怎么这么耳熟？李白不是有一首诗叫《独坐敬亭山》吗？众鸟高飞尽，孤云独去闲。相看两不厌，只有敬亭山。于是有人说李白在这首诗中在意的不是在山，而是在山上修炼的玉真公主。更巧的是，公元762年，玉真公主去世，时年七十多岁，葬于敬亭山。李白也于同一年死于敬亭山下的当涂县。也算是“不求同年同月同日生，但求同年同月同日死”了（当然也没都同了）版本二：两人同争孟浩然这个就有点太邪恶了，再加上引申出的汪伦、元丹丘等一系列人你们自己去yy吧。除了玉真公主，李白还与许多“金陵子”（就是金陵的女人）有过许多故事。见表白诗：《示金陵子》金陵城东谁家子，窃听琴声碧窗里。落花一片天上来，随人直渡西江水。楚歌吴语娇不成，似能未能最有情。谢公正要东山妓，携手林泉处处行。大家都知道，李白很仰慕东晋政治家谢安。不知是不是受了谢安与东山妓的影响，李白遇到金陵子之后，也生出想与她携手同行的想法。李白关于金陵女子的诗有很多，像《陌上赠美人》《对酒》中的七古《出妓金陵子呈六》等，都是写和金陵女子的。如果碰巧里面的金陵子是一个人（就是那个小妓女），那就是一出在路上偶遇被邀去青楼，喝醉了还睡在一起的风流韵事。在所有金陵的女子中，有一个有名字的叫做段七娘，李白也为她写过表白诗：《赠段七娘》罗袜凌波生网尘，那能得计访情亲。千杯绿酒何辞醉，一面红妆恼杀人。内容大概就是你就像洛神一样美，有什么办法能与你亲近亲近呢？是谁给了你这么漂亮的脸蛋呀么么哒～当然啦，李白这一生写诗无数，被后人yy出来的有的没的的女人（或男人？）更是数不胜数，我讲的这几首仅仅是九牛一毛罢了。李白的诗将其理解成与女子的暧昧邂逅也可，对帝王的仰慕和被重用的渴望也可，到底是为谁写的又有哪些故事许多已经不可考了。我说的这些大家就当野史一样看看，说它确有其事也好牵强附会也罢，权当一乐，不必当真。最重要的是这个男人用他传奇的一生和无人能比的浪漫情怀给我们留下了如此多的佳作，在文学史上留下了最浓墨重彩的一比，比起他的韵事，他的作品更值得关注和欣赏。", "answer_votes": "32", "answer_comment": "​9 条评论"}
{"answer_author": "寧莞", "answer_id": 39933808, "answer_text": "@匡靖   因为王维和李龟年是一对，李白不愿挖墙角.有诗为证：王维《江上赠李龟年》又名《红豆》红豆生南国 春来发几枝愿君多采撷 此物最相思", "answer_votes": "18", "answer_comment": "​4 条评论"}
{"answer_author": "崔式微", "answer_id": 113100923, "answer_text": "【李太白深情告白为哪般？】（排版爪机无力_(:_」∠)_见谅）说到李太白，大家可以说是非常之熟悉了，脑海里可以马上或是浮现一柄清亮长剑，一席碧绦长衫，手挽酒葫芦迎风长啸的出世地仙模样，可谓是仙风道骨，餐风饮露。亦或是“脱身白刃里，杀人红尘中”的少年游侠，“片言苟会心，掩卷忽而笑。”耽文书生。任谁也不会想到我白哥还素一个多情滴人儿呀~不服不行(๑•ั็ω•็ั๑)  先让咱来八一八白哥表白过的那一篓子人~（排名不分先后）No.1孟浩然出处《赠孟浩然》开头一句便直抒胸臆，摄人心魄“吾爱孟夫子，风流天下闻。”啧啧，瞧瞧我白哥，要的就是语不惊人死不休，光凭这一句孟夫子不沦陷也不行呀~乘胜追击，“红颜弃轩冕，白首卧云松。”翻译过来就是，孟夫子啊你年轻的时候那么潇洒，老了还是这么帅气~“醉月频中圣，迷花不事君。”又是一溜的排比，你醉了也帅，不当官也帅。【ps：多说一句，这两段还是有点小瑕疵，理论上绝句同一意象是不能出现两次的。三句与六句俱有弃仕之意，故小病。】“高山安可仰，徒此倚清芬。”你像巍峨的高山，又像清芬的兰草~要我如何不敬你爱你嘤嘤嘤~好湿好湿果然好诗o(*////▽////*)qNo.2杜甫杜子美出处《沙丘城下寄杜甫》这是子美与太白在东鲁分手的第一年，遥想东鲁同游之时，情投意合饮酒论诗，好不快活，“醉眠秋共被，携手日同行。”乃至到了杜甫晚年还恋恋不忘写到“何时一樽酒，从与细论文。”第一句便对杜子美吐露出了离别后自己的孤寂，无法排遣。“我来竟何事，高卧沙丘城。”我离开你到底是为了什么啊，成天无聊的想睡觉。连带着看周边的景物也好像变的萧瑟起来“城边有古树，日夕连秋声。”无趣呀无趣，从白天到夜晚能陪伴我的只有沙沙的风声，却再也回不到我们畅谈彻夜的日子了啊。“鲁酒不可醉，齐歌空复情。”我又喝起了我们一起醉过去的鲁酒，这才发现原来这鲁酒是如此的单薄，再不复一年前‘齐歌尚舞，饮少辄醉’的感觉了。前三联无一“思”字，亦无一“君”字，然句中无一处不是“思君”二字。“思君如汶水，浩荡寄南征。”白之情深若此，可为一叹。No.3韦冰出处《赠江夏韦南陵冰》此人初闻其名大家肯定不太熟悉，心想怎么又和李白联系起来了。其实他们的故事离我们是很亲近的才对，因为他两相逢之处正是江夏（今武汉武昌区）。与杜子美李龟年江南观众与偶像之逢不同的是，他俩是正儿八经的长安好基友(๑´ㅂ`๑)而且具本诗来看他俩聚在一起就变成了熊孩子组合。“我且为君槌碎黄鹤楼，君亦为吾倒却鹦鹉洲。”夭寿啦李白一言不合就要发狂辣，人生三相知，一起同过窗一起抗过枪一起咳咳...革命的友谊颠簸不破。但是还是还得把黄鹤楼鹦鹉洲好好留下来啊喂！【虚眼】", "answer_votes": "6", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 210131530, "answer_text": "一看李白就不是什么正经诗人，迷弟众多，来自唐伯虎的倾慕，八个“李白”，没谁了&lt;img src=\"https://pic1.zhimg.com/50/v2-fcd66cb01684da07d323061b356f9075_hd.jpg\" data-rawwidth=\"1080\" data-rawheight=\"1937\" class=\"origin_image zh-lightbox-thumb\" width=\"1080\" data-original=\"https://pic1.zhimg.com/v2-fcd66cb01684da07d323061b356f9075_r.jpg\"&gt;", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "镯子", "answer_id": 118728102, "answer_text": "比较深情的基友有老孟，岑夫子，元丹丘，阿倍，王昌龄等等……曾经还有达夫哥，说来话长。评论里有说他跟摩诘因为玉真公主不和的！！！不要相信那纯属扯淡&lt;img src=\"https://pic3.zhimg.com/50/aab82b452f263afd42c6b9b37dabd087_hd.jpg\" data-rawwidth=\"48\" data-rawheight=\"48\" class=\"content_image\" width=\"48\"&gt;", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "裘布德", "answer_id": 39783212, "answer_text": "我写了答案在评论区哦以及不好实名反对什么的哈哈哈氧化钙！不知道开毛黄腔！→ → 带上结论表示不要折叠好了元丹丘真的 太白写了好多好多赠他的对了题主问的是有多少位 大家答对题好不好反正不少于10位 然后没细数了话说不同人对“表白”二字的定义不同写到这里才发现这个问题多么多么无聊啊！碎了、、", "answer_votes": "2", "answer_comment": "​16 条评论"}
{"answer_author": "夏凯", "answer_id": 280261094, "answer_text": "李白，比较感激的诗人是贺知章，可谓有知遇之恩。贺知章金龟换酒，亦成为千古佳话。贺知章读了李白的诗，惊呼为“谪仙人”。贺知章告老还乡的时候，李白写了《送贺宾客归越》：送贺宾客归越镜湖流水漾清波，狂客归舟逸兴多。山阴道士如相见，应写黄庭换白鹅。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 31152338, "answer_text": "《赠孟浩然》      李白吾爱孟夫子，风流天下闻。红颜弃轩冕，白首卧松云。 醉月频中圣，迷花不事君。高山安可仰，徒此揖清芬。 ", "answer_votes": "0", "answer_comment": "​3 条评论"}
{"answer_author": "apewest", "answer_id": 101918340, "answer_text": "手持锦袍覆我身，我醉横眠枕其股。", "answer_votes": "0", "answer_comment": "​添加评论"}
