{"question_id": "26289456", "question_text": "", "question_title": "做机器学习、大数据方面有什么轮子可以造？", "question_commet": "​2 条评论", "answer_number": "5 个回答", "question_followers": "256", "brower_number": "3,712"}
{"answer_author": "周开拓", "answer_id": 32598492, "answer_text": "谢邀，这个问题太大了。。。而且小弟我是做产品的，工程只懂皮毛，所以仅从个人的理解来讲一下。首先给出结论：有很多轮子可以造，但是轮子都在底层，而且机器学习在工程应用的领域还没有什么公认好用适应各个应用场景的统一的框架（像web里面的那些）目前机器学习这个领域发展实在太快了，新的技术和方法的出现每年都有，也许去年看着还很牛逼轰轰的技术，第二年就被发现根本死路一条。所以从机器学习的角度来讲，算法层面真的没啥轮子可造，要么能造的早就造好了，要么具体工程场景每个公司的数据、业务都是高度定制化个性化的。比如淘宝的推荐系统可能京东就没法用，淘宝上能实现的某些特征，京东就抓取不到。这还都是电商，何况不同的互联网领域了。而且业务逻辑和目标老他妈变，这全世界都一样没啥好提的。但是往下一层，从存储到容器，却还是有很多轮子可以造的,但是这个东西太偏向工程了。一般人，至少个别人还造不了。比如随着推荐算法的发展：特征越来越多、越来越复杂、越来越多样化，以前可能一个i2i就能解决的问题，现在要有偏好，要有用户的历史行为，要有许多我跟公司签了保密协议不能说的特征（当然是在保护用户隐私及合法的前提下）对实时性的要求越来越高，比如大家有兴趣可以看看淘宝首页的“发现好货”区域以及我的淘宝中下的推荐模块，就是我们的算法团队做的，你可以看看这些内容和你的行为是什么关系。以上两个方向都被无数的数据证明了有良好的效果。提升是显著的，在淘宝这样巨大的平台，一点点算法优化都可以带来数倍甚至数百倍于算法工程师工资的经济效益。那么就对底层有了越来越高的要求，存储、容器，层层缓存、计算量的水平扩展和离线、实时策略的组合。都导致了对这些底层轮子越来越高的要求。比如即将到来的双11，我们将见证人类工程史上最大（好吧也许有之一）的机器学习算法群为来自全球的亿万消费者即时提供个性化服务。最后是广告，淘宝推荐团队在招募，站内私信即可。身怀绝技、有志于挑战技术极限的工程师我们希望你熟悉java/C/python之一，希望你对技术有执着的热情，不光知其形、还要知其神；希望你熟悉机器学习的基本算法及其应用，最好有2年或者以上的实战经验。有责任心、有想法有执行力的运营、产品我们希望你熟悉用户产品、希望你有2年或者更多的大型互联网产品的管理、运营经验、希望你对产品有执着的追求；希望你能说会道，不管谁以什么名义和理由来强奸你和你的产品，你能守得住自己的目标和用户体验（当然，如果真的被强奸了，希望你也有微笑面对的胸襟。）。最重要的是你应当是一个有底线、有节操、有自己特有的坚持和价值观（特别傻逼的价值观也行）的人；淘宝推荐团队是一个鼓励有自己想法的团队，老板就是用来给你挑战的。哦还有一个忘记说了，希望你能在我们需要的时候可以做好测试、数据分析师、交互、打字员等一切开发没时间做的事情，谢谢！", "answer_votes": "6", "answer_comment": "​4 条评论"}
{"answer_author": "InsaneGuy", "answer_id": 33565597, "answer_text": "ConvNetJS: Deep Learning in your browser，作者是斯坦福大学的博士生Andrej Karpathy。该项目是一个基于JavaScript的深度学习library，可以让你在浏览器中训练深度学习模型，能够帮助Deep Learning初学者更快、更直观的理解算法。它的代码托管在Github上：karpathy/convnetjs · GitHub，一起去造轮子吧~", "answer_votes": "13", "answer_comment": "​1 条评论"}
{"answer_author": "全大葱", "answer_id": 74322651, "answer_text": "啥叫机器学习，题主理解了么？", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "白神来了", "answer_id": 33605857, "answer_text": "这个问题不 @vczh 一下轮子哥都不好意思另外开下脑洞，如果有一个能用上显卡的如游戏画面般的适用于hadoop平台的分布式3D数据分析可视化工具是不是很叼。。。。", "answer_votes": "0", "answer_comment": "​2 条评论"}
{"answer_author": "匿名用户", "answer_id": 74263756, "answer_text": "各种采样算法的并行化方案", "answer_votes": "0", "answer_comment": "​添加评论"}
