{"question_id": "28558672", "question_text": "华中科技大学", "question_title": "如何评价华中科技大学？", "question_commet": "​2 条评论", "answer_number": "107 个回答", "question_followers": "1,091", "brower_number": "560,487"}
{"answer_author": "知乎用户", "answer_id": 44480809, "answer_text": "--------------------------------感谢大家的赞赏，但是希望大家不要再问我，“华科XX专业好不好？“的问题，第一，我只读了一个专业，大多数专业我都不了解；第二，什么叫“好”？好都是相对的，你的参照物是什么？第三，我如果说不好，一定会引来争议，而我的本意并非如此。--------------------------------正文作为在华科读完本科的学生，后来推免清华硕士，我想对华科做中肯的评价，以给后人更多参考。从就业上说，我想分理工和商科，我较熟悉。工科华科在全国是叫得出名字的，机械，电气，计算机软件，但是呢，三分之一去了深圳，为何？第一，北上的好学校太多，华科名气不够；深圳是软件产业最密集的地方，民企最多的地方，北京学校学生相对更热爱国企（北京国企最多），上海学校爱外企（上海是大陆外企最集中的地），华科学生好多进民企，oppo,华为，华星广电。商科，只能这么说，高考分数和你的就业机会成正比了，第一，如果你是华科经管本科生，你可能不知道实习对于你的重要性，如果你还想着说我是全国排名第十的学校学生，那么就业时候就麻烦了。上财，上外，甚至上海大学商学学生机会比你多太多，big name intern真的比你想象重要，华科的商科直接就业不好，没有在行业的强大校友资源，真的比上海高校差太多，就业意识太弱了。一般来说，现在国内少数几所顶尖大学的商学院和部分一流商科大学的学生，在本科就业上已经和国际一流大学的同学们的步伐接近，这句话如何理解？一般来说，商科学生的最为典型的路线是：大一刷GPA，参加学生组织，开始参加公司组织的一些networking活动；大二，找一份平时实习，咨询，投行，四大等，第一份实习很难找，一般靠学长学姐和同学或者家人推荐，公司名气最好要大，这是开眼界的过程；大三上，当全国99.99%的大学生还在刷淘宝，Dota，最多在自习室啃书的时候，早鸟们在干嘛？申请大公司的Summer Intern，大家问这是个什么？就好比高考前的自主招生，大学的保研，最好的公司都会通过正式的暑期实习来录用一批人，校招再招一批人，外资投行基本全部在暑期实习生中留用，外资咨询的话大约一半，宝洁也是这样招人，这个暑期实习的待遇，一般来说拿的是全职员工的工资，或者打八折，在香港的外资投行基本5万块一个月，咨询大约两万多，宝洁广州大约8K，四大的暑期实习不是很流行，因为他们那时候是审计淡季；接下来有人问，你没搞错吧，大三上就面试暑期实习？不是最早也是大三下吗？是的，95%的公司暑期实习生都是大三下，但外资投行和宝洁是大三上，外资咨询虽然晚一些，但是也在大三下一开学，麦肯锡是大三上那个过年投简历。然后经过大三暑假的暑期实习，基本好的留用，运气不好的就校招，由于有了正规的大公司暑期实习，找工作也很好找。醒醒吧，少年，仔细理一下，本科毕业想要找好工作，你很早就得准备了，不要说我大四上秋招已经比考研失败的人参加春招早很多了，事实上，你已经是晚鸟了。清北复交经管学院的好学生，一般大三上会出国交换，在国外的时候申请大三暑假的暑期实习，要么回国面试，或者公司会视频电话面试，这，就是Trajectory，成功的人绝对不可能是偶然的。如果是理工科，即使清北，绝大多数也是一头雾水，到秋招季节，要么毫无头绪，就顺其自然保研或者自费出国读硕，要么铁定科研，就国内直博或者出国读博。另外，举个没有严格数据的鲜明例子，华科和中山大学在各位心中地位如何？差不多吧，为什么，因为华科的工科完爆中大，但商科就被中大完爆，至少在就业和申请出国上。华科商科多少学生去London Business School？目测不多，有去Northwestern的凯洛格商学院吗？有去Booth Business School of Chicago University的吗？或者其他Magic 7?估计一年可能都不多，经管前几名很多保送国内学校了，由此可推测，这些国际知名商学院去读研不多，但是，各位！中大每年很多人去！那么，华科商科在国外名声没打出来，有机会各位，一定努力，保研去上海好的高校，北京好的高校，如果你是经管学生，保研去，不行就考研，最少去武大，中大，不要盯着综合排名，当你看到他们简历上的实习，你就来不及了。企业不看高校排名，只看印象。当你看应届生，实习僧等，翻过去三页找不到一个武汉的实习，就算有一个，也是码农实习岗位，你就明白高考分数为何上海财大高。对于商科的学生，还有一个极大帮助大家找工作的方法，就是参加国际性至少是国内的商科比赛，具体的比如欧莱雅的，hsbc的，Bertersmn workshop, maybank的mgac，自己搜索吧，一来可以出学校见识各种人，早知道自己不足，二来自信心极大增加，三来自己的简历和经验增长很多，眼界对于自己及时调整努力方向很重要，独学而无友，孤陋而寡闻嘛。第二，学生质量。首先，华科学生过多，本科生一届7,000到8,000人，清华北大各3,500，浙大很大，也就5,000，学生多了就要降低分数线，自然影响生源，至于为什么这么多，我不太清楚，反正武大也是7,000左右。我的眼界只能看到华科学生毕业三年的样子，长远发展不敢说。华科成绩排名前四分之一的学生，是有较好的能力和竞争力和思考力，和上交浙大学生平均水平上下。你要说，你怎么只看成绩，不看leadership，但是经验来说就是这样，排除少数校会主席层以及科学竞赛获胜者，比如Acm等。这个是比较容易理解的，成绩好的人做事有毅力，focus，这是成功的极为重要的要素（几乎是必要条件）。但从华科毕业找工作，第一份工作起点很难高，当然，C9学校的西交，哈工大和华科其实是差不多的，他们在三线城市，地理位置很不好，也是工科学校。咨询投行不用想，差太远了，能去华为就算不错了，除非你去好的学校读研。此处我提供一个数据，大家可能在别的地方也看到过一些就业薪资数据，但是不一定准确。我提供部分热门公司数据（2016年，为了各方利益，所有数据没有给精准数字），华为在华科招生，硕士月薪约为RMB 10K-11K/month，非常优秀的可以到13K-15K，本科9K-10K，华为在清北招硕士差不多15K到20K, 均为14个月到16个月。国际四大会计师事务所除了咨询业务，依然8K-9K/month。MBB每家年薪，16年入职的话总年薪40万，高盛的话15年入职投行部大约55万年薪，罗兰贝格16-17年package大约22万(base不到20万），Oliver Wyman年薪也有40万(base所有咨询公司里最高，突破30万），其余二线咨询atk等总年薪约为35万，宝洁所有部门2017年依旧12K/month，14个月，所有数据均为第一年入职，毫无疑问真实。华科学生，相对中大，上财等学生，做事情确实比较埋头，认真，但是眼界不够开阔。工科生技术上平均比较厉害，商科生由于没有硬技术的优势，普遍拼经历，实习，英语，交流，想法，华科商科生在这个上不行，约在全国三十，工科前十。关于出国，本科直接出去不建议，现在趋势是，美国前20，欧洲前十，亚洲其他国家前十左右（东大，京大，国大等），加拿大前3（特指麦吉尔，多伦多，英属哥伦比亚，虽然多伦多本科特别水，本科一届17,000人，但是硕士相对好一些，麦吉尔特别好，British Columbia有些项目不错），回国找工作，和清北复交有得一拼，其余的，比不上清北复交。要是你问我澳洲和香港读硕士如何，那么我觉得你可能还没对整个留学行情有个基本了解。先直接下结论：港硕（除了少数的Master of Philosophy, 那是每个月有1万多港币的政府奖学金的）很水，因为不要毕业论文，基本是一年，多的一年半，当然上课也要写paper，总体来说，无论留港还是回内地就业形势不太好，学费平均一年10万，投资回报率低，而且有个找工作时间问题，就是，大陆找工作都是提前一年，但是你去香港master如果读一年，那你得毕业了回来找，那时候压力就很大了，澳洲硕士差不多，成本还高一些。其余非英语国家（排除瑞士，日本等拥有少数顶尖名校的），或者爱尔兰，新西兰等英语小国，你为了体验生活可以，为了就业或者研究深造，还是算了，搞研究的话还是去美国，或者英国少数顶尖高校。国内企业不看国际排名，看印象，比如你是赫尔辛基大学毕业，和你是复旦毕业，国内企业首选哪个？但是赫尔辛基大学国际排名高于复旦。外企也不看。因为他们知道国内竞争激励，往往国内好的企业海外招聘国人回国，就说985高校的或者世界前100的。华科本科能去上述顶尖海外学校的，非常少数，我本科同学，成绩比我好（加权90），专业第二，托福99分（不算差），GRE330+，但是最后去了德州农机（半奖），她其实完全可以保送清北，但她想留在美国发展（那是另外一回事），如果想回国发展，不要直接出国。另外一点，华科学生英语平均水平不行，比北上学生要差，这个是有基础原因的。华科的学生，中部占了很多，两广两湖，河南河北，这些地方在中学时代，英语教育落后于东部的江浙，更比不上上海，比如，河南省高考不考听力（至少在2010年以前），这导致了严重的应试，并且从来不听英语，口语尤其不练，大学想补上来，需要极好的方法和意志。我在大学时代，英语很重视，到大四的时候，考了托福，111，在华科，至少我没遇到比我高的了，我觉得和我高中时代的基础是分不开的，硕士以后，我依旧认真学习，现在比111分时候好很多。我们单位托福平均也要110以上。而且，高中时代一旦不喜欢英语，大学没有人逼迫，就能难学好，因此，华科英语平均水平和高中时代基础有关，高中基础又和省份生源有关，我没有任何地域歧视的意思（我不是北京上海的），只是客观分析。因此，希望后来人一定要下苦功夫，练好英语，我考托福的两个月，每天学习英语8小时。你日后找工作，几乎每一家像样的企业，都会面试英语的。有的人又说了，在大陆嘛，我找个国企行了吧，机关单位不用英语吧，民企不看重外语吧，是的，你如果上大学仅仅为了一个混得下去的工作，英语过了四六级勉强，那是可以的。 但是给你个数据：全世界百分之九十的网页是英文的，互联网是全球最大的知识库，如果你英语好，看英文的网站，以后读英文的书本，那你获得的就是最先进，最好的资源，而且由于新闻审查制度，不用英文网站你还不知道世界主流是什么，不知道外面人怎么看我们，不知道世界的动向，只缘身在此山中。从质量上，你看看百度弹出来的那些烂广告，你再看看Yahoo, Google，这不是数量上差距。另外，如果读研，好的论文杂志都是英文的，这个趋势，不夸张地说，一百年内至少不会变。并且，全球五百强的那些中国企业，有几个不是靠monopoly？monopoly的后果是，你进了这些state owned enterprise，除非你关系够，否则，你就发展不自由，请转到：在中石油/国家电网等工作体验？的问题自己看吧。美国仍然将领导这个世界五十年以上，在你有生之年，英语绝对是世界主流，而且在中国普及度只会越来越广，比如清华本科最好的基地班，在学堂上课的那些，老师上课都最好讲英文，虽然有的老师口语很烂，没办法，趋势，比如，东京大学为了吸引国际本科生，开了个peak计划，不要你会日语，再比如，中国的企业，比如，华为，腾讯，都开始国际化。华科男女比例差不多2.5比1。男生的话，华科沉迷游戏的比例过高，导致少部分大学一事无成，其中部分毕业时候工资待遇很低，关键是职业起步就落后别人了。关于华科的硬件设施，食堂很多，但是分布不均匀，导致下课很拥挤。关于宿舍，现在有空调，还算可以了，单指东边和西边本科生的。我那时候没空调，夏天真的好热，睡不着，还断电。总体来讲，大陆绝大多数高校基础硬件都一个水平，和发达国家差距还比较大，至少每年夏天雨季，华科主干道积水的问题都没办法解决，清华也一样，稍微下雨就积水很多，无论华科清华，内地高校的管理水平，比如报销，宿舍等非核心部分，还是很落后的。关于一些实验室，排在全国前面，单比工科实验室，可能全国排第五左右了，光电国家实验室，是因为武汉是光谷的缘故，所以就坐落在了华科。理科的话，华科还行，比南大，科大，北大差远了，但是和其余的次一流高校有得一拼。文科的话，新闻还可以的，能在全国前十，医学，同济是不错的，毕竟那么大名气，和中山大学医学差不多。别的很多我不太了解了，但是总体华科还是工科著称的高校。关于国际交流，华科做得很不好，交流的人数太少太少了，有一个重要的原因是没有完善的选课和学分制度，而且学生家庭平均不那么富裕。我本科四年，除了公选课的10学分，所有学分都是安排的，没有选择，我们修了200个学分，其中，至少50个是性价比非常低的，完全应该砍。华科的本科和研究生的交流网站，叫湖北华中大出国留学培训中心，上面的交流很多是台湾的，台成清交都有，还有印度理工的。管院有和慕尼黑工大的交流，电气有亚琛的交流，。华科每年有两个新加坡国立大学的交流，很不错，近年来有和加州伯克利的交换，当然，这个是费用很贵的，别的都不用学费。此外，华科有一个良好的保研制度，尤其保外很受欢迎，单指工科，清华接收外校的每年最多的是华科，北大是武大最多，当然，比例上可能不是第一。有一点，想提醒学弟学妹，保外的时候，夏令营挺难的，除非你的加权排10%，英语也好，有一点小项目，不然南大都不要你，但是9月份保研季，很简单，15%，英语六级，基本能去交大，浙大很esay。清华的话，冲一冲也可能。所以大家大胆一点，不要怕。关于大学排名：\n因为之前答案分析太详细，我删掉了，综合了国内外很多的排名，在此直接给结论，较为综合的说，是大陆高校13名。\n另外，华科本科有个地方特别好，就是创业氛围，我此处不罗列数据，但是华科的创业回报率全国第一，知乎上有“为什么清华，北邮等学校的创业不如中部省份华科”的提问，这个是非常复杂的原因造成的，我不仔细分析，但是有创业想法的同学真的来对地方了，大陆没有更好的大学摇篮，华科的三大团队，冰岩作坊，dian团队，联创团队，建议大家加入，只针对想创业的同学，当然不是只说理工科，各种学科都欢迎。\n我是从职业发展的角度考虑的，如果你要学术，我也不特别懂，但是有一点，能有机会，不要留在国内读博，国内博士教育不行的，真心和美国学校差太多啦，2016十月补充：我现在舍友是清华博士，告诉我国内高校对于土博士歧视很重，清北博士不例外。\n我在华科四年印象最深的是带我毕业设计的老师，他在上课的时候都是嘻嘻哈哈的，但是上课反复强调一句话，这也是他大学和职业生涯的总结，我一直铭记，“大学时候你比人家厉害一点点，出去以后就不是一点点“。本科阶段应该扩展眼界，比专注一点更重要，不要让别人老说：华科学生只有匠才，没有帅才。大学多尝试，多认识不同行业厉害的人，把错误犯在校园，哪怕考了零分，还能补考，不行还能重修，要是毕业了就没机会了。\n补充：很多评论说自己是经管，文科的，很紧张，不用紧张，你可能没有看明白我的意思：如果你是商科或者文科，那么我的建议是去清北复交浙大南大（南京不是南开）人大读研，不行就去中大，武大读研，然后出来工作，那时候平台会高，至于怎么去，只有努力啦。\n——————————————————————————————————————————\n6/21/2016 Update:\n最近好久没上知乎，天天忙于为了今年校招的笔试面试在准备。最近看了一些case book和Mankiw的Principles of Economics，参加了一些咨询公司的小型交流会，和同道的同学多有交流，有了许多心得，主要针对以后的职业发展的，写得不对的地方请指正（以下所有内容均指中国大陆的情况）。\n首先还是分理工科和商业的职业，在清华这个中国理工最好的地方，我发现理工科学生就业的发展貌似不如商科。这个其实是有深刻的原因的。如果理工科学生毕业去做研发，那么就有个问题，还是三类企业，国企，外企，民营企业，如果你去国企，比如，国家电网，三桶油（石化，石油，海油）等等，因为垄断企业的管理是较为落后的，在清华顶尖的学生是不去国企的（这是实情，以前爱去国家电网），因为职业发展受限，或者说career path不清晰，大家可以尽情知乎上搜索，怎么看待清华电气博士在基层待6年？；外企的话，General Motors, General Electric，BMW，Intel，Shell等，都是全球顶尖的制造型企业，但是他们30年前来中国，是因为两个原因：1. Market size (中国市场大）,2. Labor cost（中国人工便宜），这是根本原因，后来中国教育上去了，有些公司开始有研发了，但是还是没有改变根本，那些研发，绝大多数不是核心技术，我举两个例子，第一个，我的同学在清华汽车系，他去大众研发部实习，回来和我说，部门只是把德国的技术做本地化调试，第二个，我去听过空客集团大中华区总裁的演讲，有人问：您觉得外企在中国发展最重要的是什么？他说：Keep the core technology secret. 所以去外企研发部岂不很委屈？（但是有些技术含量低的外企，比如P&G等FMCG企业，大陆是会有核心研发的，但是那些企业的核心部门又是Marketing），互联网企业比如yahoo, hulu, Google都有大陆研发中心，但是核心技术还在硅谷，中国的工程师被硅谷的歧视比较严重；如果去民企，这是研发的好地方，自己国人的企业，但是问题还是，管理体制跟不上，太年轻，中国品牌想登上国际舞台还得十年，已经有很多华为等领头羊出现了，清华厉害的学生不是特别情愿去一个国内企业，还有企业名声的原因。那么理工科的就业为什么不如商科（这里针对大陆最顶尖的学校毕业生，清北复交），因为国内制造落后，制造行业需要积累，中国还跟不上，而外企又不愿意在中国有核心研发，但你又不会出国工作，美国本科毕业平均工资最高的是理工，因为发达国家的技术领先，那么顶尖学校商科为什么就业好？因为，商业型外企在中国是真的有核心业务的，VC/PE，投行，咨询在国内做的事情和国外本质一样，所以你进了这些企业，就相当于你作为一个发展中国家的学生进入了一个发达国家企业的核心部门，这在几十年前的中国是难以想象的，那为什么就顶尖学校的商科好呢？因为好的商业型企业少，招人少，如果多了pay就会降低，四大是最好的案例，十年前那么牛逼，现在呢？就吸引不到人才，而外资金融和咨询在中国是人才最为聚集的地方。\n那么大家会问，什么样的企业好。到底工资，奖金，职业发展，累不累，工作地点，外企国企哪个最重要？有一个标准是绝对准确的：哪个企业的员工起点高，哪个企业就好。起点表现在学校，成绩，外语等。在应届生市场上反应的现象就是：越是优秀的人扎堆的企业一定有他的优势。宝洁的市场部，三大咨询公司，外资投行，Google研发等。因为目前的就业市场是自由市场，由于信息的流通性，最好的地方一定有最好的人扎堆，你一定不可能找到一个非常好但是竞争不激烈的公司。这就像世界上哪里有钱赚，一定有人去一个道理。\n在今后职业的发展上，如果你只求安稳和生活，那么我不能给什么建议（没有说不好，每个人对于人生的理解都不一样，无正误之分），我想给的建议仅针对有事业心的人：你开始工作，仍然没有结束你的学习里程，不是说工作开始，就等于开始了过日子，因为，前几年特别重要。一定要选择一个发展很快的企业，你在里面几年就升级一次，工作内容要么能够研究很深，要么能够见识广，至少有一个。不要着眼于刚开始的一点工资，1万每月还是8000，那点差别几年后根本什么都不算。你进了这个企业就像进了一个学习压力很大的大学，几年一过，你可以跳槽，那个时候，你和大学毕业进了很闲企业的同学比，你就非常厉害，工资翻几倍了。那么等到你觉得你钱够了的时候，你就可以开始安稳一点了。真正好的企业效率很高，里面的人都做事绝对靠谱，效率，比如在高盛，老板说明早交报告，那么一定可以做到，而且非常漂亮，不可能出现像你在报销发票一样拖拉的，因为报销发票地方，工资很低，而越聪明的人，越往好的地方集中，效率就越高，成长越快，钱越多，这是良性循环。", "answer_votes": "1K", "answer_comment": "​286 条评论"}
{"answer_author": "知乎用户", "answer_id": 41560018, "answer_text": "作为一个关山口学渣关注这个话题几天了，终于忍不住放下了毕设开题报告，决定来答一下。从我相对了解的几个方面来说一下吧。一、“森林大学”名副其实。       华科树非常多，学校的每一条路的两旁都是树。大部分是建校之初栽的，平均年龄50岁以上，以悬铃木（俗称“法国梧桐”）、广玉兰和樟树为主。华中工学院的第二任院长朱九思先生爱树如命，他将当初喻家山下的那片荒芜之地变成了如今郁郁葱葱的森林大学。据说华科每砍一棵树之前都要向校长汇报，校长亲自签字才允许砍，这个规矩是从朱九思先生当校长时确立的，执行至今。因此，我大学四年从没见过学校砍树，只见过学校种树（树苗还是植树节的时候发的，必须要种）。（另外，朱九思先生在文革时期收留了大量被其他高校”打倒“的教授，如呵护树苗一样呵护这些人才，在那个特殊的时期，华中工学院的师资力量得到了极大的提升。）       树多好乘凉，华科地处“大火炉”武汉，由于这些年过半百的树的存在，夏天校内的温度比校外低1~2度。而在乘凉之前，Huster每年三四月是要经过“梧桐雨”洗礼的。春天的时候，路两旁的法国梧桐会飘落大量带着毛毛的种子，这些棕色的毛会飞进眼睛里、鼻子里、嘴里，挂在头上、衣服上，跳进你从食堂打的饭里，每次呼吸都伴着梧桐的子子孙孙。每年这段时间，很多Huster会过敏，路上的行人都带着口罩，也曾有人强烈要求学校砍掉这些子孙满地的树，可这里是华科呀。二、学校基础设施      主要的教学楼只有四栋：西十二（据说曾是亚洲第三大教学楼）、西五、东九(据说曾是亚洲第一大的教学楼)和东十二楼。      东西两地相隔甚远，因此教务处排课要求是如果连排一定要安排在同一边。由于上课地点相对集中，所以上下课高峰时间段从宿舍到教学楼的路上非常壮观，乌压压全是男生（尤其西边= =）。       西十二、东九设备都不错，桌椅也比较新。       我想要说的是西五楼。我校有一个引以为豪的“人文讲座”，每周有2~3期（除考试周和假期之外），现在已有2000多期了。这个人文讲座请过非常多的大师，而地点经常是在西五117室。这个光荣的117，背负着重要的“提升全校师生的人文素养包括楼管阿姨在内”的任务，见证着一位位Huster的情操“被陶冶”，如今已经是老态龙钟了。       老到什么程度呢？        讲座都是晚上7点开始，通常是需要提前一两个小时占座的。有一天你匆匆忙忙下课忘记占座，吃完饭已经六点半了，你才想起来晚上有讲座，你一路飞奔，跑进了那个历史人文气息浓厚的117，结果发现大家都像在搞欢迎仪式一样站在过道里和教室后面，很多前排座位都空着，仿佛在等着你入座似的。你喜出望外，头顶光环地走向“御座”，准备扶着丫鬟的手坐下的时候，你发现它是一个“皇帝的座位”——据说傻瓜都是看不到这个座位的。皇帝当然不是傻瓜，所以你还是准备坐下。咣当一声，皇帝坐在了水泥地上，视线被课桌挡住，连黑板都看不到。周围站在过道里欢迎领导的群众演员们哄堂大笑。（基本情况：每排大概十几个座位吧，几乎一半都是坏的。）       如果一定要在117办讲座，为什么不修缮一下呢。让教授讲得方便，学生听得舒心多好。（感谢评论里 @默林 提醒，得知现在西五已经跟上了其他教学楼的步伐，117也返老还童了~）（上面提到楼管阿姨是因为华科紫菘公寓有一位周阿姨，白天做宿舍管理员，晚上会读书学习，有讲座一定会去听，而且会做笔记。她被李培根校长看望且表扬过，还邀请她一起去启明读书会。仔细想想华科此类“扫地僧”不少，还有紫菘的一位年过五旬的保洁员，用手机打字写了二十多万字的剧本。另有某教学楼的保安据说自学过了四级，还有考研成功离职的。）       再来说说宿舍条件吧，本科生主要是分布在紫菘学生公寓（西）和韵苑学生公寓（东）。除了韵苑的小部分宿舍之外，其他本科生宿舍均是带独卫和阳台的四人间，上床下桌。空调是2013年才装的，之前冬天取暖都是靠抖的。听说今年会装热水器，以后可以在宿舍洗热水澡了。还有一个神秘的地方也有少量本科生，所有的本科生码农（仅指计算机学院的码农，软件学院的码农在韵苑，谢谢评论里的学弟指正），都住在这里——沁苑。只有沁苑学生公寓有校园网WiFi热点，但也只有沁苑是水泥地。还曾有一位沁苑的学长根据《陋室铭》改编了一篇《沁苑铭》。（不知作者名字，哪位若知道这位学长的名字请告诉我，我补充在这里。）（已补充~）沁苑铭作者 @Eidosper楼不在矮，无电梯则名。水不在少，收费则灵。斯决不是陋室，惟典华男德馨。苔痕上阶乱，草色入窗青。谈笑有光棍，往来无女生。可以调代码，阅语英。无丝竹之悦耳，有作业之劳形。九栋伞翼舞，东十路漪泠。根叔云：何陋之有？沁苑学长示学弟学妹毕业元知万事空，但悲不得空调用。东一食堂开张日，短信勿忘告乃兄！（空调已于2014年暑可用）       食堂——学校共有34个食堂，适应各种消费水平、各种口味。但总体来说，西边的食堂水平远远超过东边。华科的食堂平均水平应该是远超湖北省其他高校的，大概在全国也属于高水平。为什么这么多食堂以及为什么口味还不错，传说是这样的：杨叔子院士全家都不会做饭，每天都要吃食堂，那时候的食堂一点都不好吃，杨院士暗想（请脑补江西湖北方言混合口音）：“君子报仇，十年不晚。今天让我吃这难吃的饭，十年后全部打入大牢反省！”过几年，他当上校长以后，大力整顿后勤，新建了很多食堂且提升了食堂的烹饪水平。从此，华科的美食之路启程了。（纯属玩笑）       最后提一下华科没有的，礼堂。华科作为一个理工科大学，文艺活动也不算太少。学校的艺术团水平也不错，每年有“键上人生”等各种音乐会，大家也都兴致勃勃。但是这么多年一直没有一个正式的礼堂，这些活动每次都只能在某学院楼的报告厅里或者校史馆前的空地上（= =）举行。衷心希望在近五年内，华科能有一个礼堂。===========等会换手机继续写==============身为大四狗的我被断电断网了，手机客户端居然不能编辑→_→只好打开了网页版继续填坑。======================================三、学风       先从断电断网这事说起。全校本科生每天23点断电，24点断网。我大一的时候（2011年）还不断网，后来据说有同学向学校提意见，说室友晚上打游戏影响他休息，要求断网。从此，每天0点到7点之间就不能登录校园网了，研究生是可以用的，所以会有同学管研究生借账号半夜起来看足球比赛。       华科学生提的意见似乎还挺受重视的，下面再讲一个例子。       李培根校长在任的时候，有一次在西五117讲了一期人文讲座。期间有提问环节，有一位同学问：“华科很多考试的题型比较固定，有些同学平时不努力学习，最后临近考试靠刷题取得高分，请问您怎么看待这种现象？”根叔说：“我会和教务处讨论这个问题的。”（大概意思，具体说法不记得了）当天晚上人人上被刷屏在讨论这个同学，骂他的居多。很多人说要人肉他。我看大家讨论的时候无意间发现了这位同学的人人，就顺手加了他好友，结果大概过了半个小时左右，一大批人来问我我是不是认识xx（他的名字），打听他的基本情况，其中包括我的辅导员=_=。这位同学的人人我大概看了看，其中让我至今印象深刻的几条：“今晚做了一件自认为比较勇敢的事情”（就是指向根叔提问）、“今天下雨了，不用上体育课，又可以去自习了，好开心。”       他提问之后几天，华科的考试周开始了，这个考试周实在太惨烈了。我了解到的几个院系（工科为主）全部吐槽说卷子变难了。以我考的数理方程与特殊函数为例，以前第一道题就是写一下特征值和特征方程这种难度，结果我看到的卷子的第一道题是含参解方程，差不多是以前倒数几道题目的难度，然后一路难下去了。之前这种工程数学都会有很多同学考到满分，而这次全年级有三分之一的同学挂科了，大部分人分数都不高。结果是有大批同学去补考了，而这位英雄仍被人们所惦记。       这位爱自习的同学只是一个Huster的缩影，还有千千万万个这样的华科男，他们穿着拖鞋，背着双肩包，包左边的网兜装雨伞、右边网兜装水杯，每天早上起床去自习，风雨无阻。华科的同学真的是非常爱自习，考试周通常一座难求，此时周边的肯德基都坐满了自习的华科人，还会有人开房去自习（真的是在自习）。因此有“学在华科，玩在武大，爱在华师”一说。       从另一方面来看，天天自习大概也是无奈之举。华科课非常多，考试又多又密集，有的老师还会比较严苛，因此对付考试需要比较多的精力投入。       我认识的其他的学校的同学每学期的必修学分一般在15学分左右，而华科每个学期必修学分在30分左右。很多学校考试是结课后的一两周内进行考试，安排相对松散，而华科将所有考试安排在考试周（一般为第13周和第21周），我经常是考试周从周一到周五每天考一门。每次考试周都是一次涅槃重生=_=。       华科有一位因挂科出名的教授“汪挂挂”，还上过报纸，很多同学对他闻风丧胆，他的电路原理课是非常非常难过的，有学长毕业多年，仍要每年回来补考，据说补考如果卷面低于60分他是一定不会给过的，可以让人家重修一辈子。补充个新闻链接华科严师汪健几十年坚持“不放水” 都为学生好       华科挂科率达到30%的课比比皆是，师生们也都习以为常了。前段时间还听说我所在学院的一门大四的专业选修课挂科率达到了40%，现在他们边准备毕设边准备补考。       看到楼上一位学弟提到了英语教学的问题，想起来之前看到一个全国高校四六级平均分排行榜，华科排在42名，平均分只有437.46分，第一名是北大551.77分。虽然这是一个不完全统计的数据，但已经足以说明问题了。华科对于英语教学不够重视，很多所谓“英文教学”的课程也过于形式化，大部分人四年下来不但没有培养出读英文paper的能力和习惯，反而连高三水平都不如了。       另，华科的出国氛围也不如其他高校浓厚。大概是老师打分太低外加英语水平的原因吧～四、其他一些细节       华科创业氛围非常好，成功榜样也非常多，还在全国高校创业财富榜拿下第一。学校也挺重视这一块的，每年都有相应鼓励扶持政策。2014年的“创青春”全国大学生创业大赛（原“小挑”）在华科举行了全国总决赛，最终华科和上交并列第一。身边有认识的同学拿到了金奖，非常厉害。       华科有“牛皮纸情结”，作业本、实习报告、实习日志、毕设日志等很多本子都是牛皮纸的封皮，我的作业本还被武大的同学嘲笑过，说看起来很古董。       华科有个叫“公益劳动”的必修课，有学分，毕业前每个人都要劳动。一般春夏是拔草锄地，冬天是扫落叶，全班一起，持续一周。真的很累，学校大概是在告诉我们不好好学习就只能干体力活去当民工吧（       监督我们劳动的师傅还说学校每年只有在七八月分才会多招工，平时都是学生来干活的。      大部分Huster走路的时候都是会俯视45度盯着地面的，很少会盯着路上的行人看~最后贴一张华科的女生节特色横幅的照片吧～<img src=\"https://pic2.zhimg.com/50/12de4578e3d0e93a2bd412a6e16fe7f5_hd.jpg\" data-rawwidth=\"3264\" data-rawheight=\"2448\" class=\"origin_image zh-lightbox-thumb\" width=\"3264\" data-original=\"https://pic2.zhimg.com/12de4578e3d0e93a2bd412a6e16fe7f5_r.jpg\">", "answer_votes": "181", "answer_comment": "​82 条评论"}
{"answer_author": "沈子恒", "answer_id": 161033491, "answer_text": "华科16年本科毕业 保送清华华科让我懂得了 什么是母校，这座森林更是我唯一的母校。华科，使我懂得了即使是从山沟了爬出来的，也可以做学术，自信的生活。（本人长白山土著，家里学历最高的是我叔叔，小学六年级。。。）对于来清华读书，我是后悔的，年轻的我有点功利。当时国光的大老板力邀我去读硕士，而我竟然无厘头的用“想离老家近一点”进行搪塞。来清华更是偶然，因为当时港大和港中文给的是博士。Q1：为什么最终没有去香港？我想回华科！！！我想回华科！！！我想回华科！！！香港的博士，想回华科教书，真的好难好难。。。当时没有留下来，也有私心，想曲线救国，拿到海外博士，做出卓有成绩的成果再回母校教书，心甘情愿为这片森林服务一辈子。华科是低调的、包容的、团结的。大学四年，也组建了很多团队，毕业后有去北美杜克、约翰霍姆金斯、香港大学的；国内清华、北大、交大、浙大更多。这里我想解释一下，我并不是很赞同一楼校友的观点。我个人认为，出去读书的不仅仅为了更好的教育、学历、经济。还真有那么一些执着的人，真的想踏踏实实做学术，兢兢业业做技术，只为了一件事，回母校，做个讲师就行。下面是我最好的朋友和我在毕业册上留言（大体意思）：我不知道自己还能不能回来，华科，你和我娘一样伟大。（沈春旭/沈子恒   华科本  清华硕）努力努力，十年一“千人”，二十年一“院士”。（方贺  华科本 Duke PhD）最美的1037，最美的你，【还有一句很虐心，记不清了。。】 （李乔  华科本 香港大学PhD）其实，华科不是留不住人才，就像学长说的，土博士很受歧视，没有海外科研经历和较大的成果，想回华科真的很难很难。这是也我当时大四做选择时最纠结的地方，一个给了你无限爱与包容的地方，你竟然要走？？？？“只为了，更好的回来”，激励也算是骗自己吧！！！Q2：华科能给你什么？上面前辈们讲得很好，我仅想通过自己的视角阐述这片森林留给我的影响。情景一：毕业那一天（2016,6.18），华中科技大学东校门街边烧烤，来了无数次了，N多个午夜，我们做完项目，就在这里填填肚子。可是那天晚上，一切都不同了，我突然发现，长大了。。。要走了。。。更痛心的是，走了什么时候还能回来？？？我是东北人，说真的很少人能把我喝醉，那一晚真的醉了。。。我们几个兄弟凌晨两点从华科东校门走到了西十二又回到了韵苑。坚强了四年，那一刻泪水再也仍不住了，平时最强势直男癌，哭得一塌糊涂，感恩，都是感恩，一草一木，一个落叶都不忍心践踏。情景二：2016.12.26小贺从北美回来办理证件，乔和我请了病假，我们一起回了一趟武汉。这里仅仅说武汉，因为，我们没有进母校的大门，在南三门校牌外面，我们一起对母校深深地鞠躬。这一次我没有哭泣，李乔也没有哭泣，小贺哭了。可能是，离开了这片森林，在也没有这样一个群体无私的帮助你，像母亲一样守护你。我没有哭，是感觉愧对母校，半年来，没有任何成果拿得出手，没有为母校挣得一点点荣耀。Q3：怎么评价华科？一流的学术  单纯的人际   安静的书桌    静谧的校园Q4：对华科有什么期待？留住人才，留住人才，留住人才。人才的引进不应该用“海外博士” “海外工作三年”等作为约束。======================================================================我和我科的关系很简单：我努力三年终于投入她的怀抱她爱我，守护我，伴我成长。一夕之念  却又离她远去我根本不知道  什么时候还能回来5年？10年？还是20？可以放弃一切唯独母校和家庭我希望，你们好好的", "answer_votes": "89", "answer_comment": "​27 条评论"}
{"answer_author": "青石", "answer_id": 41293758, "answer_text": "小时候想去的是武大，毕业的时候，我发现，樱花虽好，我独爱石楠。正经点：离开课堂，忘掉的是技巧，留下的是方法，离开学校，忘掉的是知识，收获的是精神。这是信号与系统老师在考前面对纷纷要求划重点的学生说的话，大意如此。华科真的是不错的，教书育人的地方。四年的生活，特别开心！哪怕，极有可能，缺个妹子！", "answer_votes": "23", "answer_comment": "​15 条评论"}
{"answer_author": "Eidosper", "answer_id": 61808468, "answer_text": "居然因为《沁苑铭》被爱特了，荣幸之至。平时回答以抖机灵为主，这次来干货。作为一个在这里呆了6年的人，感受如下：1 如果在这读了本科，就别再在这里读研了。要是想读，往上走走吧。本人计算机，其他专业可能稍有不同。2 武汉是除了长三角 京津 珠三角之外较好的地方，长远来看除了北京 上海以及南京 杭州几所大学会在前头以外，其他的地方，暂时没有超过的可能性。合肥、西安地缘有些糟糕，估计学校很快就会受到牵连。互联网时代，落后一年相当于落后了两轮大潮。3 进可攻退可守。相比于北京来说，武汉物价便宜，毕业后留在武汉毫无压力。如果在北京读书，后面再留北京估计也会比较辛苦。当然，杭州 南京市政建设都比武汉好，但是周围有个上海，所以相对不是那么出众。如果读了四年大学，认为自己适合平静的生活，那留在武汉也是一种选择。进可以去清华北大读研，不过那样可能会压力大一点。对于出身小地方的人来讲，武汉也是可以接受的地方。4 学校整体财力还是不错的，去年过了50亿，当然和清北上交的100亿相比差着倍数，不过还是排在全国前十的。有钱能用钱来解决很多问题。5 平心而论，能来华科的话，以山东的情况为例，大概是3000/600000=0.5%，而清北大概是150/600000=0.025%，从整体来讲学生的实力是差一个量级的。百里挑一和万里挑一的差距，而这个差距反而更容易导致智商碾压，你用正态分布算一下，等人数划分下，越靠前智商差距越大。我觉得我在华科没有遇到智商能够碾压我的人，可能top2会有。排名最高的答主说看成绩，这条在计算机学院不成立。有人只愿意花6小时搞定一门课，剩下时间干点别的，这样的人也大有人在。但是无论成绩怎样，你努力了就有收获。不过成绩好还是有用的，毕竟设计课程的那些人都是高屋建瓴的，当真正从事本行业，才发现学的那些才是最核心的东西。6 女生的最高水准基本上代表了武汉女大学生的最高水准。靠智慧的美和单纯的胸大无脑还是差别很大的。华科女生前面的部分水平是比华师好一点的，武大的话接触不多，应该差不多吧。男生很多情商不高的，不过数量在这里，质量还是可以有的。奉劝一句，有没有妹子和妹子数量没关系。7 毕业游行被丁烈云同志给取消了？反正不让泼水了。8 累于武汉的创业环境不好，本校学生创业的情况也是令人蛋疼的。武汉除了德迅就没什么像样的投资人，华工创投是挺好不过不能带来钱以外的多少东西。唯一令人欣慰的是刘玉老师叫来很多外地的校友投资人，但是刘老师做事风格我持有保留态度，她希望三分钟决定一桩投资。森果senguo.cc-专业水果O2O第三方平台恋爱记－最暖心的情侣软件: 恋爱记录免费印成书这俩就是本科创业的，鉴于都是朋友，我就不评价了。创业这点，我也没听说武大有啥多大响，当然，这边也没啥大响。武大有雷军，华科缺少互联网的领军人物，张小龙再厉害，也只是马化腾的副手。9 对于厉害的人，华科通常只是个跳板，对于平庸的人，华科可以给一个像样的就业。今天开学季，一路看到家长来来往往，新生蛮有活力，我希望他们能有美好的四年。", "answer_votes": "37", "answer_comment": "​26 条评论"}
{"answer_author": "匿名用户", "answer_id": 41462315, "answer_text": "利益相关：华科 机制 大三.在这里也呆了快三年了 看着这个问题下一片和谐的样子 我来说点不好听的.既然是评价大学 硬件物质方面的我就不提了 就谈谈课程吧.以下体验仅针对本专业 误伤见谅.1.华科对于英语的教育太不重视(尤其是工科)大一一年的英语课必修课 每周两节 大二一年的英语选修课 也是每周两节 这就是我读大学能接受到的全部的英语教育.再看看课程质量 必修课的课本难度远不及新概念3 说难听一点 大概和我初中接受的英语教育水平差不多.而选修课的课程质量更是呵呵了 口语课就做着\"How are you?\" \"Fine thank you and you?\"的水平级的对话 一节课说不了10句英语. 老师以提问的方式点名 站起来只要站够10秒 就会让你坐下 反正本意也不是让你回答问题..对比一下 不往高里比 一些排名上比我们差的学校 每周都会有专门的精听 精读课 虽然我也不能说这种课对英语的提高就一定大 但我认为比那些名字听起来很炫酷的课好太多了.来看看现状 经过两年的英语学习 我们专业有一半人过不了6级 有80%的人6级上不了500分.不是说6级过了就代表英语水平高了 可这毕竟有一定联系.我们专业 所谓的王牌专业 每个人进校的分数基本都在华科分数线+40左右 不应该是这样的水平.和一些外院啊 法学院的人一起上过课 虽然不了解别的院的课程设置 但可以明显的感受到英语上的差距.工科生就不需要英语吗 在学校看来 感觉是的.反正是向国内企业输送工程师 学什么英语 要啥自行车.2.华科的课实在是太多了华科 比谁放假晚 全国第一晚 比谁开学早 全国第一早 而对手换了一批学校.华科为什么放假少 因为课太多了 没有个23周实在是上不完啊 0 0就拿我们专业来说吧 学的太杂了 基础课就不说了 专业课除了本专业的必要课程 还要学有关材料 控制 电子 电气 能源方面的知识 都是浅尝辄止.我理解机械确实是一门涵盖比较广的学科 但我真的很希望能有一个华科机制的老前辈来告诉我 学的这些 有没有用.不想贴课表 怕损害大家的视力.我不是来抱怨上课多 辛苦 累 放假少的.我是觉得留给我们的自由支配时间 实在是太少了.我知道 英语不能指望学校 要靠自学 可实在是没有时间啊 时间它就是条毛巾 也快被拧碎了...能自由支配的时间少了 导致的最主要的问题就是 华科的学生 不知道自己要什么.要什么有用吗 有功夫追求吗 思考要什么浪不浪费时间 还是赶紧的 把份内的做完.看过一封华科学长工作以后写的感慨 不知道是真是假 大意是 华科就是基础工程师的制造厂 社会上对于华科的学生的评价主要分布在：乖 踏实 勤奋 听话.我知道这些词和学风好一样都是褒义词 但我笑不出来.任何好的评价词背后 都有着不好的一面.物质上的匮乏真的都不可怕 物质上的优越也没让人多享受.我是吃着30多个食堂 可我觉得就算只有那么几个食堂我也可以接受.我总是在几度的环境中洗澡 热水要靠自己从楼下拿桶拎上来 用毛巾沾着往身上擦 我也住过北大 体验过每层楼都有热水 供应到10点半的生活 但我觉得也都可以接受.冬天没安空调那会 我寝室里面最低只有5度 我脚不敢挨地 蹲在凳子上学习 出门反而觉得暖和 我觉得这也没什么. 可怕的是 一个零件 每一道工序都走的完美 出来却是个废品.就写这么多吧.推荐 @tigerJ的答案 褒贬得当.", "answer_votes": "70", "answer_comment": "​41 条评论"}
{"answer_author": "雨桐", "answer_id": 225431488, "answer_text": "大概是广泛被曝光这种事的学校。<img src=\"https://pic2.zhimg.com/50/v2-e1cf26ae3247cd7daea4a48ae9d7a252_hd.jpg\" data-rawwidth=\"1080\" data-rawheight=\"1920\" class=\"origin_image zh-lightbox-thumb\" width=\"1080\" data-original=\"https://pic2.zhimg.com/v2-e1cf26ae3247cd7daea4a48ae9d7a252_r.jpg\"><img src=\"https://pic2.zhimg.com/50/v2-a4c605845a582d2b35910d6edb73d424_hd.jpg\" data-rawwidth=\"421\" data-rawheight=\"750\" class=\"origin_image zh-lightbox-thumb\" width=\"421\" data-original=\"https://pic2.zhimg.com/v2-a4c605845a582d2b35910d6edb73d424_r.jpg\"><img src=\"https://pic1.zhimg.com/50/v2-e26933c6852f3d8434a5ac40f32ecfac_hd.jpg\" data-rawwidth=\"421\" data-rawheight=\"750\" class=\"origin_image zh-lightbox-thumb\" width=\"421\" data-original=\"https://pic1.zhimg.com/v2-e26933c6852f3d8434a5ac40f32ecfac_r.jpg\"><img src=\"https://pic1.zhimg.com/50/v2-29c5b47f77249966d73eec36cb2fee35_hd.jpg\" data-rawwidth=\"421\" data-rawheight=\"750\" class=\"origin_image zh-lightbox-thumb\" width=\"421\" data-original=\"https://pic1.zhimg.com/v2-29c5b47f77249966d73eec36cb2fee35_r.jpg\"><img src=\"https://pic3.zhimg.com/50/v2-cbcb66e79a48302d38e394e228a18eb7_hd.jpg\" data-rawwidth=\"580\" data-rawheight=\"536\" class=\"origin_image zh-lightbox-thumb\" width=\"580\" data-original=\"https://pic3.zhimg.com/v2-cbcb66e79a48302d38e394e228a18eb7_r.jpg\"><img src=\"https://pic1.zhimg.com/50/v2-4847ba97831518c26f32b810d407fa5c_hd.jpg\" data-rawwidth=\"421\" data-rawheight=\"750\" class=\"origin_image zh-lightbox-thumb\" width=\"421\" data-original=\"https://pic1.zhimg.com/v2-4847ba97831518c26f32b810d407fa5c_r.jpg\"><img src=\"https://pic3.zhimg.com/50/v2-ce6c846dc09fdab5b6217cd0bc5dc9c6_hd.jpg\" data-rawwidth=\"506\" data-rawheight=\"900\" class=\"origin_image zh-lightbox-thumb\" width=\"506\" data-original=\"https://pic3.zhimg.com/v2-ce6c846dc09fdab5b6217cd0bc5dc9c6_r.jpg\"><img src=\"https://pic3.zhimg.com/50/v2-503bf2c17a4ffaa99c9b82baa1190ac4_hd.jpg\" data-rawwidth=\"580\" data-rawheight=\"581\" class=\"origin_image zh-lightbox-thumb\" width=\"580\" data-original=\"https://pic3.zhimg.com/v2-503bf2c17a4ffaa99c9b82baa1190ac4_r.jpg\">BTW，人家一年9万人民币的奖学金，还住单间，也算有理由这么狂？利益相关：最好的哥们是你科2017届电气院毕业的，本人曾在2016年暑假在你科住了两个星期，应该说食堂确实很好吃。", "answer_votes": "94", "answer_comment": "​79 条评论"}
{"answer_author": "匿名用户", "answer_id": 41475481, "answer_text": "在学术方面和人才培养这些方向感觉不必多说。强势专业很抢眼，酱油专业也不算拖后腿。再次先感谢4年的培养以及引入互联网行业（嗯，华科在互联网方面的确很火热- -除了我这种强相关专业，其它各种专业都有进入这个领域的，比如哲学系= =）————————————吐槽分割线——————————————因为本答案吐槽为主，所以我决定匿名回答。1. 卡卡卡         在华科这么一个工科强势的学校，居然迟迟没有推行各种现代化设备，实在不能忍，第一个要吐槽的就是卡卡卡，在其它学校早就实行一卡通+学生证（实际上很多学校一卡通已经很大程度上代替了学生证的作用- -）；一所985，自称要接轨国际一流高校的国内TOP10左右的高校居然没有一卡通。。。好吧，没有一卡通就算了，为什么连饭卡都要有三张！        （此处应该有图- -待我去照一下食堂三种刷卡机并列的照片再来补充图片！）        列举一下我们的卡吧：金龙卡（磁条或IC版）+水卡+图书证+洗澡卡（当然那种限时的可以用金龙卡）+只收现金的校车（因为这个是怨念所以也当作卡来处理了）+银行卡（这个其实有点太勉强- -只是羡慕武大基友冲卡不用专门去取钱出来再冲）。幸好电路改造后没有再出一个电卡，嗯有点欣慰……个鬼呀。2. 课程        对于课程本身其实槽点不多，虽然我有自己的想法，但是否适合大多数却是未知的，我想吐槽的是课！程！安！排！制！度！是的，是课程安排，没得选的的，没错，就像高中一样。别提公选课，那个高中也有了，除了课程丰度肯定比不上华科外，其它简直一模一样好么。一学期只上半学期，每星期只有一节，没有很硬性的考试制度，整个生涯要修满一定分数。别提体育课，如果课表太满的话，就只能选择供你们学院的那几门课了，自由度太低。英语课同理。反正入学前我以为我终于逃离高中了，进来后才发现原来只是进入了另一个不那么有学业压力的高中而已（我们是学校典型的学渣系，各种被其它院老师吐槽，所以各个三好学生系的学霸们别反驳我说华科学业压力大，饱汉子不知渴汉子饥，真的。虽然每次看北大的同学各种掉课各种幸灾乐祸，看因学业压力而中途退课求换课的欢乐。但每次过后都略微有点神伤，继续按着大家都一样的课表去上课了。3.学校网站不说了，各种渣外包。一个产出各种优秀互联网人才的大校的各种网站都不忍直视。什么，你说是出于性能考虑？别逗，选课时没几次不崩溃的，导致不得不院系分时段选课。4.东西同济发展不平衡是的，东边西边同济（啊，我不是故意漏掉中间的- -沁苑的兄弟别骂我，对于韵苑狗来说，沁苑和紫菘是一家）发展不平衡。且之间没有方便的交通工具！看到过主校区往返同济的班车点→_→但是从没有见过班车。啊- -因为同济太远了- -所以这里先排除她了。先说不平衡：1. 图书馆馆藏量不同。且距离对于不同宿舍区的不公平。2. 食堂分布及美味程度对于不同宿舍区的不公平。3. 校外出行难度对于不同宿舍区不公平（基于商业区分布不同宿舍区对于校外出行的需求度其实是不同的4. ……不想写了，其实我真的不是那么在意这些，如果有合理的交通工具的话，那么这些其实都不是问题，所以这一条想要吐槽的是校车。校车是外包出去给司机的，每个司机自负盈亏。所以导致了司机只愿意走那么几条线路。而且人不满不走除非是一大早第一班或者当即返回即可进行下一趟高负荷运输（如下雨天，四六级考试等会又大规模校区人群交流活动时。", "answer_votes": "6", "answer_comment": "​6 条评论"}
{"answer_author": "女汉紫", "answer_id": 46984155, "answer_text": "我就实用性写几点。供选择在中国读大学和选择什么大学的学生斟酌。以下统一是在985学校中比较。1.学风好，这是妥妥的，比武大同等地位的大学强多了。整个学校领导特别强调读书，成绩高。所以你可能大学四年很难受到不好诱惑而堕落。2.特别难拿高GPA，因为领导有学得多考试难华科学生就学习能力强这种幼稚逻辑。我听说南大还可以刷分，华科不可以，还喜欢增加考试难度。这种学校，如果你有志于考国外研究生就会哭成傻逼了，和其他学校学生完全没竞争力。我曾有次看来华科讲座的武汉中介的宣传单，那简直，一整版好多我没听过的学校和武大申到了很多名校，华科只有2个，为什么，因为GPA低啊！3.氛围不开放，强调死读书，包括我们传统的泼水节都被领导为了维稳粗暴的取消了。如果你在大学随波逐流，你可能在华科多读了3年高三，但失去了很多开放的眼界和突破僵化的思维的机会。但氛围这个我不确定，因为没在别的学校学习过，只是一种推测。我听中大的同学说他们有一起学习，互相讲题的传统，但我们学校就没这种氛围，全是在庞大的教学楼自习。而且华科课程压力大，会让你整个大学都一门心思都在忙指定课程学习，最好的大学应该给你机会和校风影响让你发现自己。（但如果一大学又轻松你又堕落或者没有资源让你发现自己，还不如做三年高三狗更有益。华科讲座还有各种基地还是很多的，但没跟其他学校比较过，不好评价）ps寒暑假最短的大学，华科每次都在第一名。4.男生数量太多，质量不高。情商普遍比较低，但因为基数大学风好优质男生是有很多的。说实话，来华科大都不是省级城市而是一个人从小地方勤奋读书考过来的，所以比较木讷或者只顾读书，没有绅士风度等。如果你想把大学作为找优质老公备选的地方，去那些北上广学生喜欢去的学校读书，当然潜力股的男生我们学校还是有很多的，潜力股也可以变成优质老公的，但要好多好多年女生去培养，比如我爸。对了，男生多不代表你就可以摆脱单身，这还是看脸的。比如班上男女比6比1，我还是单身狗。ps:男生如此多的学校，女生生活的没有男女均衡学校的幸福，因为你的交际圈会变得很小。当然咯，每个学校都有男生奇多的专业。5.校友资源丰厚 华科一年招七千多人，因为是理工学校，社会中上层各行业都有很多华科人分布。而且你会发现，他们都很踏实和淳朴，有上进心。包括我很喜欢我在华科认识的朋友，积极向上，为人热情淳朴，聪明理智。根本就没勾心斗角撕来撕去的传统。6.学校绿化环境达标。四人宿舍，且宿舍大，有空调。热水也即将铺上。选学校最重要的就是宿舍条件啊！没空调的学校会过得生不如死，大一女生宿舍还没装空调时我就过着狗一般的生活。7.负能量 说实话我到了美国之后才对比出我在华科心理状态多不好。班主任，辅导员，教授各种强调加权，华科男生天天喊着找妹子，并且把女生分为屌丝和女神区别对待，让成绩和找不找到男朋友成了评价自己的唯一标准，自卑一直伴随着我。来到美国之后，我渐渐变得珍惜单身生活。因为这边的男生终于回到了高中正常的水平，并且超越。我和很多男生都是很好的朋友，他们帮了我很多，关心我，尊重我。我不用再在意自己不苗条，平时和他们一起讨论学习问题，健身，出去找美食吃。最后2点很重要：1.如果你在中国大学读书，我觉得都差不多，爱不爱学习，在大学找不找各种机会突破眼界，找不找得到优质男友都靠自己，以上这些真影响不了多少。但你要研究生考美国，来不来华科读大学就影响到你的人生，因为GPA会被拉低（个人观点）。2.中国学校说实话都很差，不能自由选课，老师不负责，照本宣科，教科书和课程难度很大，非常枯燥，不注重实践动手能力。整个在华科的大一都是自己一个人刷题自学。然后我转学到美国了，可以自由选不同专业的课，真是每年都在开阔我的眼界，教授非常负责。自己选喜欢的教授的课，是一种享受。而且我能通过自由选课真正发现自己的潜力，兴趣，世界到底是什么。而且好拿GPA，华科八十分的加权，我每次都要解释我真的不是学渣，美国top50学校第一学期GPA 3.93/4.0。而且我在美国努力多了，还学会了怎样和别人一起学习。。。（但美国学校唯一的不好之处是一般人会因为不便利和语言问题难以参加除学习以外的活动，如社团，小比赛，学生会，讲座等。美国的学习和中国学习是完全不一样的，美国听课收获多， 作业形式多样，还有月考，会有专门的discussion助教来解答你作业不懂的问题等，加上选课自由基本像是主动学习，而不是一个人痛苦而又闲散的在自习室刷题。）----2017年更新----已经录取到哥伦比亚大学的研究生。国内大学同等排名，我建议去北京上海读。机会非常多，仅仅实习就有非常多优秀公司的机会，这是很多东西换不来的。大学排名也非常重要，因为以后你有事业后，见面说校友，或者参加校友会结交人脉，是非常大的资源。华科每年招生人数这么大，有丰厚的校友资源。", "answer_votes": "78", "answer_comment": "​73 条评论"}
{"answer_author": "小书虫", "answer_id": 270697070, "answer_text": "单单说学校环境，此生最爱！来看看深秋冬初的华科吧。你是知道的，我们来自华科。虽然季候已入冬，但当太阳出来的时候，华科的校园里还是一派秋色，泛黄的梧桐叶落了一地，银杏金黄，辉映日光，校道笔直而干净，像秋日的天空一样清爽。都说草木知秋，是的，植物对季节的感知总比人敏锐而深刻，今天带领大家从学校的一草一木感知此刻美得像童话世界的华科。1春有百花秋有叶有依然苍翠的叶，也有金黄、鹅黄、珊瑚黄的叶，还有酡红的叶，来自梧桐、银杏、红枫。大自然在秋天喜欢用浓墨重彩作画，也许是觉得秋天过于萧索而用色彩来平衡。华科满校园的梧桐间杂着银杏、红枫、水杉等等，每一片叶子都在抢夺人们对它的注意力。秋天的阳光醇厚柔润，在建筑物顶端闪闪发光。河流，树林，软绵绵的草地，云絮从上面缓缓飘移。（村上春树）<img src=\"https://pic1.zhimg.com/50/v2-e3f158943ae92fb349d376088659322e_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"720\" data-rawheight=\"480\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic1.zhimg.com/v2-e3f158943ae92fb349d376088659322e_r.jpg\"><img src=\"https://pic2.zhimg.com/50/v2-d9ae2fa6b2cdf85b413767b24f71a2a2_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"720\" data-rawheight=\"480\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic2.zhimg.com/v2-d9ae2fa6b2cdf85b413767b24f71a2a2_r.jpg\"><img src=\"https://pic4.zhimg.com/50/v2-46692ace9a63a7e70fc13452f8ad3331_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"720\" data-rawheight=\"480\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic4.zhimg.com/v2-46692ace9a63a7e70fc13452f8ad3331_r.jpg\"><img src=\"https://pic2.zhimg.com/50/v2-02703a8b7ff55f6d46160e0356c4d667_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"720\" data-rawheight=\"480\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic2.zhimg.com/v2-02703a8b7ff55f6d46160e0356c4d667_r.jpg\"><img src=\"https://pic4.zhimg.com/50/v2-bf9dafd077c157cfbfb1ba7dec7b94ef_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"720\" data-rawheight=\"480\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic4.zhimg.com/v2-bf9dafd077c157cfbfb1ba7dec7b94ef_r.jpg\">2夏与秋的争夺夏日的华科无疑是令人眷恋的，青年园的荷香总让人拔不开腿，大片大片的蓝天，一团一团的云，秋风一吹，校园像川剧变脸一般，呈现出一片夏天落日般的金黄！整个过程既迅速又缓慢，像一场夏天和秋天的谈判，秋天逐渐占上风，夏天一步步退让。我们便是在这个过程中，欣赏到这季节争夺的盛景。秋阴不散霜飞晚，留得枯荷听雨声。 （李商隐）<img src=\"https://pic4.zhimg.com/50/v2-49c1c1afe0f6c41ed21977778de84123_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"720\" data-rawheight=\"400\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic4.zhimg.com/v2-49c1c1afe0f6c41ed21977778de84123_r.jpg\"><img src=\"https://pic3.zhimg.com/50/v2-b88c45c9c5815575807fb32cde90dbd1_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"720\" data-rawheight=\"269\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic3.zhimg.com/v2-b88c45c9c5815575807fb32cde90dbd1_r.jpg\"><img src=\"https://pic3.zhimg.com/50/v2-79ac297da6eba16bbd8fc1cf06ed2070_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"720\" data-rawheight=\"352\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic3.zhimg.com/v2-79ac297da6eba16bbd8fc1cf06ed2070_r.jpg\"><img src=\"https://pic3.zhimg.com/50/v2-01288a95fe10dedfcb68ec0430bd68b4_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"720\" data-rawheight=\"480\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic3.zhimg.com/v2-01288a95fe10dedfcb68ec0430bd68b4_r.jpg\"><img src=\"https://pic3.zhimg.com/50/v2-3a3fbabb50d7f7cd4d1d1e17dad5ccc8_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"720\" data-rawheight=\"480\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic3.zhimg.com/v2-3a3fbabb50d7f7cd4d1d1e17dad5ccc8_r.jpg\"><img src=\"https://pic2.zhimg.com/50/v2-c2c970babf157f494808dead299da7a9_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"720\" data-rawheight=\"480\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic2.zhimg.com/v2-c2c970babf157f494808dead299da7a9_r.jpg\">3人在深秋有阳光的深秋，整个校园一点都不感觉萧索和冷清，抬头是万黄千红的秋叶和日渐清晰、形态挺拔的树干，低头便是落叶铺就的地毯，到处是“晒秋”的人群和洋溢着青春的喧闹声，可以拿着书在晒暖的石凳上坐一下午，也可以在图书馆对面化成咖啡坐着隔着玻璃窗看天色一点点变暗。我记得你最后那个秋季的模样你头戴贝雷帽，心里一片平静你的眼里跳动着晚霞的火焰树叶一片片落入你那似水的心田（聂鲁达）<img src=\"https://pic2.zhimg.com/50/v2-ac2545d2e79f206d5e850bb6a14776d4_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"720\" data-rawheight=\"480\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic2.zhimg.com/v2-ac2545d2e79f206d5e850bb6a14776d4_r.jpg\"><img src=\"https://pic2.zhimg.com/50/v2-93a1dd3823ce00e8138b96b9d7d8985b_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"720\" data-rawheight=\"480\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic2.zhimg.com/v2-93a1dd3823ce00e8138b96b9d7d8985b_r.jpg\"><img src=\"https://pic3.zhimg.com/50/v2-311771be5b5511ece8ddf5344df79b68_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"720\" data-rawheight=\"480\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic3.zhimg.com/v2-311771be5b5511ece8ddf5344df79b68_r.jpg\"><img src=\"https://pic4.zhimg.com/50/v2-2f0e960f771167403a4e5120b4619418_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"720\" data-rawheight=\"480\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic4.zhimg.com/v2-2f0e960f771167403a4e5120b4619418_r.jpg\"><img src=\"https://pic3.zhimg.com/50/v2-82070d02738d087bbd3313fe37157b12_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"720\" data-rawheight=\"480\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic3.zhimg.com/v2-82070d02738d087bbd3313fe37157b12_r.jpg\"><img src=\"https://pic4.zhimg.com/50/v2-ca8d7eeb0f68595c0cf09e591239f37d_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"720\" data-rawheight=\"480\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic4.zhimg.com/v2-ca8d7eeb0f68595c0cf09e591239f37d_r.jpg\"><img src=\"https://pic2.zhimg.com/50/v2-fbe831334f107751547363c6184dd476_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"720\" data-rawheight=\"540\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic2.zhimg.com/v2-fbe831334f107751547363c6184dd476_r.jpg\">4秋叶静美秋天的落叶总让人感觉不亚于夏花之壮丽，它们在盛夏里极尽生命的张力，然后纵身一跃，飘然坠地，毫不犹豫。走在校园里，踏着落叶而行，你是否害怕心中浮起沉沉往事？像一片落叶想起自己夏日的浓荫？生如夏花之绚烂死如秋叶之静美（泰戈尔）<img src=\"https://pic4.zhimg.com/50/v2-f71259f0f6f06983fe47d554c6d7e7e3_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"720\" data-rawheight=\"480\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic4.zhimg.com/v2-f71259f0f6f06983fe47d554c6d7e7e3_r.jpg\"><img src=\"https://pic2.zhimg.com/50/v2-82509761f23ac6fe6406610aa2981d96_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"720\" data-rawheight=\"480\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic2.zhimg.com/v2-82509761f23ac6fe6406610aa2981d96_r.jpg\"><img src=\"https://pic2.zhimg.com/50/v2-dd10fe6637f46f032f5622c87da6f964_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"720\" data-rawheight=\"480\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic2.zhimg.com/v2-dd10fe6637f46f032f5622c87da6f964_r.jpg\"><img src=\"https://pic2.zhimg.com/50/v2-0a470b85bbbaf42a113174e78d0ec9b1_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"720\" data-rawheight=\"720\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic2.zhimg.com/v2-0a470b85bbbaf42a113174e78d0ec9b1_r.jpg\"><img src=\"https://pic4.zhimg.com/50/v2-79526ae6d66fd79da5f8f1b5bba9adaa_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"720\" data-rawheight=\"720\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic4.zhimg.com/v2-79526ae6d66fd79da5f8f1b5bba9adaa_r.jpg\"><img src=\"https://pic4.zhimg.com/50/v2-67046524d88c8e789c596873fffa9678_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"720\" data-rawheight=\"540\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic4.zhimg.com/v2-67046524d88c8e789c596873fffa9678_r.jpg\">5最美校道在学校的校道骑自行车是一件十分惬意的事情，阳光一打，树影斑驳中骑车穿过，仿佛在时光中穿行。把影子投在紫荆路边校史馆的红墙上，在绝望坡感受俯冲的快意，从西十二一直滑行到西操。秋天用一场成熟的仪式告诉我们应该体会生命的多姿多彩。 谁此时没有房子，就不必建造，谁此时孤独，就永远孤独，就醒来，读书，写长长的信，在林荫路上不停地，徘徊，落叶纷飞。  （里尔克）<img src=\"https://pic3.zhimg.com/50/v2-2d8a9e6c0d6f68e3fcc9ca871260733a_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"720\" data-rawheight=\"1080\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic3.zhimg.com/v2-2d8a9e6c0d6f68e3fcc9ca871260733a_r.jpg\"><img src=\"https://pic1.zhimg.com/50/v2-7753818b8b0a07fdeddd335de3e4cbfc_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"720\" data-rawheight=\"480\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic1.zhimg.com/v2-7753818b8b0a07fdeddd335de3e4cbfc_r.jpg\"><img src=\"https://pic2.zhimg.com/50/v2-a7bb9522030dde478b505cf271a2c22a_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"720\" data-rawheight=\"480\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic2.zhimg.com/v2-a7bb9522030dde478b505cf271a2c22a_r.jpg\"><img src=\"https://pic4.zhimg.com/50/v2-c78fb3deb104f9379ce1ed07bb22c9ab_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"720\" data-rawheight=\"480\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic4.zhimg.com/v2-c78fb3deb104f9379ce1ed07bb22c9ab_r.jpg\">结语：如果此刻你正在学校，记得好好珍惜在这里的四季时光；如果你已经毕业，记得有时间回母校看看，不管你走多远，走多久，母校总会在这里为你守候，你曾在此度过的大好时光。（完）标题 | 饶珊摄影 | 饶珊文案 | 洁人特别感谢饶珊-------------我们是华科的学生创业团队，a href=\"https://ovoooo.com/\">「小书虫App-你的读书小伙伴」 是我们的创业产品，为爱阅读的你提供书摘笔记、书友分享、藏书管理功能。欢迎关注我的微信公号「小书虫你好」（ID：heyxsc），爱书爱阅读，定期推荐好书新书。", "answer_votes": "69", "answer_comment": "​24 条评论"}
{"answer_author": "知乎用户", "answer_id": 41877804, "answer_text": "这个问题的热度和其下的回答验证了我的两个猜想：1.华科现状对本校学生来说不尽人意，校方在很多地方做的不仅是不够好。2.华科学生大体上确实缺乏人文素质，学校对学生的培养和期望过于单调。", "answer_votes": "13", "answer_comment": "​6 条评论"}
{"answer_author": "匿名用户", "answer_id": 41571563, "answer_text": "我在这里过得很伤心，特别特别伤心，每天都在后悔为什么当初要考这里，每天都在想何时能脱离苦海。我主要讲缺点。1.办事效率低就比如说想参加一个项目但是有些细节有问题，按上面给的电话打过去：“哎呀你说的这个我不清楚，我只负责本项目内的事情，你去打这个电话吧，XXXXXXXX”然后我拨通了这个电话：“这个文件是国家发的，不归我管，你去打这个电话：XXXXXXXX”然后我又拨了这个电话，一下午都没有打通。这种情况我亲身经历了三次，推来推去，最后的那个人，要么说“我也不清楚”，要么干脆找不到。再有一个早就申到了的奖学金，等了七个月还没发到卡里。去问了辅导员，辅导员去问了相关负责人，第二天钱到了。我估摸着他们之前是把这事儿忘了。重要的事到前一天或者当天才通知也是常有的。垂死病中惊坐起，今晚要交PPT。瞬间打乱你所有计划。--------------更新来吐个槽-----------5月10号晚上24点截止选课结果到5月10号晚上23点才通知我们要选课这种事情。。我已经不知道说什么了。。就这么对待早睡的好孩子么。。大四要选什么课这种事情难道不给我们时间好好想想好好问问吗。。哦对以前课程还是分配给你的不让你选呢，这么说来好像进步了呢。&lt;img src=\"https://pic3.zhimg.com/50/eee0596b70ae98acc79d9b890c02984c_hd.jpg\" data-rawwidth=\"1377\" data-rawheight=\"1070\" class=\"origin_image zh-lightbox-thumb\" width=\"1377\" data-original=\"https://pic3.zhimg.com/eee0596b70ae98acc79d9b890c02984c_r.jpg\"&gt;第二天经过辅导员的协商，给了我们一点缓冲时间，但是还是各种乌龙，比如某门课的学分突然降了，昨天本来选够了的学分突然不够了，比如在某方向内重选课的时候原来的位置不释放，点提交的时候会提示本方向人数已满。。&lt;img src=\"https://pic4.zhimg.com/50/a6396d9db9111b43a2156d2493ef23ae_hd.jpg\" data-rawwidth=\"1536\" data-rawheight=\"1851\" class=\"origin_image zh-lightbox-thumb\" width=\"1536\" data-original=\"https://pic4.zhimg.com/a6396d9db9111b43a2156d2493ef23ae_r.jpg\"&gt;部分同学仍在联系教务科中。。教务科那帮人又特别嫌麻烦特别不好打交道，完全不愿意给你办事ᕕ(ᐛ)ᕗ ---------更新完毕--------啦啦啦啦---------2.教学水工科专业的老师们可能都和生产研究结合得太紧密了，不怎么注重教学，不去想怎么把自己的课讲得更好，结果就是现在已学完62门课正在学8门课的我，能欣赏的老师一只手就能数完，还都是些基础课，微积分线性代数什么的。最让我醉的是C艹老师，期末考有一道题我觉得出错了，于是举手问，他直接把答案告诉我了━Σ(ﾟДﾟ|||)━。专业课也有讲得好的老师，但我总是遇不上，这概率不敢想。赵汉中的流体力学讲得不错，但不教我们。我是在超星学术视频上看到他的教学视频，当即放弃了反正也从来没听过的流体力学课。要是别的老师也能讲这么好就好了T T既然说到上课了就顺便吐槽，华科放假特别晚，一方面是课多，具体一点的吐槽上面有，不过我觉得另一方面是学校抽筋，本来可以早放的结果不放。大二期末，最后一门考试硬是拖了八天才考，其它课早就完了，这么多天准备这一门。大概是要协调不同院系的考试时间。有时候觉得文科生是不是比较惨，课不怎么多，还要被我们拖着不放假。。还有上个学期期末早早结束，处于笑看他校课还没上完的状态，然后搞了一个星期的公益劳动（扫落叶），两个星期的课程设计，成功地挤进了最晚放假行列。不过上面那位说毛巾被拧碎了的。。我觉得你应该是找了太多事情给自己干才会这样的。给勤奋的学生点个赞，但还是要注意劳逸结合(๑ •̀ㅂ•́๑) ✧ 。大学的时间相对来说还是比较宽松的，像我一天三大节课的时候也能找出时间在沪江网校上两节法语课，用热健做一组训练，睡觉之前还能看看黑塞，早上起来精神好好。反正只要提高效率，以及愿意给自己找乐子，时间不够用也不是很明显的问题。（哦漏这段话是刚开学不久的时候写的现在看着好羞愧啊，现在准备考试周的我已然乱成一锅粥）我们的考试那叫一个水啊，水的不行。我第一个学期认真学习，成绩不错。但是发现考试考的东西特别局限，每年还都差不多。比如材料力学每年都有一个同尺寸同材料同弹性模量的梁在同样位置的45度方向被贴了一个线应变相同的应变片。平时不认真学最后刷刷试卷就好。然后就各种翘课各种抄作业，考前一两个星期刷刷题，成绩依旧不错。呵呵呵呵呵。总之现在考试基本靠自学吧。机械作为华科的王牌专业大概也是有道理的，比如相关团队多，可以得到锻炼。然后项目算比较多。实验室多，本科生有兴趣也可以提前进去感受。金工实习搞得还蛮认真，课时足，接触了不少工厂里的东西。不过大二的认知实习是个坑。坑坑坑坑坑。一个师傅带着两个班的人参观工厂，走在后面的人根本什么都听不见，师傅停在机床边讲的时候，个子矮的同学啥都看不见，根本挤不进去。大三跟着学校的那个实习也坑，不过如果你能自己去找就好一些。3.没什么人文氛围武大的文艺活动比较多，我们学校就没有那么重视。有很多人文艺术的公选课，但是大部分老师都不会讲什么有意义的东西，学生也是去混学分，挺没意思的。人文讲座我去过两次，感觉讲得挺虚，不如我自己看书来的深刻。以及工科院系男生把女生当宝这都是骗人的好吗，我周围的女性朋友都表示没感受到任何优待，反而还被排挤。总之华科的男生很多都呆呆的，情商比较低。。学校有个艺术团，算是适当弥补了这部分缺陷。。偶尔会办音乐会，质量不错。但是比较小众，我周围好像没几个感兴趣的。校园文化节和社团文化节的活动似乎也不错但是我没去过嘻嘻嘻嘻(*/ω＼*)4.零零碎碎的槽就吐不完了：寝室床特别窄，85cm宽，比我蹭过的所有其他学校的床都要窄，睡着难受。寝室没热水，洗澡好麻烦。食堂虽然多但是好难吃，尤其是我们东边，比较不错的都在西边，跟我们隔三四公里呢。洗澡卡热水卡开水卡饭卡图书证学生证。。全都是分立的。又到了悬铃木交配的季节。。大家的咽喉和眼睛又遭殃了。什么，东九围了一个养鸭场？！虽然华科有很多找不到女朋友的男生，但是我还是找不到男朋友⊙︿⊙......不过要说优点也是有的，风景的确好。道旁种满了高大的悬铃木，看着赏心悦目，有人说在华科下雨都不用打伞，抬头就是茂密的树叶。到了秋天，满枝满地的银杏叶会让东九路变成黄金大道，我偷偷拾过几片做书签。到了季节目及之处都是花，红花酢浆草，曼珠沙华，天目琼花，凌霄花，玉兰花，紫藤萝，绣球花，含笑，晚樱，腊梅，月季，连翘，泡桐，鸢尾。。。美~不~胜~收。旁边有个森林公园，晚上可以去跑跑步，有人带队，运气好的话能看见萤火虫。宿舍楼教学楼附近到处都是猫，逗起来特别有意思。生活还算方便，学校里面什么都有，菜市场啊麦当劳啊咖啡馆啊健身房啊，新建的图书馆也特别棒。喻家山上还有坟墓，从生到死都给你解决了( ´･ω･)ﾉ(._.`)以及华科有些活动还是办的挺棒的，比如荧光夜跑，彩虹跑的事情还上过央视新闻。。的微博！总之如果你能自己搞出点人文氛围来，还是挺适合生活的。我想等我离开了华科之后，能让我怀念的只有这些美丽的景和可爱的人了，比如请我喝金桔柠檬帮我拿快递载我去上课的室友嘻嘻嘻嘻。而这样一个学校本身，我真的喜欢不起来。大家说了不少好的，我也说了这么多不好，还是自己评判吧。", "answer_votes": "52", "answer_comment": "​55 条评论"}
{"answer_author": "匿名用户", "answer_id": 41639444, "answer_text": "只记得一年之内被偷了五辆车。", "answer_votes": "12", "answer_comment": "​9 条评论"}
{"answer_author": "徐胜", "answer_id": 47656663, "answer_text": "公司原来的架构师，华科人，牛人，神人，英年早逝，可叹可悲。", "answer_votes": "2", "answer_comment": "​3 条评论"}
{"answer_author": "知乎用户", "answer_id": 114865381, "answer_text": "一所在校生还没毕业，就对毕业后的收入非常自信的大学。", "answer_votes": "10", "answer_comment": "​26 条评论"}
{"answer_author": "匿名用户", "answer_id": 54089381, "answer_text": "利益相关：湖南人，在湖南高考，在武汉关山口上过大学，各种华科、武大、中南、湖大基友。在湖南，说到中南必提湖大；在湖北，说到华科必提武大。把时钟拨回到全国高等教育改革，大学大合并的那年。在高考竞争十分激烈，而经济、教育发展程度与沿海地区颇有差距的两湖两省，发生了惊人相似的事情：两省的领导都流露过合并两所Top大学（华工+武大，中南工大+湖大）做成本省超级大学加入C9（如果真是超级武大，应该是C10）的想法，且最终都宣告流产。两省都有一所久负盛名的医学院。最终医学院都出人意料地加入了貌似不太合拍的理工科学校。如今十几年过去，两所医学院与原理工科大学间整合多有问题，排名不尴不尬。（同济的现状如此，也许湘雅会好得多）。合校之后，两省都得到了两所985（不计国科大）。都是1*理工科偏重+1*文科偏重的架构，原来的工科学校和原来的文科学校都在努力建设全门类大学。因而，要评价中南，不妨以同为理工的华科作参照物。武大底子好又是开挂的（本来就排名最高，又合了测绘、水利方面的全国Top大学），可以带过。华科和中南。华科的主要架构：华中理工+同济+武汉城建学院中南的主要架构：中南工业大学+湘雅+铁道学院城建和铁道各自贡献一个优势专业，湘雅与同济一直平分秋色。在当年中南工业完全不敌华中理工的排名基础上，中南有如今能时常进入全国前20的排名和一批全国重点专业，而华科已经经常退出全国前10. 中南的进步是显而易见的。中南的优势：学校发展用地多，湖南省支持强，后劲足。华科号称发展用地7000亩，如今已饱受开发商与武汉ZF蚕食。中南的劣势：（1）和老华工一样偏机械类，电子信息类一块仍然与华科有不小差距。如今制造业不景气，电子信息类毕业生比较应景、弄潮。（2）华科的全学科建设卓有成效，文科、管理、新闻等急追武大。中南的全学科建设还早得很。两校共同的劣势：（1）医学院整合不力。华科还远未找到一套成功整合和发展“天上掉下来的”医学院，让它像武大那样成为医学部的套路。湘雅据我听到的情况，也好不到哪去。难怪两所医学院排名依旧不温不火。（2）工科心态问题。说得不好听点，武汉和长沙相比沿海是经济不发达地带（特别武汉那工资低得），各种资金、信息的流动都远逊于京津、长三角、珠三角。而据本人观察，这两所学校从学生到老师，皆有一种“集体无意识”的木讷：大学依旧如高中般，强调考分为导向，理工科尤甚。本科生只知考高分，死读书，对职业规划和未来欠思考。直接结果就是在实习、就业市场上甚至拼不过发达地区的普通211学生。教师、教授、领导们要么一心科研，要么在本地闷声大发财，仿佛教学改革、学校排名下滑全与自己无关。很多老工科学校都有这样的问题，诸如西南交大、哈工大。学校给的课业、考试压力过大，学生根本无法去思考读研出国找工作三条路该怎么走；学生甚至部分老师偏幼稚，还是高中思维，觉得门门考100分了，埋头搞科研了，好工作和保研什么的就找上门来了。难怪排名逐年下滑。我说的是华科。看看发达地区特别是京、沪：找工作的大二甚至大一就开始关注各种实习offer和创业了。本地大企业很多，创新氛围很好。大四时简历上几个世界500强实习，远好过中下游985和北京当地211的差距。出国的同样大二就开始准备考试、选学校、申学校、走流程。当地资源唾手可得。结论：虽然武汉本地华科武大经常撕逼，长沙也是中南、湖大撕逼，但其实作为不发达的中部六省最强的综合性大学之一，华科和中南是非常互有借鉴意义的。然而如今国家格局已经形成，中部地区仍然积贫积弱。真心希望两校深化改革，不要在思想上落后于人，解放思想，解放本科生。如果走不了排名路线，就走美国大学那样的校友路线吧。", "answer_votes": "17", "answer_comment": "​13 条评论"}
{"answer_author": "匿名用户", "answer_id": 41662582, "answer_text": "华科电信工科女一枚，本科加硕士，马上满六年，就要圆润地滚开了。窃以为“评价”的话应该由权威的官方的发言人来说。下面仅从学生角度来说一说我眼中的华科。首先，我不觉得学校不重视英语，可能是因为我遇上了严格的英语老师，选修了对的英语选修课。大一英语课level2，课上老师全英文教学，会放《圣诞颂歌》《摩登家庭》《列国图志》等原声视频，有时只有英文字幕有时没字幕。听力 要算平时成绩 每周必须做，一学期两次小组presentation。如果认真学了，过四六级绰绰有余。我们寝室大一下四级都在520分以上，大二上六级都过了。大二英语课有两个老师教，主要讲英美文化，也是全英文教学。有一本全英文的参考教材，认真读过，一年下来阅读能力很有提升。还选过名为“英诗鉴赏”的选修课，基本全英文教学，学到了很多韵律方面的东西。我觉得如果想要学好英语，肯定可以在学校里找到机会，比如每周的英语角等等。此外，我们必须选满十个学分的人文选修课才能毕业，可见对理工生人文素养的提升还是有所重视的。我上过英诗鉴赏、陶渊明诗词赏析、名俗文化、诗词曲审美、佛教xx（记不清了，去旁听的，授课老师看起来很仙风道骨，还劝大家日行一善）。当时还想选欧阳康的哲学课，可惜只对启明学院的同学开放。再者，学校太大教学楼不集中，赶课好累。我记得很清楚，宝宝总理有一次来学校视察，星期五，我一天的课。第一大节西五教学楼物理课，第二大节西十二教学楼数学课，第三大节南一楼英语自主上机，第四大节东十二教学楼政治课，第五大节东九教学楼人文选修课。一天五节课五个不同的地方，遍布了整个学校，如果没有自行车简直不能活。然后，谁没有在我科丢过一辆自行车呢？偷车问题很严重。被偷得多，也是因为学校里车多，基数大。参见“点说华科”系列视频之“自行车上的华科”。我刚买了一个月的车，同学刚买了八天的车，就被偷了。我同学锁自行车前轮锁在栏杆上，过一寒假回来就真只剩个前轮了。另外，食堂真的特别多，饭菜实在是不错。华科面向学生开放的食堂，饭菜算不上好吃，但绝对以及肯定不难吃，就一般的家常菜的样子，不少油盐。我刚进大一那会儿，饭菜分量还很足，现在变少了。感觉食堂的大叔大妈们都是按照汉子的分量给妹子打饭。我总觉得打多了，不吃又浪费粮食，生生在四年里把自己喂胖了20多斤（~T_T~）最后，我科在IT业应该还是很有市场的。我硕士同寝室的妹子们集齐了BAT的offer~~~总觉得学校走“工程师的摇篮”这个路线是对的，至于什么“建成世界一流大学”的口号实在是太虚了。在华科待了这么久，感情也是蛮深的。本科毕业证戳的根叔的印，毕业典礼根叔拨的穗，马上硕士毕业就变丁校长的了;本科毕业证写的还是电信系，马上硕士毕业就变电信学院了。我也是挺圆满的了。", "answer_votes": "23", "answer_comment": "​21 条评论"}
{"answer_author": "匿名用户", "answer_id": 150216160, "answer_text": "不是什么大牛，为了不给华中科大丢脸，可耻地匿了最近在回忆自己的大学四年。我才意识到自己那段时间处于抑郁症状态。我能活到今天而没有自绝于人民真是个奇迹。我的建议是：如果你是高中生。那么，请在在选择大学之前，认真给自己写一份自传。请务必认真！！重点是：1，仔细列出那些自己觉得最有成就感的事情。注意，这个“成就感”应该是跟其他同龄人在基本同等的条件下PK获得优胜带来的。2，分析这些有成就感的事情，是哪一类初中、高中提供给你的机会？如果你大部分的成就感，来源于校风开放，机会丰富的初中、高中带给你的机会，那我强烈建议：你最好不要考虑华中科大，特别是理工科院系。去另外一所校风开放，各种机会多，没有什么“学在XX”名号的大学度过你人生中也许是最重要的4年。相信我，你绝对不会后悔。-----------------------------------------------------------------------------我愿意用我现在所有的一切，来换取18岁之前有人给我这个建议。", "answer_votes": "10", "answer_comment": "​13 条评论"}
{"answer_author": "知乎用户", "answer_id": 61110200, "answer_text": "占个坑。保研结束后思考一下", "answer_votes": "0", "answer_comment": "​2 条评论"}
{"answer_author": "匿名用户", "answer_id": 41304663, "answer_text": "1+1潜力吧&lt;img src=\"https://pic2.zhimg.com/50/4252933054e701b020d89f431447a39e_hd.jpg\" data-rawwidth=\"720\" data-rawheight=\"453\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic2.zhimg.com/4252933054e701b020d89f431447a39e_r.jpg\"&gt;&lt;img src=\"https://pic1.zhimg.com/50/c2c5f7d0a9fcffe0ff184a07ca4d821e_hd.jpg\" data-rawwidth=\"500\" data-rawheight=\"375\" class=\"origin_image zh-lightbox-thumb\" width=\"500\" data-original=\"https://pic1.zhimg.com/c2c5f7d0a9fcffe0ff184a07ca4d821e_r.jpg\"&gt;&lt;img src=\"https://pic2.zhimg.com/50/79dc4b96f71e1aa091cd36531c2ce738_hd.jpg\" data-rawwidth=\"744\" data-rawheight=\"557\" class=\"origin_image zh-lightbox-thumb\" width=\"744\" data-original=\"https://pic2.zhimg.com/79dc4b96f71e1aa091cd36531c2ce738_r.jpg\"&gt;", "answer_votes": "5", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 41448727, "answer_text": "缺乏人文气息", "answer_votes": "6", "answer_comment": "​5 条评论"}
{"answer_author": "鱼鹰", "answer_id": 49251744, "answer_text": "如果你眼中华科是僵化封闭和官僚，华科就是酱紫的。。如果你眼中的华科踏实务实创新，华科也确实是酱紫的~~2333华科校园南北东西田字格布局。南大门，毛主席像，南一楼，管理学院，喻家山山顶主轴线一字排开。。所有建筑方方正正，中规中矩。华科有朱九思老校长带大家60,70年代种的华科遍校园的梧桐树。华科人务实踏实靠谱，马拉松跑步运动摇滚氛围盛行，每天的夜晚的森林公园8000夜跑，每学期的千人荧光夜跑，还有华科西小门武汉摇滚聚集地VOX酒吧。每次厦马的时候几百号人包大巴车直接从寝室门口7,8个小时送到厦门住的青旅。华科人创业氛围浓重，点团队，联创，冰岩互联网方面做地不错。CCTV机器人团队机器人做地很棒~~华科机械光电有很多国家级的平台，有国家级的不同领域的前沿人物。华科的本科生质量很不错，研究生差一些~~华科的人文讲座氛围不错撒，有各种各样的主题讲座~~有梁木生老师不错的读书会。有踏实求学的尹平老师，有知识渊博的邓晓芒教授，有同济活化石武忠弼老先生。有德高望重温文尔雅的杨叔子老先生。曾经有经济学领域泰斗张培刚老先生，曾经有医学泰斗裘法祖。。现在还有一批机械，光电，材料在国内特别有影响力千人计划百人计划的科研骨干~~~学在华工，玩在武大。去形容这两所大学还是蛮贴切的，有时间再来细敲。", "answer_votes": "4", "answer_comment": "​4 条评论"}
{"answer_author": "知乎用户", "answer_id": 145486542, "answer_text": "      非常感谢华中科技大学东湖论坛为海外科技人才提供了非常宝贵的了解国内高校和科研的机会；感谢华中科技大学护理学院的毛院长、徐书记和各位老师们邀请了我们三个美国护理博士回国参观访问；感谢张同学的一路陪伴和操心。这次机会对于我来讲，是尤其珍贵的；因为本科在美国就读，我对国内大学之前是没有深入了解的。通过这次机会，与同学老师进行了坦诚的交流，收获非常多，充满感恩。      首先，我印象比较深刻的是华中科技大学书记及校长的演讲，深入浅出、非常有趣。书记虽然是学数学出身，脱稿情况下讲话却充满文学素养，文质彬彬、很有气质。领导们平易近人，拍照的时候我就站在他们身后，他们跟我们热情打招呼；照完照赶紧搬开凳子让我们撤离。举手投足，尽显绅士风度，让我对这所学校充满好感。      再就是，感受到了青年千人入围学者的风范。虽然这些人不是学护理，大部分学的是基础医学、生物或者材料，能感受到他们身上浓郁的学术气质。比较有印象的是，某常春藤高校的assistant professor，虽然学的是生物和理工科交叉的不怎么需要沟通的学科，英语演讲能力却是一流，十分有气质。做学术的人，虽然过得辛苦而且可能并不富足，甚至早早得就长了很多白发，却是一群有着极高趣味和精神追求的人。他们的境界还是跟我差很大的。其实，就是通过这群人的全心努力，我们国家的学术才有着快速的进展。他们是非常让人尊敬的群体。青千提供了非常好的平台，学者们可以有更多的资源和空间取得更好的学术成就，是很好的机遇；可惜对于护理学科，门槛非常太高，非常不容易争取到。目前的中国，也还没有一个护理青千的入选者，希望不久的以后这种现状会得到改变。       对于国内的大学，我最大的印象就是资源太丰富了（豪）。学校组织的音乐会是专业级别的、校内食堂也分好几种，食物特别好吃；另外，护理学院的硬件条件绝对不比美国差，模拟人的科技和数量赶超JHU护理学院，各种录音录像设备也很齐全；学生出国交流机会非常丰富，还有全日制英文授课班。感觉就是－非常开心！这都是国家富强的结果，也形成了一种良性循环：国内高校能提供优厚的资源越来越吸引着海外科研人员回国发展，促进学科进步。身边的论坛参与者都表示，过来好好看看；如果找到合适机会，马上回国。       下面详细讲讲护理学院。毛院长和徐书记是非常有情怀和追求的人；身为牙科专家，本身可以过着富足、稳定的生活，毛院长还是选择了兼任护理学院的院长，每天忙碌奔波。毛院长在护理学院是没有任何工资的，她的努力都出于一种精神追求；毛院长说话豪爽直接真性情，而徐书记则有着妈妈般的慈怀与美好，从各个方面为我们介绍了学院的状况和对科研人才的渴望，还对我们的生活给予很多建议和关心。其他的老师，也是非常热情，有着读书人淳朴的气质。与他们交流，直接而通透，无需特意迂回婉转。非常高兴这所学校有这样一种老师之间融洽的氛围。       对于护理科研非硬件上的实力，国内还是与美国差距比较大的，尤其是在护理科研的范畴、理论基础、英文写作、科研类本土教科书质量、以及科研人员的培养和教育上。科研大环境比美国功利很多，过于追求影响因子，反而忽略了护理学科本身的特性；但是相信，这种情况会随着无数人的不断努力而改变。希望有越来越多的人，真心热爱学术，把做学术作为一种朴实的精神追求，而不是一种灌水混名利的手段，真正提高这个学科在中国的发展，而不是助长灌水的风气。人的一生只有一次，总要有一些高追求；如果能为学科做一些贡献，那便是是非常丰盈的人生了。希望在美国读书的学者们，如果有机会（比如东湖论坛）的话，多多了解国内日新月异的发展。多体会、多思考，然后做出适合自己的最好的决定。欢迎关注公众号 hackgene", "answer_votes": "3", "answer_comment": "​5 条评论"}
{"answer_author": "mandymandy wang", "answer_id": 149460970, "answer_text": "不太同意目前排名第一的那位本科华科保研清华的观点。如何评价真的是一个很大的问题对不对。我是新闻学院毕业，本科出去有交换，硕士在国外念的，后来回国工作。如果顺着你们的思路谈毕业生就业前景或者说学校提供给在校生的发展来说，好像比大家都想得要乐观一些呢。1. 就业就我所在的互联网来看，如果你毕业于华科，在互联网公司的各个岗位，你都受人尊敬。校友遍地，口碑很好。更有人说在腾讯华为，校友会可以开进董事会。当然，排名第一的说互联网比不上经济咨询业，那也无可厚非，这些行业的外资确实比我们不知道高哪里去了，呵呵。不过据我所知，经济大校南开，每年近世界top级别咨询或者快消也不多。北大光华进麦肯锡那确实可以。2.出国华科出国的情况，和中山大学，武汉大学比，不太行，你们有没有想过是因为人家都是百年名校，民国的时候都有人出国，人家校友资源比我们早积累。华科毕竟才60年哦，拿什么拼。华科的理科或者工科出国，在个人起点不太高的情况下，其实去一个好学校，相对而言比较容易。我见过硬件条件不好，但是去了美国前10的直博士（当然他本科期间发了很多文章。。）也见过硬件条件很差的，去了很好的项目。申请这种事情，主观的东西太多了，包括家庭条件，个人选择，4年的积累等。3. 培养有一点还是值得说的，学校课太多，让学生自己思考的时间太少，对未来的思考太少；学校对学生多样化兴趣的发展，引导太少。确实有人在玩社团，学生创业，很难说这是一个“对未来潜能的培养和积累”。比如说本科生的科研培养，职业教育培养（帮助学生选择好的行业和职位），以及为学生提高更好的机会。视野窄了一点，和学校的实用教育不知道有没有关系，大家都盯着自己的那么一点加权，保研…“不该教育水手怎么开船，更应该教他们渴望大海”…【人生多样可能性】这个维度上，学校确实做得不够。当然这也可能是学生阶级和家庭（无贬低、客观的说）决定的吧。楼上有人说人文素养重视不够？——自己读书太少怪学校咯？4. 生活嗯，学校确实是太太大了，一下雨就是灾难。不过还是很值得留念的地方。和男朋友溜校园，怎么都走不完，好远的路；总比从校门口到校门口5分钟就走完了好，是吧。", "answer_votes": "5", "answer_comment": "​4 条评论"}
{"answer_author": "匿名用户", "answer_id": 41268970, "answer_text": "华科学生在IT行业的名声相当好，其他领域不太了解。感觉华科校园是那种很有学校的感觉的，而且还是有些大气的，长期在这样的环境中生活学习，相信性格也会收到环境的影响。学风至少在武汉说最好应该没有问题，大学时华科的学生还是很让我佩服的，当然现在也很佩服。华科学生一般都还是比较低调踏实的。人文方面稍稍弱了一点，我说的不是学校里的学科水平，而是我接触的一般的华科学生的视野和思路相比武汉大学来说。整体来说，我觉得华科毕业生不管在哪里都可以很有信心的挺起腰板，华科的学生给华科长脸了，说是中国一流学校完全是没有问题的。", "answer_votes": "12", "answer_comment": "​3 条评论"}
{"answer_author": "匿名用户", "answer_id": 42290993, "answer_text": "一流的本科，二流的硕士，三流的博士", "answer_votes": "5", "answer_comment": "​19 条评论"}
{"answer_author": "匿名用户", "answer_id": 204551639, "answer_text": "我只是单纯的怼一下说华科商科无校友的评论，简直太片面了，华科出了中国最多的经济学家，华科也是非银金融行业出了最多一把手的学校，理工男搞起商科来，丝毫不弱于经管出身的人，作为强调数理基础的学校，出来的学生有扎实的数理基础，更适合做金融类的相关工作商界部分校友列表：1. 李军----中国银行担任监事长2. 王志伟--广发证券董事长 2. 孙建平--中国平安财产保险股份有限公司董事长兼CEO3. 叶望春--平安银行执行董事,平安银行行4. 靳海涛--深圳市创业投资同业公会会长，深圳市创新投资集团董事长5. 余维佳--招商证券公司首席运营官6. 彭文德--中信建投期货经纪有限公司董事长7. 刘鹰----深圳上善御富投资管理公司董事长8. 凤良志--国元证券董事长9. 王梓木--华泰保险董事长10.万放----平安资产管理公司总经理11.王晨宁--投资银行总部执行董事12.鲁元金--投资银行总部董事总经理13.李文飚--华登国际董事总经理14.陈浩----联想投资董事总经理15.李一男--金沙江创投任合伙人16.高亮----滨海投资总经理,董事 17.王东——北京爱康创业投资有限公司董事长18.钟晓林--江南资本创始合伙人19.汪潮涌--信中利投资集团董事长20.胡强----宏源证券总经理21.屈向军--长安私人资本董事长22.姚鸿斌--深圳市金石投资管理有限公司总经理23.党剑----东方期货公司总经理24.邓强----信达期货公司总经理25.黄俊辉--北京中天嘉华理财顾问有限公司总经理26.马郢----北京丰祥国际资本集团董事长27.廖杰----百联优力投资公司董事长28.蒋学杰--长信基金公司总经理29.卢鹰----黄石资本集团投资合伙人30.陈凯慧--中国光大银行广州分行行长31.阎忻----上海积胜投资董事长32.余春风--上海朗诚资产管理创始合伙人、总裁33.赵汉忠--星浩资本CEO34.段文毅--京都期货经纪有限公司董事长35.高翔----IDG资本合伙人36.刘明----华软投资(CSIC)董事,美国瑞加公司创始人37.陈山----京福资产总经理、基金经理38.彭术乔--湖南大成投资有限公司董事长39.曾庆群--同丰资产管理有限公司执行董事/总裁40.王喆----星光国际投资管理公司董事长41.卢旸----方正集团投资公司总经理42.陈峰----浦东创业投资公司总经理（上海）43.胡秋----深圳市瀚信资产管理有限公司合伙人，常务副总经理, 投资决策委员会委员44.聂祖荣--长江证券研究所所长45.曾劲松--华控汇金投资管理有限公司董事总经理46.李娟----现任武汉华工创业投资有限公司总经理47.李旦——深圳市泰瓴资产管理有限公司 投资总监 投资决策委员会主席 48.黎昌林--武汉中部发展创业投资中心合伙人 49.刘必胜--武汉中部发展创业投资中心合伙人 50.张望明--深圳市东金投资管理有限公司董事长兼总经理51.张滨----深圳市通银担保投资有限公司董事长，深圳市通赢典当行有限公司董事长、深圳市三鼎投资有限公司董事长、深圳市本斯集团董事局主席52.王小兵--澳银资本（中国）控股有限公司执行董事、投资总监53.梅健----东方富海投资管理有限公司合伙人54.张利锐-- 麦盛资产管理有限公司董事副总经理55. 杨晔----招商证券研究所所长56.喻磊----美国万通投资银行控股集团执行董事，中国私募基金控股集团（纽交所上市公司）CEO57.张舰----湖北嘉源伟业投资集团总经理 58.文胜----银河财富资产管理有限公司总经理,银河普丰、银河普润、银河普惠投资经理59.田惠敏--燕园创投首席经济学家60.陈朗平--长江证券承销保荐有限公司董事总经理61.岳蓉----武汉固德银赛业投资管理有限公司总经理62.衷唯菁--江西中投总经理63.徐晨----中银国际证券有限责任公司董事总经理64.周明剑--国盛证券研究所所长65.王智慧--华宝兴业基金公司研究部总经理66.吴雅楠--加拿大TD资产公司投资管理副总裁67.邵毅----湖北天信华成投资担保有限公司法定代表人,执行董事 68.郭锐----上海通联金融服务有限公司CIO兼执行副总裁69.李爱庆--北京科桥投资顾问有限责任公司董事长70.孙泽君--明泰酒店投资管理有限公司董事总经理71.王鹏辉--景顺长城投资总监/基金经理72.毛从容--景顺长城投资副总监/基金经理73.龚虹嘉--中国最优秀的天使投资人74.刘模林--融通基金管理公司副总经理，同时担任融通领先成长基金经理75.王松----国泰君安证券公司副总裁76.陈静----银河证券副总裁 77.阮涛----长城基金开放式基金基金经理78.余礼冰--长城基金研究部副总经理79.于晖----工银瑞信中小盘基金基金经理80.何仁科--汇添富基金经理基金 81.肖侃宁--易方达基金经理82.周红权--国泰君安证券上海分公司总经理83.冯新----硅谷天堂投资公司华东区经理84.卢圣宏--新时代证券股份有限公司固定收益部总经理兼上海分公司总经理 85.万立新--兴业证券经理 86.黄巧莉--上海理财门户合伙人 87.曹华强--国泰君安基金经理 88.王旭巍--信诚基金公司基金经理 89.朱战----浙江能源集团财务有限责任公司投资总监 90.徐晨----中银国际证券零售部总经理91.刘江啸--齐鲁证券研究所总经理助理 92.韩国栋--上海睿正博晖投资管理顾问有限公司总经理93.邓奎----上海六和投资有限公司副总经理 94.王智慧--华宝兴业基金管理有限公司研究部总经理 95.胡曹元--长江证券副总经理 96.陈杰明--华西证券副总裁96.黄劲松--银河创新资本管理公司副总裁97.熊剑涛--招商证券公司副总裁现兼任招商期货董事长98. 朱益林--菁英时代投资集团公司副董事长，集团北京公司总裁99. 吴磊----集成期货有限公司首席风险官100.陈涵----武汉富晨东方投资管理有限公司常务副总 101.陈彪----华宏控股集团常务副总裁102.杨卫东--民生证券副总裁兼投资银行事业部执行总裁103.喻大学--闽发证券有限公司投资银行总部总经理104.王利平--中国平安保险（集团）股份有限公司执行董事（PS：为五年前的统计，近几年又新增许多商届校友）你不知道，不代表就没有。你不了解，不代表就不行。", "answer_votes": "11", "answer_comment": "​4 条评论"}
{"answer_author": "匿名用户", "answer_id": 44802944, "answer_text": "华师妹子一枚~在文艺范儿的学校里待久了的理科妹子心里，华科的地位永远比武大高那么一揪揪~毕竟学在华科。在家看《职来职往》，跟我爸滔滔不绝的讲“这男的华科的呢~哇塞这技术老酷炫了~好帅好帅的~”，好像华科真的和华师有什么关系似的，好像人家酷炫真的关自己什么事儿似的~不匿啦~敬仰每个华科技术男！", "answer_votes": "12", "answer_comment": "​5 条评论"}
{"answer_author": "粽逗得逗", "answer_id": 41542054, "answer_text": "分享华中科技大学艺术团的单曲《班会》: http://music.163.com/song/358708/ (来自@网易云音乐)这是一首情景音乐歌曲。民乐伴奏，并利用独唱、合唱的形式，生动地描绘了华中科技大学里一个班的同学聚集在一起热热闹闹开班会的情形。就我个人看来，它不但表现了华中科技大学学生的生活片段，也指出了华中科技大学的生存窘境。大家可以自己体会一下。要我评价，我觉得我对它挺失望的。", "answer_votes": "10", "answer_comment": "​20 条评论"}
{"answer_author": "ZivTH", "answer_id": 156688678, "answer_text": "更新，说了太多废话，在外校读了半年研究生，我想评价华科挺好的(不是反差，我研究生学校也挺好的)。等我研究生毕业了再来好好评价，原答案保留看一个人三年想法是如何变化的，顺便更新我周围的同学都怎么了 。––––––––––––––––––马上要毕业了，我也来答一个。两部分，先吐槽，再夸夸。吐槽的：1、华科断网断电个人觉得是一个很傻*的行为，因为大学生应该有自己判断力。周围的人也会对一些不好的行为有所制止和监督。虽然一下子解禁可能会出现问题，但最终结果绝对比断网断电这种死板规定好。2、华科的工科类实验特别之傻*，我所在的是材料学院，抄实验报告，写实验报告，做过的N多实验将我对材料加工仅有的兴趣磨没了，怒转计算机。个人认为要大大大大大大减少数量，注重质量。3、个人觉得华科课程设计很不合理，我毕业要修199个学分（好像学弟们改了减少了很多课），我和同学普遍认为一些学分就是搞笑的，什么材料成型装备，液压气压，CAD技术，模具CAD，机械制造技术基础不知道上的什么鬼，概论课是吧。当然一些硬课，例如：金属学，材料成型理论，数理基础老师上的还是非常不错了。但但但材料学院老师讲的数据库，java，计算机网络是些什么鬼，能不能让专业的来讲。总之对于华科的课程我有一万句马卖批在嘴边，总之我对华科材料学院的课程设计真的是不知道说什么好，我的胸中有一团怒火（别的学院不做评价）。4、华科校园文化没有综合类学校开放，这个我也是这么感觉的，至于原因我觉得是就是这么传承下来的吧。改不了了。5、个人觉得以前根叔在的时候，学生和领导直接的距离更近。好的：1、当然是校园风景环境了，我蛮喜欢校园的，觉得挺好看的，现在路修之后就更好看的了，个人觉得华科基础设施并不差（宿舍比同等985的有差？独卫空调热水器），至于东九下雨被淹这是历史遗留问题了吧，个人觉得想把这个整好，哪怕不是单单把东九那段路整一下就行的，下水道问题感觉不是那么好搞得吧，求专业人士解答。2、华科总能遇见很牛的人，不要总是把自己不行怪到别人身上，比如我就不行情商低，但我觉得怪不了学校。我觉得只要你想走社交路线，华科这么多社团，还不够你用？辩论赛各种赛不够你学习锻炼口才？我想大家包括我觉得自己社交少的想一想是不是自己本身就没有主动去融入外面的世界。至于觉得周围同学情商低就更没有必要了，同学情商低影响你了？别人将来没什么前途影响你了？3、说一下自己班上情况，26人有3个清北的3个上交1中科大2中科院8华科 这是读研的，出国的有6个。找工作的一个同学月薪也是15000+。他们都是书呆子？我觉得不是他们都有自己的追求和目标，确实班上的学霸和我不怎么说话（可能大家都比较害羞），但我发现学霸往往不是就只有成绩好，华科的学生可以想想周围的学霸，貌似是他们中大多数是对一切都有着积极的态度，社团，学习，科研，个人兴趣爱好，义务家教，很多他们都具有。他们只是花了很少时间在聚会玩上面。班上有独自骑行去西藏的，大一辍学出国的，对各种历史人文比较感兴趣的理科男，爱好摄影的，爱好跳舞的学霸，研究生为了兴趣爱好换方向的法学，计算机这种的，继续在本专业耕耘的。总结：华科的问题我相信在类似学校绝对有，中国的大学就一个鸟样，貌似和高中同学交流比一般学校好很多。在华科资源至少本科我觉的只要你用绝对够你用。只要你自己有目标不管是走社交，走科研，走综合能力都有地方安置你，关键是要主动。我希望华科的学弟学妹们都能够客观的评价学校客观的看待一切问题。学校不好的地方想让我炸掉学校的时候都有，但大环境就是这样的。明确自己的目标，投身进去，不要过多抱怨，在这里努力认真的对待生活，你能够成为你想成为的人，不论是何种类型。我TM最后悔就是没好好利用好图书管，太懒惰了。最后给一群随便给别人加帽子的人说几句话：真的不要随便给别人戴帽子，每个人都有自己的追求，也许你追求飞黄腾达，但别人只想平凡生活；也许你注重社交情商，别人只是想理想主义的生活；也许你认为别人屌丝傻叉，别人也只是努力在追求自己的生活。只要对方没抢你的东西，打你的人，难道不都是人生中的一个过客。这种东西更本就没有对错，切莫把周围的人都当成傻*，谁TM都过的不容易啊。", "answer_votes": "7", "answer_comment": "​添加评论"}
{"answer_author": "牧歌", "answer_id": 49623999, "answer_text": "作为一名女研究生，又在文科院系，所以，实在是忍不住过来说几点。首先，环境不错，森林大学，人均十棵树不是假的，当然，整体不能和武大比，这里所有的道路都是直直的，没有所谓的路径通幽，工科生的思维吗可以理解。其次，作为工科强校里的文科，其实蛮尴尬的，尽管华科个别文科专业也在国内排名很靠前，但是终究给人的印象是华科是工科的。不过究竟还是看你想要什么，究竟要一所毕业院校的学位，要这样的平台，还是要一个领域内不错的专业。那些读北大，华东，北师范的请自动忽略。再则，话说男女比例七比三，男生众多，但是质量真心不高，175以上的男生不多，不明白为什么华中师范，中南财经的女生都为什么很喜欢华科男。。。有句笑话说，传言168是华科男生身高的分水岭，建议真心找男朋友得妹子就算了吧，本人已经放弃寻找。。。最后，如果是理科生，建议真的可以来这里，学风没得说，专业也都不错，很多用人单位也很喜欢华科的理工科学生。", "answer_votes": "7", "answer_comment": "​28 条评论"}
{"answer_author": "覅覅呀", "answer_id": 42450580, "answer_text": "反正我不后悔来华科最近东久玉兰花开了，盗图一张&lt;img src=\"https://pic3.zhimg.com/50/3baf9800f757c0fbf1c9aaf2cf97e9da_hd.jpg\" data-rawheight=\"360\" data-rawwidth=\"640\" class=\"origin_image zh-lightbox-thumb\" width=\"640\" data-original=\"https://pic3.zhimg.com/3baf9800f757c0fbf1c9aaf2cf97e9da_r.jpg\"&gt;", "answer_votes": "7", "answer_comment": "​1 条评论"}
{"answer_author": "Francophone", "answer_id": 208726324, "answer_text": "2012年，华中科技大学法语系建立。作为学校最年轻的院系之一，法语系常常遇到上文提到的尴尬“啊，学校还有法语系啊”。是的，华科有法语系 : )。有一个优秀、有活力、如同初升太阳一样蓬勃的法语系。---------------------------以下内容来自法语人微信公众号（ID: fayuren123）理科生的梦想学府坐落在瑜珈山脚下的华中科技大学，顶着个看似不太响当当的名头，实际上却是中国顶尖综合性研究大学，是国家首批“985”“211”工程，是拥有国家实验室的四所高校之一，是大大小小的中国高校排行榜的前茅。入选《Nature》评出的“中国十大科研机构”，被称作“新中国高等教育发展的缩影”。说到华科，人们常想到：它大大小小三十多个食堂，物美价廉；占地7000余亩，绿化覆盖率72%，景色秀美，被誉为“森林大学”；以及它实力雄厚，人才辈出的理工科。在知乎上有一个问答，“在华中科技大学读文科是一种怎样的体验？”，大家不约而同都提到了一句话“在华科还有XX（某文科专业）专业吗？”在这所充满了理科大牛的理工科高校中，文科专业确实是不常被别人提起的存在。但同时，依托着强有力的理科后盾，近些年，华科文科院系已经迅猛发展起来。学科定位以法语语言文化为主体，寻求与我校经管类、理工类等强势学科的结合与互补，培养具有扎实法语语言基础、广泛科学文化知识，较强跨文化交际能力，具有国际视野并能直接参与国际竞争与合作的通用型人才。法语系依托武汉独特的地理历史优势，与法国及法语区国家关系紧密，目前已与法国、比利时两国的多所高校建立了合作关系，本科生出国交换覆盖率达60%。学生近几年就业情况呈现出“就业率高、起薪高、工作起点高”等特点。（摘自华中科技大学官微介绍）华科法语系现有九名教师，其中六位中教老师，三位外教。人数虽少，质量却高。幽默风趣的陈新丽老师，作为法语系系主任，关心到每一位同学，了解他们的生活学习状况甚至未来规划；温柔可亲的董艳丽老师，教学认真细致，法语系的每位同学都在她的帮助下，打好了坚实的基础；平易近人的王玺子老师，像一个大姐姐，耐心解答同学们的问题；还有外派法国两年的张莹老师，熟知法国各地风土人情；话唠Fred外教，他的课堂总是乐趣满满……他们扛着法语系的大旗，稳步向前走去。在对外交流方面，华科法语系与比利时高等翻译学校，斯特拉斯堡大学及巴黎七大均建立了合作关系，交流名额多达16位。在大约每班20人的法语班，可以说，每人都有机会留学交换。学院还会予以一定补助。华科法语系是小班教学，每班大约20人。在这样的小课堂上，chacun son tour是常有的事，Présentation也是法语系学生必不可少的功课，高度参与的课堂让我们始终对法语有着浓厚兴趣。身在有着“学在华中大”美誉的华科，法语系也秉承这一优良传统，在课程设置上，也是满满当当。大一作为打基础的一年，课程基本为法语语音，基础法语，法语口语和法语试听等，主要教材是马晓宏《法语》和法国原版教材《Alter ego》。时到今日，我还是忘不了大一背诵马晓宏文章并抽查的恐惧。两年前，作为法语零起点生，我们每周有四节外教课，课上Pas de chinois,甚至pas d’anglais，连蒙带猜着接受纯正法语的熏陶。大二作为起承转合的一年，多了写作工作坊和演讲与辩论工作坊。课程内容也从课本跳脱出来：法国电影史，音乐，法国各杂志报纸的小文章，在大选期间的法国大选专题。大三开始，我们正式接触翻译理论，语言学，深入学习法国文化。同时，课程量相应减少，给了同学实习实践的机会。同学们也将陆陆续续交换学习，体验法兰西风情。课外风采在课堂之外，同学们的活动也丰富多彩，每两周一次的法语角，在华科大大小小的咖啡馆里和留学生漫谈；定期举行的讲座，我们与处于学科前沿的教授们面对面交流；外语游园会上，同学们用美食与词汇小游戏，展现法语系风采……跳脱学校之外，依托武汉与法语的渊源，同学们参加了阿基坦地区红酒节，法语戏剧节，法语活动节，三月香颂饕餮……今年六月，法语系送走了它第二届毕业生。年轻的藤曼结出硕果：四位学姐保研，院校分别为北京大学、北京师范大学、华中科技大学及华东师范大学，保研率达34%；五人出国，录取学校为利兹大学，新西兰孔子学院等；五人协议就业，签约公司为华为、中建等。", "answer_votes": "5", "answer_comment": "​2 条评论"}
{"answer_author": "匿名用户", "answer_id": 201592859, "answer_text": "学校是由学生，老师，学校行政部门等多方面组成的，笼统地说华科如何如何，做定性评判是不负责任的，只会影响学校的招牌。作为在里面就读的学生，我不想只传递情绪，更想谈些具体的人和事。利益相关，遂匿之。我科学子最大的特点就是心理上不自信，不自信的原因是缺乏归属感（具体原因后面分析），于是乎学生与学生之间，学生与老师之间缺少相互之间的交往；而缺少交往就更加无法培养归属感。老师方面：对此，我科老师普遍的说法是：都大学生了，都要自己负责了，还需要老师带吗？话虽如此，但并不代表老师私毫不起作用。这句话我认为更应该理解为老师和学生之间的互动，不是老师带着学生走，更不是老师不管学生，学生一个人走弯路。就学校国际交流而言，其实学校每年有很多名额的，但一般我们是不知道的。我也是偶尔一次机会知道了学习还有这样一个部门，后来问了下那些人的政策为什么没有宣传出去，老师的回答是：现在是网络时代了，你们学生不知道自己查信息吗？学校宣传不到位，反而要我们学生自己去网站上去查这些东西。但是学生对这些东西一点信息都不知道，又怎么去查呢？对于这些老师而言，他们已经忘了，教育的目的是让学生们真正学到东西，而管学生或不管学生只是手段。或许他们自以为自己放任不管，学生会学得更多。但是难道他们就不睁眼看看实际情况吗？如果学生们并没有因为他们的放任不管而更加主动，反而迷茫不知所措，那么老师是不是应该调整自己的策略呢？即使是网络时代，有多少商家为了让自己出现在公众面前搞竞价排名，这些老师如果真想做到有效传播的话，怎么会如此呢？应该承认这个说法有一定的道理，但是老师应该始终记得自己的作用是让学生学到知识，这里的学生是一个个活生生的人，不是HUB系统上的名字。自以为放任不管就可以让学生有所收获，是自我安慰呢？还是意识本身脱离了时代？对此学生的抱怨很多了，什么话都有。比如认为有些老师官僚主义啦，认为有些老师对学生冷酷啦，不对学生负责啦。尽管这些都是学生单方面发的牢骚，但很少听老师对学生的牢骚有什么回应。我很不理解，这些老师都是朱九思老校长那个时代培养出来的。老校长当年对学生的要求何其严格，就算给了学生很大的空间，但是对学生的考核始终抓得很严的。为什么这些老师会认为很多东西不应该他们管呢？PS：这里的老师，仅仅代表我所接触的老师。我所说的老师不局限于承担教学任务的老师，还有很多承担行政任务的人。但不是说所有老师都是这个想法，我仅仅说我所遇到的普遍情况。学生方面：自主时间很少这是工科的特点，课程本身多不说，还有很多实验，一个课程设计就要花整整一周的时间，是从白天到黑夜的整整一周。基本上我从大二到大四就忙着没闲过，包括暑假。其实这本是工科学习的特点，好学难混嘛，但我科是以工科为主的综合性大学，整个大学的风气受工科影响比较强，这些工科特点成为普遍现象，呈现出来的现象就是大家都忙忙碌碌，很少有机会和其他人交往了，生活当然也比较单一。这个问题的解决要寄希望于我科文理学科的进一步发展。学校方面：缺乏荣誉感主要是对学校的荣誉感，我科在外界的名声比较不响是出了名的，对此网上有很多段子。本世纪初改了校名是历史原因，人为原因是老师并不重视宣传，我这里说的老师是学校党委宣传部的老师。学校党委宣传部有自己的一套逻辑，虽然我不怎么理解，但他们还是执行了。实实在在的效果是学校的名气并不怎么响。我科学子有感与此，曾自发探讨过这个核心问题，提出议程公开讨论，由此引发社会关注与学校思考，但没过多久就被学校宣传部叫停。类似控制对学校形象不利的言论还有很多，也不一一列举。由此可见，学校党委宣传部在压制舆论方面积累了比较丰富的经验，但是在引导舆论上面还得学习一个。有人说，基于学校传统的工科思维的特点，学校老师认为名气并不怎么重要，实实在在学到专业知识才是王道。但如果真地讲实在的话，老师们应该知道，名气却有实实在在的作用。单纯的大学生心里当然希望自己的学校名气越大越好，当发现自己高分考进的大学名气不怎么响，学习意志难免会消沉，学习实实在在的专业知识的效率就会大打折扣，这难道不实在吗？学校名气不响，毕业生就业多少会受到影响，这难道不实在吗？此外还有多少社会资源的倾斜是受学校的名声潜移默化的影响的，这些难道不实在吗？我并不认为是学校传统的工科思维影响了学习的宣传政策，工科思维是做事注重实际效果，想方设法把结果实现，作为一个实事求是的工科生，我认为学校的宣传政策没有达到应有的效果。其实，学校宣传部门也并不是认为名气不重要。当学校一时间出了两个省委书记，国家科技奖排名靠前，科研成果被新闻联播报道的时候，学校不也是花了大力气宣传的吗？其实学校还是很重视这些虚名的嘛。不对，在学校宣传部门看来，这些名气才有实实在在的意义，因为他们在他们眼里只有官方的舆论场和官方的评判体系。指导他们行动的不是工科思维，而是行政思维。（至于这种思维的正确性是另外一个话题了，中国行政占据了太多社会资源，我知道宣传部的人不是傻子，但也不是瞎子吧）。再说荣誉感：其实，荣誉感是历史的产物，是一代一代华科人交往的产物，我们这一代之间的交往还得自己一步一步地来。作为华科学子，我们是有交往的基础的，因为只有我们知道什么叫东西异地恋，只有我们说同济的时候指的是汉口那个而不是上海那个。人总是通过别人对自己的评价来认识自己，所以我们更倾向于通过社会名气来构建自己的荣誉感。但名气与实际毕竟是两回事，名气虽友实际产生，但一旦便不仅仅受实际影响。实际虽然改变了，但社会名声却仍可残存在人的脑海中，名不副实或实过于名都有之。名实相符当然很好，但当发现名与实不相符合的时候，就应该主动放弃通过名气来构建荣誉感，这也算是发挥自己的主观能动性把。作为工科生，还是注重实际的好，对名气的思考也要建立在名气实际影响的现实意义上。事实胜于雄辩，所以我科在讽刺学校宣传部门无作为之余，也应该把重心放在做事情上面，努力夯实基础，加深和同学老师校友的交往，多做些事情为学校做宣传，这些都是提升学校荣誉的基础，毕竟学校也不只是那几个宣传部门的。归属感作为基本需求的第三层次需求，其重要性不言而喻，我想如果我科学子能普遍建立对自己母校的归属感，其大学期间会进一步主动积极地实现自我——毕竟身边又太多人慢慢消沉了，我想很多都是没迈过心理上的坎——今后的一生能够积极地为社会做贡献。生活方面：我科在这几年，学习的软硬件设施不断完善，在东边这几年感觉十分明显。无论是寝室，图书馆还是自习室，都为我们全身心投入学习提供了充足的保障。学校本科是四人寝，有空调热水器，独卫。虽然没有浮夸高大上的装饰，但就在学校学习而言，已经能够保障无多少生活琐事的烦恼了。本科生在图书馆最多一次性可借20本书，图书馆买了很多文献数据库甚至多媒体数据库，用学校的IP基本上没有不能找到的资料。学校的无线网络覆盖率比较广，方便随时随地查阅资。总之，学校的生活是很便利的，我觉得这才是工科特点的实在嘛。学习方面：我科学生在刻苦方面和资质方面是没问题的，但就我四年感觉而言，教学与考试都有放水的倾向。平时稍微听听课，考试前突击一下，分数就不会很差，因为老师一般都按照历年的套路出牌。老师们也知道如果不按照套路出牌，考试结果会很难看。——如此就形成恶性循环了，老师不敢出难题，学生不敢做难题。作为学生，只有私下多努些力啦。应该说大学四年是可以学到知识的，但如果学校在教学和考核方面多下一些功夫，我们四年的收获还可以更多。就我们学院今年毕业生而言，保研的大多就留在本校，去清华上交的都偏少；找工作的较好的大多是BAT等私企，也没想着去外企试一试；出国的申请顶尖学校的很少。总之，很多人由于环境限制（武汉的地理环境，已经工科学习比较封闭的环境），大多数人自然而然地选择了中等偏上的出路，想都没想过去挑战一下更好的出路，虽然我相信他们如果尝试一下是能成功的。我科很多高考失利的清北落榜生，虽然在大学里付出了很多努力，在同学中做得还比较优秀但是发现和高中清北的同学相比还是有一定差距。眼界决定境界，我们的生活环境长期以来就是能保研就好了，能找到个工作就好了，当然就不敢有更高的追求了。——顺便吐槽一下，我也不知道为什么新闻媒体一直宣称大学生很难找工作，我们这些大学生还真信了。总结：在学校里待了四年，我也渐渐地被学校的风气所同化，以往对大学风花雪月的向往被现实击得粉碎，取而代之的是充实的课程和对人生现实的思考。虽少了一点浪漫，却多了几分实在。大一的时候曾迷茫过，也曾抱怨过，无非是学校不好玩，所学不知道干嘛，缺乏认同感等。但到了大二，发现自己不可避免地成了一个华科人，自己渐渐适应了学校的风气，也开始欣赏学校的一点一滴。于是踏踏实实地看书学习，刷加权，修双学位，找实习，最后保研。在这些实践的过程中，发现很多烦恼都是庸人自扰，在做事情的过程中就迎刃而解了。——还有很多同学因为没有去做一直烦恼了四年。我不知道我的大学是成功还是失败，或者我不知道什么叫成功失败。我一方面按照学校普遍的规划顺利地走下来，另一方面也走进了学校本身的局限。我不知道有哪些我已经得到的东西是只有华科才会给我的，我也不知道有哪些东西我本应该得到而华科没给我的。因为我只上过华科这一所大学，我无法说出华科和其他学校比好在哪，差在哪。排名，师资，名声，还有什么好和差的普遍舆论观点，没有在里面待过的人是不知道这些意味着什么的，甚至只在一个学校里面待过也不知道意味着什么。我只能说华科有哪些不好的，有哪些好的。如果真要用笼统的语言表述的话，我会说我爱自己的母校，因为那是和我生命一起跳动过的地方。PS:以上所说，很多是我所在学院的特点，很多是学校特点，还有一些是受武汉的影响，仅仅是一孔之见，不能代表全貌。但的确是个人负责任的真实想法。", "answer_votes": "5", "answer_comment": "​2 条评论"}
{"answer_author": "匿名用户", "answer_id": 48108876, "answer_text": "想体验丰富多彩大学生活的真心不要来了，这学校尼玛体制僵化，思想封闭，宣传交流少，课程多作业多氛围差，武汉这城市也是没法儿看……作为一只保送狗我的眼泪流下来……各位高考狗们还是选择北上广吧！！城市实在是太重要了！", "answer_votes": "7", "answer_comment": "​5 条评论"}
{"answer_author": "匿名用户", "answer_id": 41455593, "answer_text": "1、很方便但很大华科位于武汉市瑜家山麓，东湖之畔，处于武汉市三环内，交通相对比较便利，校区旁边有光谷购物广场，所以小伙伴出去浪啊小情侣去约会什么的非常方便。当然啦，由于华科恐怖的占地面积，西边小伙伴出门浪的便捷从来东边娃只有羡慕嫉妒恨的份——华科对外宣称占地七千多亩，在珞喻路边上华科有六个校门，从最西边的南三门到最东边的东大门之间总共有五个公交车站。大概西校区的同学已经杀了好几家店，东校区的亲才刚刚下公交车呢。至于环境嘛，虽然我们没有樱花，但是我们有树啊，毕竟我们自称“森林大学”。据官方称，华科现在校园里面大概有50多万棵树。还有个小山头，叫瑜家山。小情侣什么的，林间漫步山间散步什么的既浪漫又经济哈。（当然要是独自到半山腰去做实验什么的，我……当我什么都没说……）&lt;img data-rawheight=\"866\" data-rawwidth=\"1300\" src=\"https://pic2.zhimg.com/50/7cd75e225e541c46f3dee7e07023cd22_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"1300\" data-original=\"https://pic2.zhimg.com/7cd75e225e541c46f3dee7e07023cd22_r.jpg\"&gt;&lt;img data-rawheight=\"975\" data-rawwidth=\"1300\" src=\"https://pic3.zhimg.com/50/16843906ccbf52f348682cb1dce38671_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"1300\" data-original=\"https://pic3.zhimg.com/16843906ccbf52f348682cb1dce38671_r.jpg\"&gt;（照片来源见水印）2、搞基圣地——男女比例七比一，一对情侣三对基虽然华科是一所综合类大学，但是优势学科都集中在理工科，所以男女比例什么的，你懂的。虽然我们合并了拥有众多护士妹子的同济医学院，毕竟同济在遥远的汉口，远水解不了近渴。3、大牛不少，学霸遍地学在华科什么的不是乱说的。特别是在考试周来临之际，华科学生的人均每日自习时间不少于8小时。至于平时，单身汪没有人一起浪，自习室图书馆管冷气暖气热水WiFi，干嘛不去？噢，还有一群校外校内的大牛，比如说张小龙（我才不会告诉你们这个人就是那个独自到半山腰做实验的人），李一男。4、不搞基，不如来搞机（呸！那是做实验）虽然华科的排名不高名气不大，但是教学实力和科研实力还是相当不错的。在读本科僧研究僧加起来大概有五六万，有号称曾经是亚洲大教学楼的东九楼，武汉光电国家实验室和国家脉冲强磁场科学中心。可惜答主不是工科生，这两个实验室都没进去过。-----------------------------------------暂时想到这里的分界线-------------------------------------", "answer_votes": "6", "answer_comment": "​2 条评论"}
{"answer_author": "匿名用户", "answer_id": 124578962, "answer_text": "没多少有学问的教授，做学问的自生自灭全看院系良心。退而求其次找工作，武汉很难找到实习，找工作相比于其他985学生无优势。各个系差别很大，就本科我知道的情况来说，计算机化学控制系很差很差很差，电信系比较好比较好比较好。毕业证在it行业上是挺有用的，南方面试经常能遇到cto的师兄，别的行业不太清楚。个人评价:        华科的教育很难让人达到毕业若干年后让学校以己为荣。        求知氛围很差，教材大多自编，大多填鸭式思维。        管理僵化，信息封闭，很多信息传递全靠研一学生的敬业精神。大一不能带电脑，大二大三晚上寝室强制断电。        硬件资源缺乏:图书馆，自习位置，空调，热水器等。     利益相关:华科毕业七年。", "answer_votes": "6", "answer_comment": "​6 条评论"}
{"answer_author": "吴夙慧", "answer_id": 41269584, "answer_text": "前身华中工学院，老牌四大工学院之一，实力强劲。在IT圈校友人脉深厚，中国码农圈有北北邮南华科的说法，前段时间腾讯发布的内部代码提交量按学校分布，华科第一校友李一男、张小龙都是码农偶像,程序员出身当上CEO，走上人生巅峰创业气氛浓，有几个学生社团做了几个不错的项目性价比高，高考分数不高但是实力不俗", "answer_votes": "6", "answer_comment": "​11 条评论"}
