{"question_id": "29335373", "question_text": "武大最近排名很高，当然不排除买榜，另一所985华科发展实在迅猛，实有赶超中科大之势，计算机尤其如此，校友遍布国内IT行业顶尖企业如bat。相比之下南京地处发达省份，南京大学排名连连下滑，东南大学停步不前，南航南理工等虽然也很知名但是感觉大不如前，出了江浙沪知名度陡降。按城市影响，武汉并不比南京好多少，南京文化氛围感觉更甚，但是为什么南京的学校一直发展缓慢呢，说平均教育经费的话，武汉也不会比南京的大学多多少，武汉的学校也很多。其他城市如上海，感觉发展也蛮好的，但是复旦脚步也不是很快，上交前几年发展迅猛最近风头貌似被浙大抢过去了，同济排名如东南一直维持在18～20，华东师范大学虽然排名一直在上升但是速度始终不如武汉那几所。求各位探讨一下，不求准确答案。", "question_title": "为什么武汉的大学发展很快？", "question_commet": "​18 条评论", "answer_number": "77 个回答", "question_followers": "512", "brower_number": "112,654"}
{"answer_author": "白狄夫", "answer_id": 73214138, "answer_text": "题主真是不遗余力地带节奏黑我科和隔壁武大啊！利益相关：华科电气大四首先，华科这几年发展其实没你想象中那么快只说排名，华科巅峰是周济院士担任校长时，这几年排名一直往下滑，目前稳定在10名左右。除去校长的更换等原因，个人觉得跟武汉有关系（求武汉同学轻喷，我还是很喜欢武汉的），毕竟武汉经济上差北京上海一个档次，跟南京也有一些差距，养2所规模极大的985是有些吃力的，况且武汉还有华师武理工财大华农地大等211。不知道题主说武汉比南京“好不了多少”是哪里“好”，如果是经济方面最好拿出证据。哦对了，南大好像并没有下滑。其次，华科计算机是很不错的专业，但只能算全国准一流我挂出了教育部权威的专业评估，华科的计算机排名并不靠前，将将挤进前十。当然，华科确实现在有很多校友在IT行业里翻云覆雨，但正如之前答案所说，并不是所有人都是计算机学院的。华科的互联网创业风气很浓，学校在这方面也很鼓励学生，比较出色的学生团队有Dian团队等。还有，进入bat如果就是衡量计算机专业水平的标准的话，我觉得你也太狭隘。&lt;img src=\"https://pic1.zhimg.com/50/b2af32b7ce608a17547b9f9669af1c29_hd.jpg\" data-rawwidth=\"276\" data-rawheight=\"493\" class=\"content_image\" width=\"276\"&gt;然后，说一下题主并没有问到但有一些答案提到的EE的情况EE实在是一个非常大的学科，包括很多方向。一般美国这边学校EE包括通信，控制，固态物理，电气，电路，光学等方向。因为国内把这些专业都分成了独立的学院，所以分别对比一下，还是以教育部官方排名为准（如果我不太了解的专业，就不详说，截图顺序按照学科编号顺序）。1.光学工程&lt;img src=\"https://pic4.zhimg.com/50/d2f8f810118339c93ca423a705c51022_hd.jpg\" data-rawwidth=\"271\" data-rawheight=\"476\" class=\"content_image\" width=\"271\"&gt;华科的光电和浙大并列处于全国第一。实际上光电是华科非常顶级的专业，基于国家光电实验室发展很迅速，实验室里也有很多国内光学大牛。全国第一，其他介绍都是浮云。2.电气工程&lt;img src=\"https://pic1.zhimg.com/50/cff7de0cdb01e678a514cf1d46855e49_hd.jpg\" data-rawwidth=\"275\" data-rawheight=\"423\" class=\"content_image\" width=\"275\"&gt;因为自己就是电气的，所以比较了解。华科的电气和西安交大并列第二，仅落后清华一分。华科的电气是一直非常强的，是院系调整时从武大等学校的电机学科合并来的，是原华中工学院建立时就存在的专业，坐拥国家重大科技基础设施国家脉冲强磁场科学中心（筹），国家重点实验室强电磁工程与新技术国家重点实验室和国家专业实验室新型电机国家专业实验室， 学科设置包括了所有5个二级学科，目前院内有4个院士，是全国电气学院院士最多的学校，应该是没有之一的。电气的教授可以说是很厉害的，平时上的专业课也又广又难，这也导致电气学院成为全校学风最好的学院之一，大家几乎都主动上晚自习学霸非常多，每年保研名额争抢都很惨烈，即使本科生就工作也能找到很不错的工作。3.电子科学与技术&lt;img src=\"https://pic4.zhimg.com/50/cf22699448582cbfc6a1ecea85790cba_hd.jpg\" data-rawwidth=\"271\" data-rawheight=\"550\" class=\"content_image\" width=\"271\"&gt;华科排在第11名，排名不算很高。说起电信学院，最令人印象深刻的一个是电工基地，一个是康华光编的《电子技术基础》教材：电工基地是华科非常出色的创新平台，很多同学进入其中学习大量电路和计算机知识并在全国大学生电子设计大赛获得优异成绩。事实上，华科的电赛成绩在全国是屈指可数的；《电子技术基础》教材我就不说了，应该是全国最好的同类教材之一。4.信息与通信工程&lt;img src=\"https://pic2.zhimg.com/50/1e67ea90218a0c45670af2e184482c76_hd.jpg\" data-rawwidth=\"276\" data-rawheight=\"553\" class=\"content_image\" width=\"276\"&gt;华科排在第13，也不算高排名，但小道消息说电信之前很强，后来学校为了大力发展强电，投到弱电的资源就少了导致电信水平有所下降，当然只是小道消息，大家笑笑也就罢了。5.控制科学与工程&lt;img src=\"https://pic2.zhimg.com/50/d628b9b83e0f4a0ac44b7f49dbc7cdfa_hd.jpg\" data-rawwidth=\"261\" data-rawheight=\"475\" class=\"content_image\" width=\"261\"&gt;华科排在第7，很不错的排名。现在控制系与图像所共同组成了华科的自动化学院。作为一个理工科院校，自动化的水平是比较能体现整体水平的。BTW华科的机械，材料，能源，医学和新闻等学科也很强，尤其是机械，和上交并列全国第一。最后我个人并不推崇大学排名，但专业排名却很很支持的。很简单的算法，两家店铺A和B，A比B的苹果好吃，但B比A的梨好吃，那你说A和B哪家的水果好吃呢？只有你决定了吃苹果还是梨的时候，这种比较才有意义。华科是一所非常好的大学，但因为招生规模很大造成高考录取分偏低，加上公关并不出色造成名气不大，被很多人当成“三本“对待，在前一段时间更是被当做某”女权主义者“卖书的噱头。华科现在其实处于从理工类大学到综合类大学的转型时期，也希望学校能越办越好。但像题主这种强行把华科拿来和中科大，南大等学校比较的说法，我想不光是我，很多其他华科学子也是不能接受的。如果非要比较，我觉得西北老大哥西安交大可能更有可比性，毕竟优势学科都差不多。回到原问题：为什么武汉的大学发展很快？我想说，仅就华科而言，一直在发展，但也没那么快，强行把华科提到非常高的位置对华科是不公平的（我相信对武大也是一样）赶超中科大的说法是非常扯淡的，因为华科本来工科就强于中科大（事实上大部分工科人家压根就没有），而基础学科跟中科大的差距也是很难追上的。最后的最后武大么么哒！！！", "answer_votes": "147", "answer_comment": "​73 条评论"}
{"answer_author": "江城飘", "answer_id": 75886553, "answer_text": "撕！就会撕！拼命撕！题主问得确实稀巴烂，数据来源没有，问的点也不明确，还要一会科大南大复旦交大，生怕事少，不热闹！但总的来说题主感觉比较正确，武汉的大学这两年确实有上升。别忙着撕，没说上升就是比你长三角强，也没说比中科大厉害。BAT人多不厉害，非要IEEE？工科厉害不行，一定要基础研究？人家说你计算机强，你一定要说光电机械才牛逼，难怪撕得狠！科研成果，就业情况，包括院士数量，校友层次，这些都是一个学校牛不牛的指标，或者说是结果，但这是原因？！一群人撕得兴起，还说人家钓鱼，人家有问你哪方面强？人家问的为什么最近几年武汉的大学上升厉害，问的是这个结果背后的原因，没光说你华科，也没只说武大，问的是个整体！尽会撕！就没人看看武汉这几年GDP发展和城市建设的成果？目前体制下，没有财政支持做后盾，没有政府扶持，中国哪个大学起得来？！看看最近几年光谷发展，东湖高新区发展，大学园发展，光靠大学自身发展能那么快？看看国内优秀大学的分布，这几年风头劲的，哪个不在经济发达地区。可怜西交，中科大，哈工，都是非常好的学校，但弱在地方经济差点，别人关注度自然会低点，放在北上广，哪个不是牛逼哄哄！依十年前武汉城市那鸟样，谁关注你这边发生啥事，还大学，来都不来，没生源，看你多牛逼。利益相关，曾经的武大郎，现居武汉。语气不好，见谅，不过能看这答复的，估计也没几人。", "answer_votes": "40", "answer_comment": "​4 条评论"}
{"answer_author": "知乎用户", "answer_id": 45161098, "answer_text": "等你快毕业了，你就会发现，大学间的排名，屁用都没有。只要层次一样，平台和机会都差不多，差异都是由个体决定的", "answer_votes": "94", "answer_comment": "​22 条评论"}
{"answer_author": "陆离", "answer_id": 44688405, "answer_text": "      因为武大换了校长啊      以上开个玩笑。      真要说原因，个人感觉武大作为一个在国内算超大型的高校，无论是学科分布还是这些学科本身，都具有极大的发展空间。测绘遥感领域曾经统领全国，实力雄厚；文法学科，马哲信管一枝独秀。其他的，理科数理化生、工科土建水电，以及新闻、法学、外语一众领域，虽然不是国内顶尖，但是达到了国内一流大学的水平。      换句话说，有这样的家底，你只要不败，肯定不会差到哪里去。你要是再好好发展下，就会感觉如沐春风。事实上，新校长上任后，很多事情不仅是开武汉先河，更是开全国先河（上任之初，装空调热水，接着借校庆之名兴建宿舍、打通信息学部与本部，在研究生领域更是提早减免全部学费，大力引进国外学者，推进研究型大学）。      从前十做到全五，比别人更努力就很有可能实现。要想再进一步，就需要静下心来好好积累。名声大只是这几年做得热闹，真要做到国内顶尖，其实距离还很大。      另，中科院真的很努力，人家名声小是低调。", "answer_votes": "37", "answer_comment": "​24 条评论"}
{"answer_author": "知乎用户", "answer_id": 72718123, "answer_text": "这个帖子一开，引得京沪高校群起围殴武大华科，我第一次在知乎上看到武大华科竟然站到了一个战壕里@_@(^Q^)", "answer_votes": "33", "answer_comment": "​12 条评论"}
{"answer_author": "黄大欢", "answer_id": 44382677, "answer_text": "至于发展迅速与否，但是对武汉高校可以跨学校进行选修第二专业，表示赞同和支持，国内高校资源分布存在严重不均衡的状态，如果学校资源能够实现共享，首先不仅是学生受益，同时学校， 政府，社会都可以尽可能节省资源，实现资源利用的最大化，不知这样解释，是否合理", "answer_votes": "21", "answer_comment": "​22 条评论"}
{"answer_author": "patamon", "answer_id": 72689115, "answer_text": "这是武汉的大学在知乎上被黑得最惨的一次", "answer_votes": "28", "answer_comment": "​9 条评论"}
{"answer_author": "知乎用户", "answer_id": 81194473, "answer_text": "这种问题以后不要邀我。谢谢。真是忘却难免留个疤。我要取消关注武汉和武汉大学两个标签了老是欺负我武和华小科。这个问题，我真的替中科大不值。中科大和南开这种坚持自我的大学我向来崇拜和向往，哪怕我是武大人也不会偏袒。然后，关于我武和华科的“崛起”问题，本宝宝来自搬砖专业学的是怎么好好搬砖这种问题本宝宝没文化真的不知道怎么回答。最后。我个人十分反对大学排名，十分推崇专业排名。门外的人们，门内的风景如何与你们毫不相关。门内的我们，门外的闲言闲语与我们毫不相关。最后的最后，学一下排第一好多赞的那个答主，华科么么哒！", "answer_votes": "12", "answer_comment": "​6 条评论"}
{"answer_author": "匿名用户", "answer_id": 72685625, "answer_text": "1.见过的很多 华科同学 和 武大的孩子 确实很优秀啊~学校的实力是可以反映在学生的素质上的不是吗？华科的校风确实是严谨、踏实、低调，让人尊敬。在武大，我见过很多真·漂亮姑娘，同时完美诠释了什么叫美貌与才华并重。2.我觉得有个观点是不对的，大学是培养人的地方，但是不是每个人都应该被培养成搞科研的~有些同学可能觉得搞研究说几个专业术语就牛逼了，然而（微笑）。有些人说我们武汉的学生是井底之蛙，眼界受限。可是难道不是很多莫名其妙的歧视链和优越感都是源于狭隘和无知？张华考上了北京大学，李萍进了中等职业技术学院，我在百货公司当服务员，我们都有光明的未来。", "answer_votes": "47", "answer_comment": "​28 条评论"}
{"answer_author": "匿名用户", "answer_id": 44437882, "answer_text": "进了几个BAT的就感觉计算机牛的不行也是醉了，你到IEEE fellow里面看看多少是科大毕业的，多少是华科毕业的。目前最高票的答案里面一副鄙视数理化的样子也是low。一流大学之间真正应该较量的是学术研究，而不是毕业的学生赚了多少钱。我觉得科大带给我最大的影响就是对基础研究的敬畏之心。虽然我是学计算机的，但是我能够知道潘老师做的量子信息，陈老师做的高温超导，以及万院士领衔的核聚变研究是多么的有价值和有意义。所以我尊重科大里学基础学科的同学，虽然我知道我以后赚的钱很可能比他们多，但是他们是推动人类进步最核心的力量。当然，科大也有很多缺点，比如男女比例值太高，学科面太窄，硬件建设和其他学校相比还有差距。最后，我想和对科大感兴趣的高三学弟学妹们说一句，科大与媒体上报道的大学相比差别很大，科大也不适合所有的人，在确定报考科大之前最好来科大感受一下。", "answer_votes": "124", "answer_comment": "​43 条评论"}
{"answer_author": "哈库桑", "answer_id": 72690602, "answer_text": "提了武大华科却没提我皇家理工的发展，哭晕在厕所了。我皇家理工大学（Wuhan University of Technology），简称武理工(WUT)，是中华人民共和国教育部直属的一所理工类全国重点大学，是国家211工程、985工程优势学科创新平台重点建设院校之一，是111计划、卓越工程师教育培养计划、海外高层次人才引进计划、国家建设高水平大学公派研究生项目入选高校，由教育部、交通运输部、国家海洋局共建。学校部分科系最早可以追溯到1898年张之洞创立的湖北工艺学堂，现武汉理工大学，由分属于教育部、交通部、中国汽车工业总公司的武汉工业大学、武汉交通科技大学、武汉汽车工业大学三校在2000年合并组建而成。截止2014年4月，学校共有三个校区，占地面积4000余亩；校舍总建筑面积逾156万平方米，四座现代化图书馆藏书390余万册；有普通本科生37300余人，博士、硕士生15000余人，外国留学生800余人。在2014年泰晤士报发布的亚洲大学排行榜中，武汉理工大学位列中国大陆第九位，亚洲第49位，进入《泰晤士高等教育》2013-2014年度世界大学前400名排行榜，位居301-350位，中国大陆第八位。", "answer_votes": "8", "answer_comment": "​18 条评论"}
{"answer_author": "Flaris", "answer_id": 45220517, "answer_text": "来补充一下自己的看法。武汉的大学发展很快这个说法可能存疑，但武汉的大学生发展空间很大，这一点个人感觉强烈。一方面，学生基数巨大。武大华科两所 985 高校每年的本科生招生数量就近于万人，数量上超过同在长江沿线的科大，南大和交大。同时，武汉也是“世界上大学生最多的城市”，各类高校遍布，门类齐全营养丰富。人多力量大，如果在武汉地区画一个高校学生的“朋友圈”，显然可以具有更高的战斗力。而武汉也的确就是这么做的。华中七校组成的联盟，接受联盟内其他高校学生赴本校修读双学位。武汉的“青桐计划”为大学生创业铺平了道路。位于城市东南的“中国光谷”接纳了各类成长型企业与创业公司的入驻。武汉的大学生在学习与工作的机会上拥有了更大的优势。另一方面，口碑。只谈互联网行业。武汉高校（准确说是华科Orz）学生在互联网行业的成就是很令人瞩目的。海豚浏览器，脸萌等等现象级产品的开发运维团队均为华科出身，而武大的计算机专业依托基础学科优势，也拥有不小的成就。互联网行业内有种说法。武汉很有可能抓住移动互联网行业的兴起，而具有“中国互联网中心”的地位。虽然现在听上去显得天方夜谭，但是如果武汉有办法留住这些潜在的互联网企业，提供更好的就业创业环境，至少武汉有绝对足够的劳动力与地缘优势发展互联网行业。同时，武汉可以在大学生创新创业方面提供给在校学生更多的可能性。与传统学术型，研究型高校不尽相同（对，我说的就是南七），武汉高校的惟成绩论，惟出国论稍弱，创业环境更好。室友就在创业阶段，风生水起。从校内固定办公场地到工商执照，他和他的团队用了一个月时间基本全跑了下来。如此说，最近的几大发展热点，无论互联网+还是“扶上马，送一程”，武汉都提供着良好的孵化条件。再加上巨大的学生数量，武汉大学生可以获得的机会与条件，实为个人发展提供了巨大的助力。", "answer_votes": "10", "answer_comment": "​13 条评论"}
{"answer_author": "水煮鱼", "answer_id": 45154528, "answer_text": "等华科基础理学超越中科大的时候，少年别忘了给我的坟头上上个香，告诉我这个消息。王师北定中原日，家祭无忘告乃翁啊！还有武大，我也没有觉得发展很快。", "answer_votes": "7", "answer_comment": "​21 条评论"}
{"answer_author": "刘伟鹏", "answer_id": 72654385, "answer_text": "心疼中科…居然被人这样黑...另一所985华科发展实在迅猛，实有赶超中科大之势，计算机尤其如此，校友遍布it行业顶尖企业如bat请题主看：全美CS教授血统排名，中国科大居大中华区亚军2014年，布朗大学一团队发布全美大学排名前50的计算机系教授出身排行榜，中国科大居全球20位，在大中华区第二（仅次于清华大学），并击败哥伦比亚大学、芝加哥大学等一票美国名校。近日，美国布朗大学计算机Jeff Huang教授率团队，分析了全美大学最顶尖的50个计算机系教授出身情况（限终身教职或终身教职序列的教授、副教授和助理教授）。麻省理工学院（128人）、哈佛大学（68人）、康奈尔大学（41人）、加州大学伯克利分校（41人）、普林斯顿大学（34人）位居全球前5。清华大学（30人）并列全球第6-8位。中国科大（15人）位居与加州大学洛杉矶分校、多伦多大学（加拿大第一名校)并列全球20位。你华科要比互联网应该和北京那所211比啊，为什么武汉的985就业居然不如211？是不是武汉的学校受制于地理在衰败。如何看待北邮单个学校的毕业生拿了BAT在北京一半的校招名额这种现象？ - 腾讯北邮计算机的就业是不是真的很屌？ - 北京邮电大学从上图可以看出，百度、阿里、腾讯的员工中北邮校友的人数最多，为836人，校友排名前五的学校为北邮、浙大、北大、华科、清华。不过你科计算机虽然不及211，好歹超过清华了，可喜可贺啊！", "answer_votes": "32", "answer_comment": "​38 条评论"}
{"answer_author": "知乎用户", "answer_id": 44099721, "answer_text": "我觉得武汉的大学发展快本身就是个伪命题。武大和华科块头超大，在各种排名中靠前是很自然的。南京大学一直以精英教育著称，有如南开大学，厦门大学，这些学校排名低多少受到规模制约。至于题主说得华中师范大学，真没有觉得她发展有多好，明明是不断没落，越来越不适应市场经济了，是武汉211大学中前途最迷茫的一个。另外一个排名较高的武汉理工大学，也在很大程度上沾了规模优势的光，合校之后的几年一度是全国在校学生最多的高校，这都不是南理工能比的。倒是以前规模不大的中南财经政法大学异军突起，目前势头强劲，虽然排名不高，但在市场上呼风唤雨，最近几年分数线仅低武大华科十几分而已，这是专业优势，不得不服，反面例子就是华中师范大学。总之，大陆高校排名中，规模最重要。不可迷信排名，参考意义实在有限。", "answer_votes": "18", "answer_comment": "​20 条评论"}
{"answer_author": "李旭", "answer_id": 44170864, "answer_text": "不要看排名 排名都是各种民间的一家之言目前也就教育部的学科评估排名有点参考意义 而且这个还是学科之间评估 并不涉及学校整体个人感觉南京的高校总体水准在武汉之前（虽然规模没武汉的高校大） 算国内第三高校中心", "answer_votes": "9", "answer_comment": "​2 条评论"}
{"answer_author": "Martin Crow", "answer_id": 72677230, "answer_text": "这是在黑我华科么。。蜗壳离中科大还差得远，隔壁武大跟我们差不多，离南大距离也不小，总之清北之下是华东五校，武大华科跟他们比是有档次上的差距的，跟东南比学科精度相当，广度有比较大的优势，至于华师南航南理工，就没必要拿出来比了。。", "answer_votes": "9", "answer_comment": "​4 条评论"}
{"answer_author": "知乎用户", "answer_id": 73218834, "answer_text": "这个问题实在是炸鱼呀，你看看这么一下炸了多少吨鱼出来，真是把汉二两所高校黑成渣了。客观地说汉二两校在很多学科上颇有特色，国内顶尖没得说，但论基础学科硬实力，尤其是研究深度方面比起华五还是有明显差距的，尤其是数理基础的学科，我科物理好些，其他基础理学偏弱，个人觉得这样对工学的进一步发展也是拖后腿的，当年如果真能请来钱伟长组建力学系，可能情况就好多了。所以我科学子和学校比较类似，工程实力强一些，项目做得很好但顶级科研实力只能算差强人意，谈不上最好。当然了这几年论文情况来看进步很大，但还是不能盲目乐观，更切忌和其他学校过多攀比，在各个指标上非比的高低上下出来，除了伤和气实在是毫无意义的。好胜之心很重要，但走出自己，把与他人的争强转做对自己的严格自律，更为重要呀。前些天看邓晓芒老师的一篇文章感触颇深，当年九思校长把毫无沉淀的华中工学院拉扯成如今国内一流的hust，创业之艰辛，实属不易。朱校长七十年代末提出的创建国际一流综合性高校的目光深远至极，如果更多的人才比如黄克剑和陈家琪教授能留在华工，恐怕如今离“国际一流综合性高校”的目标就近些了。再更进一步回到起点，一流大学的目标是什么？其实就是培养一流的人才，做杰出的科研和工作。作为一员学子，在校期间打足专业基础，读更多的书充实自己的人生，毕业以后严格自律，做出一流的工作，这些都是一流大学的体现。毕竟，一旦走出校门，校友即学校的代表，校友作出的成绩体现学校的实力。所幸在工作中遇到诸多优秀校友，低调的做人和扎实地做事之风，对本人帮助和启迪都很大，在各自专业也做出相当卓越的成绩，让本人受益匪浅。因此，愚以为友校之间争个高下实在毫无必要；真正走出自己，沉淀下来做出优秀的工作，才应该是吾辈受高等教育多年，埋在内心中的终极动力呀。", "answer_votes": "7", "answer_comment": "​4 条评论"}
{"answer_author": "匿名用户", "answer_id": 72658557, "answer_text": "没人看出来是钓鱼引战帖吗？实在是玩出了新高度了", "answer_votes": "6", "answer_comment": "​添加评论"}
{"answer_author": "火火", "answer_id": 44171739, "answer_text": "私认为学校比排名就像文人比气力一样", "answer_votes": "5", "answer_comment": "​添加评论"}
{"answer_author": "littleshi", "answer_id": 44369607, "answer_text": "我咋觉得武大在衰落呢，至于华科超越中科大的想法表示呵呵。。。这个问题可以问问为什么上海这几年高校发展迅猛还比较靠谱", "answer_votes": "18", "answer_comment": "​10 条评论"}
{"answer_author": "当时不杂", "answer_id": 88933557, "answer_text": "非邀请，但是必须撕逼一下。你们有些人说武大实力不济，不值这个名次，我表示深切赞同，并且看过了这么多黑武大的评论，我都没有发声。但是像题主这样一上来就说我武是买榜的！试问，有哪个武大男儿受的了！你没听说过，士可杀，不可辱吗？！你这样变相毁坏武大声誉，践踏一个百年大学的品格，你当我们武大人都是瞎子！都是好欺负的吗？！", "answer_votes": "4", "answer_comment": "​添加评论"}
{"answer_author": "赵琰", "answer_id": 72699724, "answer_text": "求你们别再黑蜗壳啦  总感觉莫名躺枪，，，  蜗壳就想安安静静地跟大郎搞基不行麽", "answer_votes": "4", "answer_comment": "​2 条评论"}
{"answer_author": "陈怡", "answer_id": 72673099, "answer_text": "满满的槽点啊。“按城市影响，武汉并不比南京好多少，南京文化氛围感觉更甚，但是为什么南京的学校一直发展缓慢呢，说平均教育经费的话，武汉也不会比南京的大学多多少，武汉的学校也很多。”哪里来的自信啊？另外，我知道南大出了江苏不算什么，但是武大和华科出了武汉是什么地位我觉得你还是考证一下先。利申：南大本硕等等，题主是来炸鱼的吗？题主引战似乎没有成功，目前四十几条答案几乎都是反驳的，没有人站在题主一边。我就不多说了，唉我这人就是心软", "answer_votes": "6", "answer_comment": "​5 条评论"}
{"answer_author": "罗浩威", "answer_id": 81038823, "answer_text": "这个问题真是有趣，华科经济学男生，对华科是综合性大学这一事实深信不疑。不要因为科技就三本，不要因为科技就理工，华科这几年发展并不快，但我们一直致力于发扬华科吃苦耐劳，低调有内涵的传统，从不觉得中科有什么理由傲气十足，也没有要一较高下的意思，大学是为了造福社会完善人生而设立的，不是叫大家成天比标签。", "answer_votes": "3", "answer_comment": "​2 条评论"}
{"answer_author": "匿名用户", "answer_id": 73256799, "answer_text": "题目明明是武汉的学校 心疼就酱被你们遗忘的华农华师中财还有皇家大理工 ", "answer_votes": "3", "answer_comment": "​1 条评论"}
{"answer_author": "Na ja", "answer_id": 72829647, "answer_text": "想不通科大的同学那么激动干嘛  我大关山技校明明是和蓝翔不分高下题主别黑我关技", "answer_votes": "3", "answer_comment": "​2 条评论"}
{"answer_author": "匿名用户", "answer_id": 72649357, "answer_text": "华科超中科大？华科物院学生，中科大、北大、南大是我心中的圣地！等长江中游城市群的经济可以和长三角、京津圈相提并论的时候，武汉的高校也许会有追赶，但也仅限于追赶。", "answer_votes": "3", "answer_comment": "​2 条评论"}
{"answer_author": "匿名用户", "answer_id": 45158794, "answer_text": "排名这种东西，年年有新花样，可是大家心里自有自己的排名。清北top2,任谁说了我是第一都会有人撕逼；然后复旦上交浙大什么什么的，都说自己是第三大家也没异议，武大什么的自觉往后站站，5-10差不多了。就算有哪个榜哪一年进了前五，也不过是博学生们和校友一乐，心里有自己的位置就行，要是武大的校友和同学们还真的跟浙大的人说，我今年排名超过了你，那真的是打自己脸了。没什么其他实力的比较才拿排名说事儿。记得有一年武汉理工大学排名进了亚洲50左右，超过了武大还是什么，武理的同学在各个社交软件乐呵呵的分享，那么现在大家有觉得武汉理工比武大好吗？过了武大的分数线会去读武汉理工吗？（没有喷武汉理工的意思，打个比喻，校友勿喷，得罪了）", "answer_votes": "4", "answer_comment": "​4 条评论"}
{"answer_author": "匿名用户", "answer_id": 74535817, "answer_text": "找工作时才发现，我科真是太低调了，我科学子在求职时经常被鄙视。。。特别是沪系高校。同济和复旦在我科面前有优越感，我也没啥大意见。请问华东师范和上大在我科面前狂秀优越感是为哪般？！", "answer_votes": "3", "answer_comment": "​添加评论"}
{"answer_author": "风雪", "answer_id": 72675410, "answer_text": "不说别的，只比排名不比人的我坚持反对。。。。武大给人衰败的感觉是假象，华科给人发展迅速的感觉也是假象。。。。你让南大把周围几个大学一合并，排名也会再涨几个（举这个例子只是说涨排名是有套路可言的）。。。。", "answer_votes": "3", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 125854091, "answer_text": "各位无论中科南大浙大武大华科都是全国重点985的，这么撕不觉得很掉逼格很无聊吗？我希望武汉的高校发展快，我也希望北京南京杭州上海都发展快，我更希望西北西南地区的学校可以发展快.美国的哈佛耶鲁哥大普林斯顿芝大杜克出了美国知名度也很高，而中国又有几所大学在全球可以响当当？若不信，你可以上Quora查一查，中国大学知名度问题下面基本都是国内的或留学生在答题.&lt;img data-rawwidth=\"960\" data-rawheight=\"720\" src=\"https://pic4.zhimg.com/50/v2-b1986e3d2c12d1e8fa1dac173ff95076_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"960\" data-original=\"https://pic4.zhimg.com/v2-b1986e3d2c12d1e8fa1dac173ff95076_r.jpg\"&gt;作为一个中国人，我希望整个中国高等教育都可以发展快，都可以上一个台阶，可以和国外的大学比谁的发展快谁的实力更强谁的知名度更高，而不是天天在井里互撕.最后，我换用习大大的一句话：世界上不会有第二所哈佛、牛津、斯坦福、麻省理工、剑桥，但会出现一大批新兴的中国著名学府.", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "默语", "answer_id": 72694885, "answer_text": "我竟无言以对。我们代表不了学校，学校的牌子也不能代表我们。你的自信应该来自于本身而不是学校的牌子，在意这个干嘛，虚名而已！", "answer_votes": "2", "answer_comment": "​1 条评论"}
{"answer_author": "匿名用户", "answer_id": 44293254, "answer_text": "谁告诉你华科有超越中科势头？再说了，势头一词非常模糊，那我还说华科有超越清华的势头呢，可是何时能超越呢？你以后申美帝或者英国名校的时候对方可能会因为你是清华北大科大的多看你一眼，但是绝对不可能因为你是华科的而对你格外关注，华科中科终究不在一个档次的，华吹退散吧。。另外不要迷信排名 如果你非要看排名，那么你可以去查不同大学在同一个省的录取分数线，去掉地域加成后，这个排名将会是最公正的最具有含金量的（但此排名偏实用而非学术，如央财分数线高武大20-30分 但是你不能说央财综合实力强于武大。）所以一般来说THU PKU TOP 2没的说FDU SJTU USTC ZJU NJU 这五校实力相差不大，各有各的特色，都是好学校。再往后的话按分数排名就不那么准了，因为财经类大学尤其是帝都魔都的，分数线都是比较高，但是综合实力不见得比老牌国立大学强。", "answer_votes": "4", "answer_comment": "​10 条评论"}
{"answer_author": "夏白桦", "answer_id": 44137443, "answer_text": "我个人认为，毕业生5年后平均薪资，高考各地录取加权平均分，作为衡量大学最功利的标准，也是对学生最有意义的，按这种方式排名，武大华科真的不能和上财中科南大同济相比，不过是和东南相差仿佛。另外武汉作为华中地区中心城市，周边省份教育资源匮乏（河南安徽湖南），为了满足更多考生获取优质教育资源的需求，也不得不扩大招生，走上大而全的道路。利益相关：我是华科的", "answer_votes": "4", "answer_comment": "​34 条评论"}
{"answer_author": "匿名用户", "answer_id": 201771424, "answer_text": "利益相关:华科人  赶超中科大，有没有搞错?根本不是一个层次好吗……我爱我科，希望能在新的50年内大幅缩小与科大差距。因为我科基础科学实在太水了所以这或许是一个漫长的过程……（何况中科大后面还有科院）", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "超人不会飞", "answer_id": 124842353, "answer_text": "“实有赶超中科大之势”，请题主自重，不要黑中科大", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "阿柟", "answer_id": 74932175, "answer_text": "不匿了，回复的时候突然对某浙仇恨值达到顶峰，@项楚所以华科的同学撕我吧，我不回了，我还就专黑某浙了。分割线＿＿这么说吧，伪命题，有的人这么看，有的人那么看，没意义，某校人太多，现在搞得好像华武超科南是政治正确一样，我没空和你们撕，有意见保留，因为我无法说服你们。但亲们，说自己好就罢了，整天说这个衰落那个衰落真的是素质问题，这就是华科永远比不上科大的一点:人少，成才率高，不成才率也就比华科低太多，不会有这么多素质不高、过度自信、脸皮比城墙拐角处都厚的学生。即使上限一样，下不封底时，你会选哪个(不用我说，反正中科几乎在每个省都比华科高30分，衰落到姥姥家也比华科高，这是事实，别TM跟我说这有用没用，首先要承认，这是事实，也就是说，能上科大的当年几乎可以在华科任选专业!这是事实，你们扪心自问，你们同学中当你有多少是考不上科大痛心急首去了华科?)怕被撕所以匿了名，但我想告诉某些人，我尊重华武，敬佩华武，但我鄙视你们，你们以为在网上撕几句华科超中科，武大超南大给母校长脸了?处处竖敌，以撕为乐的话，劝你们别给母校丢脸了。", "answer_votes": "1", "answer_comment": "​8 条评论"}
