{"question_id": "30656792", "question_text": "", "question_title": "游戏AI和机器学习技术可以怎样结合？", "question_commet": "​添加评论", "answer_number": "2 个回答", "question_followers": "18", "brower_number": "1,241"}
{"answer_author": "李巍", "answer_id": 135836175, "answer_text": "alpha-go2016-12-21更新：先介绍一下背景，对数据挖掘和机器学习只是道听途说，并不是相关从业者。游戏行业从业者。所以对于机器学习的认识很可能是错误的，欢迎批评指正。问题本身是“可以怎样结合”？首先可能是需要考虑到物质基础：相对来说，棋类AI目前是较为成熟使用机器学习的游戏类型。学习需要样本，同时也需要强大的运算和存储能力，如果一开始不“喂”大量的样本，AI一开始的表现大抵应该就像聊天机器人发行最初一两个月的样子。对于游戏产品而言，除非是体验本身就如聊天机器人那样卖萌，否则结果会是什么呢？我想用户也许最好也就可能是觉得这个体验很新鲜，而应该不会觉得这个体验很舒服。因此说AlphaGo就是因为印象里看到个消息说这家伙准备学习星际争霸，然后跟人类PK，结果怎样，拭目以待吧。但这依然是基于星际争霸已有的巨大的样本空间、以及长时间的学习。最后给你的结果也许是好的，但是我们所期望的，更多的是跟这个结果的对抗，既不是结果本身，更不是形成结果的那些过程。根本问题在于，游戏中AI的目的到底是什么？尽可能的让你感觉到你在跟一个真实的玩家在玩？还是尽可能让你感觉到你在跟一个真实的高手在玩？还是只是带游戏整体节奏的手段？取决于游戏不同的类型，答案会很不一样。而目前来看，竞技型游戏的AI目标才是更偏重于对人类行为的模拟，才更多需要对人类行为的学习，完全从零开始的学习，注定是一个长期的养成过程。要减少时间成本、在某个简化的规则集合内，针对玩家的一些局部固有操作特征进行针对性的对抗，也许是可以考虑的。例如样本分析前期暴兵流的一些经济特征，发现或者设定其在胜率上往往被龟缩流压制，而“学习到”某位玩家长时间使用前期暴兵流，则AI则可以故意更多选用龟缩流与此玩家进行对抗。严格说来这到底算不算机器学习？不清楚。以下脑洞：巨大的样本空间、强大的运算和存储力、长时间的“投喂”，目前比较直接的想象是可以用于竞技型游戏发布前通过长期养成来得到一个初始的AI，或者是在游戏发布后通过用户大量的数据来不断改进AI。但这个过程一来费时费力，二来本身多也得摸着石头过河。结果呢？不敢打100%包票说会让玩家满意吧？万一训练出来个老兵油子把新手都吓跑了，或者训练出来个蠢货总是在关键时刻掉链子……因此即便投入正式商用了，短时间内应该还是一个辅助手段，仍然需要设计师控制关键流程和核心体验。因此传统游戏是否有足够的动力去做这种结合，目前还是很大的未知数。嗯，当然，反其道而行之地想，目前学习的性质是：时间、运算力、养成。因此利用起来这几个性质也许也是一个不错的方向：就像大家教育聊天机器人那样，一张如空白白纸般的机器人，跟据与人们的互动不断认识这个游戏世界，学会新的语言和技能，直到自己能做越来越多的事情：第一句话、第一次自己穿衣、第一次做饭……直到打倒恶龙，也许也是一个方向？只是，多人养成能够加速学习过程但是也许会减弱每个人的参与感，单人养成需要考虑到本身的运算力成本、时间成本。希望后面能多做一些玩点复杂AI的游戏……", "answer_votes": "1", "answer_comment": "​2 条评论"}
{"answer_author": "张红贵", "answer_id": 135755492, "answer_text": "当今机器学习算法已经广泛应用于我们的日常生活之中，每天我们需要处理的数据也在不断增加。理解数据背后的真实含义，能够帮助人们认识事物本质，提高生产效率。机器学习算法主要用于分类、回归和聚类，常用的几种算法如下所示。    监督分类算法    K-邻近算法    决策树(ID3算法)?    朴素叶倍斯分类器    Logistic回归    支持向量机(SVM)    AdaBoost元算法    回归预测    线性回归    树回归    无监督聚类    K-均值聚类    关联分析    Apriori算法    FP-growth算法    优化技术    降维：PCA算法    降维：SVD算法    大数据：MapReduce", "answer_votes": "0", "answer_comment": "​添加评论"}
