{"question_id": "31129033", "question_text": "我是杭州的一名文科生，明年高考，基本确定学习新闻传播专业，因此很想报考武大。——————————————————追加问题:武汉大学的戏剧影视文学专业非艺术生可以报考吗？或者非艺术生可以把它当做第二专业吗？", "question_title": "为什么武汉大学排名很靠前，但在外省录取分数线普遍偏低?", "question_commet": "​4 条评论", "answer_number": "20 个回答", "question_followers": "44", "brower_number": "126,705"}
{"answer_author": "Shuboss", "answer_id": 50868137, "answer_text": "武大郎强插一腿！！！首先我想说，浙大和武大不是一个档次，真不是一个档次！然后，武大社科人文类的专业总体优于浙大，但是不代表分数可以达到浙大水平！可自行脑补清华大学文史相对起工科算比较渣啦，你见过它分数低么？然后，在浙江，能上浙大的还真说不定选择来武大，我们不是没见到过，贴一张图！去年新闻院新闻传播类在浙江招生3人，最低分683，.最高分685，当年浙大文科浙江投档679，可以想象高投档几分能去浙大读什么专业，可能面临被调剂的命运，而来武大可以读新闻！然后，虽然浙大比武大高一个档次，但是不存在北大那样对武大的碾压！我所指的碾压指的是人家投档线比你的最高分还高！可以给你放图，去年武大法学在浙大录取两人，一个685，690，690大概可以在浙大读一个不错的专业，然而…考虑到浙大在浙江招生文科考生300多，你也就明白这两个学校的差距了！题主，能够来武大读一个不错的专业，我还是建议可以来，如果你的分数在浙大都游刃有余，我武还是希望你来！！！哈哈哈&lt;img data-rawwidth=\"640\" data-rawheight=\"1136\" src=\"https://pic3.zhimg.com/50/7d70e88ee643f4d86a3d8afd95a6240c_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"640\" data-original=\"https://pic3.zhimg.com/7d70e88ee643f4d86a3d8afd95a6240c_r.jpg\"&gt;&lt;img data-rawwidth=\"640\" data-rawheight=\"1136\" src=\"https://pic1.zhimg.com/50/0b1d8deb4128042a76d0806cb1b8fb84_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"640\" data-original=\"https://pic1.zhimg.com/0b1d8deb4128042a76d0806cb1b8fb84_r.jpg\"&gt;", "answer_votes": "9", "answer_comment": "​34 条评论"}
{"answer_author": "知乎用户", "answer_id": 50748215, "answer_text": "那是因为武大良心。武大大概是各类同水平大学中在本地方招生最少的大学之一。一般七千五百多人一届，只有一千多是湖北本省，给省外的机会多，分数自然相对低，但是武大也因此更富有竞争力。顺便一说，武大在近几年发展非常快速，而华南的中大似乎有点故步自封了，毕竟华中地区还有华科这个对手，刺激武大进步。", "answer_votes": "35", "answer_comment": "​20 条评论"}
{"answer_author": "匿名用户", "answer_id": 118830643, "answer_text": "虽然身为武大人，但浙大和武大真的不是一个档次…比如浙大在C9而武大不在C9就可以看出…当年我的分数比南大低一分、浙大高两分、武大高九分。其实我倾心南大可是一分之差无缘南大…一心想学社会科学，所以平行志愿B在浙大武大间纠结。浙大真的很强，但因为浙大强就说浙大文科也很强恕我难以苟同。各路老师同学亲友也劝说我报考浙大（毕竟更有名气档次更高…）但心向社会科学的我最后一刻还是选择了武大（真的是最后一刻，修改志愿截止日期前半小时…）武大分数低我想还是因为武大体量大，毕竟四校合体招生人数飙升至7000人，大部分学校招生总数在1000～3000，人数多必然分数低，所以我认为是招生总量的原因导致武大分数偏低。以上.利益相关：武大法学院", "answer_votes": "3", "answer_comment": "​3 条评论"}
{"answer_author": "川叶", "answer_id": 50771470, "answer_text": "我重庆人，武汉大学以他的排名来说在重庆的分数至少是不低的。武汉大学的http://m.koolearn.com/gaokao/801765.html北京大学的http://m.koolearn.com/gaokao/791898.html如果算平均分，和北大比，一般少30-40分（文） 40-50分（理）。最低分的差距我记得比这个更小一些。说到新闻传播的话，我那年武大在重庆原计划招3个新闻传播，我们报考的人分数都太高了，最后武大决定招5个。你感受一下…所以我完全没觉得分数线低…单拿新闻院来说的话。", "answer_votes": "4", "answer_comment": "​8 条评论"}
{"answer_author": "知乎用户", "answer_id": 50748494, "answer_text": "反正我不觉得和我浙水平一样0.0", "answer_votes": "9", "answer_comment": "​9 条评论"}
{"answer_author": "匿名用户", "answer_id": 80833835, "answer_text": "谁说的……至少在我省，武大的分数是在同档学校中分数最高的，而且比同档低分学校（如厦大）高了七八分不止。利益相关：高考大省，理科分数是武大分数线的考生有200+。ps：你要硬说武大全国第四和浙南人同档我也没办法。", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "crystone", "answer_id": 53660830, "answer_text": "武大每年招生规模八千左右，相比国内各家高分985已经有两倍到三倍，那么根据供求关系，供给增加而需求稳定的时候，价格，即录取线，下滑。专业设置方面，各家综合985相差并不很大，武大倾向于同专业在同一生源地招多名学生，或是按照大类招生，同质商品自然多了，趋向于完全竞争，录取线摩擦下降。（haha）", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "章一帆", "answer_id": 50745433, "answer_text": "ps：新闻的一个原则是客观公正，楼主不妨添加下浙江大学这个标签，听听浙大学子怎么说。Pps ：武汉大学是所好学校，我填志愿时曾在武大经管专业和浙大人文之间纠结。-----------题主，你好。我列一些比较吧。人大新闻系和浙大新闻选哪个？——建议选人大。（如果你想学金融专业）但是上不了浙大的社科分数线，可以上厦门大学的。浙大人文和厦大金融选哪个？——建议选厦大。现在你和我说：武大新闻和浙大新闻选哪个？——欢迎来浙大浙大在浙江招文科生300+ 。武大在浙江招几个？没超过三位数吧？这样分数线都比浙大低，你还能说什么呢？楼上有人提到：“本科看学校，研究生看专业排名。”的确。浙大的本科平台比武汉大学好。题主好像对浙大的定位不大清楚。浙大是向清北复交看齐的学校。（即使是文科，浙大在省外的分数线比南大要高，次于清北复交人）即便从我文科生的角度来看，武大是要比浙大低一leve的。好像有些误解呢……无论如何，欢迎楼主来浙大玩……吓到了学妹，去面壁去利益相关：浙大大二文科狗。", "answer_votes": "4", "answer_comment": "​9 条评论"}
{"answer_author": "姓施的瓦辛格", "answer_id": 50738361, "answer_text": "西安交大也是个好学校啊，还是正牌，就是因为在西安，所以分数低东北大学211.985，工科也是特别强，就是因为在东北，所以分数低现在你懂了吧", "answer_votes": "4", "answer_comment": "​8 条评论"}
{"answer_author": "知乎用户", "answer_id": 205431489, "answer_text": "在浙江并不低。今年和浙大就相差没几分，并且比其他大多数985都高。地段不好，被黑的很厉害，被人歧视呗。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "糖笑", "answer_id": 108155944, "answer_text": "@武汉  快来背锅", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 101879543, "answer_text": "外省投放名额太多，武汉区位优势不明显，还有高中生一般不懂怎么报学校，只考虑名气，分数自然低。你去查教育质量排名就知道这么多学校中孰优孰劣了", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 82361125, "answer_text": " 分数线有以下几条决定地理位置，分两类1.招生数量。本省大学在本省招生比较多，所以，，，本省的分数线在本省可能会更低2.地理优势。同样水平的大学，在好的地方分数更高，因为你有更多的机会与外界接触，在北京上海见识到的和在哈尔滨见识到的可不一样，说句实话，查一下学科排名，哈工大在各个专业几乎都是数一数二的，但是分数线比较低，因为。。。东三省实在不是好地方。。学术能力，很多大学排名大致是按这样拍的，还有一个方面是出国机会，比如很多学生物的都一定选择中科大，因为中科大生物专业虽然不是最好，但是出国机会最多，而生物在国内。呵呵。国外还好。名气。同济南开，大学，著名的老牌大学，但是已经是今非昔比了，靠着名气保持高分。所以，排名这个东西嘛，差不多就好吧 ，分数线这个东西嘛，仅供参考啦", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "李辂 字献凉", "answer_id": 50999601, "answer_text": "河南考生，表示985名校里面，武大在河南投放的招生指标确实是最多之一", "answer_votes": "1", "answer_comment": "​4 条评论"}
{"answer_author": "匿名用户", "answer_id": 52171938, "answer_text": "原因可能是你看的排名的问题吧。虽然只是听过一些清北复交科的教授的评论，我一直认为浙大排名很高（甚至有时比复旦还高）只是因为合并了很多学校，规模大而不精。但是，但是我还是第一次听说浙大和武大排名差不多的。真是第一次。       我觉得你看到的排名应该是武连书排的吧，那玩意，口亨。可是武连书也把浙大排在武大前面啊。        这么说吧，我也不怕找骂，务实排一下中国的比较好的大学吧。第一梯队：清北。这两所学校比强弱没什么意思，一个梯队的。下面每个梯队内都是类似的。有谁排在清北前面可以说是自取其辱。可能你会说什么国科大云云，但是出路太窄，一条路到黑总是不好的。想当年我高三申请清华申请了五次，呜呜呜呜，还是没去成。第二梯队：复旦交大中科大。这个梯队大学就不能用一个字代指了，牌子没那么响。        可能有人喷科大怎么在这里。我只能说你把科大排在哪我都无所谓，但是我就要把他排在这，因为有很多很高水平学生为了出国放弃平辈来了这里。我的一个师兄物理竞赛全省第二，保送北大妥妥的，还是来这了。我把它排这里是因为它培养的精英们。科大的学术严谨和国际声誉不是喷子们的母校能比的，斜眼。第三梯队：浙大，南大。想了想还是把浙大排在前面，毕竟各种大学排名风光。可是我很喜欢意淫南大把南京那几群高水平大学合并了会是什么样。东南大学、南航、南理工、河海、南师大、中医科…阿勒！这个水平比浙大合并的大学水平不知道高到哪里去了。可是，只是意淫。第四梯队：人大，西安交大，哈工大，北航。中间两个是C9，你不服不行。位置原因高考录取分数不高。但是C9就像一个小俱乐部，很多机会没门票就是没有。我记得有个很有名的C9留学家长群，不是C9的就是不给加。北航也很好，不是只学飞机的！斜眼。第五梯队：争的学校太多的，看官么把自己母校愿意加就加进去好了。PS：我很想知道读新闻啊来我们复旦好了，复旦排名比武大排名总没有争议了吧。", "answer_votes": "6", "answer_comment": "​19 条评论"}
{"answer_author": "匿名用户", "answer_id": 137852621, "answer_text": "坐标江苏，武大华科的分数与南航南理工大致相当。因为孩子想报武大的时候，家里都会说“武汉穷地方，不去。”根据城镇居民收入统计，南京应届生人均收入排名全国第四，武汉应届生人均收入排名全国第二十四，几乎只有南京的三分之二。数据和排名未必准，但也充分反映了武大华科在江苏这类地方不属于受欢迎的学院。本科南理光电，研究生华科国光，毕业后打算回江苏发展。", "answer_votes": "1", "answer_comment": "​8 条评论"}
{"answer_author": "匿名用户", "answer_id": 198604938, "answer_text": "因为名不副实。", "answer_votes": "0", "answer_comment": "​1 条评论"}
{"answer_author": "知乎用户", "answer_id": 114289852, "answer_text": "武汉大学和华中科大在 河南 湖南 江西 安徽 山西 四川 山东等省份都是招生人数最多的外省985学校.", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 92364500, "answer_text": "在浙江，文科我记得武大和浙大一个分数吧，一两分的差距，还不一定谁高。同档次的还有北师大什么的。其实具体到专业的话，武大有些专业很有优势的，编辑出版之类好像，新闻，法学也很好。浙大教育学不错。不过省外浙大名气非常大，比肩复旦，所以浙江人不去浙大，至少名气上来说是可惜的。但是浙大文科出路也一般，文科传统就业的行业里，人脉也不如武大。", "answer_votes": "0", "answer_comment": "​1 条评论"}
{"answer_author": "郑昊", "answer_id": 50832418, "answer_text": "你别光查武大啊，除了北上杭宁的高校，其它地方的知名高校普遍分数低，不光武汉，整个中西部都是这样，兰州大学这种985的文科经常只比重点线高10分而已。因为浙江考生就是喜欢这几个地方，中西部根本不愿意去，至于为什么你自己也清楚。武汉大学还是不错的，认识一个武大经管的女生，有一次她和我说她第一志愿是复旦差了几分，于是第二志愿来武大，还能上分数最高的经管院，是武大在浙江招的文科最高分，我默默一想，武大最高，那岂不是整个中西部高校在浙江招的文科状元了……就这样和学霸认识了。所以，你仅仅比哪个学校好意义不大，区域因素在浙江考生中影响很大。", "answer_votes": "1", "answer_comment": "​3 条评论"}
