{"question_id": "31384808", "question_text": "如题。20160724。毕业前题的问题，现在已经毕业一年啦。15个回答，差强人意。多感性，少理性。视角多单一，逻辑不清晰，用工程控制思维说，只有正控制没有负反馈，不是一个好的控制，也不算好的答案。继续等辣。。", "question_title": "如何评价华中科技大学的研究生好多普通一本或者二本的学生生源？", "question_commet": "​3 条评论", "answer_number": "66 个回答", "question_followers": "221", "brower_number": "156,428"}
{"answer_author": "霜耳", "answer_id": 54202828, "answer_text": "我来占坑说说吧！Cambridge 说：好讨厌学校这么多从China来的，考不来好学校，也研究生能来我这儿蹭门面。MIT如是说，看那些Chinese，就会刷题考分，就会拿绩点，做起实验来，一点创新能力都没有。Stanford说，asian成绩好怎么样，你给我开家公司，开发新技术，再不济你先搞搞半导体。清北复交如是说，看出个国还得天天左手GRE，右手Toefl，我来分分钟。—————缝合线—————抖机灵莫见怪————手机码字太慢—————最烦这种居高临下盛气凌人不居安思危反到坐吃山空。好大学给你什么，给你是看不起人的资本，还是给你瞧不起人的本钱，给你的是努力的机会。俗话说满罐子不荡半罐子荡，就是这么个道理。否定一切出生论。否定一切有色眼睛。王安石伤仲永还是得好好看看。", "answer_votes": "65", "answer_comment": "​15 条评论"}
{"answer_author": "知乎用户", "answer_id": 52384559, "answer_text": "换个角度，我科也有许多人去比华科还好的学校呢……", "answer_votes": "20", "answer_comment": "​4 条评论"}
{"answer_author": "匿名用户", "answer_id": 53077494, "answer_text": "华科最优秀的学生研究生一般都去清华北大或者出国了，本校保送留下一部分，剩下的名额就是考研考进来。外校都希望能通过考研跳到更高层次更高平台，通常会比本校的更努力。作为一名刚二本考到华科的学生，说实话来到贵校确实有些自卑。自从我通过复试后没多久就争取多呆在实验室。我也非常珍惜在华科学习的机会，差距确实有，但我会用心努力弥补。华科的研究生确实非常优秀，导师也很有水平，但同样有天天混日子的。既然都是华科的研究生，大家起点相同，追究本科背景不如看看毕业后谁发展的更好。", "answer_votes": "119", "answer_comment": "​101 条评论"}
{"answer_author": "匿名用户", "answer_id": 259896905, "answer_text": "如何评价清华研究生很多都是来自像华中科技大学这样高考比我们低60分多的学校的学生？    如果题主觉得华科收二本学生让你觉得很惊讶，那请问让清华的学生亲何以堪，要知道我们多出来的60分都是很难题目的分呀，应该说这60分比从500分考到600分要难的多么。    但是清华收华科的学生，是因为华科的那些学生很刻苦，低调务实，有实力，在考研的角逐中用硬实力脱颖而出，而不是因为在清华看来华科是一个985,在清华的老师眼里你来自华科和你来自普通本科差别并不大。     同样清华也会欢迎来自二本三本，学习成绩优异的同学们，实力至上，在国内，top2才不care你来自什么985,什么211反正都没什么牌面就是了，要想来读研，拿出科研成果，实力才是硬道理     反倒是，那些不顶尖的学校更加关心，学生的出身校，从这一点来看华科愿意接受二本学校学生，说明华科更加看重学生的硬实力     当然不排除同样水平表现力的学生学校更加倾向出身好的，但相对而言，已经是相对很公平了    从整体来看，全国各个高校都有这种趋势，好学校的学生有更大的平台，更广阔的视野，更强的平均实力，自然能选择更高的发展平台，清华的牛人，早早就跟随业内顶级大牛，空出来的教育资源自然让次一级的学霸上位，同理从清华往下的学校都在一定程度上重演这样的规律    在4年前你也是通过那几张试卷考出来的分数进的学校，所以人家现在用同样的方式进了学校没什么问题，并不能说你当年的高考就显得更加高大上，既然你觉得你很强，为何不在考研中再次展示你的实力呢，假如你连考研都考不过人家，是不是还问自己，为什么考研比我高的多的学生和我在一所学校读研    为什么很多一本二本的学生，很大原因是这部分学生基数比较大，本校的大部分学生和同等级别院校有更大的概率会获得更好的发展平台，自然本校的资源被这些学生上位了    考研，工作干什么都好，是一个人在高考后又一次具有标志性的洗牌和筛选，正如你的提问，人家上来了，而自己还在原地踏步或者退步，既然对此不满，有所疑虑，那么就说明你应该警醒自己。    如果你只是纯粹的想了解，这样一种现象的数据分部规律，那么你自己先贴出来对应的现象分部数据更容易引出你想要的所谓的工程控制。", "answer_votes": "84", "answer_comment": "​27 条评论"}
{"answer_author": "知乎用户", "answer_id": 187717767, "answer_text": "今年考上的，来回答一下这么久之前的问题。先声明：虽然时间不长，但是记忆总会添油加醋（来自 同桌的你），所以我不能保证内容的客观性，而且我内向幼稚不成熟，所以不能保证这个答案不是迂阔的。最重要的原因我认为是复试的选拔制度。1.初试通过人数很多，但是通过复试的却很少。我考的光电学院的，今年的分数线是300，和去年一样。本来都以为分数线会升高，毕竟今年的考试难度有所降低，400+的一大片。但是分数线依然是300。只是去年的复试人数与通过人数的比是1.2比1，而今年是1.5:1，复试的准入门槛降低但是竞争更加剧烈。此外，专业复试分类进行，光学工程学硕考的369以上的才有资格进行光学工程学硕的面试，不够的都去参加专硕的面试（我就是不够的），学硕面试未通过的再到专硕里排名。这样来看，学硕的比例如果还是1.5:1，那专硕的由于加上了学硕被刷下来的，可能比例达到2:1了。2.英语面试（20分）公平。之前看了浙大考研的面试经验贴，说要准备专业词汇，于是准备了很多。结果，英语面试是英语学院的老师来面试的！先是自我介绍，要求是：不能包含姓名、学校信息！如果强行介绍，会被判为不及格，每个人身上会贴一个编号，老师的评分表上也是编号，没有你的信息。然后听一段听力材料，内容就像把考研英语中阅读题的读出来，接着问你几个问题，这段话讲了什么，然后再问一两个问题。3.笔试（40分）公平。 是与初试不一样的科目，一般是一门专业必修课。而且考试并不简单，很考验对这门课细节的理解。考察你在初试考完之后复试之前的这段时的学习能力或者你的基础，同样地，这个能力和你的学校无关。4.专业面试（40分）公平。同样地，你进去之后不能介绍自己的学校、姓名等信息，如果你强行介绍，会被判为不及格。标签和评分表也一样。面试的老师似乎要么是不教本科生课的，要么是大课的老师，对学生普遍都没印象的。必问问题是你考的哪门课？你还擅长哪门课？老师会针对你考的课和擅长课各出一道题或者两道题。复试的公平，使得本校学生的关系优势消失，而初试通过的人多，使得参加复试的基底更大。从熵的角度来讲，把气体进行混合后再取出一些。那么将气体混合的越充分，加入的气体越多，你所取出的气体混合的就越充分吧。题主，这个回答可以吗？", "answer_votes": "35", "answer_comment": "​44 条评论"}
{"answer_author": "匿名用户", "answer_id": 91190109, "answer_text": "二本 今年刚刚考上华科。先说不好听的话吧。不要yy二本学生从大一大二就开始准备考985研究生了，我们大一大二还在玩。。而且，如果真有从大一大二就开始准备考研的，有那个毅力早就保研了。不要举特例，我知道肯定有人的七大姑八大姨是从大一大二就开始准备考研后来逆袭的，但是我自己在二本学校，我从我自己和我所在的环境出发来看，我们都是从大三下学期开始复习的，可能有早点，那也是从大三寒假开始。绝对没有从大一开始的。我不知道有人说二本生考上都是提前一两年开始准备的这句话的目的是什么，但是我只能说绝对不是这样。但是，我承认，确实二本学生考上以后会和本校生有差距。这点从面试我就能感受出来。所以，我也很后悔大一在玩，大二考雅思而忽略了培养自己专业课能力。我会尽自己最大努力去弥补，可能有人说，你怎么也比不过那些本校生，whatever，我努力是想改变我自己的生活，就像我考研一样，我自己过的舒坦就可以。很开心华科给了我这个机会和牛人们相处，我会好好珍惜，去提升自己。", "answer_votes": "43", "answer_comment": "​34 条评论"}
{"answer_author": "文火慢炖", "answer_id": 52403528, "answer_text": "这很正常好吗，人往高处走，水往低处流。考研当然都是往好的学校考，除非你本校已经很好，所在专业的实力也很强。再说，考研考进好的大学比高考容易一些。所以重要的是放下你的优越感，搞好自己的学习科研，提高专业技能&lt;img src=\"https://pic4.zhimg.com/50/v2-9663798c9a672e086cf0e704dc4049ff_hd.jpg\" data-rawwidth=\"411\" data-rawheight=\"300\" class=\"content_image\" width=\"411\"&gt;", "answer_votes": "8", "answer_comment": "​添加评论"}
{"answer_author": "方应杭", "answer_id": 263620320, "answer_text": "楼主不如换个角度想：为什么清华北大的本科生不来华科读研呢？答案就显而易见了。", "answer_votes": "5", "answer_comment": "​添加评论"}
{"answer_author": "弈晨", "answer_id": 52986543, "answer_text": "反问一句：如何评价华科里的本科生有不少是高三复读生？或者可以继续反问：如何评价华科里有不少学生是农村户口？如何评价华科里有不少学生在高中只接受应试教育？看到很多人的回答说普通一本或者二本考过来的研究生如何如何差之类，评价一下：首先土著不应该有一点优越感，因为普通一本或二本考生比你有追求，你没有考去清北或国外读研究生。其次，那些意淫人家本科大一大二就开始准备考研科目的人，请你们拿出准确的证据和统计的数据，一切没有正规统计数据的意淫都是心理变态。真为那些华科土著研究生最后毕业时混得没有人普通一本或者二本考过来的研究生好感到悲哀，正如我也为华科本科生里应届高考生混得没有往届高考生混得好的那些感到悲哀一样。", "answer_votes": "48", "answer_comment": "​7 条评论"}
{"answer_author": "知乎用户", "answer_id": 52415149, "answer_text": "没有统计过，但是我个人觉得清华北大的本科生的平均智力水平或者说平均学习能力，应该远在清北的研究生之上。推而广之，后面的学校都一样。", "answer_votes": "10", "answer_comment": "​3 条评论"}
{"answer_author": "熊伟", "answer_id": 213447160, "answer_text": "谢邀（好吧没人邀）这警醒了我们，高考一次成功不是终身成功，一次失败也不是终身失败，在一个更好的平台，如果不继续努力，四年之后依然会被很多平台不如你的人追上甚至超越。努力让高考成为一个小高峰而不是人生的巅峰。客观的说。。从统计平均的概率上讲，本科就在一个优秀的学校的同学的数理基础和逻辑思维包括一些基础概念的理解是要明显优秀一些的……(ノ=Д=)ノ┻━┻ 我等学猹还要努力啊！", "answer_votes": "18", "answer_comment": "​9 条评论"}
{"answer_author": "知乎用户", "answer_id": 52364052, "answer_text": "@程传酉为什么你这么喜欢邀请我回答问题。。。。。。。。我来转述一下我院辅导员和导师的话：其实学院里面还是想要成绩在中等（这部分明显上不了研究生）的本院系学生也不想要外面考进来的高分普通一二本的。为什么，因为按照我们自己本科的培养计划下来，进入实验室就不用再教你基本的实验常识和一些文本能力。外校高分进来的多是大学从大一大二就开始刷题，除了专业课，数学，政治，英语。原来专业的课基本都是混过去的。也就是除了考试以外，实验，探究，论文，眼界，业界内的基本认知。这些都是空白，进入实验室后的培养成本会很高。这一切是为了什么，就是因为本科学校的名气，校友资源，等各方面都比较一般。需要更大的平台和资源来提升自我的学历背景和人脉背景。这也是改变命运的一个方式而已。", "answer_votes": "18", "answer_comment": "​22 条评论"}
{"answer_author": "asang peng", "answer_id": 81258774, "answer_text": "难道你想华科的研究生生源是清华北大的？那样才真是个值得在知乎一问的问题。", "answer_votes": "13", "answer_comment": "​1 条评论"}
{"answer_author": "Xero", "answer_id": 187908242, "answer_text": "第一：我以前还觉得自己保研本校还不错了，后来发现还留在本校的，真的挺丢脸的，本科华科的，读研还在华科，已经不是在原地踏步了，根本就是退步。（仅就这个话题来说）第二：如果题主华师一附中毕业，来到华科发现身边一堆乡镇中学考上来的同学，然后来知乎提问，大家会怎么觉得呢第三：人这辈子哪里都是起点，初中三年比不过的，也许你高中就能比过了，高中比不上的，你考研说不定比他强啊，有的人把大学当做的一个终点那肯定是不对的。人家只是前几年没混好而已，凭什么一辈子混不好。", "answer_votes": "8", "answer_comment": "​1 条评论"}
{"answer_author": "何汕", "answer_id": 187903292, "answer_text": "这特么不很正常嘛？别人在准备考研的时候，我渣科保研线以下的兄弟们在干啥呢。虽然我不知道别人在干啥，我只知道我这种学渣一没过保研线二又没准备考研，特么我凭什么能继续在华科读研？道理总是很简单，你们就是不想承认。", "answer_votes": "8", "answer_comment": "​4 条评论"}
{"answer_author": "Silencer", "answer_id": 213924075, "answer_text": "你知道高考有地域差异吗", "answer_votes": "5", "answer_comment": "​3 条评论"}
{"answer_author": "知乎用户", "answer_id": 211535309, "answer_text": "如何评价清北里总有一些来自华科这类学校的普通生源？", "answer_votes": "5", "answer_comment": "​1 条评论"}
{"answer_author": "ZLX", "answer_id": 121426871, "answer_text": "你既然心中有答案又何必等。", "answer_votes": "5", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 76329548, "answer_text": "我是二本学校不久前保研到华科计算机的。人往高处走，水往低处流，这是人之常情。不赞同普通一二本大二就刷考研题目什么的观点，我们这里这种人并不多。我们这边的学生也有专业课基础好，外加技术牛逼的。", "answer_votes": "5", "answer_comment": "​10 条评论"}
{"answer_author": "石头Sama", "answer_id": 52423167, "answer_text": "这个问题我们院长给我们说过几次，很多二本学校的学生从他们一开始踏入那个校门开始就定下一定要考研到好学校去的目标，这些人也很努力，也是学霸，从大二基本上就开始刷题准备考研，但是他们往往会忽略基础课程，只学考研科目，很容易就造成了笔试成绩特别高，面试评价特别低，院长给我们举了一个今年的例子，一个二本院校的学生考了400多，面试的时候问一些专业相关的问题什么都不会，结果就刷下去了。这些人确实是死读书，但也是人之常情，也是没办法的办法，华科的专业第一有机会保研清华北大甚至全奖出国，但是他们学校的第一可不一定有这个机会保研到985，所以就只能考。现在保研考研政策都变了，以后可能情况还有变吧", "answer_votes": "4", "answer_comment": "​2 条评论"}
{"answer_author": "Shuboss", "answer_id": 52344344, "answer_text": "太正常不过了，因为华科是一所985，工科强悍，所以有很多因为高考成绩不理想屈读普通一本或者二本的同学通过考研途经完成自己的梦想。还有就是，名校光环效应，单纯为了就业和名气，也是召集了众多同学蜂拥而至，而且拉开的考研战线往往特别长！据了解，985高校以及很多211高校，复习考研的时间基本从暑假甚至更后才正式开始，而部分二本考生提前一年就开始刷书本了……所以初试成绩高的为他们，这不足为怪…重点是，像我，现在还在为专业课考试发愁，过不过都是问题…无暇顾及考研=_=", "answer_votes": "3", "answer_comment": "​5 条评论"}
{"answer_author": "程显通", "answer_id": 201959610, "answer_text": "利益相关：华科附属同济学生个人认为，华科考研有点高不成低不就从本校想工作的学生看：一部分学生不想考选择工作，华科本校作为工科为主体的985大学，找到收入满意的工作不一定需要研究生以上学位，所以不选择读研究生。从本校想出国、考研的学生看，华科作为一个985他的实力明显劣势于国内外很多大学，考研的同学往往是想要给自己一个更好的平台的，所以不会选择华科。从外校学生来看，工科类211、985读研所能取得的收益不那么高，而工作也比较好找，容易放弃读研，对于文理科类211学生，华科没有太大优势，可能也就二三本院校的学生才会觉得地处二线城市偏远地区影响范围也就在华中地区的华科本校是一个比较好的选择。从本校学渣的角度，他每天专业课都要死了，他还想考研？另外如前面的答案说，本校考研竞争也无明显优势，为什么不选择一个收益更高的平台呢？", "answer_votes": "2", "answer_comment": "​13 条评论"}
{"answer_author": "叶大帅Max", "answer_id": 55322757, "answer_text": "人都是往高处走，水都往地处流。这个很正常，好多本校的都考研或保研到更好的学校去了。其实我觉得人与人之间一开始的差别不是很大，但是环境带给人的影响是不可否认的。好的学校带给你的机遇和机会是略差的学校所比不了的。比如一个项目，人家就是给华科的团队做不给你做？为什么因为人家是985啊，是工科名校啊。另外一个我觉得你所认识的人和见识都会不一样。人本校为什么不考自己本校，（说实话大部分都是些吊车尾或者对学校很有感情的才会考本校）因为人家在本科时候的见识就比你广，这个社会就是这样，资源都是掌握在有限人的身上。     最后我想说一点，人和人之间是有差距的（ps：本人学渣一枚，无歧视含义），但我们不能否定努力的价值。", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 263655674, "answer_text": "首先看的出来：题主很看不起那些普通一本或者二本的生源呢。觉得他们不配上华科？要不然也不会问这个问题吧。因为这个根本没什么好评价的，考研本来就是双向选择。学生能考上是一方面，老师愿意要是另一方面。一、普通一本或者二本的学生为啥能考上华科？可能华科考研试题太简单了吧，就算是普通一本或者二本（也许以前还有三本）的学生好多努力一下都能考上。如果考408的话，考的人会不会少一点？（招不到人怎么办？）二、华科并不排斥，或者说乐于接受大量普通一本二本的生源（或者说没有更好的选择）。三、话说华科是985？真的？说实话不是看回答里有人提，真不知道。。。所以就我看来这个学校在985里不算好的吧，或者说名声不是很大，至少肯定比不上清华、北大、中科大等那些没读过书的人都知道的学校。如果我是985211学校的学生现在想考一个更好的985的学校，华科基本不在考虑范围。为什么？假如我本来就是一个211的或者不出名的985的，我有必要再考一个不是那么nb的跟之前本科学校差不多的985吗？考研无非就是想提高自己的层次，尤其是本科读的还不是最好的学校。清华北大的会去考华科的研究生吗？说实话，还不如亮一下本科学历。。。普通一本或者二本的学校当然也想考清华北大，但是毕竟绝大多数也只能想想。。。考211的提升又不大，考985太好的又考不上，所以。。。你懂的！ 四、     总结：普通本科想考985，太难的考不上，碰巧遇到一个不错的985 华科，没那么难考。就这个了！211、985的本科想考个更好更有名气的985，华科？考上还不如不考，划掉。华科：如果不招普通本科，招不满；试卷太难？没人考。所以通吃吧。五、话说我对华科也没有丝毫的了解，完全路人，只是觉得题主真的是这个学校的？你自己学校什么水平难道自己心里没点b数？                                      逃~", "answer_votes": "1", "answer_comment": "​2 条评论"}
{"answer_author": "白季", "answer_id": 261407567, "answer_text": "我科还很多保研去清华北大的呢，清华北大嫡系子弟怎么想？我科也不差，但比清华北大还是低一点。你再看还老有人在知乎开live，什么二本如何几个月冲刺清华研究生呢……关注和参与live的人还辣么多。live主赚疯了……再求清华北大嫡系心里阴影面积？做好自己吧，想辣么多。等你工作了会发现有可能一个很水没能力没技术没学历的人还是你的领导呢……", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "妖哥", "answer_id": 260207226, "answer_text": "华科本科，现保外读研。我是华科社会学院毕业，跟很多华科社会学院的研究生都比较熟。虽说社会学讲究数据代表性，不过由于条件所限只讲一下观察的结果吧。社院学硕绝大多数都是来自于211学校，少量考研的来自于一本院校，专硕绝大多数来自于河南山东湖北和湖南四省。题主如果来自这四个省份不用我多说你高考多辛苦。就拿河南来说，二本线比宁夏一本线都高一点，在河南只能上二本的在宁夏就能上华科。你以为本科华科说明高考多牛逼？如果不是来自于高考大省，二本甚至三本里面比华科学生学习好的人多的是。为什么华科学生总体上素质比普通一本二本要好，因为华科学生视野开阔，平台好资源多，单纯论智商你还真不一定比得过别人。你把那些努力学习高考失利的学生（不在少数）拉到华科溜两年，谁比谁素质高还不一定。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "Dufre", "answer_id": 259682135, "answer_text": "作为双非本科，某电研究生；认为家乡的华科武大比某电强百倍的原因！（当初觉得华科武大分数线太高了，不敢报）华科武大的复试一直是算综合分，再排名，再淘汰，再选导师。所以你可以看到很多复试被刷的学生中有很多本校的。再其次，据我在华科武大的同学反映，老师基本没有歧视外校的现象（仅仅是我这些同学，不代表普遍情况）。但我现在所在学校，保护本校学生太强烈，可以说本校上线的几乎不刷，划线比国家线高不了多少，因为本校的都考的分都不高。这样何谈公平呢？本校学生总是有种身俱来的优越感（虽然我不知道他们有什么资格，其实优秀的人已经去c9了）。所以希望本校的学生摆正心态，人家在进步，而你在原地踏步。外校也没必要自卑，努力证明自己才最重要。", "answer_votes": "1", "answer_comment": "​2 条评论"}
{"answer_author": "匿名用户", "answer_id": 248574657, "answer_text": "全国的双非及二本，数百计，推免率低，学习氛围较差，生源亦较差。能“劈荆斩棘”来到华科之类的名校，已十分不易，你在感叹分子多的时候，也要想想分母有多少。仅就2017广东高考理科来看，清北最低排位0.1k/550k+ ，华科6.6k/550k+，某垫底985(非中外项目)32k/550k+。如果非得查出身，比985，211更有效的，是查高考排位。65000位后的211不只一两个。20000位前双非也多得是。所以仅在高考难度上讲，进华科要比进清北容易太多，而且从高考生源看，某些强一本未见得比211，和末流985差。另外，如果阁下感叹的是双非生源的综合素质差，相对贵校而言那是当然；如果仅是感叹双非生源多，那是教育系统运转的结果，我上高数时的老师，是河南大学本科，清华硕博。线代老师，上交本科，本校（一般211）硕士。马化腾，用南大的分数到深大。很久远的一届有位用清华分数来本校，哭着毕业的师兄。虽然例子老旧，但能说明，所谓名校，不是铁打的一块，人才的适当流动是客观的事实。如果你的意思是为什么学校/学院/导师不卡人，把“只会应试”的生源挡在门外，那也许是因为和他们竞争的人，连“应试”这关都过不了。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 240284584, "answer_text": "理性，逻辑。你这个问题一不理性，二没逻辑。就像上面说的，你已经有答案了还问个屁阿。丢华科的脸。去了剑桥你就会知道什么是真的牛，傻逼。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 236114393, "answer_text": "从事考研教育客观的答一发1. 生源为何挺多一本二本的我觉得这是个不太正确的命题，我不是华科的，但是我觉得有部分二本一本考上的，被放大了，你潜意识里面认为很多二本和一本的考上了，实际上是很残酷的，华科应该生源不止挺多一本二本的，还有的是 211985，双非学校优势学科的学生。2.一本二本是否受歧视任何企图以 “我二本啊，但是我依然上清华研究生”之类的命题都存在诱导性，勿拿个例当普遍，其中受到的困难，如鱼饮水冷暖自知。回到小标题，是否歧视，根据我的看法，研究生选拔还是按照择优录取的原则进行挑选，你二本的又考的没人家高，被刷了心里委屈暴露学校黑歧视，这种伪命题就不用说了。真正当一个二本学生和985考一样分数的时候，你作为老师，你选择谁？没有任何歧视，老师只是按照他的标准选人，择优录取永远是准则。3.研究生生源来看就我校来看，保研清一色211及行业特色院校以上，不知名高校可能过审机会都没有。特意看了今年的保研面试名单，更有学院招生老师直接放话，双非院校不用申请，基本没戏考研才会出现普通院校，考的高的不骂老师不打老师，正常发挥基本没问题，但是你分数又不高，一问三不知，老师是你亲戚，才敢录取你啊。这就是事实，无可厚非4.能力方面从事考研辅导，不用院校的生源有明显区别，同校生源更是参差不齐，有些学生连基本的录取信息去官网查询都不会，学习能力低下，只能当炮灰，而这一部分人大部分来自所谓的一本二本。5.真的好残酷么？确实残酷，只能说，本科出身有一定影响因素，但是会有幸存者去攀登名校，只是你们不知道被踩在脚下的占大多数。我支持和认可一切希望通过自己努力改变命运的学生，并且衷心希望你们进入名校。有梦想会努力的人永远值得尊敬和认可，考研是人生一个重要的选择。", "answer_votes": "1", "answer_comment": "​2 条评论"}
{"answer_author": "匿名用户", "answer_id": 213956594, "answer_text": "实际上就是说明了研究生扩招，整体生源水平下降。研究生生源和本科生源完全不是一个档次，所以很多招聘看本科。今年九月入学的，西边我所在某院研究生入学人数首次超过本科生，这个现象和数据来源都是在和某教授吃饭时他主动提及的……", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 213942211, "answer_text": "中国的高考制度不合理，尤其是像江苏，河南，浙江等省份，想通过高考考上一所985.211大学是不容易的，但是有许多人又不甘满足于普通一本或二本院校，所以许多人就选择了考研，然后一不小心就考上了。", "answer_votes": "1", "answer_comment": "​1 条评论"}
{"answer_author": "匿名用户", "answer_id": 213866913, "answer_text": "我就说个政治不正确而且不爱听的，研究生同班同学里面，读博出国就业的档次，仍然是本科985好于211好于二三本，你以为是一样的，然而并不是华科考去清华的，就业普遍差于清华本科的，同理，二本考来华科的，找工作一样比华科本硕的难。", "answer_votes": "1", "answer_comment": "​1 条评论"}
{"answer_author": "郑欣", "answer_id": 213770893, "answer_text": "建议楼主真正走出去看看，看看自己比那些二本或者普通一本中上进的学生强多少", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "慕笙", "answer_id": 189454541, "answer_text": "1.人往高处走水往低处流，人之常情2.私以为研究生考试选拔的是能力而非来历3.华科作为理工科高等院校，也拥有不少优秀的专业，当然会吸引各方学生4.华科本校的本科生不一定能考上华科的研究生5.建议题主不要抱有高考考好了就可以一辈子骄傲的想法，考研实际上是新统一的起点", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "剥桔子的汪", "answer_id": 95197892, "answer_text": "占坑，两年后来回答。", "answer_votes": "1", "answer_comment": "​3 条评论"}
{"answer_author": "匿名用户", "answer_id": 284888099, "answer_text": "      在这个时代，知识不分年龄，不分性别，更不要说分学校了。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "乐土", "answer_id": 270154514, "answer_text": "你们高中有好好学，人家大学有好好学，有啥不服气的？", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 267134693, "answer_text": "难道你还想它的研究生生源全是985或211的?这样百分之九十的专业都招不满，在校研究生人数至少缩小一半。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 265003376, "answer_text": "因为华中科技大学好啊", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 264513859, "answer_text": "所谓人往高处走，水往地处流本科 — 硕士 只是人生中的一段路而已，可能有的人跑得快，跑得早，早早的就在了前面又不代表一辈子都在前面人生又不只是本科四年，大家都在努力，不过努力的成本越来越大就是了人这辈子最重要的是希望穷小子也能吃上饭，读上书，宽敞的教室，干净的食堂，设施完善的图书馆和宿舍题主去普通一本和二本看看就知道是什么情况了<img src=\"https://pic4.zhimg.com/50/v2-ebbc37443813044eaeb4ead20d77f93b_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"684\" data-rawheight=\"218\" class=\"origin_image zh-lightbox-thumb\" width=\"684\" data-original=\"https://pic4.zhimg.com/v2-ebbc37443813044eaeb4ead20d77f93b_r.jpg\">题主自己提的问题就是感性的「好多」是多少呢？据我所知，现在的保研率已经很高了，留给其他学校的人机会越来越少当然，以后保研率会越来越高，题主这样的感慨就不会有了", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "衍古vm", "answer_id": 264108481, "answer_text": "没毛病，人往高处走。华科本科生如果考研估计也会努力考更好的学学校吧。像我在二本大学，就我们人文中文这专业的学生，周围考研的同学准备的大部分都是我觉得很厉害的大学，有考武大的，厦大的，北影的，中传的，复旦的。学渣瑟瑟发抖，当然考上几个我也不知道，往年也有学姐学长考上武大复旦这些的，看人啦。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "古尘", "answer_id": 263830917, "answer_text": "凭能力考进去的，有什么问题么？", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "老肇", "answer_id": 263467786, "answer_text": "这个问题太深！首先这个思想的出现是因为我国中国特色社会主义制度建立后产生的。经济上让一小部分人先富起来，划出了一些经济开发特区，国家重点扶持对象。同时教育上也采用了同样的方法，让一小部分学校先发展起来，各个地方重点建设哪几个学校，国家层面上又重点发展哪些高校。这样就让我们产生了等级观念，这个学校好，教育部直属国家重点高校，毕业分配方向不错（当然是包分配时期）。而且我们中华民族都有一种人往高处走的思想根源，不是我喜欢才去，而是它等级高我就去，它就也好我就去，它能赚钱我就去。由此便产生了激烈的竞争，随着基础教育的发展，这种竞争越来越激烈，甚至有些省份一分之差就是几万人。有的人上了一本而有的人上了二本。难道你认为这一分能体现出任何水平吗？何况还有改卷老师的心情加在这一分里。中国的考试真的是世界上最残酷的考试，绝对没有之一。因为我们人口多，学校少，好学校更少，不均衡发展更显著（无论是教育还是经济）恢复高考才多少年嘛！时间越长这些学校最开始赋予的特殊性在人印象里越深刻，人们感觉我儿子考了个985倍儿有面，他真聪明，这孩子有前途。然而同样是985也还分高低，总之就是排名靠前的看不起靠后的，沿海的看不起内陆边疆的，首都的更牛，排名不相上下的又互相看不起。真是一个永无止息的宫斗剧！让我想起了中国合伙人里的一句台词：你们跟三十年前有什么区别，你们就知道窝里横!中国人打中国人，懦夫！去向那个打你的人去学习，直到你变得比他更强！我感觉中国人2000年封建帝制给我们的影响里官僚主义太深刻，谁都想高人一头，喜欢那种站在高峰奴役他人的感觉。也就是想让别人看得起，喜欢看不起别人！好吧，有点偏，走到心理层面了。总的来说，你没有理由看不起别人的努力，你四年前高考能考进来，他凭什么四年后考研不能考进来？别提考试难度，中国这么多的不公平哪里说得完？高考公平吗？考过的人都知道，各种差异，状态天气试卷地域人口民族运气还有大姨妈等等！有钱的孩子英语水平还过得去的，家里再有点权力给孩子会考成绩全改A，这些考一本都很悬的进哈佛剑桥不大可能，去个诺丁汉或者杜克大学没问题吧，实在差那再读一年预科！一年花个二三十万给玩似得。比你考个华科牛不牛？别轻易看不起别人，我感觉无论在中国任何一所大学的学生，你努力的考上了研究生，你绝对不差，要是生在美国，这样的都去常青藤了。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "局外人", "answer_id": 260527226, "answer_text": "在务实的技科，还有这B问题，CNS出完了，导师项目做完了，女朋友找到了？你以为大技科短短10年跃入前15，是靠吹的？小伙子，好汉不问出处，真是闲的蛋疼。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "zsz", "answer_id": 260461759, "answer_text": "大概是因为好的学生都去北清复交了吧", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "雷洛", "answer_id": 260454881, "answer_text": "你看华科的弱势学科当然二本等普通学校学生多，你去看看华科顶级学科，找下有几个出生不好的。前者是华科需要你，后者是你需要华科。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 260192557, "answer_text": "一二本能通过考研进名校的，也是吃了很多苦的，他们要相对名校本身的学生付出的更多。相对周围人，他们有更高的追求与向往，同时也有更强的自律力。就像田忌赛马，上等马对下等马，名校招收的二本生，是相对名校下等马的上等马，是对高考后又一次优等生的赛选与检验。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "蔡星", "answer_id": 260089554, "answer_text": "首先，反对一切出生决定论。其次，实力至上，能力才是检验真理的唯一标准。再次，作为一个本校保研生，非常敬佩那些考研来到华科的学生。最后，这是人才向上垂直流动的必然规律。沃克的向清北复交走，同时二本院校往武大华科走，都是正常现象。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "Mr.Z", "answer_id": 260067673, "answer_text": "清北本科优秀的人看你甚于你看二本，更可悲的是人家根本就不关心这种问题，非湖北籍的大多清北本科怕是听都没听过蜗壳这种非洲小国，真是坐井观天，夜郎自大....", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 260034928, "answer_text": "问这个问题的人是不是天生就存在一种优越感？？如果一个人的本科能决定你的命运的话，那么估计也只能借着华科的名头穿着应届生的外衣在政策保护的壁垒下幸福三个月了。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 260010203, "answer_text": "就拿文科来说吧，在我们省，华科文科录取均分和我省二本录取均分差了57分，华科和清华差了52分……", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 260002760, "answer_text": "利息相关就保研来说，华科学硕只给985高校学生，貌似211第一都只有专硕。嗯，大家自行体会吧。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 253904999, "answer_text": "看你评价个答案还要拽工程控制思维，确实是标准华科男", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 236096181, "answer_text": "占坑，普通一本，高考失败，无缘华科，等我考上华科的研究生来答一波。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "么咯么咯", "answer_id": 234167708, "answer_text": "其实我想说的是，不论这些人层次如何，能进去的，那是导师选的。我觉得是否被选上，在复试中变现的实力更能说明问题，而不是题主所说的“来历”。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "黄小明", "answer_id": 228173156, "answer_text": "和我们中南差不多，不过说真的，基本二本和普通一本的考我们这些学校的研究生都不怎么受待见，因为真的和环境还有见识有关。我们数学院的研究生大部分都是普通一本和二本考进来的，我们教授也说，初试分数贼高，复试一问啥都不会，数值分析数理方程常微分实变复变都不会，光会高代数分，有啥用", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "高僧求佛头三通", "answer_id": 217723157, "answer_text": "你是看不起自己还是看不起别人？", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 214107513, "answer_text": "每个学校都有成绩好的和成绩差的学生，很正常。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 214032230, "answer_text": "一部分大学学习很好的可以保研，但这部分人要控制在一定比例，比如百分之二十或者十五或者十。其他绝大多数学生可以通过参加国家统考的方式获取机会，我们要的是利用一切可以利用的时间看考研科目，提高基本数学英语，政治和专业课素养。专业课一般考的都是最重要最基础的一两门课。当然初试之后还有复试，复试包括面试笔试等，一系列考试筛选下来的人升学。个人觉得这套制度已经是比较合理了，既不搞一刀切似的只要保研学生也不搞高考式的完全统一考试。除少数地方外总体还是比较公平的。我们国家人口基数大，学生多，不可能一切只为少数学生服务，况且大学不应该固步自封，把学生当成自己的私有财产，那样的学校是没有广阔的发展前景的。     另外，如大家所说，人生到处是挑战同样到处是机遇，成功总是青睐把握住机会的人，有的人早有的人晚一些也有人一直没有抓住机遇，这些不是一成不变的，高考不是唯一需要跨过的山峰，大学是求学路上重要一环不是终点，世界潮流浩浩汤汤，变换莫测。     出现这样的情况很正常，倘若出现华科研究生普遍高分低能，庸庸碌碌，用人单位不愿要这种情况那就不正常了。—————————————————————————前段时间有个视频很火，某企业主管电视台上阐述为什么喜欢招985学生，虽然有些话听起来很残酷刺耳，但也反应了一部分现实。社会就是这样，优胜劣汰，难道一次高考就能解决所有问题，就能保证你吃香喝辣，就能保证你一帆风顺?不可能的，还要一直努力，即使那次不是很成功，还有考研，你还可以复习，国家给了相对公平的机会，就看我们能不能抓住了。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 213951305, "answer_text": "其实我感觉问这种问题并没有什么意义。无论是哪所好的高校，都会有一大批非本校的研究生。本科作为一个起点，是对高中读书生涯的阶段性总结。大家在不同的起点开始赛跑，心中奔赴的目的地也会有差别。但是，奔跑的过程中有人会掉队，有人会放弃，有人会加速前进并有所收获，不能一概而论。我自己也是高考发挥不理想，不想复读，去了一所普通本科。但是大学期间还是很努力，年年都拿奖学金，毕业的时候找的工作也不错，但还是选择继续读研了。感觉工作的时间还很多，读书的日子就那么几年。硕士期间，班级里也有很多本科出身不错得同学，但我感觉硕士阶段又是新的起点吧，成绩综合第二名，毕业找工作的时候，相对班里同学，还是找的很顺利的。的确，现在的就业形势就是学历出身都要看几代，但是还是要知道只有失败的过去，没有失败的未来。眼光一直盯着过去的人，就少了很多时间思考以后怎么样。你手上的牌怎么打，你说了算。好牌打烂，烂牌打好，非一朝一夕。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "宇过天晴233", "answer_id": 213802826, "answer_text": "好多高校都有这个现象，我觉得只要不是那几所考研专业户出来的都没啥", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "叶盛", "answer_id": 213652486, "answer_text": "理解不了这种人的思维，难道说华科的学生就不能考武大清华？清华北大就不应该收其他学校的学生？", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "蕾蕾", "answer_id": 188017274, "answer_text": "这有什么不好理解的，高考有失利的，大学努力就可以继续追求好学校，人往高处走，我就是从别的学校考来华科的，凭自己的努力。华科的学霸也会继续追求好学校，我老公就是本科华科直接保研清华的。考来华科确实觉得比以前学校好，但是去过清华才发现更好，当然本科就能来华科的固然很优秀～", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "yonka", "answer_id": 52841214, "answer_text": "正常，人往高处走吧，考研因为起点不一样(有些人可以从很早就开始准备)所以是很好的第二次改变学历的机会，蜗壳处于名校的边缘(吐槽一下06年以后几乎每年降一名是要闹哪样)，也许是容易成为集火的目标。据我所知，蜗壳考研保研往上走的去交大中科院的比较多，清华的非常少，估计蜗壳在一些学校眼里跟蜗壳学生眼里的交大差不多吧，他们去交大等也许跟蜗壳学生去清华一样概率太低。", "answer_votes": "0", "answer_comment": "​2 条评论"}
{"answer_author": "匿名用户", "answer_id": 188105281, "answer_text": "因为去不了清华北大，所以随便找了个985。", "answer_votes": "0", "answer_comment": "​添加评论"}
