{"question_id": "33892253", "question_text": "", "question_title": "什么是机器学习？", "question_commet": "​1 条评论", "answer_number": "68 个回答", "question_followers": "2,950", "brower_number": "395,716"}
{"answer_author": "bsdr", "answer_id": 142469657, "answer_text": "- 1+1等于几 ？- 50- 傻x，多了- 1+2等于几？- 20- 傻x，多了- 3+4等于几- 7- 傻x，对了- 6+9等于几- 13- 傻x，少了很多很多次以后……- 2+2等于几- 4- 4+5等于几- 9这就是机器学习，准确来说是最常见的一种，监督学习。最开始的几步是对于模型的训练，“多了”或“少了”可以理解为训练时的误差，模型根据误差调整自身参数，这就是机器学习里常用的反向传播(Backpropagation)的简单的解释。梯度下降涉及到计算，真没想到该怎么通俗解释。。再补充一个最近一直在看的，生成对抗网络(GAN)。- 孙悟空(Real data)：我是孙悟空。- 如来(D net)：你是真的。- 六耳猕猴(G net)：我是孙悟空。- 如来：你是假的。- 孙悟空：我是孙悟空。- 如来：你是真的。很多很多次以后......- 六耳猕猴：我是孙悟空。- 如来：你是真的。GAN由一个G网络和一个D网络组成。G网络目标是尽量生成与真实样本数据相似的数据，让D网络出错；D网络目标是判断一个样本是来自真实样本还是由G生成的。交替训练两个网络，存在全局最优解，使G网络生成的样本和真实样本一样，同时D网络判断的正确率达到1/2。", "answer_votes": "481", "answer_comment": "​56 条评论"}
{"answer_author": "长了两个小痣的", "answer_id": 58958808, "answer_text": "&lt;img src=\"https://pic3.zhimg.com/50/f6736d27c4dc0256f1c9dbfb61c2c5dc_hd.jpg\" data-rawwidth=\"727\" data-rawheight=\"612\" class=\"origin_image zh-lightbox-thumb\" width=\"727\" data-original=\"https://pic3.zhimg.com/f6736d27c4dc0256f1c9dbfb61c2c5dc_r.jpg\"&gt;", "answer_votes": "321", "answer_comment": "​29 条评论"}
{"answer_author": "郦橙锦妖", "answer_id": 261638623, "answer_text": "曾经有个笑话说：你一个搞机器学习的，哪来的资格鄙视我们迷信星座的人？是的……星座可以是：无监督的机器学习我认识k个人，我有他们的出生年月日，性别，长相，身高，肤色，性格，聪明程度，有没有宠物......我的目标是把相似的人集中到一簇里，分成十二簇。训练成功的时候，发现这些人都有类似的出生月日和性格。我认识了个新朋友，他说他生日11.11，有魅力然鹅有仇必报，我就知道“哦！（划掉）单身狗（/划掉）天蝎座！”。有监督的机器学习我认识k个人，双子座k1个，水瓶座k2个，狮子座k3个......天秤座k12个。样本量充足。我把一部分人的各种特征作为输入，他们的星座作为输出。机器帮我们建了个模型，模型这头放进特征，那头产出星座。如何评估模型好不好用呢，我把剩下的人的特征放进去，用模型产出星座，然后和他们的真实星座比较。用来建立模型的叫训练集，用来评估模型效果的叫测试集。训练和评估了一会儿，机器表示AUC（注2）达到0.6，我不满意，调了一会儿参，AUC达到0.75，差不多能上线了。（过拟合和欠拟合用星座来举例反而复杂了，这里略过。）我在十月认识了个肤白貌美的新朋友，和她约吃饭，花了两个小时挑餐厅，一个小时点菜，吃完以后餐厅还送了她一个小蛋糕因为在生日当月光临有奖。“你天秤座的吧。”“啊，你怎么知道！”对抗生成网络在拥有一些星座的基本知识后，我是一个待训练的判别器。我有一群无聊的朋友，他们各有星座，但他们试图骗我他们都是双子座。他们有的学得不像，被我拆穿了，就回炉重练，试图学得更无破绽，我也在一次次辨别中越来越抓得到双子座的精髓。最后两方尽己所能，他们尽力骗我，我尽力不被骗，最后识别概率50%左右，他们就成了装得最像双子座的人，我成了最能看穿双子座伪装的人。这就是对抗生成。卷积神经网络我认识k个人，现在不管他们的年龄身高收入水平，只看脸，能知道他们的星座吗？实际上估计是不能的......但反正也扯这么远了，就假设每个星座长得有每个星座的特点吧！卷积神经网络是深度学习的一种，优越性在于输入可以是图像，而且不需要用文字描述。所以不用抓破脑袋去想特征，“眼睛距离”，“眉毛上挑程度”，“鼻头大小”，“人中长短”......放弃吧，列不完的。我喂给机器的是足量的人脸图片和他们的星座，机器从图片一角开始卷像素点，提取语言不能表达的特征。下图示意了“卷”的动作。&lt;img data-rawheight=\"384\" src=\"https://pic1.zhimg.com/50/v2-6428cf505ac1e9e1cf462e1ec8fe9a68_hd.gif\" data-rawwidth=\"526\" data-thumbnail=\"https://pic1.zhimg.com/50/v2-6428cf505ac1e9e1cf462e1ec8fe9a68_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"526\" data-original=\"https://pic1.zhimg.com/v2-6428cf505ac1e9e1cf462e1ec8fe9a68_r.gif\"&gt;中间层肯定卷得妈都不认识了，不要紧，机器认识就行，最后它会告诉你这个人是各个星座的概率。结果就是，我只要拿着你的照片给机器，就知道你大概率是什么星座了，神不神奇～注释—1. AUC指Area Under Curve，越高模型效果越好。Curve在哪儿呢……curve是正样本的正确率和负样本错误率的抗衡，如果一直都是正样本正确率0.5，负样本错误率也0.5，就是斜向右上角的一条45度直线，AUC也等于0.5，和抛硬币差不多。更具体的解释一两句写不完请自行搜索～—感觉这个答案下严谨的也有，通俗的也有，严谨的我是写不了了所以打了个通俗的比方……希望零基础的知友看得开心！专业的知友请批评指正～", "answer_votes": "587", "answer_comment": "​47 条评论"}
{"answer_author": "知乎用户", "answer_id": 57480240, "answer_text": "<img src=\"https://pic3.zhimg.com/50/f22e18e2da473bb8b0585d9b4fac4734_hd.jpg\" data-rawwidth=\"3000\" data-rawheight=\"2000\" class=\"origin_image zh-lightbox-thumb\" width=\"3000\" data-original=\"https://pic3.zhimg.com/f22e18e2da473bb8b0585d9b4fac4734_r.jpg\">1.  机器学习的本质机器学习的本质是什么？ 2.Andrew Ng说机器学习  Andrew Ng在《斯坦福大学公开课 ：机器学习课程 》开头，提到了 Arthur Samuel 和 Tom Mitchell 两位j机器学习领域前辈关于机器学习的定义。见本篇第4节。3.  林轩田说机器学习果壳网：“机器学习”听起来很厉害，可“机器学习”到底是研究什么的？与当前热门的大数据、人工智能，有何联系？有没有一些好玩的例子？林轩田：机器学习想做的事情，简单的说是要从资料中归纳出有用的规则。大数据说的是对大量的资料做分析，而人工智能说的是让机器看起来更聪明，两者都可以使用机器学习来做核心的工具。我们可以举 2012 年的 KDD-Cup 做例子，当年腾讯给的题目之一，是希望能从大量的线上广告资料中，找出“这个广告到底会不会被点击”的规则，如果机器能找出有用的规则，我们就会有更高“智能”的广告系统了。我们在第一堂课中还会有些很有趣的例子跟大家分享。4.  机器学习的定义什么是机器学习：一次权威定义之旅权威定义      我们先从阅读四本大学课程中常用的机器学习参考书开始。这些是我们的权威定义，它们为我们更加深入地思考这个学科奠定了基础。我选择这四本书来强调该领域的一些有用的、多样的观点。经验告诉我们，这个领域确实是包括很多的方法,因此选择一个合适的角度是取得进展的关键。Arthur Samuel定义的机器学习(1959)作为机器学习领域的先驱，Arthur Samuel在 IBM Journal of Research and Development期刊上发表了一篇名为《Some Studies in Machine Learning Using the Game of Checkers》的论文中，将机器学习非正式定义为：”在不直接针对问题进行编程的情况下，赋予计算机学习能力的一个研究领域。”在机器学习的历史上，Arthur Samuel做了一些非常酷的事情。他曾经做了一个西洋棋程序，让计算机自己跟自己下棋，下棋速度非常快，因此Arthur Samuel让他的程序自己和自己下了成千上万盘棋，逐渐的，程序开始慢慢意识到怎样的局势能导致胜利，怎样的局势能导致失败，因此它反复的自己学习“如果让竞争对手的棋子占据了这些地方，那么我输的概率可能更大”或者“如果我的棋子占据了这些地方，那么我赢的概率可能更大”所以渐渐的，Arthur Samuel的程序掌握了哪些局面可能会输，哪些局面可能会赢，因此奇迹出现了，他的程序的棋艺甚至远远超过了他自己。ArthurSamuel让他的程序比他自己更会下棋，但是他并没有明确的教给程序具体应该怎么下，而是让它自学成材。Mitchell  定义的机器学习 (1998)      Tom Mitchell在他的《Machine Learning（中文版：计算机科学丛书:机器学习 ）》一书的序言开场白中给出了一个定义：“机器学习这门学科所关注的问题是：计算机程序如何随着经验积累自动提高性能。”      我喜欢这个简单明了的定义，它是我们在帖子最后得出的程序员定义的基础。注意计算机程序这一提法和提到的“自动提高”一词。写程序以改善它们自身，这是挑衅！      他在引言中多次重复提到一个简短的形式体系：“对于某类任务T和性能度量P，如果一个计算机程序在T上以P衡量的性能随着经验E而自我完善，那么我们称这个计算机程序在从经验E学习。”      不要让术语的定义把你吓跑，这是一个非常有用的形式体系。我们把这一形式体系作为一个模版，把经验E、任务T和性能度量P列在一张表的顶部，并且列出带有更少歧义的复杂问题。它可以作为一个设计工具来帮助我们清楚的思考收集什么样的数据（E），需要做出什么样的决策(T),以及如何评价结果（P）。这就是我们把它作为一个标准定义的原因。请把它记在心里。统计学习基础      《The Elements of Statistical Learning: Data Mining, Inference, and Prediction》是由三个斯坦福的统计学家编写的，它自我描述为组织探究他们领域的统计框架。它在前言中写到：“许多领域都产生了大量的数据,统计学家的工作就是让所有这些数据变得意义:提取重要的模式和趋势,理解“数据在说什么”。我们称之为从数据中学习。”      我所理解的统计学家的工作是，使用统计工具在上下文环境中解译数据。作者似乎想要把机器学习领域中的全部作为辅助工具。有趣的是，他们选择把“数据挖掘”包含在书的标题中。      统计学家从数据中学习，但软件也可以，并且我们是从软件学习到的事情中学习，从由多种多样的机器学习方法做出的决策和得出的结果中学习。模式识别      Bishop在《 Pattern Recognition and Machine Learning 》的前言中写到：“模式识别起源于工程学，而机器学习产生于计算机科学。然而这些领域可以看做成是同一领域的两个方面。”      看了这些，你会获得这样一个印象，Bishop从一个工程的角度来到这个领域，后来又采取同样的方法学习和利用了计算机科学。这是一个我们应该效仿的成熟方法。更广泛地说，不管一个方法所宣称的领域，如果它能够通过从数据中学习使得我们获得一个更接近的洞察力或结果，从而更符合我们的需要，那么，我们就称之为机器学习。 算法角度      Marshland在《Machine Learning: An Algorithmic Perspective》中采用了Mitchell对于机器学习的定义。他在序言中提供了一个促使他写下这本书的强有力的解释：“机器学习最有趣的特征之一就是，它介于几个不同理论学科之间，主要是计算机科学、统计学、数学和工程学。机器学习经常被作为人工智能的一部分来进行研究，这把它牢牢的置于计算机科学中。理解为什么这些算法能够有效工作需要一定的统计学和数学头脑,这往往是计算机科学专业的本科生所缺少的能力。”      这是深刻并有益的。首先，他强调该领域的多学科性质。虽然我们已经从上面的定义中获得了这样一种感觉，但他为我们进一步强调了这一点，机器学习来源于各种各样的信息科学。第二，他强调了过于坚持一个给定的角度的危险性。特别是，算法工程师避开一个方法的数学内部运作原理的情况。毫无疑问，相反的情况，统计学家避开实现和部署的实际问题也是同样受限的。维恩图解      2010年9月，Drew Conway创建了一个漂亮的维恩图，我发现这个图是很有帮助的。他在解释中评论到，“机器学习就是黑客技能、数学和统计学知识的加和。”<img src=\"https://pic4.zhimg.com/50/0234f7e3c705b7f6a356e1dc30a39808_hd.jpg\" data-rawwidth=\"300\" data-rawheight=\"286\" class=\"content_image\" width=\"300\">      数据科学维恩图。归属于Drew Conway，是一种知识共享许可的非商业归属。      他还把危险区域描述为黑客技能与专业知识的加和。这里，他所指的是，那些了解得足够多的人是危险的。他们能够访问和构建数据，了解这个领域，还能运行一种方法并给出结果，但是他们并不理解结果的含义。我认为这就是Marsland曾经可能暗示的意思。程序员定义现在我们来谈谈，要想把所有这些问题分解为具体细节，程序员需要做些什么。首先，我们来看看抵制我们分解和程序的解决方案的复杂问题。这构成机器学习的动力。然后，我们需要找出一个适合于程序员的定义,一个每当其他程序员问我们什么是机器学习时我们就可以使用的定义。a. 复杂问题      作为一名程序员，你最终将会遇到很多类型的顽固抵制逻辑的、程序的解决方案的问题。我的意思是，对于很多类问题，坐下来写出解决问题所需要的所有条件语句是既不可行也不划算的。我听到你的程序员大脑在大喊，“亵渎”。      这是真的，以每天的鉴别垃圾邮件问题为例，每当介绍机器学习时，它是一直被使用的例子。当一封邮件到来时，你将怎样写一个程序来过滤垃圾邮件，决定是将它放在垃圾箱还是收件箱中？你将可能开始收集一些实例并深入研究它们，你将寻找垃圾邮件和非垃圾邮件所特有的模式，你还将会考虑抽象出那些模式以便你的启发式学习将来能够应用到新案例之中。你将会忽视那些永远不会被看到的古怪邮件，你将能够轻松的提高准确率并为边界情况制定特殊的程序。你将反复多次的浏览邮件并抽象出新模式来改善做出的决策。      在那里有一个机器学习算法，所有这些事情都由程序员而不是电脑来完成。这种手动导出的硬编码系统将具有同程序员一样的、从数据中提取规则并将其实现的能力。这能够做到，但是它将花费太多的资源，而且会是一个持续的噩梦。b. 机器学习      在上面的例子中，我确信你下定决心寻求自动化的那一部分程序员大脑，能够看到自动化和优化从例子中提取模式这一过程的机会。机器学习方法就是这样一个自动化过程。      在垃圾/非垃圾邮件的例子中，经验E就是我们所收集的邮件，任务T是一个决策问题（也称为分类），它需要标记每一封邮件是否为垃圾邮件，并将其放入到正确的文件夹中。我们的性能度量将是一些类似于准确率之类的、介于0%-100%之间的一个百分比（正确决策数除以总的决策数再乘以100）。      准备这样一个决策程序的过程通常被称为训练，收集到的实例称为训练集，程序即为一个模型，一个把非垃圾邮件从垃圾邮件的分离出来的问题的模型。作为程序员，我们喜欢这个术语，一个模型具有特定的状态并且需要被保持，训练是一个执行一次的过程，也可能会根据需要重新运行，分类是待完成的任务。这些对我们来说都是有意义的。      我们能够看到上面定义中所用到的术语并不是很适合于程序员。从技术上来说，我们写的所有的程序都是一个自动化操作，因此，机器学习是自动化学习的这一说明是没有意义的。c. 一个现成的小笑话      那么，让我们来看看我们是否可以使用这些片段,构建一个机器学习的程序员定义。机器学习是一个源于数据的模型的训练过程，最终归纳出一个面向一种性能度量的决策。 “训练一个模型”代表训练实例，“模型”表示通过经验学习获得的状态，“归纳出一个决策”代表基于输入做出决策的能力，并且需要一个用于未来决策的、不可见的预期输入。最后，“面向一种性能度量”是指准备好的模型的针对性需要和定向特性。——————————————————————————————————————————Best wishes to all MLers ！", "answer_votes": "221", "answer_comment": "​4 条评论"}
{"answer_author": "Kaiser", "answer_id": 194331124, "answer_text": "这则新闻高度凝练地回答了本问题：四川推“智慧红云”：用大数据和人工智能“算”党员思想状况<img src=\"https://pic1.zhimg.com/50/v2-a97fd320fa324c56d850a5d7e3c4c132_hd.jpg\" data-rawwidth=\"730\" data-rawheight=\"450\" class=\"origin_image zh-lightbox-thumb\" width=\"730\" data-original=\"https://pic1.zhimg.com/v2-a97fd320fa324c56d850a5d7e3c4c132_r.jpg\">四川推“智慧红云”：用大数据和人工智能“算”党员思想状况下面我们展开港一蛤：01. 量化将不再是抽象、模糊的“印象分”这句话点出了机器学习的本质，一切都是量化的，而不是“抽象、模糊”的。原生的图片、文字等形式都是不识得的，都要转化为数字、向量、矩阵。之前我也分享过一个关于“词袋”模型的例子，最终都是0101的，当然实际应用中的量化问题比这复杂得多。<img src=\"https://pic3.zhimg.com/50/v2-bd74ea1e7cf3f7d2f428d9b285982be8_hd.jpg\" data-rawwidth=\"600\" data-rawheight=\"632\" class=\"origin_image zh-lightbox-thumb\" width=\"600\" data-original=\"https://pic3.zhimg.com/v2-bd74ea1e7cf3f7d2f428d9b285982be8_r.jpg\">我们常说机器学习是“玄学”，因为从方法论上来讲，机器学习不是基于推理的“演绎法”，而是基于观测的“归纳法”，这就跟“因为所以，科学道理”的灌肠思维方式有别。前几天看到一位情绪很不稳定的朋友留言，很有代表性地体现了两种思维方式交会下，人类的迷茫与焦虑，进而恼羞成怒的过程。<img src=\"https://pic2.zhimg.com/50/v2-b58c652488aed16ee103bdb2a818ab28_hd.jpg\" data-rawwidth=\"662\" data-rawheight=\"251\" class=\"origin_image zh-lightbox-thumb\" width=\"662\" data-original=\"https://pic2.zhimg.com/v2-b58c652488aed16ee103bdb2a818ab28_r.jpg\">这里还是希望大家保持一颗平常心，不要打那么多感叹号，你的感叹号并不能治感冒。说到中医的话，这个“神农尝百草”其实就是机器学习的思想，虽然没有真的用机器。<img src=\"https://pic4.zhimg.com/50/v2-f5804368f9842e881f259840aa8a4eb5_hd.jpg\" data-rawwidth=\"517\" data-rawheight=\"357\" class=\"origin_image zh-lightbox-thumb\" width=\"517\" data-original=\"https://pic4.zhimg.com/v2-f5804368f9842e881f259840aa8a4eb5_r.jpg\">02. 数据系统首先将收集党员（基层组织）的基础数据、活动数据，及参加“三会一课”、讨论发言情况等精准数据；......“智慧红云”通过数据渗透、数据驱动、数据再造、数据协同......可以看到这里出镜率最高的词就是“数据”，因为是归纳法，所以数据是基础。注意“数据”和“数字”的区别，原始的、非结构化的图片文字音频这些虽然不是数字，但也是数据。世上本没有“大数据”，后来数据多了，就有了大数据。——山东·迅其实人们很早就意识到了数据的重要性，比如在一些老司机很集中的贴吧，会看到铺天盖地的“求数据”。<img src=\"https://pic2.zhimg.com/50/v2-1649e1ab0249781dad38eb288a0794ff_hd.jpg\" data-rawwidth=\"624\" data-rawheight=\"810\" class=\"origin_image zh-lightbox-thumb\" width=\"624\" data-original=\"https://pic2.zhimg.com/v2-1649e1ab0249781dad38eb288a0794ff_r.jpg\">03. 学习一个随后，系统独有的“党员数据精准画像引擎”，将在云平台上对党员（基层组织）进行快速、准确、全面的“画像”所谓“画像”就是特征提取的过程，有一个很古典的笑话：说生物课考试，老师拿了个笼子掀开一角让学生辨认这是什么鸟，一考生愤然离席。当被问到身份的时候，该生露起裤腿怒斥：“你看看我是谁”。“认鸟”就是机器学习的典型应用，叫作“分类”。很多问题都可以转化为分类，比如说看病诊断，分类的结果就是“有病没病”、“我有病你有药吗”、“没病走两步”等类别。近两年医疗+深度学习结合的方向很热，尤其是医疗影像+图像识别，其实就是让机器学习看片子，现在准确率已经很高了。对于“认鸟”这个分类任务来说，腿或许不是一个很好的特征。<img src=\"https://pic1.zhimg.com/50/v2-5e2c16c1a73c83e5b4eb9e6d21ad6d67_hd.jpg\" data-rawwidth=\"815\" data-rawheight=\"415\" class=\"origin_image zh-lightbox-thumb\" width=\"815\" data-original=\"https://pic1.zhimg.com/v2-5e2c16c1a73c83e5b4eb9e6d21ad6d67_r.jpg\">生活中很常见的一种景象，也可以归结为分类，就是“性欲强”系列。在女性（甚至男性）的照片评论区，总能看到各种“鼻子大、性欲强”，“发际线高、性欲强”，“有脑袋、性欲强”等说法。这里“性欲强”是分类预测结果，前面就是提取的特征。那么对于机器学习来说，“鼻子大”和“性欲强”到底有没有统计上的相关性，相关性有多强，是需要从数据中挖掘的。而数据挖掘的结果，都是以概率分布的形式存在的，本质上都是“猜测”，而非“两点之间直线最短”、“pV=nTR”这样确定性的结论，所以显得“玄学”。很多时候这个“鼻子大”也很难直接量化，我们可能没法事先去量人家鼻子，而是只有一张图片，那么从图片中自行提取特征也是一个专门的课题。<img src=\"https://pic3.zhimg.com/50/v2-9af2739ee416ff57ebd94835d7f7635e_hd.jpg\" data-rawwidth=\"519\" data-rawheight=\"386\" class=\"origin_image zh-lightbox-thumb\" width=\"519\" data-original=\"https://pic3.zhimg.com/v2-9af2739ee416ff57ebd94835d7f7635e_r.jpg\">04. 深度学习最后，系统可针对“画像”采用“TensorPlus深度学习系统”进行解决方案推送，为基层组织更好开展党员学习教育提供帮助。这里有个“深度学习系统”叫“TensorPlus”，不知道跟“TensorFlow”有什么关系（应该没啥关系），他们的名字里都有一个“Tensor”，也就是张量。刚才说的“数字、向量、矩阵”都是低阶张量，这个机器学习最终都会落实到张量的计算上，这一点和计算流体力学(CFD)有些相似。所谓“深度学习”是机器学习的子集，即多层神经网络的方法。其实学术界也是存在起名浮夸风的，早年支持向量机刚出来的时候，也叫“支持向量网络”，其实里面没有网络啥事，就是听着牛逼。TensorFlow的这个页面可以直观地体验玩耍用神经网络做分类： Tensorflow — Neural Network Playground<img src=\"https://pic3.zhimg.com/50/v2-56c002707814f6e42989ba9c817fde92_hd.jpg\" data-rawwidth=\"1343\" data-rawheight=\"852\" class=\"origin_image zh-lightbox-thumb\" width=\"1343\" data-original=\"https://pic3.zhimg.com/v2-56c002707814f6e42989ba9c817fde92_r.jpg\">05. 广告本文的部分图片出自我站刚刚上线的课程，地址及主讲人介绍如下：深度学习的理论基础 - 集智课堂自然语言处理 - 集智课堂欢迎感兴趣的朋友们关注（都有免费试听章节）。", "answer_votes": "123", "answer_comment": "​26 条评论"}
{"answer_author": "Jacky Yang", "answer_id": 261599167, "answer_text": "这个问题好像跟另一个问题(机器学习的本质)类似:http://www.zhihu.com/question/19830921这是我的回答:https://www.zhihu.com/question/19830921/answer/258032988", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "姚冬", "answer_id": 162029705, "answer_text": "所谓人类的智能就是能根据已有的信息结合过往的经验逻辑去做判断，然后用这个判断去指导行动，再根据行动获得的反馈去修正判断，如此循环往复。人工智能就是通过编程让计算机拥有接近人类的智能。传统的计算机编程方式是人类自己总结经验，归纳成严谨的逻辑公式，然后用编程语言描述出来，编译成机器码交给计算机去执行。机器学习是一种新的编程方式，它不需要人类来总结经验、输入逻辑，人类只需要把大量数据输入给计算机，然后计算机就可以自己总结经验归纳逻辑，这个过程就叫训练，训练过后得到一个模型，这个模型就可以用来代替人去做判断了，训练得比较好的模型甚至可以达到超过人类的判定准确度。这种新的编程方式未来可能成为日常软件开发中常用的技术，用来解决一些传统编程方式不太好解决的问题。每个程序员都应该学一下机器学习。举个例子：十年前，2007年我在Nokia的时候遇到个问题，需要给当时的全屏手写输入法开发一个判定算法，因为输入法是全屏模式的，用户可以在整个屏幕上写字，但是屏幕上还是有一些可以点击的按钮的，比如回退，关闭，选择候选字之类的，所以要能区分用户到底想写一个笔画还是要点按钮。当时用的方法是根据收集的大量用户书写行为数据，根据笔画的位置，长度，角度，书写时间等数据，用一些三角函数，对数，配合一堆系数（都是些初中代数几何知识）生成一个公式，公式的计算结果就是这个用户输入是点击还是笔画的概率。这个公式不是我总结的，有专门的人做这个研究，我的工作只是把公式写成C++代码并调试通过。如果用今天的观念来看，这就是一个典型的机器学习问题，训练一个分类器就可以解决。当时的研究者未必想不到用机器学习来解决，但他想到也没用，因为当时的硬件性能不足以运行机器学习的判定代码，当时的手机只有 400MHz的ARMV7单核，浮点运算性能也很差，内存也很小。现在的硬件平台已经没什么问题了，至少简单的浅层模型跑起来没压力。如今各种机器学习的平台框架都很成熟，学习资料也很丰富，每个程序员都应该学一学。其实入门并不难，下面是我前些日子学习机器学习入门的时候写的代码，用来训练一个分类器，用给定的三个边长判定这是不是一个合法三角形。代码只有30行，用Keras API开发，后端是Tensorflow。如果已经安装部署了 Keras和Tensorflow，那么这个代码可以直接运行。from keras.models import Sequential\nfrom keras.layers import Dense, Activation\nfrom keras import optimizers\nimport numpy as np\n\ndef isTriangle(a, b, c):\n    return a + b > c and a + c > b and b + c > a\n\ndata = np.random.random((1000, 3))\nlabels = np.zeros(1000)\n\nfor x in range(0, 1000):\n    if isTriangle(data[x][0], data[x][1], data[x][2]):\n        labels[x] = 1\n\nmodel = Sequential()\nmodel.add(Dense(32, activation='relu', input_dim=3))\nmodel.add(Dense(1, activation='sigmoid'))\nmodel.compile(optimizers.RMSprop(lr=0.01, rho=0.1, epsilon=1e-07, decay=0.0), \n              loss=\"binary_crossentropy\",\n              metrics=['accuracy'])\nmodel.fit(data, labels, epochs=50, batch_size=32)\n\ntest_data = np.random.random((10, 3))\ntest_result = model.predict(test_data)\nprint test_data\nprint test_result\n\nscore = model.evaluate(data, labels, batch_size=1)\nprint \"\\nScore: \", score\n我承认，代码是从一些例子里摘抄的，参数是自己乱填的，这些代码我还不是每一行都能读懂，但是没关系，先有实践然后慢慢补充理论知识，这是我一贯的学习方法。", "answer_votes": "150", "answer_comment": "​20 条评论"}
{"answer_author": "军师", "answer_id": 192058504, "answer_text": "什么是机器学习？推荐完全没有开始学习的同学，可以先去集智（https://jizhi.im）的社区看看,看看他们都在解决什么问题，对机器学习和深度学习有一个初步的印象，这对你看以下的若干段落会比较有帮助，因为有些词汇比较生涩。如果你已经有python基础，可以选择直接从《机器学习实战》开始你的机器学习之旅。如果你不知道如何入手，这里或许能提供一些入门的方法：大一计算机学生如何学习机器学习？ - 知乎。概览：机器学习是计算机科学的一个子领域，1959年一个叫Arthur Samuel的人给出了机器学习的定义“计算机有能力去学习，而不是通过预先准确实现的代码”。在人工智能领域，机器学习逐渐发展成模式识别和计算科学理论的研究。机器学习探索可以预测数据的算法的研究和建设--比如有些算法克服了严谨的静态的程序流程，通过从简单的数据中构建简单的模型来进行数据预测或者下决定。机器学习被应用于大规模计算性任务，尤其是当设计和编程过程中拥有良好表现的确切算法是难以实现或者不能实现的时候。简单的几个应用：email过滤，检测网络入侵者，OCR，排序学习，计算机视觉。机器学习是非常接近（重叠）计算统计学的，关注于通过计算机来实现预测-决定这一过程。它与数学最优化有很强的关联性（提供方法，理论，应用领域）。机器学习有时候可以跟数据挖掘混为一谈，后者关注更多的是探索性的数据统计并且因为无监督学习而出名。机器学习同样可以是无监督的，并且可被用来学习和建立实体行为上的基准线，并且被用来发现有意义的异常。在数据统计领域，机器学习是一种用来设计复杂模型和算法并以此实现预测功能的方法。在商业领域，机器学习因为预测分析而闻名。这些统计模型允许研究者，数据科学家，工程师和统计学家去“产出可信赖的，可重复的决策和结果”，并且通过对数据的历史关系和趋势的学习发现“隐藏的视角”。从2016年起，机器学习成了流行词，并且通过Gartner 在2016年的大肆宣传，机器学习到达了不合理的期望的峰顶。有效的机器学习是困难的，因为找到模式是困难的并且经常出现训练数据不够的情况。导致机器学习程序经常不能交付结果。Tom M. Mitchell 提出了一种被广泛引用的，更正式的定义：对于某类任务T和性能度量P，如果一个计算机程序在T上以P衡量的性能随着经验E而自我完善，那么我们称这个计算机程序在从经验E中学习。这个定义对机器学习在基础的操作上而不是认知术语上来说是重要的，因此根据Alan Turing在他的paper----“Computing Machinery and Intelligence”中的提议，问题“机器可以思考么？”可以被替换为“机器可以做我们可以做的么？”。在这个假说中，他想要实现构建一台思考的机器可能着了魔。不同的类型和任务机器学习任务往往可以被划分为三种大类，取决于可从训练系统获得的信号量或者反馈的属性。这些分别是：监督学习：计算机获得简单的输入给出期望的输出，过程是通过一个“训练模型”，学习通用的准则来从输入映射到输出。无监督学习：没有给出标记用来学习算法，让它自己去发现输入的结构。无监督学习自己可以被当成一个目标或者一个实现结果的途径（特征学习）。增强学习：一个计算机程序与动态环境交互，同时表现出确切目标（比如驾驶一辆交通工具或者玩一个游戏对抗一个对手）。这个程序的奖惩机制会作为反馈，实现它在问题领域中的导航。处于监督学习和无监督学习之间的是半监督学习，“teacher”给出一个不完整的训练信号：一个训练集丢失了部分目标输出。传导是原则中的一个特殊的例子，除了那部分丢失的目标，整个问题实例的集合在学习过程中是被知晓的。在别的机器学习问题的分类中，学会学习这一过程需要靠学习它自己，这归纳偏向于之前的经验。发展性学习则阐明了机器人学习，生成它自己学习情况的序列，通过不断地自我探索、与人类“教师”的不断社会性交互、使用导向性的机制（比如主动学习，熟化，机器协同，模仿这一过程），进而去累积地获得各部分的独特技巧。当一个人开始考虑获得一个机器学习过的系统的输出，另一类机器学习的任务就出现了：从分类上来说，输出被分为两个或者多个类别，并且学习者必须制造出一个模型用来分配目前没有出现的输入数据提供给一个或者更多的类别。这是传统解决方法，使用监督学习。垃圾邮件过滤器就是一个典型的分类，输入是email信息并且类别分为垃圾邮件和非垃圾邮件。从回归上来说，同样是一个监督学习的问题，输出是连续的而不是离散的。从聚类上来说，一个输入集应该被分为若干个组。不同于分类的做法，这些组之前并不被预先知道，这使其被当做无监督学习的任务来处理。密度估计可以在某些地方找到不同版本的输入。降维处理简化了输入，通过映射它们给更低维度的空间。主题模拟是一种近似的问题解决办法，尤其是当一个程序被给予了一个序列的人类语言的文档，并且任务是找出哪些文档的主题接近时。历史渊源以及和别的领域的关系：作为一项科学尝试，机器学习在人工智能领域不断地探索，现在已经长大。在人工智能的早期，作为一门学术学科，许多研究者对机器从数据中学习非常感兴趣。他们尝试着用多种抽象的手段去解决问题，比如术语----“神经网络”。这些感知机一样的玩意儿和一些其他的模型被重新改变为统计学上的广义线性模型。概率推理也被应用于此，尤其是自动化的医疗诊断系统。但是，“过于强调逻辑，以已有知识为基础的方法”这一现象，造成了人工智能和机器学习的分歧与割裂。概率系统被数据的获得和表现，这两者的理论和实践中出现的问题所困扰。到1980年，专家系统开始主宰人工智能，并且统计学开始失宠。致力于抽象的/以现有知识为基础的的学习继续影响着人工智能，引领了归纳逻辑编程这一潮流，但是更多的统计学上的线性研究开始完全地跌出了人工智能，尤其是在模式识别和信息检索领域。神经网络研究此时被人工智能和计算机科学同时放弃。与此相关的整个系列，也因为 Hopfield, Rumelhart and Hinton三者在20世纪80年代中期对反向传播算法的成功革新，被人工智能/计算机科学领域当成一种联结机制而排除。机器学习，被改组成了一个独立的领域，在20世纪90年代开始走向繁荣。这个领域改变了它的目标，从实现人工智能到解决实际问题。它的关注点从继承自人工智能的象征性做法转换为从统计学和概率学上借来的方法和模型。它同时也从英特网不断增长的数字化信息、分发有效性等方面获利。机器学习和数据挖掘经常使用同样的方法并具有明显地重叠，但是不同之处是机器学习关注于预测，是从训练数据中学习，基于已知的特性进行预测。数据挖掘关注于从数据中发现未知的特性。数据挖掘使用和很多机器学习的手法，但是持有的是不同的目标。从另一方面说，机器学习同样使用了数据挖掘的一些做法，比如“非监督学习”或者预处理的步骤去提高学习器的准确性。大量的困惑出现在两个研究团体之间，这来自于两个团体的基础假设：在机器学习领域，表现是通常用来衡量再次产生已知知识的能力，但是在知识探索和数据挖掘(KDD)领域，关键任务是发现先前不知道的知识。衡量已知的知识，一套监督学习的处理方法将会比无知的做法（无监督学习）容易呈现出更好的性能，虽然在典型的KDD任务中，监督学习不能被使用，因为训练用的数据的无用性。机器学习同时与优化有着亲密的关系：许多学习问题可以被作为公式，用来使训练样例集中损失函数最小化。损失函数在预测被训练的模型和实际问题实例上表现出了差异性（举例来说，就分类来说，一个想要程序想要分派标签给一个实例，并且模型被训练为正确预测，预先指派标签给样例数据集）。两个领域的不同之处源自目标的广义化：一个优化算法关注于在训练集上可以被最小化损失，而机器学习是关心最小化损失在看不到的例子上。机器学习与统计学的关系机器学习和统计学是非常接近的两个领域。根据 Michael I. Jordan在机器学习领域的理念，从方法论原则到理论工具，在统计学领域是有一段很长的史前史。他也建议数据科学这一术语作为全部领域的前置。Leo Breiman区别两个统计学的模型：数据模型和算法模型，在算法模型中意味着或多或少包含着机器学习的算法，比如随机森林（Random forest）。一些统计学家已经采纳了机器学习中的一些做法，引申出了一个联结领域-----统计学习。机器学习理论一个学习者的核心目标就是从经验中形成概念（推广）。概括是学习机器通过在学习一个数据集后在新的、未知的例子/任务中根据上下文精确表现的一种能力。这些训练例子来自一些通用的不知道可能性的分发版本，并且学习者不得不去构建一个通用模型来使它在新的例子中产生足够准确预测。机器学习算法中的计算分析和它们的表现是一个理论计算机科学的分支，其中理论计算科学因计算学习理论而出名。因为训练集是有限的，并且将来是不确定的，学习理论通常并不做出对算法表现的保证。反而，在表现上出现两极间概率性的抖动是很常见的。偏置方差分解是一个量化概括过程出现的错误的方法。为了在泛化过程环境中的最好表现，假说的复杂性应该匹配数据下函数的复杂性。如果假说的复杂性小于函数，那么模型会对数据欠拟合。如果模型的复杂性作为回应而增强，那么训练中的错误会减少。但是如果假说过于复杂，那么模型会过拟合，并且泛化性会变差。除了性能界限之外，计算学习理论家研究了时间的复杂度和学习的可能性。在计算学习理论中，一个计算被认为是可行的，如果它可以在多项式时间内被执行完毕。这里有两种时间复杂度结果。积极结果展现出一个确定类别的函数，它可以在多项式时间内被学习。消极的结果展现出确定类别不能在多项式时间内被学习。机器学习方法决策树学习：决策树学习使用了一个决策树作为预测性模型，映射一个对象的观察结果给其目标价值一个推论。关联规则学习：关联规则学习是一种用来在大型数据库中发现变量之间的有趣联系的方法。人工神经网络：一个人工神经网络学习（ANN）算法，通常被称为神经网络（NN），是一个由生物的神经网络所激发出的一个算法。计算结构是由联结的人工神经元组所构成，通过联结式的方法来传递信息和计算。现代神经网络是非线性的统计学数据模型工具。它们通常被用来在输入和输出之间模拟复杂关系，找到数据中的关系，或者在观测变量中从不知道的节点捕获统计学结构。深度学习：个人不能承受硬件的价格和GPU的发展推动了这些年深度学习的进步，深度学习是由人工神经网络中的多个隐藏层组成的。这条道路试图去模拟人脑的过程，光、声进入视觉和听觉。一些成功的应用有计算机视觉和演讲识别。归纳逻辑编程：归纳逻辑编程（ILP）是一门用逻辑编程控制规则的学科，它使用统一的表示法来处理输入样例，背景知识和假说。给定已知的背景知识的编码和一组被表示为事实的逻辑数据库的示例，ILP系统将派生出一个假设的逻辑程序，该程序包含所有积极的和没有负面的示例。归纳编程是一个相关的领域，它考虑任何一种表示假设(而不仅仅是逻辑编程)的编程语言，例如函数式编程。支持向量机：支持向量机是一系列关于监督学习在分类和回归上的应用。给出训练样本的数据集，每一个标记属于两类中的一类，一个SVM训练算法构成了一个模型，可以用来预测一个新的样本是否进入一个类别或者是另一个。集群：集群分析是将一组观察结果分配到子集(称为集群)，这样，同一集群中的观察与一些预先确定的标准或标准相似，而来自不同集群的观察则不同。不同的聚类技术对数据的结构作出不同的假设，通常由一些相似性度量定义，并通过内部紧度(相同集群的成员之间的相似性)和不同的集群之间的分离来评估。其他方法基于估计的密度和图连通性。摘要聚类是一种非引导性学习的方法，是一种统计数据分析的常用技术。贝叶斯网络：一个贝叶斯网络，信任网络或者有向无环图模型是一个概率性图的模型，它通过有向无环图代表了一系列的随机变量和他们的条件独立性。举例，一个贝叶斯网络代表着疾病和症状可能的关系。给出症状，网络可以被用来计算疾病出现的可能性。有效的算法存在于执行推理和学习的过程中。增强学习：增强学习关心代理人如何在一个环境中采取行动，从而最大化一些长期受益的概念。增强学习算法尝试去寻找一些策略，映射当前世界的状态给代理在这些状态中应该采取的行动。特征学习：一些学习算法，主要是无监督的学习算法，旨在发现训练中提供的输入的更好的表示。经典的例子包括主成分分析和聚类分析。特征学习算法常常试图保存他们的信息输入同时变换方式使它有用,在执行分类或预测之前经常作为预处理步骤,允许重建输入来自未知的数据生成版本,而不一定是必须可靠的设置。流行学习算法试图在学习表现是低维度的约束条件下实现这一目标。稀疏编码算法试图在学习表示稀疏(有很多个0)的约束条件下这样做。多线性子空间学习算法的目标是直接从多维数据的张量表示中学习低维表示，而不需要将它们重新组合成(高维的)向量。深度学习算法发现了多个层次的表示形式，或者说是一种层次结构，在(或生成)低层次特性的基础上定义了更高级、更抽象的特性。有人认为，智能机器是一种可以学习一种表达方式，它可以分解解释所观察到的数据的各种变化的潜在因素。相似度量学习：在这个问题中，学习机被给予了很多对相似或者不相似的例子。它需要去学习一个相似的函数，以用来预测一个新的对象是否相似。它有时被用到推荐系统中。稀疏字典学习：在这种方法中，一个基准面被表示为基函数的线性组合，那么这些系数被认为是稀疏的。让x是一个D维的基准，D是一个d乘以n的矩阵，每一列D代表一个基函数。r是用d表示x的系数。从数学上讲，稀疏字典学习意味着解决<img src=\"https://pic3.zhimg.com/50/v2-609d1b2e86f2cc354f175276b18ca58b_hd.jpg\" data-rawwidth=\"67\" data-rawheight=\"20\" class=\"content_image\" width=\"67\">这个问题，这里r是稀疏的。一般来说，n被假定为大于d，以允许稀疏表示的自由。学习字典和稀疏表示是非常困难NP问题，很难解决。一种流行的启发式学习方法是k-svd。稀疏字典学习被应用在很多场景。在分类中，问题是确定一个从未被发现的数据属于哪个类。假设每个类的字典已经构建好了。然后，一个新的数据与类相关联，这样就可以用相应的字典来表示最稀疏的数据了。稀疏字典学习也被应用于图像去噪。关键的地方是，一个清晰的图像补丁可以用图像字典来表示，但是噪音是不能的。遗传算法：遗传算法是一种启发式搜索，它模仿自然选择的过程，并且使用一些突变和变向来生成新的基因型，以找到好的情况解决问题。在机器学习中，遗传算法在20世纪80年代和90年代使用过。反之，机器学习技术被用来提高遗传和进化算法的表现。基于规则的机器学习：基于规则的机器学习是任何机器学习方法的通用术语，它可以识别、学习或发展规则来存储、操作或应用知识。基于规则的机器学习者的定义特征是一组关系规则的标识和利用，这些规则集合了系统所捕获的知识。这与其他机器学习者形成鲜明对比，他们通常会识别出一种特殊的模型，这种模型可以普遍应用于任何实例，以便做出预测。基于规则的机器学习方法包括学习分类器系统、关联规则学习和人工免疫系统。学习分类器系统：学习分类器系统（LCS）是一个基于规则机器学习算法的家族，它每次结合一个发现组件和一个学习组件。它们试图鉴别一套上下文相关的规则，用分段的方式共同地存储和应用知识，以达到预测的目的。应用：自适应网站情感计算生物信息学脑机接口化学信息学DNA序列分类计算解剖学计算机视觉，包括物体识别信用卡欺诈检测博弈信息检索网络欺诈检测市场营销机器学习控制机器感知医疗诊断经济学自然语言处理自然语言理解优化和启发式算法在线广告推荐系统机器人移动搜索引擎情绪分析序列挖掘软件工程演讲和手写识别金融市场分析健康监测句法模式识别用户行为分析翻译引用Machine Learning and Optimization\n http://www.britannica.com/EBchecked/topic/1116194/machine-learning  This tertiary source reuses information from other sources but does not name them.\n Ron Kohavi; Foster Provost (1998). \"Glossary of terms\". Machine Learning. 30: 271–274.\na b c d Machine learning and pattern recognition \"can be viewed as two facets of the same field.\"\nDickson, Ben. \"Exploiting machine learning in cybersecurity\". TechCrunch. Retrieved 2017-05-23.\nWernick, Yang, Brankov, Yourganov and Strother, Machine Learning in Medical Imaging, IEEE Signal Processing Magazine, vol. 27, no. 4, July 2010, pp. 25–38\n Mannila, Heikki (1996). Data mining: machine learning, statistics, and databases. Int'l Conf. Scientific and Statistical Database Management. IEEE Computer Society.\nFriedman, Jerome H. (1998). \"Data Mining and Statistics: What's the connection?\". Computing Science and Statistics. 29 (1): 3–9.\n\"Dark Reading\".\n \"AI Business\".\n\"Machine Learning: What it is and why it matters\". www.sas.com. Retrieved 2016-03-29.\n\"Gartner's 2016 Hype Cycle for Emerging Technologies Identifies Three Key Trends That Organizations Must Track to Gain Competitive Advantage\". Retrieved 2017-04-10.\n\"Why Machine Learning Models Often Fail to Learn: QuickTake Q&A\". Bloomberg.com. 2016-11-10. Retrieved 2017-04-10.\n\n\na b Langley, Pat (2011). \"The changing science of machine learning\". Machine Learning. 82 (3): 275–279. doi:10.1007/s10994-011-5242-y.\nLe Roux, Nicolas; Bengio, Yoshua; Fitzgibbon, Andrew (2012). \"Improving First and Second-Order Methods by Modeling Uncertainty\". In Sra, Suvrit; Nowozin, Sebastian; Wright, Stephen J. Optimization for Machine Learning. MIT Press. p. 404.\n a b MI Jordan (2014-09-10). \"statistics and machine learning\". reddit. Retrieved 2014-10-01.\nCornell University Library. \"Breiman  : Statistical Modeling: The Two Cultures (with comments and a rejoinder by the author)\". Retrieved 8 August 2015.\n Gareth James; Daniela Witten; Trevor Hastie; Robert Tibshirani (2013). An Introduction to Statistical Learning. Springer. p. vii.\nBishop, C. M. (2006), Pattern Recognition and Machine Learning, Springer, ISBN 0-387-31073-8\n Mohri, Mehryar; Rostamizadeh, Afshin; Talwalkar, Ameet (2012). Foundations of Machine Learning. USA, Massachusetts: MIT Press. ISBN 9780262018258.\nAlpaydin, Ethem (2010). Introduction to Machine Learning. London: The MIT Press. ISBN 978-0-262-01243-0. Retrieved 4 February 2017.\n我是军师，国内首家高质量强专业性机器学习社区----集智（https://jizhi.im）联合创始人&COO，互联网界的信息贩子，招聘相关信息可以免费发布在我站或者知乎专栏，需要帮助或商务合作请私信。", "answer_votes": "126", "answer_comment": "​12 条评论"}
{"answer_author": "你不知道我是谁", "answer_id": 124327784, "answer_text": "有一个古老经典的例子：购买芒果假设有一天你去购买芒果，老板摆了满满的芒果，你会挑选一些芒果后让老板称重，然后根据重量付款购买。&lt;img src=\"https://pic2.zhimg.com/50/b3b7354193c05b52aea22f51d862d877_hd.jpg\" data-rawwidth=\"1024\" data-rawheight=\"768\" class=\"origin_image zh-lightbox-thumb\" width=\"1024\" data-original=\"https://pic2.zhimg.com/b3b7354193c05b52aea22f51d862d877_r.jpg\"&gt;显然，你希望挑选相对更成熟更甜一些的芒果(因为你是根据重量付款而不是根据质量)，所以你应该怎么挑选芒果呢？你想起来你妈妈曾教过你，亮黄色的芒果比暗黄色的芒果更甜一些，所以你有了一个简单的规则：只挑选亮黄色的芒果。所以你会检查芒果的颜色，挑选其中颜色更亮丽一些的，然后付款回家。是不是So easy ?并不是。。。生活总会更加复杂你回家吃了这些芒果之后，也许会觉得有的芒果味道并不好，你郁闷了。。很显然，你妈妈教给你的方法很片面，挑选芒果的因素有很多而不只是根据颜色。在经过大量思考(并且试吃了很多不同类型的芒果)之后，你又得出一个结论：相对更大的亮黄色芒果肯定是甜的，同时，相对较小的亮黄色芒果只有一半甜(即：如果你买100个亮黄色芒果，其中50个大的，50个小的，则50个大的都是甜的，而50个小的大概只有25个是甜的)。你会很开心自己得出的结论，然后下次去买芒果的时候就根据这个结论去买芒果。但是下次又去买芒果的时候，你喜欢的那家店不卖了。。所以你只能买别家的芒果，不过别家的芒果和之前你常去的那家的芒果不是一个产地的。然后你发现你之前得出的结论不适用了。所以你只能重新开始尝试。你尝试了这家店的每种类型的芒果之后，你发现，这个产地的芒果是：小的、暗黄色的更甜一些。这时候呢假设你有朋友来家里了，你摆了一些芒果给他们吃，但是你朋友说他并不是很在意芒果甜不甜，他更加喜欢多汁的芒果(这个朋友是不是很烦？)。又一次，你根据你的经验，又尝了所有类型的芒果，然后发现： 软一点芒果比较多汁。然后后来你又因为工作或其他原因要搬家了，在新的地方你发现这里的芒果和家里的芒果又不一样，这里 绿色的实际上比黄色的更甜一点。然后你喜欢上了一个妹子，结果妹子竟然不喜欢芒果，妹子喜欢苹果。所以你得去买苹果，你之前所有实践得出的芒果的知识都没用了。你需要根据芒果的经验，用相同的办法重新研究一遍哪些因素会影响苹果的口感。没办法，谁让妹子长得好看呢。编程现在呢想象一下，你在写一个程序帮助你挑选芒果(或者苹果)，你会写到类似如下的规则：if ( color is bright yellow and size is big and sold is vendor1 ): mango is sweet ; if ( soft ): mango is juicy ;等等。。。你会利用这些规则来挑选芒果，甚至你也许会把这个规则告诉你的家人，你可以保证挑选出的芒果都是预期的结果。但是，每当你要观察一个新的属性的时候，你只能手动更改这套规则。并且你需要了解所有繁杂的影响芒果质量的因素。如果这些因素足够复杂，你很难手动分类所有类型的芒果而做出精确的规则。也许你的研究还可以获得一个芒果科学的PhD(如果有的话)。并且，也不是所有人都这么闲来研究这个。机器学习(ML)算法ML算法算是普通算法的一个进化。 允许程序可以根据提供的数据进行自动的学习，它可以使你的程序变得更\"聪明\"。你可以从市场随机购买一些芒果作为样本(training data)，然后列出所有芒果的属性，比如颜色，大小，形状，产地，经销商，等等(features)，以及 甜度，成熟度，是否多汁，等等(output variables)。将这些数据在机器学习算法里运行(classification/regression)，则ML算法构建一个模型：芒果的属性--芒果质量。下次你再去买芒果，你就可以检测一下芒果的属性(颜色，大小等等)(test data)，然后提供给ML算法。ML算法会根据模型(model)预测哪些芒果是甜的，较成熟的/或者更多汁。算法内部使用的规则也许会类似于你之前手动写的哪些规则(decision tree)，也或者使用更复杂的规则，但是基本上这些对于用户和使用者而言并不需要关心。yoyo切克闹，你现在再去买芒果就有很大信心了，而且并不需要关心这些挑选好的芒果的细节。而且更重要的时候，随着时间你的ML算法会自我提升(reinforcement learning)，当预测错误的时候矫正自身，随着读取更多的training data预测也会越来越精准。但是，最流弊的一点在于，你可以利用相同的算法而训练出不同的模型(model)，比如苹果，橘子，香蕉，西瓜等等，随便你想要训练出什么模型只要你高兴就好 :)而且，这套算法是为你学习的，你说屌不屌？机器学习: 使你的算法越来越聪明, 所以你就可以不用太聪明 :)  翻译自quora.", "answer_votes": "65", "answer_comment": "​6 条评论"}
{"answer_author": "靠靠靠谱", "answer_id": 117564476, "answer_text": "# 未完工<img src=\"https://pic3.zhimg.com/50/317d8b0bd3a41ba629ede6a738ab20c3_hd.jpg\" data-rawwidth=\"1204\" data-rawheight=\"412\" class=\"origin_image zh-lightbox-thumb\" width=\"1204\" data-original=\"https://pic3.zhimg.com/317d8b0bd3a41ba629ede6a738ab20c3_r.jpg\">这就是一个很好的机器学习的栗子（认真）我们定义一下宝宝学习：\"如果宝宝的认知在随着家长的谆谆教诲和熏陶下，以表达能力或考试成绩衡量下自我完善，我们称这个宝宝在从家长的教育中学习。\"(沃玆基·硕德, 2016)而机器可以简化为没有智能但计算能力超好记性超好的宝宝：“对于某类任务T和性能度量P，如果一个计算机程序在T上以P衡量的性能随着经验E而自我完善，那么我们称这个计算机程序在从经验E学习。” “A computer program is said to learn from experience E with respect to some class of tasks T and performance measure P, if its performance at tasks in T , as measured by P , improves with experience E” (Mitchell, 1997) （中文翻译引用 @unknownknown 的答案） 用人话讲，就是用数据E完成一个任务T，并且用性能测量P衡量如何：Task: 任务，包括但不仅限于分类（猫还是狗）、回归（股价预测）、降维、转录（图像->文字，语音->文字）、翻译、合成和采样（产生伪数据）、缺失数据的填补、去噪...Experience: 数据，有监督的或无监督的Performance measurement: 性能测量，比如错误率、准确率噫，好像还是有点拗口，换成宝宝学习就明白了：Task: 任务，分类『分享』褒义词/贬义词，分辨『分享』应该使用/不该使用，分辨『分享』名词/动词/形容词Experience: 数据，马老师灌输的分享的理念，涵盖『分享』二字 (label=1) 的都算，不含『分享』二字 (label=0) 的也算；还是无特征的数据，宝宝自己抓取了特征：利益受到伤害Performance measurement: 性能测量，宝宝使用『分享』正确率...不断纠正宝宝，作为的新的数据又输入给宝宝，很快宝宝就可以抓取正确的特征而收敛...机器学习和宝宝学习最主要的区别，是宝宝是高智能，可以自适应地处理各种问题，机器需要模型，需要编程告诉它流程。模型可以看做是一种对数据的假设，所谓『学习』就是学习模型中的参数，而宝宝真的学到了分享。举个栗子，就像从没见过大象的盲人摸象（任务T），我先告诉盲人，大象不是一堵墙也不是圆柱体，是一堵墙带四个圆柱体两个尖锐物质和一根水管的东西（模型），然后带他去大象馆摸个够（数据E）。盲人渐渐摸出了感觉，嗯，柱体的直径和腰差不多粗，墙比人高，尖锐物质是坚硬的（学到了参数）。这个时候带他去摸动物园——噫，这都不是大象啊。（性能测量P）机器学习里骇人的部分往往都是模型，因为我对大象一无所知，才会构建各种各样的模型和算法（如果开个天眼直接告诉我大象的DNA序列或者发我一个博物君，就不用搞这些幺蛾子了）。还有一个好玩的定理叫『没有免费的午餐定理』(No free lunch theorem for machine learning, Wolpert, 1996)，其实就是没有一个绝对优秀的机器学习算法，要就数据论数据，就情况论情况。这才是机器学习研究工作者孜孜不倦的追求啊。具体算法太多啦，只推荐一个有趣的神经网络的回答：如何简单形象又有趣地讲解神经网络是什么？ - 王小龙的回答", "answer_votes": "16", "answer_comment": "​1 条评论"}
{"answer_author": "微软亚洲研究院", "answer_id": 212563947, "answer_text": "很多人都在谈机器学习，无论是专业从业者还是业余爱好者都必须弄清楚一个问题：什么是机器学习？今天，我们想借用微软亚洲研究院资深研究员闫峻博士撰写的一个小故事《“小马医生养成记”》来回答这个问题，相信同学们看完以后对机器学习的认识会更加深刻哦~————这里是正式回答的分割线————近年来，机器学习和大数据领域的突破进展使人工智能急速回温，训练计算机模拟甚至实现人类的学习行为则是目前人工智能领域最受关注的研究课题之一。很多人都难以想象，看似冷冰冰的机器如何能在短时间内学得一身本领的？其实，培养计算机具有一定的专业能力与培养一个专业人才的过程具有很多相似性。计算神器，天资超凡老马有一个小儿子叫小马，他非常可爱，且拥有超乎常人的记忆力，基本过目不忘。小马的算数能力同样惊人，各种加减乘除，非一般儿童可比。经过儿时的培养和精心呵护，老马惊喜地发现自己的孩子还耳聪目明，听写考试成绩永远名列前茅，对所看到事物的辨识力也十分了得。老马总是骄傲地和朋友们说：“我的孩子是个小天才，小小年纪已经学会好几种语言了，我们全家出国旅游，他都可以当个小翻译了。”就在前几天学校的下棋比赛上，小马轻轻松松拿了第一名。于是，老马决定，要好好培养这个孩子。机器学习小课堂计算机与人类相比有很多先天的优势。比如记忆能力、基本运算的速度等方面都是正常人类所无法比拟的。随着人工智能技术的发展，计算机在感知计算如语音识别、图像识别等领域的能力也已经开始赶超人类。在基于大数据的机器翻译，以及基于搜索算法与增强学习的棋类竞技上，计算机也表现出了强有力的竞争力。于是，人们期望计算机能做的更多、更好。虽然计算机有先天的优势，但自身仍有不足。在努力了解计算机并帮助这个 “天才儿童” 成长的过程中，我们是否可以利用一个或多个具体的应用领域来更好地认识“他”并更有效地挖掘“他”的潜力呢？因此，我们计划从一个小目标开始，看看计算机能不能成为一名称职的人类医生助手，甚至未来是成为一名医生。知识工程，美中不足小马果然没有辜负家人的期望，以优异的成绩考入了全国知名的医学院。在学校里，小马认真阅读了大量书籍和文献，知识积累越来越丰富。眼看大学就要毕业了，小马被派到一所知名医院进行实习。凭借自己的知识积累，小马决定一展身手。可是当小马到了医院见到了形形色色的患者后，他发现书本里学到的知识有点不太够用。患者对症状的含糊描述让他不知所措。而且很多患者的现实情况和书本里讲的经常不太一样，总是多出或缺少几个他没见过的特殊症状表现，所以小马没办法用他在学校里学到的知识严谨的推理出合理的结论给患者。这让小马感觉挫败，他觉得自己的知识零散，不灵活，于是他决定回到学校继续读研深造。<img src=\"https://pic1.zhimg.com/50/v2-1df76b6cf0e1ed0b44c1683a1cff7cef_hd.jpg\" data-rawwidth=\"1429\" data-rawheight=\"738\" class=\"origin_image zh-lightbox-thumb\" width=\"1429\" data-original=\"https://pic1.zhimg.com/v2-1df76b6cf0e1ed0b44c1683a1cff7cef_r.jpg\">读研期间，小马勤学好问，把他遇到过的、不知道如何解决的问题归纳总结起来，向导师询问，学习到了很多书本里学不到的新知识。他意识到：要成为一名好医生，不能光靠书本知识，经验也很重要。研究生毕业后，小马如愿以偿加入到他实习时的这家知名医院成为了一名医生，并开始积累他的临床经验。机器学习小课堂知识工程是早期人工智能技术关注的焦点。知识的提取、知识的表示与推理曾被认为是人工智能的基础。但在应用的过程中，人们逐渐发现高质量专业知识抽取的成本很高，也很难做到完备，知识的表示也很难做到易用的语义层面，这一切都给知识推理带来了巨大的挑战。这些挑战所带来的后果就是人们发现在很多应用领域单纯依赖于知识工程的方法成本高，也难以达到预期的效果。因此，人们开始对知识工程产生质疑，甚至对人工智能产生质疑。另一方面，随着统计机器学习的发展以及计算机对大数据处理能力的提高，人们开始重新解读人工智能。虽然知识工程遇到了很多问题，但大批科学家还是坚信计算机的智能不能单纯依靠统计学习，它离不开前人知识的总结。在微软亚洲研究院，针对知识图谱的建立，我们研究了一系列知识挖掘工具，并定义为Knowledge Mining API。针对知识的语义表示，我们研究并开放了 Microsoft Concept Graph等能够在语义层面表达知识的方法。所有的这些努力都是为了以更低的成本建立更完备、更易于计算的知识图谱来“武装”我们的计算机。统计学习，返璞归真小马的勤奋让人动容，除了每天出诊，他还阅读了大量科室内之前的治疗记录，他的学习速度让其他医生望尘莫及。经过一段时间的拼搏，小马已经是一名颇有经验的医生了。对于患者的诊断，他有了自己的心得甚至可以称之为感觉。很多时候小马像条件反射一样，凭感觉就能快速给出判断和治疗方案，一般的患者小马都能轻松诊断。慢慢地，小马觉得他已经不需要按照医学院里学的那些条条框框工作了，他的经验和直觉足以应对。然而有一天，科里发生了一起医疗事故：有一位资深医生根据自己经验治疗的一名患者出了问题，“人走了”，患者家属要打官司。于是医院决定，再有经验的医生在诊断之后也要有理有据，可以给出诊断理由。<img src=\"https://pic2.zhimg.com/50/v2-80c8141bb15820750ac3eabffd584250_hd.jpg\" data-rawwidth=\"1427\" data-rawheight=\"709\" class=\"origin_image zh-lightbox-thumb\" width=\"1427\" data-original=\"https://pic2.zhimg.com/v2-80c8141bb15820750ac3eabffd584250_r.jpg\">这件事对小马触动很大，他成为科室里第一个做出快速反应的人。因为小马在学校里学习的知识很有逻辑性，所以他很快地把自己的经验和之前的知识做了研究，找出了其中的核心联系。同时，令人惊喜的是，小马发现，当他的理性知识结合他的感性经验后所做出的诊疗结果比以前更加有效，这也让他加速成为了一名令人信服的专家医生。同时，他的经验也给书本知识进行了很大的补充。这些收获让小马思考了一个新的问题：“我从事了这么久的临床治疗，获得了一些书本里没有的经验，这本身就是一种创新。除了把它们总结下来，我能不能有更大的创新来推动医学的进步呢?”机器学习小课堂基于大量数据的统计机器学习包括深度学习，近年异军突起，尤其是深度学习。由于对复杂非线性模型的逼近能力与对数据的自适应能力，因此深度学习在很多应用领域表现优异，在很多应用中深度学习得出的结论甚至可以与人类专家的决策相媲美。但人们也陆续发现了一些深度学习的不足之处——一个突出的问题就是完全参数化模型导致的结果具有不可解释性。另外，很多科学家还在想的一个问题是，既然人类的进步总是站在前人的肩膀上，那么机器学习为什么一定要从零开始，是否可以把前人的经验和知识利用起来，融入到机器学习的过程中？于是，知识工程与统计机器学习的结合引起了越来越多的关注。目前针对知识与统计机器学习结合的相关研究主要集中在把知识表示为统计学习目标函数的归一化项或把知识当作输入数据表示的扩展。当然还有一些更加简单粗暴的方式，如多个不同独立模型加权后的共同决策、知识图谱当作统计学习的后处理过滤器等等。各种早期尝试都让我们看到了二者结合带来的进步，但目前还没有显著的帮助。这个方向是我们当前研究的一个重点。创新野心，假设求证人人都在谈创新，可创新谈何容易，该从何下手呢？忽然，小马想起了读研时导师对他所选择课题的建议“大胆假设，小心求证”。对，创新的方式很多，就从“大胆假设，小心求证”开始，小马决定。“以前学到的知识可以让我进行理性地推理，积累的经验可以让我进行感性地决策。二者的结合让我成为了一名专家医生。创新要基于我的知识和经验，但不能局限于此，一定要有所超越!”小马心里想到。于是小马在各种病症与诊断用药之间寻找联系，基于他的知识和经验寻找新的可能性。小马常问自己的一句话是“这个病人为什么不能那样治呢？”当提出这样的问题后，小马查找大量资料，寻找临床证据，当证据相对充分时，他便提出临床实验请求。终于功夫不负有心人，小马一个大胆的假设被多个病例所验证。因为此事，小马成了院里知名的具有极强科研能力的专家医生。这一切，也让小马的父亲倍感骄傲。<img src=\"https://pic4.zhimg.com/50/v2-8bf74453d1c203a11ed7d611d8f2f189_hd.jpg\" data-rawwidth=\"1429\" data-rawheight=\"708\" class=\"origin_image zh-lightbox-thumb\" width=\"1429\" data-original=\"https://pic4.zhimg.com/v2-8bf74453d1c203a11ed7d611d8f2f189_r.jpg\">再来谈谈老马。老马是一名大学教授，主攻计算机领域的机器学习理论。有一次，老马对小马说：“孩子，爸爸的算法研究在应用时就像在治病，具体问题是病，算法就是药，药没有万能的，算法也一样。”小马无意间想到了和父亲的那次谈话，他突然意识到，现在各个领域都在讲跨界是有道理的，“我们行医也可以借鉴一些其他领域的知识，触类旁通可以得到更多的灵感来激发我的创造力。”机器学习小课堂无论是知识工程还是统计机器学习，如今人们开始愿意相信计算机的理性推理和感性决策能力。但即使二者结合，人们还是无法预期计算机是否将会具有创新能力。想想人类的创新，很多情况是基于两点：一是灵感，这是具有很强随机性的东西；另一个是联想，就是触类旁通。关于灵感，人类的很多创新灵感是在理性推理与感性认知后的一种假设检验，即先想到“能不能这样”，然后再去求证。那么计算机是否可以模拟这一过程呢？由于灵感即假设的某些随机性，我们开始重新关注近期并没有被重视的随机算法。比如遗传算法，可以通过数据向量基因表示的遗传变异得到一些新的假设，然后利用大数据搜索技术寻证。由于计算机的超强记忆与快速搜索能力，这条路是否可以让计算机具有一定的创新力？从另一个角度来看，这种假设检验的思路也是对现有大部分统计学习和知识推理的一种有效补充。<img src=\"https://pic3.zhimg.com/50/v2-2c543d253c525be7a3036092d62e7374_hd.jpg\" data-rawwidth=\"1431\" data-rawheight=\"706\" class=\"origin_image zh-lightbox-thumb\" width=\"1431\" data-original=\"https://pic3.zhimg.com/v2-2c543d253c525be7a3036092d62e7374_r.jpg\">统计学习是基于大数据的，也就是说，可以从大量数据中学到统计规律。知识图谱的建立往往也是基于大数据的，那么能解决的问题也就主要集中在数据分布的前端，往往忽略了长尾。比如，有一个罕见疾病在不经意间被某些治疗手段治好了，但这种案例很少，也容易被人忽视，那么大数据观点是很难建立出相应的模型和知识图谱的。但如果通过假设检验的方式，一旦假设被建立，检验过程就是去寻找相应的证据，哪怕相关数据量很小，也可能被捕捉。所以，我们的一个长线研究课题就是这种基于假设检验的机器“创新”。跨界人才，触类旁通小马从小爱好广泛，历史、地理、物理、化学样样精通。然而，小马以前的这些知识所在领域分散，看起来相互之间好像没有什么关联。但自从在和父亲的谈话中意识到跨领域思考可以触类旁通的道理以后，小马遇到各种事情都会想一想：是否在其它问题中学习到的道理可以被应用。果然，在一次诊疗过程中，小马发现病人所面临的情况和治理城市污染的道理相似。表面上看到各个排污企业都安装了环保设备，但因为使用成本过高，很多企业没有真正投入使用，所以污染依旧。同样的道理，这个病人虽然使用了看上去最好的药物，但这些药物会消耗正常细胞，导致身体抵抗力下降，所以身体可能会出于本能主动阻止药物发挥应有的作用。于是，小马果断调整了治疗方案，让病人获得了更好的疗效。同时，在和病人沟通的过程中小马发现很多患者听不懂他关于病情的解释，但如果根据患者的知识背景用一些比喻的方式解释，患者很快就会接受诊疗建议。小马想到，这同样也是运用一个领域的知识来解释另一个领域的问题，只要道理是一样的。从此以后，小马养成了一个习惯，就是遇到任何问题都会联想到他在生活、学习和工作中遇到的其他领域可以触类旁通的情景。很快，小马的诊疗技术进一步突飞猛进，也越来越受患者的喜爱。 机器学习小课堂人类的很多创新来自联想。另外，人的举一反三地能力也不同程度地依赖于联想。联想是什么？从我们研究的观点看，可以片面理解为从某个未被解决的具体问题搜索到已被解决或已被部分解决的类似问题，这个类似问题的解决方案或背后隐藏的道理可以被应用来解决当前问题。这种联想往往是跨领域的。回到当前研究的热点领域，在统计机器学习中，transfer of learning（迁移学习）就是一种机器通过联想解决问题的途径。从知识图谱的角度看，要实现机器的联想能力，首先要建立一个跨领域的知识图谱。现今所有常见的知识图谱一般都不会为“父亲”和“大山”建立关系，也不会为“生活”与“巧克力”建立关系。但在人类的常识体系中，他们是有一定联系的，也是经常会被人们联想到的。当前，我们研究的一个早期尝试，就是建立这种跨领域的知识关系图谱，以此赋予机器一定的联想能力。情感注入，人性沟通小马在事业上的一帆风顺并不能掩盖他自身的一些问题。由于名气越来越大，找他看病的患者也越来越多，他发现自己很多时候对患者没那么有耐心。很多患者反映：和小马医生交流时，他总是面无表情，语言生硬。小马的一个很大优点就是发现问题尽量马上解决，他意识到，除了给患者治好病，还要让患者满意。于是，他开始学习各种沟通技巧。慢慢地，小马能够从与患者的沟通中体会患者的心理需求，能够体会患者的喜怒哀乐，并能察言观色给患者体贴的呵护与治疗。他还开始主动关心每一位患者，并提出个性化的建议。不仅治病，小马还会给出防病、养生的建议。此后，小马成为了一名真正受欢迎并具有创造力的医学专家。机器学习小课堂在关注计算机硬能力的同时，为了更好地让机器与人类沟通并服务于人类，我们也要关注计算机的软能力。这包括用户个性化建模的能力、情感理解与表达的能力等等。我们关注的另一个重点是主动模型与被动模型的区别。目前我们建立的很多计算机服务都是被动模型，也就是说以有求必应为目标。但很多情况下主动地提醒、建议在很多实际应用中是非常必要的。然而主动模型的度很难把握，多了会烦、少了会想。因此，关于主动模型的研究也是我们当前研究的一部分。时代人才，综合素质小马的成功不是偶然的，其中付出了巨大的努力。他天资聪慧，具有某些如记忆、算数天分这样的超常能力，经过培养后感知能力超群，无论听还是看。他勤奋好学，对书本有很强的学习能力，并快速建立了自己的知识体系。他学习迅速，可以快速从大量案例中积累经验。更了不起的是，他能很好地把经验和书本知识相结合。之前一直有亲戚担心小马天资过于聪慧。“上帝给了你超群的能力，为你开了很多门，就会给你关上几扇窗。你的创造力可能不如别人，可能没那么强的联想能力，也可能会自闭，和别人的沟通可能会出问题”，各种质疑曾经频繁出现，但小马一次次证明了自己。他比别人更细心，这让他的大胆假设更容易被验证，这就赋予了他超乎常人的创造力。通过知识体系的建立，小马拥有自己超群的联想能力。而他的细致让他更容易察言观色每一个人，也赋予了他更强的情感沟通能力。在这样一个日新月异的时代中，小马的综合素质能够使他脱颖而出，成为最优秀的明日之星。————这里是回答结束的分割线————以上回答摘选自微软研究院AI头条，机器学习六步曲--“小马医生”养成记。 感谢大家的阅读。本账号为微软亚洲研究院的官方知乎账号。本账号立足于计算机领域，特别是人工智能相关的前沿研究，旨在为人工智能的相关研究提供范例，从专业的角度促进公众对人工智能的理解，并为研究人员提供讨论和参与的开放平台，从而共建计算机领域的未来。微软亚洲研究院的每一位专家都是我们的智囊团，你在这个账号可以阅读到来自计算机科学领域各个不同方向的专家们的见解。请大家不要吝惜手里的“邀请”，让我们在分享中共同进步。也欢迎大家关注我们的微博和微信 (ID:MSRAsia) 账号，了解更多我们研究。", "answer_votes": "229", "answer_comment": "​12 条评论"}
{"answer_author": "许铁-巡洋舰科技", "answer_id": 136425131, "answer_text": "作者：许铁-巡洋舰科技链接：知乎专栏来源：知乎著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。一段程序可以看做一连串从输入到输出的过程，无论是工程师还是程序员，我们都想通过设计来完成某种功能， 比如说你做一个网页， 你要画视觉图， UI图， 前端后端交互图，我们是给计算机设计一套解决具体问题的流程， 如做一个淘宝网。机器学习呢？  机器学习是你不去设计， 而让计算机自己去磨，如同用一套很一般的模子里打磨出能够解决特定问题的武器。 这点上，机器学习做的正是” 自发能够产生解决问题的程序的程序” ， 一些机器学习的经典算法如线性回归， SVM， 神经网络， 它们单个都不能解决问题， 但是通过“学习”却可以一会去预测房价一会去寻找美女。它是怎么做到的： 我们模仿人学习的过程让机器来学习些程序：最常见的方法就是是有老师告诉你对错的学习 ，这个称为有监督学习 。一个一般被作为监督学习入门的实例， 是预测房产的价格， 一个房子的价格决定于非常多的相关因素， 比如房子中卧室， 厕所，客厅的数量和面积， 周围环境的交通， 安静与否，有无学校等， 我们要从这些要素中知道房子的价格。如果你是传统的房产专家， 你的方法一定是到各个地点做调查成交价， 随着经验的增加， 你会得到各个区域的基准价格， 然后按照这个基本价格结合房子的特征上下调整，得出你的经验公式。  这真是累死小哥啊。有了最原始的机器学习，我们也可以把这个人类得出经验的过程让机器解决。我们的小哥现在只需要在网上放一分表格， 让人们把有关房子的有用无用的信息和价格都填了， 做一个巨大的excel表格。 然后我们让程序从这些信息学习价格的pattern（模式）。之前的因素在这里我们换以一个新的词汇-特征。每一个特征， 这次要用一个数表示， 如同线性代数里的坐标基。而这些特征如何决定价格的， 我们就可以不管， 让机器决定去。特征的个数我们通常称之为维度，一个问题的维度往往决定其复杂性， 以及所使用的方法， 这就是复杂系统所擅长讨论的范畴了在此不详述。 维度本身同时决定我们可能需求的数据量多少， 高维度意味着我们需要求解问题的信息量也成比例的增长。 特征工程就是在大量的信息， 比如“我的房子有个大落地窗”这种话里提取出和房价可能相关的属性（attribute）。所谓机器学习的模型选择，就是在寻找一个基本学习框架， 包含你对预测事物的非常一般的理解， 比如房子的价格可能是很多因素的叠加这种初中水平的东西，学名线性回归：<img src=\"https://pic2.zhimg.com/50/v2-afd58ade816f805562e2eac13b199952_hd.jpg\" data-rawwidth=\"1110\" data-rawheight=\"134\" class=\"origin_image zh-lightbox-thumb\" width=\"1110\" data-original=\"https://pic2.zhimg.com/v2-afd58ade816f805562e2eac13b199952_r.jpg\">你不是有众多特征决定吗？ 我可以用一个算法，让一个非常初级的模型自动的进化，机器学习工程师要做的是把这个模式的毛坯找出来，以及这个寻找自动算法的算法做出来，这个一旦做出来， 后续的数据就像一颗颗子弹把模型打造成型。<img src=\"https://pic3.zhimg.com/50/v2-ffd8b18628ada4013d965aba9b1f95ec_hd.jpg\" data-rawwidth=\"1408\" data-rawheight=\"780\" class=\"origin_image zh-lightbox-thumb\" width=\"1408\" data-original=\"https://pic3.zhimg.com/v2-ffd8b18628ada4013d965aba9b1f95ec_r.jpg\">这个把模型打磨成型的过程就是学习，行里叫求解参数。这组参数不是让某个特定的房子的价格被最好的拟合，而是让整个数据集都被一组参数涵盖。 这组参数就是我们学习的结果， 放佛具有了一种人一样的预测未知房价的能力。 就像人一样，机器也是从错误中学习的，因此，最经典的监督学习里， 我们首先要做的是衡量错误的大小，我们用一个叫cost function的东西衡量模型预测的结果与真实值的差距， 模型的效果越差， 这个cost function的值就越高。<img src=\"https://pic4.zhimg.com/50/v2-3879fd1f5f47c6aaca2a5251a63c5292_hd.jpg\" data-rawwidth=\"1480\" data-rawheight=\"350\" class=\"origin_image zh-lightbox-thumb\" width=\"1480\" data-original=\"https://pic4.zhimg.com/v2-3879fd1f5f47c6aaca2a5251a63c5292_r.jpg\">这个函数告诉你的是，每次犯错都是潜在的风险和损失，我们称之为cost。而cost 函数来衡量目前模型离最终正确模型的距离。这个cost函数恰恰是由刚刚说的参数决定的。 这些参数的含义是， 当你改变某一个特征比如房屋的面积，你的房子价格就会变动，但是变动的方式是什么， 你不知道， 你就去随机的扰动这些参数看看得来的价格会如何变化，并且和真实的价格信息比较， 可能你忽然发现某个瞬间， 你的所有房子的价格都被一组参数神奇的拟合了。<img src=\"https://pic3.zhimg.com/50/v2-2ddb693474f8d2e3fac10cd763f0a558_hd.jpg\" data-rawwidth=\"1520\" data-rawheight=\"404\" class=\"origin_image zh-lightbox-thumb\" width=\"1520\" data-original=\"https://pic3.zhimg.com/v2-2ddb693474f8d2e3fac10cd763f0a558_r.jpg\">我们称这组参数为最优，或者说我们学习的结果。虽然这个cost函数和统计学里的方差很相近，但说的不是并非一个意思。 机器学习能否成功，就在于这个最优位置能否找到， 而在大多数时候，我们连这个最优位置是否存在都不知道。当然刚刚说的随机方法很是不靠谱，实际操作中我们用到的是一个叫梯度下降的方法， 让参数顺着最快速减少预测错误的方向去自动调整，如下图。<img src=\"https://pic1.zhimg.com/50/v2-c4ba9bc5bad6d89c7abdb7b1b41cf112_hd.jpg\" data-rawwidth=\"1370\" data-rawheight=\"972\" class=\"origin_image zh-lightbox-thumb\" width=\"1370\" data-original=\"https://pic1.zhimg.com/v2-c4ba9bc5bad6d89c7abdb7b1b41cf112_r.jpg\">图中的x，y轴代表参数， 高度代表错误率， 洼地的那个点正是最优参数点。 训练与测试：用一个形象的比喻理解有监督学习，它就像一个拿着一堆模拟考试题学习的学生， 这个过程里你通过不停的比较你和标准答案的差距来学习完成试卷， 而最终这个学生要面对的是真实的考试。 相对应的，我们通常在有监督学习里把我们的数据分成两部分， 一部分做学习的试题，另一个部分做考试用。 一个学生完全可能在平时练习的时候把每道考题被的滚瓜烂熟，而在真正的考试里一塌糊涂，这种情形我们称之为过拟合。 <img src=\"https://pic4.zhimg.com/50/v2-3cb92d77fe216d4fca5a9120dfc33e11_hd.jpg\" data-rawwidth=\"605\" data-rawheight=\"337\" class=\"origin_image zh-lightbox-thumb\" width=\"605\" data-original=\"https://pic4.zhimg.com/v2-3cb92d77fe216d4fca5a9120dfc33e11_r.jpg\"><img src=\"https://pic3.zhimg.com/50/v2-c8aeab941e774b515a0bc20101594fd5_hd.jpg\" data-rawwidth=\"990\" data-rawheight=\"610\" class=\"origin_image zh-lightbox-thumb\" width=\"990\" data-original=\"https://pic3.zhimg.com/v2-c8aeab941e774b515a0bc20101594fd5_r.jpg\"><img src=\"https://pic2.zhimg.com/50/v2-e921571bb5a120c91562d68b49e1fbcd_hd.jpg\" data-rawwidth=\"916\" data-rawheight=\"912\" class=\"origin_image zh-lightbox-thumb\" width=\"916\" data-original=\"https://pic2.zhimg.com/v2-e921571bb5a120c91562d68b49e1fbcd_r.jpg\">如果用两个最简单的例子来解释过拟合发生的原因，主要就是在局限的数据里过度的挖掘模式导致的。  比上图说一个人想要识别树叶，它只见过那些有锯齿的树叶， 见到没有锯齿的叶子就会判断它不是叶子。 或者一个人只见过白天鹅， 它拼命的根据已有的经验去定义天鹅，而当第一个黑天鹅出现时候， 它的定义就失效了。 无监督学习 ：再一些更困难的问题里， 我们根本不掌握我们所要求解的信息，比如房屋的价格， 这好比一个没有标准答案的开放性考题， 我们需要学生发散式的探索。无监督学习看起来不能给出一定的答案， 但是其结果却可以让我们得到意想不到的惊喜。 无监督学习最典型的范例是聚类， 一个典型的例子是， 你是一家互联网公司，你要对你的一大堆客户信息， 你首先面对的是如何把这些数据进行整理归类，无监督学习里的聚类算法如k-means，它可以轻松的把你的客户信息根据特征自动划分成大类， 之后你可以发现喜欢爱马仕包的女生也爱喝拉菲的红酒这种信息。 再有说如果你有大量的人的心电图，你要分辨出哪些是异常的可能是心脏病的情况，但是你又不知道病人有关的信息， 让机器自己去无监督学习， 都可能得到意想不到的insight。机器学习很美吗： 机器学习这件事， 看上去很美， 事实上一点也不， 因为你面临的是变幻莫测的问题， 你训练的再好， 你的预测也是有风险的。首先， 因为存在模式，问题才可以预测， 如果你的问题本身就没有模式， 或者模式极为不可捉摸， 你的算法再强大也会失败。比如说你要预测某个商品网站上衣服的价格， 但是这个网站里的衣服都是一个疯狂销售者根据它每天的心情好坏定的， 而你却去找了一堆衣服的尺码材质特征来， 那你的算法终究要失败。 即使是一个模式存在的问题， 也总会在某个时点上， 碰到问题的边界。比如说你要做一个根据女生特征匹配对象的机器学习算法， 你的算法总是根据你过去掌握的男女匹配记录搞的， 而总会有某个时刻， 你的对象已经不符合历史数据的规律，这时候要不你调整算法， 要不你直接放弃服务这类无法预测的人。 机器学习最难的是什么？如果你思考一遍上述流程， 你可能发现一切都很容易， 从数据清洗，特征提取，到模型选择， 事实上这你就错了。  因为机器学习最难的一部 ， 这里根本就没提到， 那就是把现实生产生活中的问题， 提炼成一个机器学习问题 。这需要的是你对问题本身的深刻洞察。  有一天也许整个数据清洗到模型选择和交叉验证都自动化了。但始终有一个东西不能完全被机器搞定， 那就是你如何从一个全新的领域， 去提取机器学习可以有助解决的最重要的问题。 再有， 无论机器的预测多准确， 它的结果如果不是在解答人的需求， 也是一个没用的或至少不令人喜欢的东西。 比如我发明一个算法能够特别准的预测老人的寿命， 或者根据女生现在的长相推测她80岁的长相， 即使算法十分牛掰， 这样的产品估计也不是客户喜闻乐见的。   <img src=\"https://pic2.zhimg.com/50/v2-3bf90fb7ff6b80364f2aabb7a20a524d_hd.jpg\" data-rawwidth=\"800\" data-rawheight=\"483\" class=\"origin_image zh-lightbox-thumb\" width=\"800\" data-original=\"https://pic2.zhimg.com/v2-3bf90fb7ff6b80364f2aabb7a20a524d_r.jpg\">", "answer_votes": "123", "answer_comment": "​2 条评论"}
{"answer_author": "杨冠南", "answer_id": 135972418, "answer_text": "拿买西瓜举例一个人买西瓜买的多了，就会接受大量的西瓜数据例如敲西瓜的声音、西瓜外皮颜色、纹路等从而生成了一个西瓜模型（敲击声音清脆、纹路清晰、颜色鲜绿的瓜会比较甜）下次遇到一个新的西瓜，这个人就可以通过西瓜模型来判断出这个瓜甜不甜。大量西瓜数据 ＋ 大脑学习 ＝ 西瓜模型遇到一个新西瓜 ＋ 西瓜模型 ＝ 判断出新西瓜甜不甜由以上总结一个极度简化版的机器学习过程给计算机大量的数据计算机通过学习算法生成一个模型在面对新的情况时，模型会给出相应的判断。大量数据 ＋ 学习算法＝ 模型新的一条数据 ＋ 模型 ＝ 机器的判断这大概就是机器学习", "answer_votes": "11", "answer_comment": "​3 条评论"}
{"answer_author": "泊数", "answer_id": 97055259, "answer_text": "普林斯顿大学机器学习方向博士，大数据建模公司普林科技CTO。楼上的回答都偏学术一些，以下将尽可能通俗易懂地讲一讲怎么理解“机器学习”。和大数据一样，机器学习(MachineLearning, ML)是一个热门而又有略有误导性的名词。字面上它让不禁让人联想到一群机器人排排坐上自习的科幻场景，然而实际上它指的是让计算机具备像人一样的学习能力的高(qi)端(ji)技(yin)术(qiao)，进而从堆积如山的数据中寻找出有用的知识。听起来有些不可思议，真的有这种黑科技吗？计算机的正确打开方式难道不是喂给它一串命令，然后愉快地看它乖乖执行么？除了0和1啥也不认识的呆呆计算机，怎么还能像人类一样“学习”了呢？嘿嘿，这个还真可以有。别急，且容我慢慢道来。在讨论计算机如何学习之前，不妨先来看看我们人类是如何学习的。人类的学习按逻辑顺序可分为三个阶段：输入，整合，输出。大家都多多少少学过英语，我就拿学英语来举例好了。在入门时我们都逃不出背单词的苦海，不积累一定的词汇量后续学习都无从谈起，这是输入阶段。然而很快我们就会发现，即使背完一本牛津大辞典也是没法和歪果仁愉快交流的。我们必须学习语法，学习一些约定俗成的习惯用语，才能知道如何把单词组合成地道的句子，这便是整合阶段。最后，有词汇量作基石，又有了语法规律作为架构，我们就能在特定场合用英文来表达自己的想法。这是输出阶段，也正是我们学习英文的初衷。学习其他东西也是一样，概括来说，都要经历从积累经验到总结规律，最终灵活运用这三个阶段。对此，我们完全可以对人类的学习给出如下定义：人类的学习是一个人根据过往的经验，对一类问题形成某种认识或总结出一定的规律，然后利用这些知识来对新的问题下判断的过程。毫不夸张地说，学习能力绝对是人类打猩猩时代起憋出的大招，在它的帮助下人类一举登顶食物链之巅。之后经过了数千万年的自然选择，学习能力弱的要么被环境淘汰要么被同类坑害，都死绝了。学习这套流程已深深写入了我们的DNA里，一代比一代玩得溜。故事到这里似乎直指人类称霸宇宙的happy ending了，然而我们还忽略了一件事，就是人类的脑容量和寿命毕竟有限。即便聪明如爱因斯坦，发现相对论前前后后也要耗费数十年。即使再有更聪明的人出生，也得从1+1abc学起，达到爱因斯坦的水平小半辈子也过去了。由于这个限制，纵使人类有超级的学习能力，还是很难让现有知识爆炸性增长的。帮助人类突破这个瓶颈的，正是计算机。人类学习能力强，但记性差，反应慢，还容易坏。计算机虽呆，但容量大，计算快，还稳定怎样融合这两者的优势呢？显然最简单省事的方法就是手把手教会计算机学习了~(是谁说不如植入芯片让人脑变电脑的，你出来，我保证不拿你去做实验（微笑脸）) 那么，应该怎样教会计算机学习呢？人类可以从自己获得的经验中学习知识，然而计算机没法读书万卷也做不到阅人无数，只能从我们投喂给它的数据中学习规律了。我们当然希望计算机学到规律之后立马智商爆表，分分钟就能自己用新知识独当一面啦。不难想象，一旦这个设想成为现实，计算机就能以类似人类的方式解决很多复杂而多变的问题。计算机解决问题与人类思考的经验过程将会趋同，不过它能考虑更多的情况，执行更加复杂的计算，从而产生及其可观的效益。那么问题来了，怎么指导计算机从数据中总结规律呢？几十年来，很多计算机科学和应用数学界的学者们总结出了不少教会计算机的办法，它们就是各式各样的机器学习算法。它们是数据科学家们胯下的挖掘机，担负着将海量数据化腐朽为神奇的使命。至此，我们终于可以对机器学习下这样一个定义了：机器学习是指用某些算法指导计算机利用已知数据得出适当的模型，并利用此模型对新的情境给出判断的过程。由此看来，机器学习的思想并不复杂，它仅仅是对人类生活中学习过程的一个模拟。而在这整个过程中，最关键的是数据，是数据，是数据！重要的事情说三遍。如果说模型是我们希望造出来的火箭，那数据就是它的燃料。数据量直接决定了我们的火箭只是个概念玩具，还是能够载人登月，还是可以飞出太阳系探寻智慧生物。这也是机器学习和大数据是如此密不可分的原因。不得不说在这一点上计算机是远远比不上人脑的。人类学习能力的可怕之处在于，能够通过极其有限的样本归纳出泛化能力极高的准则。要知道，AlphaGo经过和自己左右互搏数千万局才达到现今的棋力，而和他不相上下的李世石，穷其一生打谱恐怕也到不了这个数目的百分之一。正所谓“No data，no intelligence”。事实上，只要数据量足够大，机器学习算法的选择反倒没有那么重要了。打个比方的话，数据和算法之于计算机好比阅历和智商之于人类。丰富的阅历所带来的智慧，自然不是靠一点小聪明就能驾驭得了的啦。AlphaGo就是一个智商20棋龄10000年的老妖精，打败李世石主要靠的是经验。机器学习根据所处理数据种类的不同，可以分为有监督学习，无监督学习，半监督学习和强化学习等几种类型。实践中应用较多的也就是前两种。所谓监督学习，就是说数据样本会告诉计算机在该情形下的正确输出结果，希望计算机能够在面对没有见过的输入样本时也给出靠谱的输出结果，从而达到预测未知的目的。就像一个学生通过做多套高考模拟卷并订正答案的方式来提高高考成绩。在这种情形下，数据就像是监督计算机进行学习的教师，故而得名。根据输出结果是离散值还是连续值，监督学习可以分为分类问题和回归问题两大类。他们在文字、语音、图像识别，垃圾邮件分类与拦截，网页检索，股票预测等方面有着广泛应用。而无监督学习，是指数据样本中没有给出正确的输出结果信息。这就像做了好多套没有答案的模拟卷，最后还要去高考。听上去是不是既惊悚又不靠谱？但其实做没有答案的试卷也是能学到很多有价值的信息的，比方说哪些题出现频率高，那些题爱扎堆考，等等。无监督学习希望从数据中挖掘的正是这一类信息，常见的例子有聚类，关联规则挖掘，离群点检测等等。知乎专栏链接：http://zhuanlan.zhihu.com/p/20791490著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。", "answer_votes": "181", "answer_comment": "​23 条评论"}
{"answer_author": "立冬", "answer_id": 143331334, "answer_text": "f(x)=y机器学习就是得到f", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 142545747, "answer_text": "其实就是拟合一个或者多个函数来解释观测到的一些现象。看起来神秘其实是因为拟合过程很难用现有的理论知识来解释。", "answer_votes": "2", "answer_comment": "​1 条评论"}
{"answer_author": "我是马夫", "answer_id": 287431913, "answer_text": "最近整理近两年所学，做了个脑图。欢迎指教～<img src=\"https://pic3.zhimg.com/50/v2-80382c04b10a1e928c0bf6b23e982cb6_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"1236\" data-rawheight=\"1390\" class=\"origin_image zh-lightbox-thumb\" width=\"1236\" data-original=\"https://pic3.zhimg.com/v2-80382c04b10a1e928c0bf6b23e982cb6_r.jpg\">", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 58101307, "answer_text": "谢邀。一个人有符合当代社会发展的三观，就会为自己、为别人带来正向的收益。机器没有三观，站在我们的视角看，它不会痛不会爽不会恐惧不会欲求，不像我们那样被基因支配着、被社会网络支配着表层认知和潜意识。但是我们可以给它设定三观，设定什么是好的什么是坏的（目标函数），设定什么是可行的什么是不可行的（约束条件），这样就构成了一个最优化问题。各种类型的最优化问题有相应的一些解法，有兴趣可以去看凸优化的书。这些解法以算法的形式表现给机器看，机器照着做。那么，机器按照人们的设定去追求梦想的过程，就叫做机器学习。只有好的三观和方法，是不够的，还要有好的采样。在一个小地方小环境里面，一样正的三观，付出同样多的努力，你的成就和格局相对是非常有限的。所以，要见多识广，读万卷书，行万里路，阅万重人。总结三要素。1. 三观。决定你走向何方。2. 方法。不断反省优化自己的方法，提高靠近目标的效率。3. 采样。既要广，又要密。不一样的采样看到的是不一样的世界。我这是在教做人还是做机器学习？", "answer_votes": "11", "answer_comment": "​5 条评论"}
{"answer_author": "文刀叉点", "answer_id": 58135250, "answer_text": "上面有答友说的很详细了。。。我用最简单的例子来说吧1）百度的识图（图像检索）2）淘宝的给你推荐商品3）各种各样的图像识别（比如前些日子的微软年龄）机器学习，两部分首先是“机器”，这个机器一般其实指的就是“电脑”其次学习，这个学习也分为两部分，一是“数据”而是“算法”其实和人是一样的，比如你父母教你认识“打棒球”这个体育运动的时候。肯定要给你看打棒球的图片或者视频，或者需要跟你描述这个运动这些就是“数据”至于说“算法”的话，描述本身就是一种算法。比如他们告诉你“拿着球棒，这样那样挥舞击球的就是棒球”。这样，在没有他们帮助的情况下，再给你一个新的打棒球的图片，你也认出这是打棒球=====机器学习其中的一个门类也是一样的道理首先输入数据通过预先建立好的一套框架，训练出一个模型对于一个不在训练数据集里的输入我们将之和模型做一系列的操作然后得到一个结果，这个结果可以是一个概率，也可以是一个二值（0，1）从而帮助我们分析这个测试输入上述只是最简单的一个分类的流程。=====机器学习还可以干很多其他的事情但是究其核心，最终总是可以归类到“分类”和“拟合”上面去=====要注意一个最核心的问题机器学习必须要有样本，如果没有训练数据，无从谈起什么学习。所以现在越来越火的什么大数据、数据挖掘之类的东西。正是因为数据量已经太大，使得人类无法处理了。所以才用计算机在数据之间去寻找隐藏其中的规律", "answer_votes": "10", "answer_comment": "​添加评论"}
{"answer_author": "李粒儿", "answer_id": 243827817, "answer_text": "首先机器学习分为：监督式学习，非监督式学习，半监督学习和增强学习下面先讲监督式学习：就是 先给给机器一堆数据（text data），并给这些数据贴上label，告诉机器这是鸡排猪排还是卤味然后engineer结合algorithm（包括决策树，神经网络，支持向量机，最近邻居法，native bayesian classification ，最小二乘法，逻辑回归 ）写出一个program到机器里面。并且告诉机器“以后再遇到数据就往这个公式里面套哦 记住了没”然后机器说“哦  ”半监督非监督和增强等有空更这个图解做的特别好 特 别 的 好 要记得看 圖解機器學習10.14更：讲下非监督式学习：非监督式学习的系统的text data不需要预先贴上标签 ", "answer_votes": "14", "answer_comment": "​8 条评论"}
{"answer_author": "匿名用户", "answer_id": 58182583, "answer_text": "总结过去，预测未来", "answer_votes": "16", "answer_comment": "​添加评论"}
{"answer_author": "石夏星", "answer_id": 117460496, "answer_text": "做了 6 个月的手写识别领域的实习，科普向答案。计算机学界的一大特点，就是命名的能力远超其时代的技术（误）。机器学习真的就是让机器做分类，这既是「学习」的过程也是「学习」的目的。典型的带「识别」二字的功能一般都依赖机器学习来训练识别引擎。例如手写识别和人脸识别。然后这些识别的功能，是不是就是机器在做分类？最后，机器学习我们说是「监督式学习」，也就是说我们要人工定义好希望的分类组别，人工分类一堆学习案例。机器学的就是这些人工分拣的案例。之前 WWDC 期间，在 The Talk Show With John Gruber 上，Gruber 问 Photos 中的机器学习不在服务器端进行，能不能和 Google 的一样好。Craig Federighi 的一个梗「而且其实只是要让电脑认出（照片中）哪里是山，完全不需要用户的照片，（派 MacOS 的命名团队去拍照就可以了）」，说的就是机器学习的样本是提前挑选的。", "answer_votes": "6", "answer_comment": "​1 条评论"}
{"answer_author": "Bruce Lan", "answer_id": 192442431, "answer_text": "<img src=\"https://pic1.zhimg.com/50/v2-7a0db2990c04adec4932426a57179f2e_hd.jpg\" data-rawwidth=\"1089\" data-rawheight=\"809\" class=\"origin_image zh-lightbox-thumb\" width=\"1089\" data-original=\"https://pic1.zhimg.com/v2-7a0db2990c04adec4932426a57179f2e_r.jpg\">深度神经网络是从数据提炼出来的复杂函数构建的网络，而深度指的是神经网络的层数。这个系统是一组简单的可以训练的数学函数集合。<img src=\"https://pic2.zhimg.com/50/v2-858f1970eca29801613c7e478166efcd_hd.jpg\" data-rawwidth=\"1085\" data-rawheight=\"813\" class=\"origin_image zh-lightbox-thumb\" width=\"1085\" data-original=\"https://pic2.zhimg.com/v2-858f1970eca29801613c7e478166efcd_r.jpg\">当输入一张图片，输出是人工标记的猫图片，这就是所谓的监督学习。当你把许多的样本送给系统，它会去学习近似的函数。而非监督学习指的是系统可以根据非指定的图片，用深度学习的“经验”识别出图片中的物品。<img src=\"https://pic3.zhimg.com/50/v2-545d396a7cf980e772dcfbf8dc2359ff_hd.jpg\" data-rawwidth=\"600\" data-rawheight=\"325\" class=\"origin_image zh-lightbox-thumb\" width=\"600\" data-original=\"https://pic3.zhimg.com/v2-545d396a7cf980e772dcfbf8dc2359ff_r.jpg\">为了决定图片中的到底是猫还是狗，需要经过很多层。从最底部的神经元将会看到像素块，而更高层的神经元则会根绝下层的神经元的输出才决定是否工作。模型有可能会出错，但是它会总结错误并在系统中进行调整，下一次输入就可能输出正确的答案。学习算法比较简单选择训练样本运行神经网络在输入后查看它的结果调整后的权重让输出更接近于标签看看神经网络到底是如何工作的？让我们用动图看看神经网络到底是如何工作的？ 1.首先由很多层的神经网络组成整个网络<img src=\"https://pic1.zhimg.com/50/v2-4853ed10d32977c0c188ebca85125e2c_hd.gif\" data-rawwidth=\"540\" data-rawheight=\"304\" data-thumbnail=\"https://pic1.zhimg.com/50/v2-4853ed10d32977c0c188ebca85125e2c_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"540\" data-original=\"https://pic1.zhimg.com/v2-4853ed10d32977c0c188ebca85125e2c_r.gif\">2.最底层的神经网络会先对样品进行学习和判断。<img src=\"https://pic3.zhimg.com/50/v2-37e82ced62228b70a4e2a032cb7df2f6_hd.gif\" data-rawwidth=\"540\" data-rawheight=\"304\" data-thumbnail=\"https://pic3.zhimg.com/50/v2-37e82ced62228b70a4e2a032cb7df2f6_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"540\" data-original=\"https://pic3.zhimg.com/v2-37e82ced62228b70a4e2a032cb7df2f6_r.gif\">3.整个神经网络会进行学习，而深层的神经网络单元会根据前面的单元反馈的结果进行判断。<img src=\"https://pic4.zhimg.com/50/v2-38ffee937cea7eeb49938125a5cbb06a_hd.gif\" data-rawwidth=\"540\" data-rawheight=\"304\" data-thumbnail=\"https://pic4.zhimg.com/50/v2-38ffee937cea7eeb49938125a5cbb06a_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"540\" data-original=\"https://pic4.zhimg.com/v2-38ffee937cea7eeb49938125a5cbb06a_r.gif\">4.不同的学习单元会有不同的判断的结果，但通过重复的学习和纠正（调整策略和权重），最终会提升学习效率和准确性<img src=\"https://pic4.zhimg.com/50/v2-292d5a264e8da62c7eb419e0f9fbc99d_hd.gif\" data-rawwidth=\"540\" data-rawheight=\"304\" data-thumbnail=\"https://pic4.zhimg.com/50/v2-292d5a264e8da62c7eb419e0f9fbc99d_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"540\" data-original=\"https://pic4.zhimg.com/v2-292d5a264e8da62c7eb419e0f9fbc99d_r.gif\">5.经过重复学习后，这类型的图片的特征已经被神经网络记住了，以后这类型的图片也能轻易被识别<img src=\"https://pic3.zhimg.com/50/v2-37a034b55fc0a28c0e76b49c4f368658_hd.gif\" data-rawwidth=\"540\" data-rawheight=\"304\" data-thumbnail=\"https://pic3.zhimg.com/50/v2-37a034b55fc0a28c0e76b49c4f368658_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"540\" data-original=\"https://pic3.zhimg.com/v2-37a034b55fc0a28c0e76b49c4f368658_r.gif\">感兴趣可以看这里：人工智能专家Jeff Dean《大规模深度学习》PPT编译 - 知乎专栏更多文章请到：VC Insights - 知乎专栏更多回答请看：Bruce Lan - 知乎", "answer_votes": "4", "answer_comment": "​添加评论"}
{"answer_author": "宇峰", "answer_id": 143331398, "answer_text": "&lt;img data-rawwidth=\"320\" data-rawheight=\"327\" src=\"https://pic3.zhimg.com/50/v2-ff35ce7af55dd77da613119961e66f96_hd.jpg\" class=\"content_image\" width=\"320\"&gt;Andrew Ng：看看我的课就知道什么是机器学习了", "answer_votes": "4", "answer_comment": "​添加评论"}
{"answer_author": "拉拉拉", "answer_id": 162183247, "answer_text": "前面一些回答有点太知乎体了，回答的不够直接，而且几个太神话机器学习了。  机器学习其实只是统计学里的拟合应用在计算机上的实现，既不神奇，也没那么好用。拟合本身已经有几十年的研究历史了，近10年发展迅速完全是因为计算能力的进步。试想如果验证一个结果都需要等个把月才能看到计算出来的结果，那这个学科显然发展不起来啊。回答里说什么使机器具有学习能力啊，或者可以预测未来啊之类的希望能知其所言，不要言其所知。", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "小鸡仔在漫步", "answer_id": 112430377, "answer_text": "作者：季锐航链接：http://zhuanlan.zhihu.com/p/21675168来源：知乎著作权归作者所有，转载请联系作者获得授权。浅谈机器学习（一）人送外号：小鸡仔在漫步最近爱上了机器学习，自己最近也一直通过查阅网上资料（机器学习的最佳入门学习资源—伯乐在线，很感谢这篇文章给了自己很大的启发），还有斯坦福大学Andrew Ng教授在网络中分享的视频，可以说机器学习完全刷新了自己对世界的看法，作者一直有一个观点：世界的发展应该不断的朝向智能化发展，我这里所说的智能化指的是在我们日常生活中为我们提供便捷服务的东东哦！（当然大家的想法也许会不同），但是我想大家一定很期待周围提供服务的东东居然具备人类的智慧，就像小孩子刚出生通过生活经验的积累，逐渐学会了行走、穿衣、泡妞（哈哈，邪恶一下啦）、生存技能等。现在，无论电影里还是小说里那个机器时代真的更进一步啦，我对机器学习现在浅显的理解就是让我们的生活更加舒服、自然(先直白的讲)。当然通过阅读上面所说的网络资料得知，对机器学习的深度理解应该是：成功的机器学习应用不是拥有最好的算法，而是拥有最多的数据！      作者现在是在校的本科生，大学四年做过一丢丢的实际项目，作者是搞控制的，做过一段四旋翼飞行器的控制器设计还有路径规划问题，其实我之前对做实际系统的立即是把我们的思想撰写成逻辑代码，如果系统遇到了指定的问题，根据我们之前定好的逻辑关系告诉系统应该采取什么措施，(当然啦，比如看见一个刚出浴的妹子，你的逻辑是什么呢。。。哈哈  自己YY去吧)。但是也许我们所设计出来的东东也许仅仅停留在现在的阶段啦，比如见到上面所说的情景，你比较小的时候也许（还会）闭上眼睛哦！！（也不排除个别情况），但是随着你不断地“学习”，总有一天。。。。（当然啦，作者可是可以纹丝不动，哈哈啊哈哈），这个就是我们成长的过程（怎么感觉自己这么邪恶。。。），所以我们怎么可以让我们设计出来的系统仅仅能够满足当前呢，我们应该根据我们成长的环境，不断的总结经验（到底要不要，要不要***上*），让我们的系统也和我们一样能够不断的学习和进步！这就是我对机器学习的理解，其实就是通过大量的数据（生活的经验等），让我们的系统具有学习的能力。如果你看到这里我想应该已经差不多明白了作者所说的机器学习的核心思想是：不是靠多么牛叉的算法，而是靠大数据！！（这词一听逼格就很高）。      以上都是自己对机器学习的理解，当然啦如有表达不当还请大家多多指正！如有自己独特的见解可以留言，一起学习哦！对啦，原谅作者对邓紫棋的喜欢，哈哈哈！！！再次对（机器学习的最佳入门学习资源—伯乐在线）这篇文章表示感谢，文章仅供学习，交流使用，绝无商业用途！！！！如果对你有帮助还请大家点赞哦！！！！", "answer_votes": "2", "answer_comment": "​3 条评论"}
{"answer_author": "智易科技", "answer_id": 269125669, "answer_text": "未经允许，请勿转载！如需转载，请联系微信公众号：【智易AI】（ID：Zhiyi_AI）---------------------------------------------------我们每个人每天都在生产着数不清的各种数据，图片、音视频、各种图表、代码等等，这些都是数据，它们不断飞速增长，丝毫没有停下来的迹象。<img src=\"https://pic1.zhimg.com/50/v2-255bb8ad215836e2ff3ea7ff50ee3ebf_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"1200\" data-rawheight=\"646\" class=\"origin_image zh-lightbox-thumb\" width=\"1200\" data-original=\"https://pic1.zhimg.com/v2-255bb8ad215836e2ff3ea7ff50ee3ebf_r.jpg\">而机器学习让这一切数据有了重要意义。英国未来学家Arthur.C.Clarke曾有一句名言：“任何足够先进的科技与魔术别无二致。”<img src=\"https://pic4.zhimg.com/50/v2-05ff4ba12f19a8ce05edf4ae4b30defc_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"640\" data-rawheight=\"320\" class=\"origin_image zh-lightbox-thumb\" width=\"640\" data-original=\"https://pic4.zhimg.com/v2-05ff4ba12f19a8ce05edf4ae4b30defc_r.jpg\">但机器学习并不是要成为魔术，它是一种工具和技术，我们可以用它来结合数据回答问题。它是计算机科学家们想让计算机像人一样思考，进而研发出来的一种用数据或以往的经验来优化计算机程序的技术。生活中，机器学习其实早就已经环绕在你身边了。当你在搜索引擎搜索的时候，机器学习来帮助搜索引擎判断哪个结果更适合你（也在判断哪个广告更适合你）；当你在下班路上打开网易云音乐的FM，立马跳出一首你第一次听但你却很喜欢的歌曲，因为这是网易云音乐通过学习你平时听歌习惯所推荐的歌。<img src=\"https://pic2.zhimg.com/50/v2-e7b91a3b04a61c5bbfc2fe72fca5912e_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"597\" data-rawheight=\"302\" class=\"origin_image zh-lightbox-thumb\" width=\"597\" data-original=\"https://pic2.zhimg.com/v2-e7b91a3b04a61c5bbfc2fe72fca5912e_r.jpg\">以前让计算机去做什么事情的唯一方法就是输入命令告诉计算机如何实现。但机器学习算法并不是这样，它们会自己找到答案。换句话说，在机器学习中，并不是我们给机器编程，而是机器自己给自己编程。现如今，各种各样的企业都可以被AI所赋能，金融、零售、互联网、教育......任何行业都可以实现「AI+行业」，但许多行业目前正面临着AI人才和技术两大门槛的挑战。智易科技通过自身独创的一站式AI研发与应用云服务平台，帮助企业更加简单便捷地进行AI应用的开发与部署，低成本拥有人工智能，从而获得更大的商业价值。<img src=\"https://pic1.zhimg.com/50/v2-acd5e37039afa68f6029e15e2c2830e0_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"1280\" data-rawheight=\"374\" class=\"origin_image zh-lightbox-thumb\" width=\"1280\" data-original=\"https://pic1.zhimg.com/v2-acd5e37039afa68f6029e15e2c2830e0_r.jpg\">机器学习不仅仅只有一种方法，实现它的方法多种多样，这里所说的方法，在程序语言中，我们叫做算法。目前所有机器学习的算法，大概可以被分为以下几类。监督学习如果在学习的过程中，我们不断向计算机提供数据和这些数据所对应的值。例如给计算机看吉他和尤克里里的图片，并告诉计算机哪些图片里的是吉他，哪些图片里的是尤克里里，然后再让他们学习去分辨从未见过的吉他和尤克里里。通过这些指引的方式，让计算机学习我们是如何把这些图片数据对应上图片所代表的物体，也就是让计算机学习这些标签可以代表哪些图片。这种方式叫做监督学习。<img src=\"https://pic1.zhimg.com/50/v2-af6e922cb81b1307d5f0268138037c94_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"640\" data-rawheight=\"427\" class=\"origin_image zh-lightbox-thumb\" width=\"640\" data-original=\"https://pic1.zhimg.com/v2-af6e922cb81b1307d5f0268138037c94_r.jpg\">在零售行业，零售商能够通过消费者的一系列行为，了解消费者的购买偏好。机器学习这些消费者的购买数据之后，可以为零售商提供销量预测及消费者最可能购买的商品的最佳建议，从而优化供应链，实现0库存，获取更大的利润。<img src=\"https://pic3.zhimg.com/50/v2-194a33f301270bb9b988dbb60337ddea_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"1280\" data-rawheight=\"853\" class=\"origin_image zh-lightbox-thumb\" width=\"1280\" data-original=\"https://pic3.zhimg.com/v2-194a33f301270bb9b988dbb60337ddea_r.jpg\">无监督学习如果同样在这种学习过程中，只提供给计算机吉他和尤克里里的照片，而并没有告诉他哪些是吉他，哪些是尤克里里，取而代之的是，我让它自己去判断和分类。让他总结出这两种类型图片的不同之处，这就是一种无监督学习。在这种学习中，我们可以不用提供数据所对应的标签信息。计算机通过观察各种数据之间的特性，会发现这些特征背后的规律，例如尤克里里只有四根弦，而吉他拥有六根弦。这些规律也就是通过无监督学习的方法所学到的东西。半监督学习还有一种方法综合了监督学习和无监督学习的特征，它主要考虑如何利用少量有标签的样本和大量没有标签的样本进行训练和分类。强化学习如果把计算机丢到一个对于他完全陌生的环境或者让他完成一项从未接触过的任务，他自己会去尝试各种的手段，最后让自己去成功适应这样一个陌生的环境，或者学会完成这件任务的方法途径，这就叫强化学习。 比如说我想训练机器人打台球，我只需要告诉它基本规则，让他自己去尝试各种各样的击球方法。在开始阶段，他的命中率可能会非常低，不过他会像人类一样，自己总结失败或成功的经验，最后成为一个超强的“台球选手”。（PS：Google DeepMind开发的AlphaGo中也应用了强化学习。）<img src=\"https://pic1.zhimg.com/50/v2-6fd12e7c360508f6406607fd5de37fd2_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"640\" data-rawheight=\"363\" class=\"origin_image zh-lightbox-thumb\" width=\"640\" data-original=\"https://pic1.zhimg.com/v2-6fd12e7c360508f6406607fd5de37fd2_r.jpg\">在拥有海量数据的某些行业（如金融行业），除了那些强相关的数据，我们也会去使用很多的弱相关的数据来帮助做决策。这种弱相关数据来源多样化，有些来自用户的行为数据，有些来自用户的浏览记录... 他们之间存在的非线性关系使得风险评估变得非常复杂。而这些条件使得深度学习模型在风险评估上拥有独一无二的优势。除了风险评估外，在反欺诈、舆情分析、高频交易上深度学习也能发挥很好的作用。<img src=\"https://pic2.zhimg.com/50/v2-6a810338f13b7e887c39db18c89b6875_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"517\" data-rawheight=\"300\" class=\"origin_image zh-lightbox-thumb\" width=\"517\" data-original=\"https://pic2.zhimg.com/v2-6a810338f13b7e887c39db18c89b6875_r.jpg\">这里只是高度概括了一下机器学习的定义及其主要的几个分类，机器学习是一个非常广泛的领域，涉及从数据中推断答案所用的全部技术。数据是推动机器学习发展的基石，而机器学习是打开数据隐含意义的钥匙。关于智易科技智易科技是一家具有海归背景的AI技术与服务提供商，团队来自于Google、Apple、微软、阿里巴巴等国内外顶级IT公司，在云计算和AI领域深耕多年，具备国际顶尖的机器学习技术。智易通过打造一款独创式的一站式AI研发与应用云服务平台，帮助企业更加简单便捷地进行AI应用的开发与部署，低成本拥有人工智能，从而获得更大的商业价值。目前公司已获得国内数家顶级基金的数百万美元天使投资。 ", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "岂安科技", "answer_id": 267364593, "answer_text": "关于机器学习，搜索引擎给出的回复是这样的：机器学习(Machine Learning, ML)是一门多领域交叉学科，涉及概率论、统计学、逼近论、凸分析、算法复杂度理论等多门学科……然而，我对这样专业的解释并不能完全理解，于是，我暗戳戳的去咨询了一下对机器学习颇有研究的高级售前顾问小周天，然后他整理了一下，有了以下的回复：这么说吧，机器学习算法可以不再让你明确地给出执行步骤或判断规则，而让电脑根据输入数据自己创建规则并处理问题。➤ 整点儿实际的：考虑下如何区分垃圾邮件？首先是不是想到的要来个关键词过滤？通过编写一些规则来筛选判断：if 匹配到关键字去垃圾箱，else 去收件箱。我们所有的精力都会花在写这些过滤条件上。写了几百条以后感觉差不多了，可发件人又换说法了，金三胖进化成了胖三金，胖三金进化成了三月半。逼得我们不断地要对过滤条件进行更新。<img src=\"https://pic4.zhimg.com/50/v2-e619a0fc98c2da3d840fea0f86cd52a1_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"640\" data-rawheight=\"277\" class=\"origin_image zh-lightbox-thumb\" width=\"640\" data-original=\"https://pic4.zhimg.com/v2-e619a0fc98c2da3d840fea0f86cd52a1_r.jpg\">能不能有一种方法能让机器自己总结这些敏感词（特征）就像歌里唱的 “当你看着我我没有开口已被你猜透”？机器学习的有趣之处正是与此。它的玩法是这样的：首先我们需要准备大量已经经过区分的邮件。然后把这些区分好的邮件喂给一个现成的无需二次开发的机器学习算法。机器学习算法可以通过识别两组邮件的区别来创建自己的规则或模型，这一阶段叫做机器训练。当模型准备完成后，当再次输入未经区分的邮件时，机器学习算法即可按照模型的规则来自主判断区分邮件。<img src=\"https://pic4.zhimg.com/50/v2-12037ca5b7524827565662a39987a7ec_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"640\" data-rawheight=\"238\" class=\"origin_image zh-lightbox-thumb\" width=\"640\" data-original=\"https://pic4.zhimg.com/v2-12037ca5b7524827565662a39987a7ec_r.jpg\">在程序员的欢呼声还没停下时，我要说，然鹅，这都不算什么。更让人惊喜的是同样这个区分邮件的机器学习算法，不只可以用来区分邮件，当你把输入的数据换成了验证码图片，它又可以被用来训练识别验证码，而你不用为此算法去多改一行代码。这个给定分类数据的学习方式的例子，可以说既解释了机器学习又解释了监督学习了更多关于机器学习的实例、干货请关注微信公众号：bigsec", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "ASTRI", "answer_id": 195033827, "answer_text": "学校跟导师做了一段时间机器学习,下面是学渣版的回答～<img src=\"https://pic4.zhimg.com/50/v2-66980593f9349dd829240c9279e03b81_hd.jpg\" data-rawwidth=\"466\" data-rawheight=\"4610\" class=\"origin_image zh-lightbox-thumb\" width=\"466\" data-original=\"https://pic4.zhimg.com/v2-66980593f9349dd829240c9279e03b81_r.jpg\">", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "花京华", "answer_id": 142715766, "answer_text": "简单一句话，根据已有信息，通过一种数学方法，去推测未知的信息。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "e不同", "answer_id": 137145948, "answer_text": "对于小白来说，我认为最简单的理解“机器学习”，应该是这样：1、什么是机器学习机器学习是程序员通过设计一些算法，让机器（程序）来模仿人的一些能力。2、为什么机器学习是人设计的算法，能力又能超过人？很简单，比如无人驾驶，在程序中设计了十万种可能遇到的情况及处理办法。其中一种，比方说高速公路上前车急刹，人来驾驶，完全凭感觉，来控制刹车的轻重和时机，在那么短的时间内，人有时候的分析是错误的，即便是正确的，但却受制于机体的反应速度，可能会导致操作偏离原本预估，就会造成追尾。但是如果机器来控制，它就可以调用大量的数据，分析前车刹车距离，自身的速度，车辆的制动距离，后车的距离和速度等等，在极短的时间内分析完成，并准确无误地执行制动方案。这个时候，机器的能力是超过人的，也就达到了所谓的“人工智能”了。3、机器学习不是说机器在进化，只是机器调用大数据，拥有了比人更多的处理办法，从而得到了比人处理某件事情更好的效果。（PS.非专业人士，最近在了解人工智能和机器学习的知识，原先的茅塞因想通以上而顿开，望大神指正。）", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 58122159, "answer_text": "笼统地说，机器学习就是让机器通过一些历史的数据，不断地学习出新的知识，比如预测、推荐、分类等等，再通过学习效果的反馈再反过来纠正自身错误。", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "方凯", "answer_id": 154429976, "answer_text": "机器学习指的是一门多领域交叉学科，涉及概率论、统计学、逼近论、凸分析、算法复杂度理论等多门学科。专门研究计算机怎样模拟或实现人类的学习行为，以获取新的知识或技能，重新组织已有的知识结构使之不断改善自身的性能。\n它是人工智能的核心，是使计算机具有智能的根本途径，其应用遍及人工智能的各个领域，它主要使用归纳、综合而不是演绎。可以去马克威算法交易平台看一下。\n ", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "terryfi", "answer_id": 131619674, "answer_text": "我想这篇文章从实现的角度说明了什么是机器学习机器学习的最佳入门学习资源 - 文章 - 伯乐在线", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "卢文龙", "answer_id": 287397497, "answer_text": "我觉的可以把机器学习拆解成3个部分来看。任务、模型、特征。常见的任务包括：分类、回归、聚类、异常检测、排序等。常见的模型包括：线性模型、支持向量机、树模型、神经网络等。特征包括：统计特征、业务特征（基于人的主观经验提取的特征）、自动提取的特征（如卷积）等。大部分机器学习都可以理解为在上述三个部分中组合。例如图片识别。首先是个分类任务，其次，常见的模型都是神经网络模型，但之所以成为深度学习，是因为在特征环节不是人工提取特征，而是有很多卷积层、池化层等自动提取，加深了网络深度。而更多的数据，既大数据，是因为提供了更多特征提取的素材，因为在一个机器学习任务中，特征决定了你能达到的高度，而模型只是尽量逼近这个绝对高度。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "挖鼻屎", "answer_id": 277927081, "answer_text": "我有全套机器学习视频，微：houlaosan222", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "林滨", "answer_id": 275021651, "answer_text": "在定义什么是机器学习之前，我们要先弄明白学习是什么。毛主席说好好学习，天天向上。这就是说学习是一个向上变好的过程。那么怎样才能向上变好呢？婴幼儿通过听爸爸妈妈的语言学习说话；小朋友们通过不断地观察周边认识世界；学生们通过阅读书本听老师讲解掌握知识。这些学习的前提都是需要一定数量的外界输入才能完成。所以，我们可以给“学习”一个定义：通过一定数量的外界输入在某个技能上达到提升效果的过程。弄清楚了学习的定义，机器学习也就很简单了。对机器来说，外界的输入就是数据；技能可以是搜索，识别，分类等等，提升效果可以是变快了，变精确了等等。 那我们可以定义说：“机器学习”是机器从外界提供的大量数据中学习某种模式从而使某一技能的表现获得提升的过程。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 274482483, "answer_text": "机器学习是人类构建人工智能的诺亚方舟一种方法啦，机器学习是可以让计算机通过数据和经验学习能够处理某些特定的问题，比如人脸识别，图像分类，语音识别，自然语言理解等等。。。。。。", "answer_votes": "0", "answer_comment": "​添加评论"}
