{"question_id": "37256015", "question_text": "本人研一，目前已经将机器学习的基础知识部分以及学习了不少，目前深入学习包括了《PRML》、《统计学习方法》、《矩阵论》、《最优化方法》、吴恩达《机器学习》视频、部分《凸优化》、《数字图像处理》；[PS:本人有c/c++/matlab/java的语言基础，python还没有用过；]我目前还没有任何机器学习方面的实践经验，不知道接下来我改如何学习，如何进阶到更高的层次，求大神分享经验！", "question_title": "机器学习、数据挖掘 如何进阶成为大神？", "question_commet": "​6 条评论", "answer_number": "75 个回答", "question_followers": "7,011", "brower_number": "336,417"}
{"answer_author": "Luau Lawrence", "answer_id": 85500530, "answer_text": "现在知乎上越来越多的Data Mining/Machine Learning的回答都是在推荐Coursera公开课、推荐PRML/ESL/MLAPP、推荐好好看书听课做习题，其实这些内容和步骤是有一定局限性的，不适合出现在DM/ML进阶的问题中。一是Coursera的公开课太简单，偏向于入门，对于有一定基础的同学来说信噪比太低，讲得大多数都是已经知道的东西，我自己也曾经尝试过为了追求知识体系的完整性而去从头学一些东西，最后发现效率实在是太低了所以作罢；二来是题主已经看完了该看的书籍，也懂得怎么去找书刷习题。一般寻求进阶的同学，不是不知道看书刷题听课，而是这些手段对他们来说提高已经很有限了。我个人的建议，如果想走industry track，就好好去找人内推你去实习，这是最快的办法。工作中有许许多多比你厉害的人有踩过无数雷坑的senior，向他们学习比看书看公开课效率高多了，而且还可以积攒你以后会用到的人脉，强调一下，人脉这个东西真的很重要，即使在相对来说更崇尚技术的计算机行业。尽量在实习期间撸一个完整的项目，不管是对你的career，还是对你对技术的理解，都是大有帮助的。如果走research track，选一个细一点的方向，for example，increamental learning, LDA, entity recognition等等，然后多去读paper发paper（发paper的话，灌水要适度，更重要的是打基础）。有时候即使看了书做了习题，那也是别人写的书别人设计的习题，真实的情况中有大大小小的坑等着你，等到你真正拿着书上的东西去做一篇paper出来才会发现自己之前知道的实在太少了，发paper是一个非常有益的提升自己的事情。另外还要广泛涉猎各种书籍，可以是关于DM/ML的，也可以是关于抽样与统计推断的，也可以是关于热力学和复杂网络的，多去读多去看，往杂了学，提高自己整体的科学素养。基础打好了，等到读PhD的时候产出就会特别高。评论有提到一个问题，如果毕业想去企业但是在读期间导师又不让实习怎么办？先争取把导师的任务完成得尽善尽美看能不能争取去实习，不能的话，就找几个靠谱的小伙伴一起刷比赛吧，也是蛮好的。", "answer_votes": "433", "answer_comment": "​49 条评论"}
{"answer_author": "马超", "answer_id": 268151326, "answer_text": "不妨看看 xlearn 的源码。在机器学习里，除了深度学习和树模型 (GBDT, RF) 之外，如何高效地处理高维稀疏数据也是非常重要的课题，Sparse LR, FM, FFM 这些算法被广泛运用在实际生产和kaggle比赛中。现有的开源软件例如 liblinear, libfm, libffm 都只能针对特定的算法，并且可扩展性、灵活性、易用性都不够友好。基于此，我在博士期间开发了 xLearn，一款专门针对大规模稀疏数据的机器学习库，曾在之前 NIPS 上做过展示。经过打磨，现开源 https://github.com/aksnzhy/xlearn。我们的 vision 是将 xLearn 打造成和 xgboost，MXNet一样的工业事实标准。<img src=\"https://pic2.zhimg.com/50/v2-f3f5208c313e82ab90bd5a5b10c67890_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"750\" data-rawheight=\"703\" class=\"origin_image zh-lightbox-thumb\" width=\"750\" data-original=\"https://pic2.zhimg.com/v2-f3f5208c313e82ab90bd5a5b10c67890_r.jpg\">相比于已有的软件，xLearn的优势主要有（1）通用性好，我们用统一的架构将主流的算法（lr, fm, ffm 等）全部囊括，用户不用再切换于不同软件之间。（2）性能好。xLearn由高性能c++开发，提供 cache-aware 和 lock-free learning，并且经过手工 SSE／AVX 指令优化。 在单机MacBook Pro上测试 xLearn 可以比 libfm 快13倍，比 libffm 和 liblinear 快5倍（基于Criteo CTR数据 bechmark）。<img src=\"https://pic1.zhimg.com/50/v2-59e6792cb1297850c236194c379bdba5_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"750\" data-rawheight=\"980\" class=\"origin_image zh-lightbox-thumb\" width=\"750\" data-original=\"https://pic1.zhimg.com/v2-59e6792cb1297850c236194c379bdba5_r.jpg\">（3）易用性和灵活性，xLearn 提供简单的 python 接口，并且集合了机器学习比赛中许多有用的功能，例如：cross-validation，early-stopping 等。除此之外，用户可以灵活选择优化算法（例如，SGD，AdaGrad, FTRL 等）<img src=\"https://pic3.zhimg.com/50/v2-a9c56903cf5fddac60c653d2c4d045c6_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"750\" data-rawheight=\"661\" class=\"origin_image zh-lightbox-thumb\" width=\"750\" data-original=\"https://pic3.zhimg.com/v2-a9c56903cf5fddac60c653d2c4d045c6_r.jpg\">(4) 可扩展性好。xLearn 提供 out-of-core 计算，利用外存计算可以在单机处理 1TB 数据。除此之外，xLearn 也提供分布式训练功能。这里我希望更多的朋友加入这个开源项目！", "answer_votes": "137", "answer_comment": "​15 条评论"}
{"answer_author": "阿里云云栖社区", "answer_id": 249328580, "answer_text": "机器学习是计算机科学的一个子领域，在人工智能领域，机器学习逐渐发展成模式识别和计算科学理论的研究。从2016年起，机器学习到达了不合理的火热巅峰。但是，有效的机器学习是困难的，因为机器学习本身就是一个交叉学科，没有科学的方法及一定的积累很难入门。本文通过系统的分析上百篇翻译博客，制成了机器学习必备手册，本手册一定会帮助你走向你自己的“人生巅峰”。手册包含如何入门机器学习，机器学习流行算法，机器学习实战等等。一．机器学习入门篇：1．让你少走弯路：这有一份开展机器学习的简短指南摘要：本文分享了一份简单的关于开展机器学习的心得体会，目的是给初学者提供基本的指导，主要讲解了建立系统、选择合适的评价指标、数据处理、系统优化等内容，帮助初学者少走一些弯路。2. 机器学习的入门“秘籍”摘要：机器学习已经成为当下最火热的技术之一，对于初学者来说，如何快速入门机器学习是至关重要的。本文属于入门级宝典，高手请绕道！3. 会玩超级玛丽，机器学习能有多难？摘要：小白也能看懂机器学习？这篇文章用超级玛丽的原理教会你，到底什么是机器学习，让尖端科技不再艰深难懂。4. 机器学习能为你的业务做什么？有些事情你肯定猜不到！（机器学习入门第一篇）摘要：机器学习是一项令人难以置信的技术，你需要了解很多很多的基础知识，以使得业务功能尽可能的不受复杂算法的影响，让你能够提出正确的问题、了解机器学习模型开发过程、成立一个团队以促进学科间的不断合作，而不是把数据科学视为一个产生奇迹的黑匣子。5. 关于机器学习算法 你需要了解的东西（机器学习入门第二篇）摘要：对学习算法进行分类是基于构建模型时所需的数据：数据是否需要包括输入和输出或仅仅是输入，需要多少个数据点以及何时收集数据。根据上述分类原则，可以分为4个主要的类别：监督学习、无监督学习、半监督学习和强化学习。6. 如何开发机器学习模型？（机器学习入门第三篇）摘要：创建一个优秀的机器学习模型跟创建其他产品是一样的：首先从构思开始，把要解决的问题和一些潜在的解决方案放在一起考虑。一旦有了明确的方向，就可以对解决方案进行原型化，然后对它进行测试以确定是否满足需求，不妨看看本文是如何一步一步实现的。7.如何高效运作机器学习团队（机器学习入门第四篇）摘要: 一个“传统”的产品团队由设计师、工程师和产品经理组成，而数据分析师有时也会包含在其中，但大多数情况下是多个团队共享这个稀缺资源。在机器学习团队中又会有哪些角色和组织结构呢，本文为你揭晓。8.机器学习会产生哪些用户体验问题？（机器学习入门第五篇）摘要：许多机器学习算法都是黑匣子：输入大量的数据，然后获得一个以某种神秘方式工作的模型。这使得很难向用户解释机器学习的结果。在许多算法中，还存在着交互效应，这使得模型更加难以解释了。你可以把这个看成是特征之间的复合效应，特征之间以多种奇怪而又复杂并且不为人类所理解的方式结合在一起，整体效应大于各个部分效应。9. 简单自学机器学习理论——引言 (Part I)摘要：本篇文章是\"机器学习理论\"三部曲中的第一部分，主要介绍学习机器学习的动机及基本理论知识，详细介绍机器学习所学习的问题、泛化误差以及学习问题是否可解的公式化表示，为初步研究机器学习的人员介绍了机器学习的基本处理过程。10. 简单自学机器学习理论—— 泛化界限 (Part II )摘要：本篇文章是\"机器学习理论\"三部曲中的第二部分，主要介绍独立同分布、大数法则及hoeffding不等式等基本数学知识，详细推导了泛化界限及其分解。11. 简单自学机器学习理论——正则化和偏置方差的权衡 (Part III )摘要：本篇文章是\"机器学习理论\"三部曲中的第三部分，主要介绍方差分解以及目标函数的正则化，通过仿真可以看到，引入正则化项限定了学习问题的解决方案范围。12. 入门级攻略：机器学习 VS. 深度学习摘要：本文以浅显易懂的语言介绍了机器学习和深度学习的定义及应用，以及在源数据要求，硬件支持，特征工程、问题解决方式、执行时间及可解释性等方面的区别，对于新手入门有很大启示意义。13. 增强学习小白？本文带你入门了解增强学习摘要：入门一件新事物总是会有些无从下手的，看了本文希望可以给大家一些帮助和了解。14.这10本由浅入深的好书，或让你成为机器学习领域的专家摘要：机器学习是个跨领域的学科，而且在实际应用中有巨大作用，但是没有一本书能让你成为机器学习的专家。在这篇文章中，我挑选了10本书，这些书有不同的风格，主题也不尽相同，出版时间也不一样。因此，无论你是新手还是领域专家，定能找到适合你的。15.想知道机器学习掌握的怎么样了吗？这有一份自测题（附答案和解析）摘要：人类对于自动化和智能化的追求一直推动着技术的进步，而机器学习这类型的技术对各个领域都起到了巨大的作用。随着时间的推移我们将看到机器学习无处不在从移动个人助理到电子商务网站的推荐系统。即使作为一个外行你也不能忽视机器学习对你生活的影响。本次测试时面向对机器学习有一定了解的人。16. 送机器学习电子书——(TensorFlow)RNN入门摘要：本文作者正在写自己的新书Machine Learning with TensorFlow，这篇博文只是他新书的一小部分，作者用简单的语言介绍了RNN，不用一个小例子介绍了如何使用Tensorflow中内置的RNN模型进行预测。17. 适合入门的8个趣味机器学习项目摘要：还在为找不到机器学习入门练手项目而感到无奈吗？本指南中，将给大家带来8个适合初学者学习的有趣的机器学习项目，简单易学，相信会增添大家学习机器学习的信心。18. 机器学习快速入门：你必须知道的三大算法摘要：每天霸占新闻头条的“机器学习”，想入门，先看懂这三大算法。二．机器学习算法篇：1.快速选择合适的机器学习算法摘要：机器学习初学者可以通过本文了解如何快速找到合适的机器学习算法。2.多重角度解读：贝叶斯推理是怎么工作的摘要：本文首先介绍了贝叶斯的起源，并利用简单的例子生动形象地讲解了贝叶斯定理是如何工作的，解释了其基本原理以及公式的物理含义。3.简单通俗易懂：一个小例子完美解释Naive Bayes（朴素贝叶斯）分类器摘要：Naive Bayes分类器的解释有很多，但是基于一个小例子来解释的不多，本文就是基于一个简单通俗易懂的小例子来解释Naive Bayes分类器。4.“学”、“习”二合一：监督学习——支持向量机（SVM）入门摘要：SVM是机器学习中有监督学习的一种，通常用来进行模式识别、分类、以及回归分析。本文用一个小例子简介SVM，言简意赅，通俗易懂。5.机器学习利器——决策树和随机森林摘要: 机器学习是当下最火的领域，本文通过一个小例子介绍了其核心算法：决策树和随机森林。6.基于图的机器算法 （一）摘要：基于图的机器算法学习是一个强大的工具。结合运用模块特性，能够在集合检测中发挥更大作用。7.基于图的机器算法 （二）摘要：基于图的机器算法学习是一个强大的工具。结合运用模块特性，能够在集合检测中发挥更大作用。本文是基于图的机器算法系列文的第二篇。8.简单易学！一步步带你理解机器学习算法——马尔可夫链蒙特卡罗（MCMC）摘要：对于简单的分布，很多的编程语言都能实现。但对于复杂的分布，是不容易直接抽样的。马尔可夫链蒙特卡罗算法解决了不能通过简单抽样算法进行抽样的问题，是一种实用性很强的抽样算法。本文将简明清晰地讲解马尔可夫链蒙特卡罗算法，带你理解它。9.进阶隐式矩阵分解——探讨如何实现更快的算法摘要：本文重点是围绕Conjugate Gradient（共轭梯度）方法来探讨更优的矩阵分解算法。10.纯干货|机器学习中梯度下降法的分类及对比分析（附源码）摘要：本文详细介绍了基于使用数据量的多少，时间复杂度以及算法准确率的不同类型的梯度下降法，并详细说明了3种梯度下降法的比较。11.深度学习网络大杀器之Dropout（I）——深入解析Dropout摘要：本文详细介绍了深度学习中dropout技巧的思想，分析了Dropout以及Inverted Dropout两个版本，另外将单个神经元与伯努利随机变量相联系让人耳目一新。12.深度学习网络大杀器之Dropout（II）——将丢弃学习视为集成学习之我见摘要：本文分析了可以将丢弃学习当作是集成学习。在集成学习中，可以将一个网络划分成若干个子网络，并且单独训练每个子网络。在训练学习后，将每个子网络的输出进行平均得到集成输出。另外，展示了丢弃学习可以看成是在每次迭代中不同隐藏节点集合的集成学习表现，同时也展示了丢弃学习有着与L2正则化一样的效果。13.神经网络常用激活函数对比：sigmoid VS sofmax（附python源码）摘要：本文介绍了神经网络中的两种常用激活函数——softmax与sigmoid函数，简单介绍了其基本原理、性质及其使用，并用python进行了实例化演示，在文章的最后总结了两种激活函数的区别。14.新颖训练方法——用迭代投影算法训练神经网络摘要：本文介绍了一种利用迭代投影算法对神经网络进行训练的方法，首先介绍了交替投影的基础知识，说明投影方法是寻找非凸优化问题解决方案的一种有效方法；之后介绍了差异图的基础知识，将差异图与一些其他算法相结合使得差分映射算法能够收敛于一个好的解决方案；当投影的情况变多时，介绍了分治算法，最后将迭代投影算法应用到神经网络训练中，给出的例子实验结果表明效果不错。15.车辆追踪算法大PK：SVM+HOG vs. YOLO摘要：本文通过SVM+HOG算法，YOLO算法实现车辆检测和跟踪准确性和速度的对比，得出YOLO算法更具优势的结论。16.什么是视频向量化？本文带你了解基于DeepWalk的视频推荐摘要：本文简要讲述了视频向量化，对DeepWalk的算法进行简单的解释。17.比PCA降维更高级——（R/Python）t-SNE聚类算法实践指南摘要: 本文介绍t-SNE聚类算法，分析其基本原理。并从精度上与PCA等其它降维算法进行比较分析，结果表明t-SNE算法更优越，本文最后给出了R、Python实现的示例以及常见问题。t-SNE算法用于自然语音处理、图像处理等领域很有研究前景。18.随机森林 VS 梯度提升机——模型融合之我见摘要：本文节选自Quora社区上“When would one use Random Forests over Gradient Boosted Machines (GBMs)?”问题的回答，几位博主就随机森林(Random Forests)与梯度提升机(Gradient Boosted Machines, GBMs)的适合场景以及优缺点展开了讨论。三．机器学习常用库：1.倚天遇到屠龙：LightGBM VS xgboost谁才是最强的梯度提升库？摘要：很多人把XGBoost比作屠龙刀，LightGBM比作倚天剑，那么当倚天遇到屠龙，谁更强呢？2.即学即用：Pandas入门与时间序列分析摘要：这篇文章是Alexander Hendorf 在PyData Florence 2017上做的报告。报告前半部分主要为初学者介绍Pandas的基本功能，如数据输入/输出、可视化、聚合与选择与访问，后半部分主要介绍如何使用Pandas进行时间序列分析，源代码亲测可用。3.俄罗斯最大搜索引擎Yandex开源了一款梯度提升机器学习库CatBoost摘要：俄罗斯搜索巨头Yandex宣布，将向开源社区提交一款梯度提升机器学习库CatBoost。它能够在数据稀疏的情况下“教”机器学习。特别是在没有像视频、文本、图像这类感官型数据的时候，CatBoost也能根据事务型数据或历史数据进行操作。4.Netflix开源面向稀疏数据优化的轻量级神经网络库Vectorflow摘要：在Netflix公司，我们的机器学习科学家在多个不同的领域处理着各种各样的问题：从根据你的爱好来定制电视和推荐电影，到优化编码算法。我们有一小部分问题涉及到处理极其稀疏的数据；手头问题的总维度数很容易就能达到数千万个特征，即使每次要看的可能只是少数的非零项。5.Python高性能计算库——Numba摘要：在计算能力为王的时代，具有高性能计算的库正在被广泛大家应用于处理大数据。例如：Numpy，本文介绍了一个新的Python库——Numba， 在计算性能方面，它比Numpy表现的更好。6.第二热门语言：从入门到精通，Python数据分析库大全摘要：本文介绍了一些常见的用于数据分析任务的Python库，如Numpy、Pandas、Matplotlib、Scikit-learn以及BeautifulSoup等，这些工具库功能强大，便于上手。有了这些帮助，数据分析会变得分外简单。7.新工具——TensorLayer：管理深度学习项目的复杂性摘要：本文介绍了一种新基于TensorFlow的python库——TensorLayer，它能够有效的帮助开发者管理好自己的深度学习网络。并且它还提供了很多功能强悍的API，帮助开发者更好的完成任务。8.Pandas并非完美无缺摘要：我们一直使用Pandas，但是却不知道关于Pandas的细节。Pandas开发者深度复盘Pandas，指出了十大关键性问题，并通过介绍了如何使用Apache Arrow来解决这些问题。9. 关于Numba你可能不了解的七个方面摘要：目前Numba正被开始流行使用来加速Python程序，本文讲解了七个大家可能不了解的方面，希望对大家有所帮助。四．机器学习实战篇：1.57行价值八千万美元的车牌识别代码摘要：为了防止被窃车辆进入黑市销售，警方使用了一个名为VicRoads的基于网络的服务，该服务用于检查车辆的登记状态。该警局还投资研发了一个固定式汽车牌照扫描器：一个固定的三脚架摄像头，可扫描过往的车辆，并自动识别被窃车辆。2.如何利用机器学习预测房价？摘要：本文作者利用自己过去三个月里所学到的东西，来预测所在城市的房价。所用到的技术有网络爬取技术、文本自然语言处理，图像上的深度学习模型以及梯度增强技术等。3.机器学习中的技术债务摘要：许多人遇到技术债务时都会眉头紧锁，但一般来说，技术债务并不是一件坏事。例如，当我们需要在最后期限之前发布版本的时候，技术债务就是一个可以利用起来的合理手段。但是技术债务存在与金融债务一样的问题，那就是到了要偿还债务的时候，我们所付出的要比开始时付出得多。这是因为技术债务具有复合效应。4.DIY图像压缩——机器学习实战之K-means 聚类图像压缩：色彩量化摘要：本文以图像压缩为例，介绍了机器学习的实际应用之一。5.如何将机器学习用在基于规则的验证上摘要：这篇文章介绍了一些高级问题，比如：智能自治系统的验证有多少可以用机器学习来实现？大多数的需求是否仍然是基于规则的，如果是这样，那么它们如何跟机器学习相结合？ 机器学习和规则之间的不稳定接口如何影响基于机器学习的系统？6.Certigrad——随机计算图优化系统摘要：Certigrad是一种概念证明，它是用于开发机器学习系统的一个新途径。7.使用神经网络和遗传算法玩转 Flappy Bird摘要：本文展示了针对Flappy Bird游戏设计的机器学习算法。本实验的目标是使用神经网络和遗传算法编写一个人工智能游戏控制器，打出游戏最高分，不服的来挑战！8.教机器写代码：增强拓扑进化网络(NEAT)摘要：NEAT的意思是“增强拓扑进化网络”，它描述了在进化过程中受遗传修饰启发的自学习机器的算法概念，不妨看看它是如何教机器写代码的。9. 机器学习中，使用Scikit-Learn简单处理文本数据摘要：机器学习中，我们总是要先将源数据处理成符合模型算法输入的形式，比如将文字、声音、图像转化成矩阵。对于文本数据首先要进行分词（tokenization），移除停止词（stop words），然后将词语转化成矩阵形式，然后再输入机器学习模型中，这个过程称为特征提取（feature extraction）或者向量化（vectorization）。五．机器学习杂谈篇：1.关于机器学习你必须了解的十个真相摘要：作者从非专业人士的角度对人工智能常见的误解进行了解释说明。2.谁更胜一筹？——随机搜索 V.S. 网格搜索摘要：随机法和网格法都是常用的、有效的结构优化方法。那么它们两者当中谁更胜一筹呢？在本文中，作者通过有趣的地形搜索实验，找到了答案。3.没有任何公式——直观的理解变分自动编码器VAE摘要：本文简单介绍了变分自动编码器VAE的基本原理，从经典神经网络的贝叶斯计算概率方法慢慢转变到变分自动编码器神经网络中的优化问题，使用KL散度度量误差，给大家提供一个VAE的基本框架。全篇没有公式，通俗易懂。4.增强避障系统设计浅析：站在机器学习的角度，剖析学习型避障小车的设计思路摘要：FF91于12017年1月4日在美国拉斯维加斯成功首发，拉开了互联网生态电动汽车的序幕。自动泊车使得停车也成为了一种享受，新手司机再也不用担心该如何见缝插针了。但是如果在车水马龙的繁忙环境下，无人驾驶还能得心应手吗？本文将站在机器学习的角度和大家分享学习型避障小车的设计思路。5.AlphaGo在围棋界成为最强王者后，我们该如何进行机器学习？摘要：机器学习无疑是时下的科技热点。无人驾驶，机器下棋，股市预测等领域，我们都能找到机器学习忙碌和高大的身影。那么对于初学者来说，该如何下手？该怎么学习呢？6.分享Andrew Ng在深度学习暑期班中演讲的机器学习项目摘要：深度学习项目流程，带你走出迷茫。7.分布式机器学习平台比较摘要：机器学习，特别是深度学习（DL），最近已经在语音识别、图像识别、自然语言处理、推荐/搜索引擎等领域获得了成功。这些技术在自主驾驶汽车、数字卫生系统、CRM、广告、物联网等方面都存在着非常有前景的应用。当然，资金驱动着这些技术以极快的速度向前发展，而且，最近我们已经看到了有很多机器学习平台正在建立起来。8.机器学习和统计学的“爱恨情仇”可以结束了摘要：机器学习和统计学在数据科学的领域里，已经相爱相杀很多年。今天，就让我们跟随ML从业者和统计学家两者组成团队，解开两者这几十年的“爱恨情仇”。9.2017上半年无监督特征学习研究成果汇总摘要：无监督学习是人工智能时代核心技术，今天我们就来盘点一下2017上半年无监督学习出现了那些重要的研究成果。10.有监督相似性学习：基于相似问题数据的对称关系学习摘要：本文简单介绍基于相似问题数据的对称关系学习，通过在Quora数据集和StackExchange语料库上应用孪生卷积神经网络的结果表明，对称网络能够较大幅度地提高检测精度。11. 应用机器学习：传道解惑指南摘要：本文作者编辑了一份包括概念、定义、资源以及工具的知识合集，这对于在这个复杂领域从事工作的人来说非常有用。本系列博客内容由北邮@爱可可-爱生活老师推荐，@阿里云云栖社区组织翻译，翻译小组袁虎负责整理。本系列长期更新，更多关于机器学习的优质好文，多多推荐！原文链接更多技术干货敬请关注云栖社区知乎机构号：阿里云云栖社区 - 知乎", "answer_votes": "280", "answer_comment": "​11 条评论"}
{"answer_author": "熊辰炎", "answer_id": 85887688, "answer_text": "谢邀，真的深入学习了这些的人不应该来问这个问题。如果不是钓鱼问题的话，下一步就是大量看paper，开始做自己的科研了。可以也看看Stanford,MIT,UCB和我们CMU的机器学习系的PhD课程。把推荐的reading，homework，project什么的看看。如果是往工程方向走的话就是搞搞开源项目，或者进公司做实际产品了。另外这种问题你来知乎问能问出个啥。 你如果这些书都认真读完也做了不少课后习题，然后又会进一步在这个方向深入的话，本科入门公开课或者网申跟你早就一点关系都不应该有了。", "answer_votes": "95", "answer_comment": "​7 条评论"}
{"answer_author": "知乎用户", "answer_id": 85198013, "answer_text": "我不是大神。背景：某二本院校大四学生；说一说自己的学习经历吧。不知道能不能对题主有所帮助。跟大多数人一样，是从Andrew Ng大神的coursera课程接触到机器学习。在学那门课的时候也就老老实实的看完，看到最后，听到Andrew说看完这些课程的人基本上已经超过硅谷半数的工程师了（具体不记得了，大意是说看完就屌屌的了），前一秒，我是信的，后一秒，我自问我到底会了啥，无非就知道些机器学习的名词，算法的基本思路。然后我该干嘛？找本书来看看啊，找另外一个公开课看看啊，给脑子里那个模型增加数据量啊。《统计学习方法》+台大的公开课《机器学习基石》和《机器学习技法》这个组合简直杠杠，我敢拍着胸脯说我看了4遍，第1遍是照着课程进度配合书籍一起学习，第2遍是课程完结后的复习，第3、4遍在我参加kaggle比赛的时候进行知识的回顾。这个组合里面的书籍可以换成该课程对应的教材。看完书籍和公开课，我发现，数学很重要！数学很重要！数学很重要！在看Ng的课时倒还没有这个感觉，看台大课程的时候明显感觉到数学知识的比重陡然增加。然后就看了MIT的线性代数公开课和微积分，这才解决了公开课里面的部分疑惑。理论的知识大概了解了，然后我该干嘛？python大法好啊！什么C++，java啥的真复杂，直接做个调包侠多么愉快啊。二话不说，直接就学，Python 2.7教程,感谢廖叔叔。接下来就是热门的机器学习算法包scikit-learn: machine learning in Python 。什么，算法输入要求是pandas data frame ，来一本 利用Python进行数据分析 (豆瓣)。 至此，已经学会基本的数据预处理了，这些无论是书籍还是公开课都直接略过不会教的。在这里要隆重推荐 周志华老师的 机器学习 (豆瓣) ，目前看过的最好的中文的机器学习教材，涵盖了很多教材所没有的 数据预处理，特征工程。这书，得供起来。会调用算法了，然后我该干嘛？机器学习？数据挖掘？这两者到底界限在哪里？要不就都看看吧，有了这个想法后，我找了cousera上UIUC 的data mining 专项课程Specialization来看，里面有两门课是大名鼎鼎的韩家炜教授所教的。至此，我知道了pattern mining,搜索引擎的基本框架和原理，文本挖掘和自然语言处理的一点知识，聚类分析的大概。这些课程中都会夹杂着之前所学的机器学习算法。每节课课后推荐的延伸阅读文章和书籍非常值得去看一看！了解了一些应用，然后我该干嘛？玩啊！当然是好好玩机器学习/数据挖掘比赛啊，Kaggle: The Home of Data Science，我把101，playground这两个级别的比赛刷了一遍，然后鼓足勇气参加了一个有奖金的比赛！最后排名状况是在1800多个队伍排300多名。一开始不知道怎么去做一个kaggle比赛的时候，我照着 https://www.dataquest.io/section/kaggle-competitions 的教程过了一遍，大概就知道整个流程。偶然一次，碰到数据量特别大的比赛，数据量上G，套了一个模型上去后，直接memory error。这让我知道了大数据处理平台 Apache Spark™的好用之处，也再一次证明了，学习python的好处 Welcome to Spark Python API Docs!。我在windows 10的系统上尝试着跑一个单机版的spark来玩玩，配置过程一直出错，巨麻烦。这个时候我感受到了linux的友好！（没有黑windows的意思）也因为这样，顺便学习了linux操作系统。推荐 鳥哥的 Linux 私房菜 -- 鳥哥的 Linux 私房菜 首頁。会玩了，然后我该干嘛？找工作啊！我在拉勾网、100offer、哪上班和实习僧这些招聘网站找数据挖掘/机器学习的岗位，把招聘要求里面的共同需求点给标记出来。常见机器学习算法数据库java、c++、python、Rlinux操作系统数据结构与算法在知道自己的不足之处后，自然就一直在填补这些简历上面的空缺。当然我觉得自己在机器学习算法方面还有很多疑惑和不了解的地方，正准备去研读下经典的PRML。其实说了这么多，无非是想说，我是在一次次的需求和兴趣的驱动下去学习的，题主不妨仔细地思考下自己的需求，从机器学习的应用方面去找找灵感，也许会是不错的选择。然而我说了这么多，我学了这么些东西，我还是找不到实习！找不到实习！找不到实习！投了简历倒是给我个反馈啊喂！我容易吗我！！", "answer_votes": "2.7K", "answer_comment": "​277 条评论"}
{"answer_author": "知乎用户", "answer_id": 107707404, "answer_text": "反正就是一句话：Learn by doing, keep your hands dirty.", "answer_votes": "24", "answer_comment": "​5 条评论"}
{"answer_author": "li Eta", "answer_id": 71494282, "answer_text": "题主是否要明确一下成为哪方面的大神？是成为非常能coding的机器学习应用大神(熟知各类模型算法的组合和优劣，分分钟能依据具体业务设计模型)?还是论文满天飞，各种理论分析，各种bound随便推的学术界大神?前者多看ML工具书(比如MLAPP、PRML、ESL、FML等)，多写代码。后者多看前沿论文，多学基础理论。", "answer_votes": "24", "answer_comment": "​17 条评论"}
{"answer_author": "知乎用户", "answer_id": 73076701, "answer_text": "我学了好几年了，还一直感觉自己在入门。。。每次看大牛们发的paper，都觉得自己弱爆了", "answer_votes": "11", "answer_comment": "​3 条评论"}
{"answer_author": "冰柠檬", "answer_id": 88060066, "answer_text": "本人背景：机器学习、量化投资我的看法：理论实践相结合就看是先理论后实践，先实践后理论，边实践边理论。这些都是可以的，看个人想法，也看机遇，正所谓缘分天注定嘛!下面说一下个人经历，希望对题主有帮助吧。我是属于边实践边理论。我最早是在课堂上接触到神经网络，也看了一些书，美颠美颠的以为自己都会了。结果跟随老师做百度的一个项目时傻眼了，完全写不出算法。于是跟大多数人一样，从Andrew Ng大神的公开课开始学习，期间啃了《统计学习方法》、《数据挖掘》、《机器学习实战》等。在项目进行中会发现自己越来越多的不会，项目结束后，继续做金融时间序列的相关研究，慢慢走向了量化投资。在量化投资领域，我是大量阅读资料（包括各种论文，经典书籍，研究报告等），设计量化投资策略，编写程序实现，分析总结，继续阅读资料，反复迭代下去。其中理论实践结合中的分析总结很重要。说了很多了，最后一句，兴趣才是驱动学习的最大动力！真真的写了篇鸡汤呢？哈哈。。。对于题主来说，接下来就是做项目，找实习，更多的去实践。如果有项目的话就踏实的做项目，不多说。=============最后打个广告，如果没有项目、实习可做，可以找我。个人目前在JoinQuant平台做机器学习在量化投资中的研究，欢迎感兴趣的朋友私信我，一起来讨论用机器学习做量化投资，这是很酷的事情。【机器学习方法研究】——思路整理、支持向量机为表达诚意附上部分个人研究干货。这是之前回答的一篇资料帖，量化交易主要有哪些经典的策略？ - 冰柠檬的回答========下面简单介绍一点，不做详细展开特征选择基本面因子：PE，PB，ROE等技术指标因子：RSI、KDJ、MA、MACD等蜡烛图形态因子：三乌鸦、锤子线等大数据等等。。。输出股价，股价涨跌分类，未来一段时间收益率等还有一类用法是利用非监督学习甚至深度学习找到更好的特征比如找到大涨的股票，然后看大涨前一段时间的形态有没有相似的，利用非监督学习的方法。套利是看股价的相关性，这样的关系可能不是那么明显地存在于股票的价格中，可能存在于收益曲线中或者方差曲线中，甚至更高复杂度的统计量中。深度学习提供了将原数据投影到另一个特征空间中的方法，而且是高度非线性的。那么，原数据中没有体现出来的相关性，会不会在这种高度非线性的投影空间中体现出来呢？貌似歪楼了。。。。", "answer_votes": "57", "answer_comment": "​4 条评论"}
{"answer_author": "rainer wang", "answer_id": 72493272, "answer_text": "不是大神，只是个学渣，目前也不知道有没有入门，只说下自己感受先是看完了《集体智慧编程》一书，这本书设计到很少的数学内容，粗略的介绍了推荐系统的构建，聚类，搜索引擎，模型优化，文本过滤，决策树等算法，以及怎么写爬虫爬数据等等，用作入门还不错，算法主要是用python实现的，请务必按照书中的算法，自己动手实践！如果不熟悉Python，可以买本Python教程看一看，推荐老外写的《Python基础教程》，有中文版，我买的是第二版。《集体智慧编程》豆瓣书评在这里集体智慧编程 (豆瓣)。然后把coursera上NG老师的公开课，（公开课链接在此https://www.coursera.org/learn/machine-learning/home/welcome，网易公开课上还有个斯坦福大学版的，如果觉得数学基础不错，可以看那个） 完完整整的看完，并且做完所有课后习题！看完视频不一定会写算法，所以没有做习题的话，请务必做完所有习题，并保证所有习题都做对（课后习题可以提交，查看分数，确认是否答对。另外遇到不懂的，可以到coursera该课程的论坛上提问题，论坛的mentors很热心，在这里谢谢他们对我若干问题的解答）NG老师也说了，他写算法是先用少量训练数据在Octave（类似于matlab，但是是开源的）上实现，看学习曲线，调整，确认效果，然后再做后续的处理，所以这里课后习题就用NG老师说的Octave来做吧。目前在啃PRML，刚看完第一章，楼主能深入学完这本书，实在是我的楷模。我基础比较差，所以第一章包括课后习题，就花了我好长时间。文中涉及到的一些概念，google, wiki之也花了好多时间。看过其他同学的一些经验，这里说下我看完第一章的感受，请务必把课后习题都做完！实在不会做的，可以自己想一遍，然后参阅这本书的solution。等学完PRML这本书，计划再把ESL（The Elements of Statistical Learning）这本书啃完。我之前是先看的ESL，结果发现实在是看不懂，然后去亚马逊上看书评，看老外们是怎么学的，下面这张图的书评人说了他的经验，建议先看PRML，然后再看ESL。因为PRML给了一定的基础，再去看ESL会简单一些，ESL也会涉及到比较多的实践操作（我还没看ESC这本书，只是看了别人的一些经验）。我认为很对，所以现在在照着做，这个书评的链接在这里，http://www.amazon.com/gp/customer-reviews/R1VGUIHGV72TTO/ref=cm_cr_pr_viewpnt?ie=UTF8&ASIN=0387310738#R1VGUIHGV72TTO&lt;img src=\"https://pic4.zhimg.com/50/bde1a6deb9f1a005cc44769a55da5fc6_hd.jpg\" data-rawwidth=\"1518\" data-rawheight=\"614\" class=\"origin_image zh-lightbox-thumb\" width=\"1518\" data-original=\"https://pic4.zhimg.com/bde1a6deb9f1a005cc44769a55da5fc6_r.jpg\"&gt;#=====================================================更新一下上面提到的两本书的完整书名：PRML，Pattern Recognition And Machine Learnin，Pattern Recognition And Machine Learning (豆瓣)ESL，The Elements of Statistical Learning，The Elements of Statistical Learning (豆瓣)#=====================================================以上。", "answer_votes": "95", "answer_comment": "​11 条评论"}
{"answer_author": "知乎用户", "answer_id": 91961860, "answer_text": "看题主的描述，理论基础应该基本ok了，可以考虑接触一些实战项目，比如Kaggle、阿里天池的一些比赛。如果自己计算资源偏少还是建议参加天池的比赛，提供了分布式计算平台，而且本身对于校招有比较直接的帮助——阿里提供top队伍校招绿色通道。Tianchi Big Data Platform-Build the Leading Platform of \"Crowd Intelligence and Crowd Innovation\"个人也建议看看我之前为14年天池比赛写的实战总结：https://www.zhihu.com/question/20874105/answer/41562872", "answer_votes": "12", "answer_comment": "​1 条评论"}
{"answer_author": "wepon", "answer_id": 71835172, "answer_text": "已经很牛逼了，去实习吧", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 73149525, "answer_text": "感觉题主才是大神， 研一能看完本人研一，目前已经将机器学习的基础知识部分以及学习了不少，目前深入学习包括了《PRML》、《统计学习方法》、《矩阵论》、《最优化方法》、吴恩达《机器学习》视频、部分《凸优化》、《数字图像处理》这分明是来嘲讽的。反正研一看完这些的， 估计手里怎么也有个ACL了， 要是没有就说明没看完， 用不着下面的人说我强答。。。。。", "answer_votes": "33", "answer_comment": "​24 条评论"}
{"answer_author": "洋葱办刘主任", "answer_id": 209493921, "answer_text": "AI笔记 | 一张图帮你全面掌握机器学习算法知识体系<img src=\"https://pic3.zhimg.com/50/v2-fbfb710d80a13892b17f1d70af8ce00a_hd.jpg\" data-rawwidth=\"917\" data-rawheight=\"979\" class=\"origin_image zh-lightbox-thumb\" width=\"917\" data-original=\"https://pic3.zhimg.com/v2-fbfb710d80a13892b17f1d70af8ce00a_r.jpg\"><img src=\"https://pic2.zhimg.com/50/v2-7a6e4abb74780224f77723ca1a04c3a8_hd.jpg\" data-rawwidth=\"917\" data-rawheight=\"1250\" class=\"origin_image zh-lightbox-thumb\" width=\"917\" data-original=\"https://pic2.zhimg.com/v2-7a6e4abb74780224f77723ca1a04c3a8_r.jpg\"><img src=\"https://pic4.zhimg.com/50/v2-a642ca0e91f9d2ff5ac079b34ec7dbec_hd.jpg\" data-rawwidth=\"917\" data-rawheight=\"906\" class=\"origin_image zh-lightbox-thumb\" width=\"917\" data-original=\"https://pic4.zhimg.com/v2-a642ca0e91f9d2ff5ac079b34ec7dbec_r.jpg\"><img src=\"https://pic3.zhimg.com/50/v2-4d39a68e543a20945c13292ad7856440_hd.jpg\" data-rawwidth=\"917\" data-rawheight=\"1001\" class=\"origin_image zh-lightbox-thumb\" width=\"917\" data-original=\"https://pic3.zhimg.com/v2-4d39a68e543a20945c13292ad7856440_r.jpg\">【更多人工智能资料下载欢迎关注公众号@智能玩咖】", "answer_votes": "8", "answer_comment": "​1 条评论"}
{"answer_author": "周涛", "answer_id": 97363399, "answer_text": "研一就将机器学习的基础知识部分学习了，还深入学习包括《PRML》、《统计学习方法》、《矩阵论》、《最优化方法》等，感觉牛逼哄哄。建议多看些机器视觉应用", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 86077468, "answer_text": "看到题主这么完备的学习体系，深感自愧不如。我简单从coding的角度分享自己的体会吧：找一个靠谱的DM比赛，然后认真地思考和尝试，可结合平时所学所思，具体过程参考烂大街的攻略，此处不再赘述。当然一个比赛只能看到一个方向的不足，可以考虑参加各式各样的算法比赛，涉猎更多的领域以开阔眼界，具体看个人精力，当有一天你觉得比赛没意思的时候，就是你做出抉择的时候，往工业发展还是专心学术，你心里应该就有答案。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 85577791, "answer_text": "说实话，一说什么大数据data science，ML，DL一大堆人就跑出来指点江山挥斥方遒......真正能做有意义的东西，能做出好研究的我怀疑国内高校内的老师一个985估计也都是个位数。本人是国内本科，也没有觉得原来认识的老师做的研究多么厉害，最多是用了ML结合图像图形就能发cvpr了", "answer_votes": "9", "answer_comment": "​5 条评论"}
{"answer_author": "BigQuant", "answer_id": 153189919, "answer_text": "1. 看书、看视频公开课等等，现在良莠不齐的太多了，找大师的、经典的吧2. 实践实践再实践，计算机和机器学习都是实践科学。可以找一家技术性的公司实习，也可以去机器学习平台上实践操作：推荐kaggle；同时也推荐 https://bigquant.com/ ，这里可以用实际的股票数据来练手（声明：利益相关，我是BigQuant官方账号）", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "yuke", "answer_id": 227136401, "answer_text": "       我的个人观点是，重要的是去一家有真正技术大神领导的公司，因为基础的概率与统计、机器学习和程序开的学习方法的知识架构都差不多。真正实现人才之间的区分度的是看谁能够实现从数学、概率、程序和对现实世界的抽象和建模几个维度同时融会贯通。而这种能力是很难在跟着书本或者做一些基础性的项目当中学会的，加入一家真正有机器学习/大数据分析顶尖专家的公司并和这些专家配合工作应该是提高最快的方式。        在机器学习中，很多人都知道cross-entropy loss function（交叉熵损失函数），也在大数据分析中学习了maximum likelihood estimations（最大释然估计 MLE），但是我们公司面试过的很多的申请人居然不知道这两者之间的关系。而且我们惊奇地发现几乎所有了解MLE的计算方式的申请人都无法用一句话说出它在现实世界被使用所隐含的假设。MLE被使用的前提假设可以用一句简单的话概括出来：我们认为我们眼睛观测到的现象就是发生概率最大的一组事件。我们看到申请人可以非常熟练地使用RNN、CNN和各种其他看似复杂的机器学习方法却无法回答上面这个问题。         这可以算是一个经典的知其然而不知其所以然的例子了。想要锻炼出这种知其所以然的能力，去一家有真正技术大神领导的公司我认为是至关重要的。       大神集中在互联网和金融量化投资-AI人工智能算法投资这几个领域。       在判断一家公司是否有大神的时候应该仔细判断他们公司所在的行业是否深入使用深度学习/大数据分析。       对于互联网领域，很多朋友比较熟悉了，图像识别、金融征信与人工智能助手三个领域应用最多：图像识别：face++、商汤科技等金融征信：蚂蚁金服、阿里、京东等人工智能助手：Siri、玩秘App、Cortana等等。这些公司都是在深度学习和大数据分析方面非常专业的，背后一定是有技术大神支撑的。       金融量化投资领域是很多朋友们不熟悉的领域，其实量化投资领域早在10年前就深入地使用机器学习和其他大数据分析方法，利用纯数学模型进行二级市场投资。这里面大家可以关注来自国际顶级投行（高盛、摩根大通）的量化交易部门和顶级对冲基金的专家所在的公司。这是为什么国际上很多科技领域的机器学习专家之前来自于金融量化投资领域      我对大家的建议是加入一家拥有真正的机器学习/大数据分析顶尖专家的公司，在大神身边成长，这可能是我觉得最高效的捷径。", "answer_votes": "14", "answer_comment": "​9 条评论"}
{"answer_author": "知乎用户", "answer_id": 93948106, "answer_text": "我觉得已经入门了的人是不需要来问这种问题的，看这个问题的人可能也是就想入门。如果你想做机器学习方面的事情，请不要去把精力放在各种算法，模型上。 我不是说这些没用，只是你学的这些东西对想招你的公司来说也没用，也就是对你入门没用。整个数据行业对单纯搞机器学习的初级人才需求不高。招得最多的是BAT联盟, 不过别人一般喜欢招有经验的，完全没有经验基本上投的简历看都不看，因为人太多了。 各种只做过KAGGLE几道题目的研究生就过来说自己想当数据科学家。这还不是最惨的，数据科学号称统计学加计算机，也就是跨界，所以计算机的申请，搞统计的也申请，和统计沾边什么金融，经济的也申请。 反正就是供应过剩，需求还没旺起来。 因为供应太多，需求不旺导致初级人员工资不高。 一般只有做web端的IT在前几年(0-2)的80%左右。如果你只是为了钱，说实话web端的机会好得多。 如果你真想加入这个行业，也看好这个行业。 请从数据本身入手， 比如在简历中显示出你在数据预处理方面的能力，获取数据的能力，大规模数据储存读取方面的能力。这些才是一家公司项目老大最看重的，对于新人来说。 好吧，如果你这些能力都没有，还想加入这个行业。 学爬虫吧， 容易学，容易出结果，所有我说的能力都在做爬虫的过程中运用了， 处理XML，处理JSON，处理各种不规整数据。 爬X宝，爬X东，各种获取数据的能力。 存MYSQL，存MONGODB,各种大规模数据储存读取方面的能力。进阶点 使用SVM,DL之类的来做ORC。 做完这些之后你会发现，你对数据本身的理解加深了。想进入一家做数据的公司易如反掌。话说，我最近招爬虫工程师，来投简历的都是想做数据挖掘的，都是被人工智能迷晕了脑袋，根本不知道人工智能的基础是什么。 有兴趣的可以看看我的一篇文章。http://zhuanlan.zhihu.com/p/20675350最后如果有深圳的同学有兴趣做爬虫，或者Python web端，说话人识别，可以私聊我。大量需求。。", "answer_votes": "18", "answer_comment": "​7 条评论"}
{"answer_author": "知乎用户", "answer_id": 71396979, "answer_text": "谢邀。我的过程是，“看了些书以为自己会了”--“但是算法写不出来”--“算法能写出来，发现自己其实什么都不会”，现在在向应用努力。我不是计算机专业，主要是个人爱好，研究大数据与人工智能在金融投资中的应用。所以我不是特别偏理论，主要勤于写代码设计算法，不过线代积分概率基础还算牢固，而且也经常翻这些书，以汲取各类算法思想为主。金融数据噪声大，特征难以提取，所以更关注选择何种特征而不是对偶解还是单纯形这类纯数学问题。看你什么专业了，计算机或者数学专业，如果不能沉下心写两篇学术论文那真的只能算皮毛；其他专业能结合机器学习的思想code自己的想法基本就可以过关了，没必要整天研究纯理论，根据自己的情况选择多看论文或者多写代码就行了。", "answer_votes": "23", "answer_comment": "​10 条评论"}
{"answer_author": "梅洪源", "answer_id": 85697527, "answer_text": "看你的大神标准是什么。真的成为专家的话，去读PhD。成为知乎大神的话，我就不知道了。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "司徒功源", "answer_id": 83575707, "answer_text": "如果题主真的符合自己所说的，你已经很不错了，大神这个词不能随便说，不去牛校读到个phd，写个好几年代码，基本不用谈，最好的检验办法是：理论是不是懂了，代码能不能跑通，数据够不够了解。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "RAC HHH", "answer_id": 91205635, "answer_text": "欢迎加入我们数螺社区一起讨论，数据科学家的专业社区~ 你可以百度数螺找到我们", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "Hao Zhang", "answer_id": 182956940, "answer_text": "如今, 机器学习变得十分诱人, 它已在网页搜索, 商品推荐, 垃圾邮件检测, 语音识别, 图像识别, 自然语言处理等诸多领域发挥重要作用. 和以往我们显式地通过编程告诉计算机如何进行计算不同, 机器学习是一种数据驱动方法(data-driven approach). 可能你已经看了几本书, 也学了不少课程, 对各个常用算法的推导也了熟于胸. 然而, 有时候你会觉得机器学习像是一种\"魔术\", 当面对具体应用问题时, 即使是给定相同的数据, 一位机器学习领域专家和一位新手训练得到的结果可能相去甚远. 在这里当你在应用机器学习时你应该想什么 - 知乎专栏详细讨论了初学者面对实际任务时需要考虑的九大问题:我该选什么学习算法?我该选什么目标函数?我该选什么优化方法?不要偷看测试数据欠拟合/过拟合: 认准你的敌人机器智能+人类智能高维\"灾难\"数据! 数据!集成学习: 以柔克刚", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "机机复鸡鸡", "answer_id": 155667252, "answer_text": "泻药，以下是我在专栏的分享Kaggle的联合创始人兼CTO：八个学习机器学习的诀窍 - 知乎专栏学习机器学习和人工智能的最佳方式是什么？\n你该感到幸运，现在比以往任何时候都更有利于开始学习机器学习和人工智能。近年来，该领域迅速发展壮大。专家们发布并抛出了高质量的开源软件工具和图书馆。每天都会出现新的在线课程和博客文章。机器学习带动了行业的数十亿美元的收入，实现了无与伦比的资源和巨大的就业机会。\n这也意味着入门可能有点困难。下文是我认为的好方法。如果您在此过程中遇到任何问题，请搜索Kaggle，并在我们的论坛上发布，这是获取诀窍的好方法。挑选你感兴趣的问题从您想要解决的问题开始，使其更容易保持专注和积极性的学习，而不是开始一个令人恐惧的在Google查询资源主题列表。想解决问题也迫使你深入公司学习，而不是被动地阅读。好的问题开始有几个标准：它们涵盖您个人感兴趣的区域。数据是随时可用的，非常适合解决问题（否则大部分时间将浪费）。您可以在单个机器上舒适地处理数据（或其中的一些相关子集）。没有想到的问题？别担心！我们通过我们的入门竞赛系列，在Kaggle提供了一个很好的机器学习问题。从泰坦尼克竞技开始。为您的问题制作一个快速，简陋的端到端解决方案在实现细节中容易陷入僵局，或者仔细调整错误的机器学习算法。您的目标是尽快获得一些广泛基础的内容，涵盖端到端的问题，从数据读取，处理到适合机器学习的形式，培养基本模型，创造结果，并评估其性能。进行和改进您的初步解决方案现在你有一个功能基准，现在是获得创意的时候了。尝试改进初始解决方案的每个环节，并衡量影响，看看花费时间是否有意义。许多时候获取更多数据或改进数据清理和预处理步骤具有比优化机器学习模型本身更高的投资回报率。这个步骤的一部分应该包括动手数据 - 检查各行和可视化分布，以更好地了解其结构和异议。写出并分享您的解决方案获得解决方案反馈的最佳方式是写下来并分享。撰写您的解决方案意味着您将以一种新的方式与其进行交互，并更好地理解它。这使他人了解您所做的工作并提供反馈，帮助您学习。它还可能认识到您的机器学习伙伴，这将有助于展示您的能力并获得工作。Kaggle数据集和 Kaggle内核是分享您的数据和解决方案，获取其他人的反馈的有效方法，也可以看到其他人如何扩展您的问题，这也开始充实您的Kaggle配置文件。重复＃1-4 跨越各种各样的问题现在，您已经为一个您感兴趣的问题做了这一步，在不同的一组域中再次执行此操作。你从表格数据开始吗？处理涉及较少结构化文本的问题，另一个是解决图像识别的问题。机器学习的问题最初是为您构建的吗？很多创造性和有价值的工作正在弄清楚如何从一个松散定义的业务或研究目标到一个明确的机器学习问题，首先。通过这种方式解决一个问题类型。Kaggle比赛和 Kaggle数据集为明确定义的机器学习问题和适用于机器学习的原始数据源提供了良好的起点。认真参加Kaggle比赛（如果你还没有这样做）在数以千计的其他人努力工作的同样问题上，您的最佳表现是一个巨大的学习机会：它强制您一遍又一遍地迭代问题，然后暴露您对该问题有效的工作。关于其他人如何处理和调整问题，个人竞赛的论坛是一个丰富的资源，内核是提供有关数据的探索性见解以及一个简单的方法来开始解决问题，以及获奖的博客文章展示，这都是最有效的方式。Kaggle比赛也提供了与他人合作的独特机会。我们的社区具有多样化的背景和技能，所以每个人都有教训和学习东西。你永远不会知道，你可能会遇见你未来的同事Kaggle！专业应用机器学习这使您可以将大部分时间花费在机器学习上，真正帮助您升级。决定您要追求的角色类型，并建立与此相关的个人项目组合是一个强有力的起点。如果您还没有准备好开始面试机器学习职位，那么在您目前的职位上接受新的项目，寻求咨询机会，参与到黑客和数据相关的社区服务机会也是其他途径。专业工作通常需要强大的编程能力， 通过重点项目改善这一点可以产生许多下游收益。专业机器学习工作的宝贵机会包括：在操作系统中应用机器学习。着眼于机器学习研究，推动科技进步。利用机器学习进行探索性分析，以改进产品和业务决策。帮助他人机器学习教授别人将巩固你对核心概念的把握。有很多不同的方式去选择最适合你的风格的方法。他们包括：撰写研究论文。发表谈话写博文和教程。回答关于Kaggle，Quora和其他网站的问题。个人指导和辅导。共享代码示例（在Kaggle内核和GitHub上）。教班写一本书。来源 Quora答案由本哈姆纳，Kaggle的联合创始人兼CTO发表", "answer_votes": "11", "answer_comment": "​1 条评论"}
{"answer_author": "ming Astro", "answer_id": 86178102, "answer_text": "上kaggle，找个数据小点的competition实践一下，顶看十本书。另外能把那个pattern recognition那本书深入学习在下实在是佩服佩服", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 94111619, "answer_text": "很多人打算从事数据挖掘工作，问要看什么书，以下是比较专业的回答：【第一阶段】《统计学》《高等数学》《数据库》《算法导论》《数据挖掘导论》《可视化分析》【第二阶段】《莫生气》《论持久战》《佛经》《老子》【第三阶段】《颈椎病康复指南》《腰椎间盘突出日常护理》《心脏病的预防与防治》《高血压降压宝典》《强迫症的自我恢复》《精神病症状学》【第四阶段】《活着》-------此梗来自网络修改", "answer_votes": "29", "answer_comment": "​7 条评论"}
{"answer_author": "文刀叉点", "answer_id": 71424304, "answer_text": "大神都不说自己是大神好吗。。。机器学习的元老级别，ICML的创始人，Deep Learning的发起人等等等等。。。也不会称自己是大神。。。", "answer_votes": "0", "answer_comment": "​2 条评论"}
{"answer_author": "KevinSun", "answer_id": 85357234, "answer_text": "深入学习过这些课程之后已经是大神了", "answer_votes": "1", "answer_comment": "​3 条评论"}
{"answer_author": "青云", "answer_id": 134823064, "answer_text": "如果你想做机器学习方面的事情，请不要去把精力放在各种算法，模型上。 我不是说这些没用，只是你学的这些东西对想招你的公司来说也没用，也就是对你入门没用。整个数据行业对单纯搞机器学习的初级人才需求不高。招得最多的是BAT联盟, 不过别人一般喜欢招有经验的，完全没有经验基本上投的简历看都不看，因为人太多了。 各种只做过KAGGLE几道题目的研究生就过来说自己想当数据科学家。这还不是最惨的，数据科学号称统计学加计算机，也就是跨界，所以计算机的申请，搞统计的也申请，和统计沾边什么金融，经济的也申请。 反正就是供应过剩，需求还没旺起来。 因为供应太多，需求不旺导致初级人员工资不高。 一般只有做web端的IT在前几年(0-2)的80%左右。如果你只是为了钱，说实话web端的机会好得多。 如果你真想加入这个行业，也看好这个行业。 请从数据本身入手， 比如在简历中显示出你在数据预处理方面的能力，获取数据的能力，大规模数据储存读取方面的能力。这些才是一家公司项目老大最看重的，对于新人来说。 好吧，如果你这些能力都没有，还想加入这个行业。 学爬虫吧， 容易学，容易出结果，所有我说的能力都在做爬虫的过程中运用了， 处理XML，处理JSON，处理各种不规整数据。 爬X宝，爬X东，各种获取数据的能力。 存MYSQL，存MONGODB,各种大规模数据储存读取方面的能力。进阶点 使用SVM,DL之类的来做ORC。 做完这些之后你会发现，你对数据本身的理解加深了。想进入一家做数据的公司易如反掌。", "answer_votes": "8", "answer_comment": "​2 条评论"}
{"answer_author": "知乎用户", "answer_id": 137352654, "answer_text": "试试在Github上创建属于自己的小项目和个人站点,把你所学的东西举一反三应用到小项目中,同时把学习中填坑的心得和灵感发现等点滴东西简要记录下来,长期坚持，你会发现自己进步很快，同时还打造出了一片属于自己的根据地（附上你的Github根据地的地址，到你投的简厉中显眼位置）。不愁无伯乐。", "answer_votes": "4", "answer_comment": "​添加评论"}
{"answer_author": "Ubermensch", "answer_id": 92683396, "answer_text": "少玩知乎多看书", "answer_votes": "4", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 172436525, "answer_text": "一般来说不是专门搞这个的研究生，还是用为主吧。说实话现在学机器学习的太多了，都想来学学，但是严格来说这个东西里面涉及的数学还并不是那么简单的。所以在知乎上我从来不看也不回答这方面的问题，大部分都是停留在用的层面上，对算法的原理和实现细节并不懂。所以其实这种如果想要成为机器学习或者挖掘的大神就有点本末倒置了。这类人群的目标应该是学会一些机器学习算法的使用，用在自己的工作或者学科上，用机器学习来造福自己的原本领域。但是要说学会用机器学习，那也非常简单啊。学学python。然后numpy，scikit-learn，caffe这些东西把算法都给你封装好了，你根本不用去看你上面大部分的书，直接用就好。最后根据你的需要去补充一下其他python库就好了。如果喜欢做数据挖掘，kaggle是个非常好的平台... ...", "answer_votes": "3", "answer_comment": "​1 条评论"}
{"answer_author": "tryharder", "answer_id": 94023709, "answer_text": "一定要学好数学！这是最最最关键的", "answer_votes": "3", "answer_comment": "​1 条评论"}
{"answer_author": "匿名用户", "answer_id": 71208858, "answer_text": "目前深入学习了prml，又没有实践过，哥们这前后矛盾呀！能不能别逗？", "answer_votes": "5", "answer_comment": "​10 条评论"}
{"answer_author": "shujujia", "answer_id": 97529210, "answer_text": "首先，多读些书，充实自己，才有可能成为大牛，推荐一些书：机器学习：《数据挖掘实用机器学习工具与技术》、《数据挖掘导论》、《机器学习》、,《数据挖掘与机器学习WAKA应用技术与实践》Python：《利用Python进行数据分析》、《Python基础教程》、《Python Cookbook》、《“笨办法”学Python》MATLAB：《精通MATLAB》、《MATLAB R2014a从入门到精通》、《MATLAB R2014a完全自学一本通》、《MATLAB宝典》数据库：《MongoDB权威指南》、《数据库系统概念》、《SQL语言与数据库操作技术大全》、《Oracle从入门到精通》R语言：《统计建模与R软件》、《R语言实战》、《ggplot2数据分析与图形艺术》、《数据挖掘与R语言》", "answer_votes": "3", "answer_comment": "​添加评论"}
{"answer_author": "Ge skye", "answer_id": 84052636, "answer_text": "我在谷歌的老师和学长最近告诉我个惊恐的消息，谷歌正在组建研究通用机器学习的研究室。再结合谷歌的量子计算机研究，我觉得我要是十年之类学不出来估计也就不用学了。貌似歪楼了。", "answer_votes": "3", "answer_comment": "​4 条评论"}
{"answer_author": "匿名用户", "answer_id": 235845779, "answer_text": "给大家分享个1000+ 的机器学习与人工智能资料、论文、教学视频、数学基础、入门博客整理合集以及开发框架介绍。分享自: 机器学习专题 - DevOpen.Club | 高质量的软件开发视频教程", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "[已重置]", "answer_id": 104061608, "answer_text": "       把机器学习学好是一个漫长的过程，要想找到进阶为大神的秘籍，这也是我这个菜鸟级别的想找的秘籍。呵呵，个人觉得吧，虽然现在还是个菜鸟，但是把机器学习学好没有捷径，珍惜每一个做项目的机会，多去思考，多去实践，了解其他同事在做这个项目时是怎么思考的。        就拿自己前段时间做的一个项目，媒体分类模型。分类使用模型有贝叶斯，逻辑回归，svm等，也不难。但是如果要做一千多个类别的分类模型那怎么办，一般过程就是爬取这些类目的标注数据，预处理，在使用模型分类。但是如果有其中的几个类别我不想要了，或者添加几个类别，这样都需要重新训练模型，重新评测数据，在项目周期上就不得不延长了。所以有好的算法基础同时，还要有一个好的设计框架。        可能很多人把跟多的时间放在了解模型的原理上了，比如梯度下降是怎么实现的，拟牛顿法为什么收敛速度快。但是在项目开发中，大部分时间在在数据集的标注和预处理过程。做好这两个也不影响我们成为大师的步伐，因为这里面包含很多的设计方法在里面，也可以加深你对模型的理解。        以下为我预处理数据的一些过程：        1、如何制作保留词，在对数据进行分词时候把保留词加载到jieba分词中，避免这些词被拆分。怎么制作保留词呢？不需要被拆分的词很多，是无法穷举的。我们可以从模型选择出来的特征入手，对每个类别的特征进行一个排序。 比如：体育运动这个类目的特征：比赛 3.857281，球队 2.936345，球员 2.856101，体育 2.665685，奥运会 2.660206  ... 特征后边跟的数字是分类模型决策函数的系数，也可以看做是特征权重。很明显 “比赛”这个特征在体育运动这个权重是比较大的，但是是否含有比赛关键词的都可以被分到体育运动中呢。答案是否定的，比如选美比赛、英语比赛，这就跟体育 运动无关了，所有像这些词我们可以有针对性去构建合成词加载到jieba分词里。         2、制作通用停用词，所谓通用停用词就是任何一篇文章进行分词后都进行词的过滤。这个停用词库怎么构建呢？当然停用词也是无法穷举的，也没有必要每个 停用词都加到词库里，比如我们选择出来的特征里不含有“我们“，就没有必要把”我们“加到停用词库里。也要从特征里找这个停用词。我们总共250w的训练 语料得到的词袋大概240w左右，经过特征选择出20w左右的特征，也就是我们只在这20w的特征里找通用的停用词，特别要把权重大的并且可以做为停用词 的词加到停用词库里。         3、制作类别停用词，所谓类别停用词就是，在决策判断是否属于这个类别时，这个特征不应该起到关键作用（即权重不应该很大），但是这个特征在这个类别 判断中权重系数大，这个时候怎么办呢？首先这个词不能加到通用停用表了，因为这个特征对其他类别的判断是有作用的。比如时事政要这个类别，模型训练出的特 征如：女性、大学、女子等这些特征的权重比较大，但是这些特征对时事政要类别的判断是没有决定性意义的，所有需要制定这样的类别停用词，在模型训练时候， 这些词的权重在这个类别中就会降低了。一点见解，仅供参考。", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "吳子豪", "answer_id": 94044043, "answer_text": "找個項目。研究不同框架，自己嘗試修改/實現。大量閲讀paper，了解每個方法/trick的原理，歷史，長短處。嘗試新的idea，實現代碼，調參。Work的話閒餘時想下理論解釋。", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "Gao Alex", "answer_id": 71818728, "answer_text": "你如果真正深入学习了问题中列出的书，那么，你，已经是大神了。", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "如皋金城武", "answer_id": 154633739, "answer_text": "听Andrew Ng的机器学习课程，不停地um   um   um   真的听不下去", "answer_votes": "1", "answer_comment": "​1 条评论"}
{"answer_author": "豆沙大魔王", "answer_id": 87323411, "answer_text": "做到一定程度，这种东西很靠天赋滴", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "BrianRWang", "answer_id": 255040618, "answer_text": "希望24个月以后能来答这个题。", "answer_votes": "1", "answer_comment": "​5 条评论"}
{"answer_author": "henryWang", "answer_id": 73094465, "answer_text": "你都深入学习了《PRML》、《统计学习方法》、《矩阵论》、《最优化方法》、吴恩达《机器学习》视频、部分《凸优化》、《数字图像处理》这些东西了，实现什么东西还不是手到擒来么。。那就差自己写一本这样的书了吧", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 278765692, "answer_text": "感觉期末要挂了，大三学生一口老血吐出来，决策树，向量机，贝叶斯，不是我等愚笨之人所学的。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 270975036, "answer_text": "灵魂阿赖耶识 人工智能自我意识与情感 感知理解反思处境行为 学习记忆推理建模 博弈非完整信息 盲人画家灵魂阿赖耶识 人工智能自我意识与情感 感知理解反思处境行为 学习记忆推理建模 博弈非完整信息 盲人画家西安交通大学教授郑南宁：人工智能的下一步是什么？―中国教育和科研计算机网CERNET西安交通大学教授郑南宁：人工智能的下一步是什么？2016-12-15 中国教育网络院士谈信息领域的颠覆性技术编者按：　　10月25～26日，“国际工程科技发展战略高端论坛——信息领域的颠覆性技术”在西安开幕，百余名国内外院士、专家出席，现场听众近700人。本次论坛的主题是“信息领域的颠覆性技术”。论坛由中国工程院主办，西安交通大学、中国工程院信息与电子工程学部共同承办，是中国工程院信息学部最重要的年度学术活动。本届论坛设置主题演讲、分论坛两大环节，26位专家将各自研究领域所获得的杰出成就发表演讲，研究范围涉及人工智能、认知计算、人机交互、云计算、知识自动化、机器人、大数据、虚拟现实、集成电路、高性能计算、空天一体化信息网络、计量检测等领域。撷取部分与会嘉宾的精彩观点与读者一起分享。郑南宁：人工智能的下一步是什么？<img src=\"https://pic4.zhimg.com/50/v2-2b2b9ceace1bcdd5e8e6821a650f2636_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"296\" data-rawheight=\"295\" class=\"content_image\" width=\"296\">郑南宁：中国工程院院士、西安交通大学电信学院教授　　随着2006年Hinton等人提出深度学习概念，人工智能研究进入了崭新的发展时期，也不断地影响、推进着相关众多产业、行业的快速发展。人工智能“精彩回归”，重新受到学术界、产业界等社会各界的广泛关注。　　人工智能是研究人类智能活动的规律，构造具有一定智能的人工系统，使机器能够像人一样思维和认知。当前人工智能的研究前沿之一是如何实现由完整信息到非完整信息的处理，构建更加健壮的人工智能，使人工智能系统对用户错误、目标偏差、错误模型以及未建模对象具有更好的适应性。无人驾驶就是一种典型的非完整信息处理问题。　　由于我们不可能为所有的问题建模，“未知的未知”问题对构建稳健的人工智能系统提出了挑战。为了设计更加健壮的人工智能，需要采用稳健优化、学习因果模型和组合模型等方法来提高人工智能建模问题的稳健性。　　要设计更加健壮的人工智能，首先要提升对于模型错误的稳健性，对风险敏感的目标进行优化，采用稳健推理的算法，如采取谨慎的策略提升应对建模错误情况下的鲁棒性；其次，需提升对于为建模问题的稳健性，扩充模型、学习因果模型、采用组合模型监测模型表现以检测异常等。　　从人工智能的研究来看，我们长期以来坚持两个目的：一是如何使机器更加聪明，二是如何用机器模拟人的智能，同时能够发展出更聪明的机器帮助人类更好地发展。从人的角度来思考，建立一种智能系统需要以下基本的因素：它必须要适应我们的世界，要具备学习的能力，同时需要有记忆能力，在学习记忆的基础上完成推理，另外在推理的过程中还必须建立一种因果模型。　　直觉推理可以看成两个方面：一个是物理层面的推理，就是可以跨越时间尺度给出判断和情景演变的过程；另一个是心理层面的推理。无人驾驶车事故的例子，说明无人驾驶车是在非完整信息下出现的问题。如何在不完整信息下让机器做出正确判断，使得机器具有推理和自主学习的能力，这样的过程是健壮的人工智能能够实现的。　　人的认知过程，在很多场合下是从全局到局部的，在大量先进知识的前提下，往往是一种自上而下的过程。我们做了一个让计算机实现对人体运动进行分析的实验，并选择了乐团的指挥。乐团的指挥实际上是乐团的灵魂，在乐团演出中每一个人都要按照指挥的动作把曲子用自己演奏的乐器表达出来。通过身上的标记点把指挥的动作通过摄像机模拟出来，把一个指挥家的动作合成以后，我们让机器来指挥。　　人工智能是一门综合性的前沿学科和交叉学科，其发展与信息科学、认知科学、神经生物学、心理学、数学等学科深度融合。发展人工智能要做到“两手抓”，即一方面要踏踏实实积极推进人工智能的基础理论研究，另一方面要重视人工智能在重大学科领域和重大工程中的实践应用。开展科学研究的目的是造福人类，但在历史进程中，科学技术也曾被别有用心者利用而阻碍了社会发展，甚至给人类带来灾难。　　实现类人水平的人工智能还需要迎接哪些挑战？一是如何让机器在没有人类的帮助下学习，二是如何让机器像人类一样感知和理解世界，三是如何让机器具有自我意识、情感以及反思自身处境与行为的能力。使机器具有自我意识和反思能力是类人智慧最难的挑战，无论对科学和哲学来说，这都是一个引人入胜的探索领域。　　未来三十年，人工智能将在计算能力、人工智能系统等方面催生颠覆性技术，其研究成果将在社会管理、国防、生命健康、金融、能源、农业、工业等众多领域大放光彩，人工智能也将迎来新的发展高潮。未来，人工智能将渗透到人们生活中的各个角落，成为人们生活中不可或缺的组成部分。　　（本文根据郑南宁在“国际工程科技发展战略高端论坛”上的讲话整理，未经本人确认）=-===========================================================================中国工程院院士郑南宁：人工智能发展应明确方向中国工程院院士郑南宁：人工智能发展应明确方向_人工智能,机器,挑战,智能制造及工业4.0-中国智能制造网2016年06月21日 11:32:28中国智能制造网人气：30906　　【中国智能制造网 名家论谈】不久前，围棋软件“阿尔法围棋”战胜围棋世界冠军李世石，让人们惊叹人工智能发展取得的成就。这是否意味着机器即将获得类人智能呢？现在得出这样的结论还为时过早，但确实需要思考人工智能的发展方向问题。中国工程院院士郑南宁：人工智能发展应明确方向当前，人工智能在发展中面临三大挑战。第一大挑战是让机器在没有人类教师的帮助下学习。人类的很多学习是隐性学习，即根据以前学到的知识进行逻辑推理，以掌握新的知识。然而，目前的计算机并没有这种能力。迄今为止，最成功的机器学习方式被称为“监督式学习”。与老师教幼儿园孩子识字一样，机器在每次学习一项新技能时，基本上都要从头开始，需要人类在很大程度上参与机器的学习过程。要达到人类水平的智能，机器需要具备在没有人类过多监督和指令的情况下进行学习的能力，或在少量样本的基础上完成学习。也就是说，机器无须在每次输入新数据或者测试算法时都从头开始学习。【修行人解读 人类的学习能力依据唯识学，关键是阿赖耶识种子依，人类的学习能力是存在于人的整个生命体的灵命之中。后天的教育与学习，不是人类学习能力的全部，否则不能解释莫扎特8岁就可以作曲，并且8是的作品一直流传至今，不断演奏而具有生命的感召力。也许随着科学的发展，阿赖耶识的种子依，也会被人类证明。人工智能现在只是被动的监督式学习，达不到主动地隐性学习，更谈不到阿赖耶识种子的流转】第二个挑战是让机器像人类一样感知和理解世界。触觉、视觉和听觉是动物物种生存所必需的能力，感知能力是智能的重要组成部分。在对自然界的感知和理解方面，人类无疑是所有生物中的佼佼者。如果能让机器像人类一样感知和理解世界，就能解决人工智能研究长期面临的规划和推理方面的问题。虽然我们已经拥有非常出色的数据收集和算法研发能力，利用机器对收集的数据进行推理已不是开发先进人工智能的障碍，但这种推理能力建立在数据的基础上，也就是说机器与感知真实世界仍有相当大的差距。如果能让机器进一步感知真实世界，它们的表现也许会更出色。要达到人类水平的智能，机器需要具备对自然界的丰富表征和理解能力，这是一个大问题。尽管围棋很复杂，让计算机在棋盘上识别最有利的落子位置也很难，但与精确地表征自然界相比，描述围棋对弈的状态显然要简单得多，两者之间的差距还要几十年甚至更长时间才能弥合。【修行人解读 人类之所以具有感知和理解世界的能力，首先是人类文明4万年以来发展与进化的结果。在印尼的原始森林的存在的原始部落，由于他们与现代社会存在数千年的隔绝，原始部落的人群的感知和理解的世界，就与现代社会人群感知和理解的世界大大不同，原始部落抛弃吃人的高尚习俗还是近30年的事情。所以，对于人类为何具有的感知和理解世界的能力，是属于人类意识与灵魂的范畴，作为科学家的院士，有此犯下凡重大失误也是可以理解。郑南宁，男，汉族，1952年12月生，祖籍陕西西安，出生于江苏南京。1975年毕业于西安交通大学电机工程系；1981年西安交通大学获工学硕士学位。毕竟院士的生活的年代与社会环境背景是那样的。但是院士对于人类的博弈与计谋，还是有深刻的认知。尽管围棋很复杂，让计算机在棋盘上识别最有利的落子位置也很难，但与精确地表征自然界相比，描述围棋对弈的状态显然要简单得多，两者之间的差距还要几十年甚至更长时间才能弥合。】第三个挑战是让机器具有自我意识、情感以及反思自身处境与行为的能力。这是实现类人智能最艰难的挑战。具有自我意识以及反思自身处境与行为的能力，是人类区别于其他生物最重要、最根本的一点。另外，人类的大脑皮层能力是有限的，如果将智能机器设备与人类大脑相连接，不仅会增强人类的能力，而且会使机器产生灵感。让机器具有自我意识、情感和反思能力，无论对科学和哲学来说，都是一个引人入胜的探索领域。【修行人解读 人工智能具有人类自我意识，是完全不可能的。人类的自我意识，是因为人类与宇宙生命体是一体的。人类至今都无法解读意识的机理，今后也解读不了。灵命与灵魂问题，是一个远远超越人类本身的哲学问题，也是人类的终极问题。世界，也许就是一个宇宙大生命的模拟的、梦幻的镜像，宇宙的本体在哪里呀？这是一个不是人工智能的科学院士，可以回答的问题。】人工智能的发展能不断帮助人类，但它同时也是一把“双刃剑”。我们要警惕人工智能给人类带来的负面影响，关注人工智能的发展将带来的深刻伦理道德问题。我们需要的是帮助人类而不是代替人类的人工智能。发展人工智能的目的不是把机器变成人，也不是把人变成机器，而是要扩展人类的智能，解决人类社会发展面临的重大问题。这是科学界、各国政府和人类社会在人工智能发展上应认真对待的问题。需要确立伦理道德的约束监督机制，使人类免受人工智能不当发展带来的负面影响。(来源：人民日报 原标题：中国工程院院士郑南宁：发展有助于人类的人工智能)文章链接：中国智能制造网 http://www.gkzhan.com/news/detail/88302.html============================================================================郑南宁：发展强人工智能需从脑认知和神经科学寻求启示郑南宁：发展强人工智能需从脑认知和神经科学寻求启示-新闻-科学网当前，人工智能已经成为席卷社会各界的热潮。今年7月，国务院印发了《新一代人工智能发展规划》，一系列支持政策和措施正在逐步推进。在日前在济南举办的2017中国自动化大会上，中国工程院院士郑南宁向记者表示，当前，人工智能渗透到了社会各个领域，但目前来看，无论是深度学习还是其它方法，解决的都是单一问题，而人类大脑是一个多问题求解的结构，“当前急需发展强人工智能，而这可以从脑认知和神经科学中得到启示”。郑南宁指出，人类面临的许多问题都具有不确定性、脆弱性和开放性。今天人工智能的理论框架，建立在演绎逻辑和语义描述的基础方法之上，但我们不可能对人类社会所有问题都进行建模，因为我们不能把一个行为的所有条件都模拟出来，这就是传统人工智能的局限性。“因此，我们要建造一种更加健壮的人工智能，需要脑认知和神经科学的启发”，郑南宁指出，计算机和人类大脑是为问题求解的物质基础。在智力和计算能力方面，计算机远远超过了人类，但是人类面对的大部分问题都是开放的、动态的、复杂的，大脑在处理这种问题时表现出的想象和创造，还有对复杂问题的分析和描述，是传统人工智能方法所不能企及的，因此，我们只能从人类大脑的神经网络结构中，去获得构造新的人工智能的因素。郑南宁介绍，人类大脑非常奇妙，正是在这个物质基础之上，才演义出人类世界的发展和为问题求解的各种方法，“大脑不是通过一个统一的、未分化的神经网络，来实现单一的全景优化学习。大脑是模块化的，具有独特且相互作用的系统来支持认知功能，如记忆、注意、语言和认知控制。脑认知和神经科学的研究成果，可以为解决人工智能长期存在的规划与推理问题提供新的方法”。郑南宁进一步介绍，人的大脑有800亿个神经元容量。我们可以通过大脑的结构连接、功能连接和有效连接的聚合与分离来洞察大脑的认知机理，“大脑的结构连接是相对静态的，而功能连接和有效研究则具有时空动态演化的特性。有效连接描述了神经元之间的因果与相互影响关系”。“直觉推理、认知推理和因果模型是构建健壮的人工智能必须考虑的基本因素”，郑南宁最后表示。=========================================================================【解读新一代人工智能规划】郑南宁院士：混合增强智能——协同与认知【解读新一代人工智能规划】郑南宁院士：混合增强智能——协同与认知2017-08-04 16:06人工智能/操作系统/人类人工智能是一种引领许多领域产生颠覆性变革的使能技术，合理并有效地利用人工智能技术，意味着价值创造和竞争优势。为抢抓人工智能发展的重大战略机遇，依托我国应用需求和市场的巨大优势，加快建设创新型国家和世界科技强国，在党中央、国务院统一部署和要求下，《新一代人工智能发展规划》（以下简称规划）对我国人工智能发展战略做了全面部署，明确了我国人工智能发展的总体要求及三步走的战略目标，并将人机协同的混合增强智能作为规划部署的五个重要方向之一。智能机器与各类智能终端已经成为人类的伴随者，人与智能机器的交互、混合是未来社会的发展形态。人机协同的混合增强智能是新一代人工智能的典型特征。当前的人工智能系统在不同层次都依赖大量的样本训练完成有监督的学习。真正的通用智能会在经验和知识积累的基础上灵巧地无监督学习。如果仅仅是利用各种人工智能计算模型或算法的简单组合，不可能得到一个通用的人工智能。特定领域的人工智能系统如谷歌的Alpha Go、IBM的深蓝和Watson等依赖强大的计算能力在挑战人类智力方面取得了巨大进步，但这些系统还无法通过自身思考得到更高层次的智能，它们与具有高度自主学习能力的通用人工智能依然存在着差距。但是，人工智能在这些特定领域应用的巨大成功为我们研究与发展新一代人工智能提供了重要的借鉴和新的方法。人类面临的许多问题具有不确定性、脆弱性和开放性，也是智能机器的服务对象和最终“价值判断”的仲裁者，因此，人类智能与机器智能的协同是贯穿始终的。任何智能程度的机器都无法完全取代人类，这就需要将人的作用或认知模型引入到人工智能系统中，形成混合-增强智能形态，这种形态是人工智能或机器智能的可行的、重要的成长模式。混合增强智能形态可分为两种基本实现形式：人在回路的混合增强智能，基于认知计算的混合增强智能。一、人在回路的混合增强智能将人的作用引入到智能系统中，形成人在回路的混合智能范式。在这种范式中人始终是这类智能系统的一部分，当系统中计算机的输出置信度低时，人主动介入调整参数给出合理正确的问题求解，构成提升智能水平的反馈回路。把人的作用引入到智能系统的计算回路中，可以把人对模糊、不确定问题分析与响应的高级认知机制与机器智能系统紧密耦合，使得两者相互适应，协同工作，形成双向的信息交流与控制，使人的感知、认知能力和计算机强大的运算和存储能力相结合，构成“1+1>2”的智能增强智能形态。在当前大数据、深度学习在不同领域不断取得突破性成果之际，更需要清楚认识到，即使为人工智能系统提供充足、甚至无限的数据资源，也无法排除人类对它的干预。例如，面对人机交互系统中对人类语言或行为的细微差别和模糊性的理解，特别是将人工智能技术应用于一些重大领域（如产业风险管理、医疗诊断、刑事司法、自主驾驶、社会舆情分析、智能机器人等）时，如何避免由于人工智能技术的局限性而带来的风险、失控甚至危害？这就需要引入人类的监督与互动，允许人参与验证，提高智能系统的置信度，以最佳的方式利用人的知识，最优地平衡人的智力和计算机的计算能力，从而实现大规模的非完整、非结构化知识信息的处理，有效避免由于当前人工智能技术的局限性而引发的决策风险和系统失控等问题。二、基于认知计算的混合增强智能在人工智能系统中引入受生物启发的智能计算模型，构建基于认知计算的的混合增强智能。这类混合智能是通过模仿生物大脑功能提升计算机的感知、推理和决策能力的智能软件或硬件，以更准确地建立像人脑一样感知、推理和响应激励的智能计算模型，尤其是如何建立因果模型、直觉推理和联想记忆的新计算框架。对当前人工智能而言，解决某些对人类来说属于智力挑战的问题可能是相对简单的，但是解决对人类来说习以为常的问题却非常困难。例如，很少有三岁的孩童能下围棋（除非受过专门的训练），但所有的三岁孩童都能认出自己的父母，且不需要大量经过标注的人脸数据集的训练。人工智能研究的重要方向之一是借鉴认知科学、计算神经科学的研究成果，使计算机通过直觉推理，经验学习将自身引导到更高层次的。另外，在现实世界中，人们无法为所有问题建模，这里存在条件问题（Qualification Problem）和分支问题（Ramification Problem），即不可能枚举出一个行为的所有先决条件，也不可能枚举出一个行为的所有分支。而人脑对真实世界环境的理解、非完整信息的处理、复杂时空关联的任务处理能力是当前机器学习无法比拟的，还有人的大脑神经网络结构的可塑性，以及人脑在非认知因素和认知功能之间的相互作用，它们是形式化方法难以、甚至不能描述的。人脑对于非认知因素的理解更多的来自于直觉，并受到经验和长期知识积累的影响。人脑所具有的自然生物智能形式，为提高机器对复杂动态环境或情景的适应性，以及非完整、非结构化信息处理和自主学习能力，为构建基于认知计算的混合-增强智能提供了重要启示。认知计算架构可以将复杂的规划、问题求解与感知和动作模块相结合，有可能解释或实现某些人类或动物行为以及他们在新的环境中学习和行动的方式，可以建立比现有程序计算量少得多的人工智能系统。在认知计算的框架下，可以构建更加完善的大规模数据处理和更多样化的计算平台，也可为多代理系统解决规划和学习模型的问题，以及为新的任务环境中的机器协同提供新的模式。人工智能追求的长期目标是使机器能像人一样感知世界和解决问题。当前的人工智能已不是一个独立、封闭和自我循环发展的智能科学体系，而是通过与其他科学领域的交叉结合融入到人类社会进化的过程中，并将深刻改变人类社会生活，改变世界。【修行人解读 人类之所以具有感知和理解世界的能力，首先是人类文明4万年以来发展与进化的结果。在印尼的原始森林的存在的原始部落，由于他们与现代社会存在数千年的隔绝，原始部落的人群的感知和理解的世界，就与现代社会人群感知和理解的世界大大不同，原始部落抛弃吃人的高尚习俗还是近30年的事情。所以，对于人类为何具有的感知和理解世界的能力，是属于人类意识与灵魂的范畴，作为科学家的院士，有此犯下凡重大失误也是可以理解。郑南宁，男，汉族，1952年12月生，祖籍陕西西安，出生于江苏南京。1975年毕业于西安交通大学电机工程系；1981年西安交通大学获工学硕士学位。毕竟院士的生活的年代与社会环境背景是那样的。但是院士对于人类的博弈与计谋，还是有深刻的认知。尽管围棋很复杂，让计算机在棋盘上识别最有利的落子位置也很难，但与精确地表征自然界相比，描述围棋对弈的状态显然要简单得多，两者之间的差距还要几十年甚至更长时间才能弥合。】【修行人解读 人工智能具有人类自我意识，是完全不可能的。人类的自我意识，是因为人类与宇宙生命体是一体的。人类至今都无法解读意识的机理，今后也解读不了。灵命与灵魂问题，是一个远远超越人类本身的哲学问题，也是人类的终极问题。世界，也许就是一个宇宙大生命的模拟的、梦幻的镜像，宇宙的本体在哪里呀？这是一个不是人工智能的科学院士，可以回答的问题。】==============================================https://zhuanlan.zhihu.com/p/31699318嘉露莲、布琴科夫、派保、菲蒂帕、沈冰山盲人画家 30岁失明Bramblitt现能见更多颜色 陶进失明人水墨世界说起绘画艺术来，许多人都说：画画是视觉艺术。确实，绘画艺术作品的创造靠直觉和直观，但人们往往把这直观的“观”简单地理解为是视觉。在中国传统文化中“直观”不仅包括眼睛“看”这种“观”，而且包括远远超过这种意义的深刻认识。“观”这个词，在中国传统文化中，其意义是繁多的，但是，有几层意义，是值得特别重视的。在《说文解字》中，释“观”为“谛视也”。“谛”则释为“审”。就是说，这种“观”不是一般的看，它要达到的目的，也不是一般所要达到的目的。这在《易传》中，更明确地指出：“常事曰视，非常曰观”。老子在《道德经》中所用之“观”，正是在这种“非常”的意义上。“道可道，非常道”。其所指是，“道”乃“非常”，不可言说。虽然不可言说，但却可以“观”。因此，“直观”就中国传统文化而言，必须从超越眼睛看这种意义上去领会，才能进入事情的本质。其实，人了解信息和掌握信息是有很多渠道的，人的六根②即眼、耳、鼻、舌、身、意的互用就足以证明了这一点。当然，眼睛是最便捷获得信息的渠道之一，但并不是唯一。著名科学家钱学森教授说：“有的人与常人不同的实践，也就有一种特别的思维，他能处理普通人扔掉的信息”。每当我带着盲人绘画班的学生去公园、郊外去写生花卉时，盲人学生都能用手辩认出红花、蓝花、白花……这是因为不同色彩的花朵在温度上有一点点差别，而使盲人认出它们的颜色，这叫以手代目；每当我带着盲人学生去树林中画树时，总会有盲人对我说：“这有一只美丽的小虫站在树叶上”，我看了半天都没看见，于是盲人拉着我朝他嗅到气味的方向走去，把树叶一翻开，原来漂亮的小虫就在我们身边，我却看不到。然而盲人以鼻代目却看到了并在地上画给我看“它是园形的红色的，然后在红色的园中有规律的点上七个黑点”此时，七星螵虫活灵活现的展示在我眼前；每当我带着盲人学生到山里去画大山时，盲人学生通过双耳听山中的回音，从而观察出山的近远、大小、多少并画出来。这叫做以耳代目。这就是普通人扔掉的信息，即认定没有眼睛观察就无法做画的道理。从远古记载的所有资料中，我们也可以清楚地看到这样一个事实，在人类还没有创造出文字之前人类就用绘画、舞蹈等进行交流，这就是与人类象思维有关的形象思维的问题。是的，象思维乃是人生来的一种本能，一种本原性的思维③。只是这种“本能”或“本原”在概念思维占统治地位，或者说概念思维成为思维“常态”之后，人的这种“本能”或“本原”就经常被遮蔽或被抑制，久而久之甚至有所退化。例如，传统中国文人，许多人都是琴、棋、书、画四样都会的，至少精通书法、会作诗。但是，现在，就是从中文系毕业，从事文化或文艺事业的人，不用说琴、棋、书、画中四种都会，就是能作诗的，又有几个？在这里，确实可用老子的名言“为学日益，为道日损”来解释这种“退化”现象。老子批评的“学”，在春秋末期，主要是指儒家为代表的“礼乐”文化。“礼”之“明份”，“乐”之“合同”，无论是作为理论规定，还是作为治国的典章制度，都是一种理性化的表现。从思维方式上看，也是强化概念思维的表现。为什么“为学日益，为道日损”？就在于作为“礼乐”的“学”，在概念思维的框架里出现僵化，从而使显示宇宙万物一体相通的“道”受“损”，即出现堵塞。现代人，其所以缺乏象思维，正是这种在概念思维框架中所显示的“为学日益，为道日损”。从现代脑科学的意义上看，用《数字化生存》的作者尼葛洛庞蒂的话来说，就是只用左脑而使右脑萎缩。但是人们却没有意识到这种右脑萎缩的可怕性，有些人反而指责别人对右脑的开发，对人的潜能挖掘，诸如：绘画艺术又不是闹着玩的，没有双眼是不可能画画的。那么我又是怎样教盲人学画画的呢，概括而言：一听，听理念课树立信心战胜自己的弱点，听用笔在纸上组成不同造型时的声音特点，听自然界美好的氛围之声，从而激发自己的创作冲动。二嗅，让盲人学生嗅出不同五颜六色的味道，嗅出浓淡墨色的味道，嗅出一幅新国画构图的墨味布置和五颜六色的分布来。三比，拿着盲人的手当画笔在画纸上比画着学构图，在手掌心上练造型等等。四摸，摸我用硬纸剪出来的各种动物、植物的形状及构图等。五练，勤能补缺，用心苦练，早晨4—5点就起来静心的用心听毛笔在纸上造型时如春蚕吃叶的声韵之味，并加以总结成为自己的心得。六评，我们老师再对盲人学生的国画习作进行讲评指导等。特殊艺术中的盲人绘画犹为特殊，盲人画家嘉露莲这样说：我们行事为人，是凭着信念、信心，而不是凭着眼见。由于盲人失去了视力，他们认识色彩是凭着嗅觉和触觉，他们深有体会的说：每一种色彩都有自己独特的气味。而且用手触摸也会有不同的感觉。例如红色使我的手指尖感到暖，而蓝色则感到凉……。正因为他们不用视力去绘画，所以她们的绘画都不是写实的，而是中国式的写意画，他们把用心去观察到的事物凭借着想象去创造，这就是特殊功能的绘画艺术，是心灵的画卷。正如印象派绘画大师塞尚所讲的：“艺术不是直接描绘，而是我心灵的作品”，这才充分体现了艺术挑战精神的极限，只有这样，绘画才能治心明道，盲人才能从艺术中得到完美，所以盲人绘画是特殊的，其创作的一般过程是这样：她由一条向导狗带领，拿着录音机到风景区去散步，录下水流，鸟鸣、风吹树林、狗踏青草等声响。回家后，反复播放录音带，当这些感觉冲动使她得到一幅画的意念和意象时，就要聚精会神，“发疯似地画起来”。她说：“我只是画出我心中的画，直到我的心感觉已经完成时为止”。盲人的画就是这样热衷于表达心灵，表达内心的情绪，这些方面是复杂和潜在的，是非语言，非文字的，也就是说：绘画艺术必须忠实于自己的感受，在表现自我感受的过程中不能照顾到谁，如把该照顾的都照顾完了，艺术家自身也就不存在了。是的，特殊艺术中的盲人绘画正是按照“艺术上的突破，以思想上的突破居先。艺术上的变，以魂质上的升华更有价值。”去实践的，当盲人画家们在观念上冲破绘画一定要视觉的框架之后，就享受到了公民的权力，就明白了“等你逼近生命极限，把曾经想都不敢想的事也做过了，这就叫无憾的人生。”John Bramblitt绘画的方式与盲人阅读的方式相同，通过触摸纹理而感受。John Bramblitt通过使用一种特殊类型的油漆，在画布上用线条创造属于他的艺术品，他说，每种颜色颜料的手感不一样，这样调色是靠自己触摸的感觉而决定。“有时候人们很难理解我是如何画画的，但这真的很简单”他笑道“这需要耐心”。在他的网站上他说：“我所作的基本上就是把所有能看见的画家眼睛的工作用触觉来代替。突起的线条让你找到画布上颜色的位置。”Bramblitt说失明对于他来说是生活的转折点，因为他开始在最黑暗的洞穴中发现了出路，那就是艺术。他开始用速干颜料在画布上画出线条，将空白的画布涂满颜色。随着他越画越多，他发现每种颜色都有不同的质感。神奇的盲人画家和他的作品神奇的盲人画家和他的作品_趣闻趣事_中文幽默王<img src=\"https://pic2.zhimg.com/50/v2-66b5486ae1ba0224ee5396cd2a155d29_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"550\" data-rawheight=\"363\" class=\"origin_image zh-lightbox-thumb\" width=\"550\" data-original=\"https://pic2.zhimg.com/v2-66b5486ae1ba0224ee5396cd2a155d29_r.jpg\">　　你能相信这些彩色画作是出自一位盲人画家之手吗？没错，他就是现年53岁的土耳其画家Esref Armagan，一出生就失明的他，却可以画出人物、山水、房屋、蝴蝶等，甚至还绘制了自己的肖像画，而且可以很好的应用色彩、阴影、透视比例等绘画技巧，是不是很神奇？佛家的“天眼说”或修炼界所谓的“第三只眼”。佛家的“天眼”说“天眼”真的存在吗？_本来如此_新浪博客大约二十多年前，科学家们一直认为人的神经细胞分工很细。比如，视觉细胞只接收处理眼睛传来的信号，而听觉细胞只是对声音有反应。但后来研究人员发现神经细胞其实可以有多种功能。比如在灵长类动物的实验中，一些细胞既可以对手的触摸有反应，同时也可以“看”得见距离这只手几厘米内的物体。和李教授合作进行特异功能研究的物理学家陈建德教授则是从佛家“开天眼”的说法来解释。天眼在人的两眉之间往上一点连结松果体这个位置上。陈教授认为用手识字，可能就是这只“天眼”发挥的功能，也就是修炼界所说的第三只眼所起的作用。在许多古老文明的神像、祭司的面具上，或印度的佛像，道家的神像上在额头的部位都不约而同地刻画者这一只眼睛。古希腊哲学家将其称之为“灵魂的宝座”。史记“扁鹊列传”中记录着神医扁鹊具有“视人五脏颜色”的能力。他具有天眼，能透视人体，然后配合自己的医学知识，帮人“看”病。这个例子在俄罗斯也有，根据真理报2004年1月的报导，俄罗斯的一个小女孩娜塔莎可透视人体内部器官，看到其中有病的部位。从小失明的盲人画家艾斯莱福·阿马甘（Esref Armagan）和其风景画作。著名“盲人绘画”的实例2005 年1月的《新科学家》杂志报导了一个从小失明的盲人画家艾斯莱福·阿马甘（Esref Armagan）画图的事例。按理说他这辈子完全没看过任何景象，然而他却可以画出山川、湖泊、房屋、人物和蝴蝶，对于色彩、阴影和透视比例的处理亦非常专业。哈佛大学的神经学学者阿尔瓦罗·帕斯库尔-勒奥纳（Alvaro Pascual-Leone）邀请阿马甘到美国波士顿接受测验。勒奥纳教授也请阿马甘作画，画一条伸向远方的路和路边的电灯柱。盲眼画家一手作画，另一手指尖触摸纸面完成作品。在视觉功能缺失时，人大脑中负责视觉功能的区域并不会停止工作。而扫瞄阿马甘的大脑时，发现在他作画的时候，这一区域也发光，正像他“看”到了一样。勒奥纳教授说，阿马甘虽然没有光感，但是他的“观察”能力与正常人不相上下，他还能将反映到他大脑中的物体在纸上完整地表达出来。科学家因此认为：争论多年的关于人的意识眼(mind eye)应该是存在的，而且每个人都有，但是有正常视力的人所感知的外部信息太强，从而将这种能力淹没了，阿马甘却得以发挥了这种能力。有些学者认为人体有许多潜在能力尚未被开发出来，而这只天眼其实就是人的本能之一。================================================================", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "人邮异步社区", "answer_id": 255760641, "answer_text": "畅销榜上的深度学习和机器学习书单！", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "西瓜骑士", "answer_id": 252233631, "answer_text": "做程序也是一项创造型工作，创造型工作，思路永远比技术更重要。也许一个算法能让你的某个功能效率提升十倍，但有可能换个思路，就可以让你整个软件提升整整一代。要进阶你就得从实际应用出发，进阶需要的是结合实际所产生的很酷的思路灵感。然后实现这个灵感所需的知识才是你需要的理论知识。至于其他的知识？在你这个方向上，就属于被淘汰的知识。进阶的代价？看过“一拳超人”没有？当你秃了，就变强了", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "Sun1one", "answer_id": 250549809, "answer_text": "进一家好公司！【黑科技】BMW宝马无人驾驶汽车项目，需要6名C++程序员，要懂Robortics、machine learning、AI，博士优先， fluent English：work with Germans，薪资待遇超级open！微信：evansun1994", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "围墙", "answer_id": 249860306, "answer_text": "我也研一，不过刚开始学，打算暑假前达到你这种程度的一半左右，然后找实习。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "文谊", "answer_id": 249358262, "answer_text": "题主你是在钓鱼执法，鉴定完毕！", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "荷马全", "answer_id": 227865158, "answer_text": "像Hassabis那样修个脑神经研究，认知科学的博士。或者像Minsky从哲学角度去思考人类意识的原理。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "姜煜", "answer_id": 224408500, "answer_text": "我觉得这篇文章，楼主更想知道自己在学完这些书以后，水平和能力在什么位置", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "JunLu", "answer_id": 210898617, "answer_text": "推荐台大的course课程（现在coursera已经不更新了），可以找一下网络的视频", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 156844993, "answer_text": "踏踏实实的打基本功，一步一步来， “部分《凸优化》”，你可能就看了前五章，先看完嘛 ，然后找博士后或者高年级博士生，让他们带你做科研，或者去公司参与项目，学完手头的，别再自学瞎折腾了。心态一定要调整好，一些从事机器学习的人犯了一些路线错误，不要犯这些错误：第一、盲目崇拜：1）对由于团队的马太效应和人口红利而成果很多的大Boss进行个人崇拜；2）CS类本科出身的人对数理类本科出身的人，无论他们数学知识掌握怎样，先盲目崇拜一下；第二、不实事求是：1）自我定位不清醒，明明是灌水还自我感觉良好，因为在顶会灌了水；2）妄想出优越感，忽视其他方向和学科，在小圈子里面自我繁荣，推了几个公式觉得自己跟数学家一样，仔细想想，你不就是个做拟合函数的吗；就会那一点儿东西还掌握的不怎样，其他知识又不懂多少，甚至有些人生活不能自理，又找不到对象又买不起房子，就是个准中产还觉得自己跟芸芸众生不一样；第三、左倾路线：1）急功近利的心态严重，因为机器学习相比数理化文史哲而言，它周期短，所以人比较浮躁；2）机会主义，一窝蜂去灌一个很火的方向想搞大新闻；第四、人格分裂：1）一些公司的研究员因为找不到教职而刻意去贬低高校的老师，说高校在灌水，但他们自己也在灌水；2）有一部分混学术圈的，明明就是个走资派大奸商，而装作科学家；3）微博和朋友圈和facebook全是转发来的技术贴子，跟转发机器人一样，这当然是你们的自由，但你们技术咋样自己不清楚吗，这么大年龄的人了，装什么三好学生；4）不是因为爱好而去做科研，而是因为想打败别人，而去顶会灌水，再说你灌了几篇NIPS了，有种亮出来第五、私德一般：确实有些很优秀的人，工作很拼，透支健康，不关心父母、配偶、子女；第六、公德一般：1）别人明明有贡献，别管人家是朋友还是网友，亦或是实习生，却最后发文章不挂人家名字；2）不回邮件，您装什么大忙人——————————骂的真爽！——————————题主要好好学习。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 155732322, "answer_text": "没有顶会paper在手是没有底气说自己过了入门阶段的。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "醒醒", "answer_id": 146002758, "answer_text": "看ng的视频斯坦福大学公开课 ：机器学习课程。有几个将近两个小时，而大部分内容都理论性比较强， 重复率太高，我坚持不下来，所以跳着看，居然很多内容也能看懂。用sklearn工具做一些简单的数据分析，分类、回归、聚类等，看sklearn的文档contents - scikit-learn 0.18.1 documentation是个力气活，很多问题讲的不细致还得揪住一个词网上查半天。比如1.9. Naive Bayes 朴素贝叶斯分类这部分，文档中列出了核心的公式，虽然是理解该模型的关键，但是想真正理解贝叶斯分类器的设计意图，并跟一个外行讲明白其原理，我是看了一个下午加一个晚上，跟着媳妇一起争论中学习明白的。原来贝叶斯分类器记录了每个标签y对应的xi的多个正态分布模型N（u，i^2），并在预测时对每个标签y都计算一遍概率的连乘，选出最大的概率那个标签。虽然不知道sklearn背后是怎么实现的，但是我相信给我时间我也能实现一个了。当然，彻底的弄明白要到我真的实现了一个贝叶斯分类器之后才敢说。路漫漫其修远兮，一个小的知识点的掌握尚且如此波折，我相信成为专家之路一定不平坦。坚持在做中学，才是王道。纸上得来终觉浅，绝知此事要躬行。加油，与君共勉。--占坑，陆续更新", "answer_votes": "0", "answer_comment": "​1 条评论"}
{"answer_author": "匿名用户", "answer_id": 139216645, "answer_text": "如果能跟一个大神级的导师，那就事半功倍了", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "宇峰", "answer_id": 134299431, "answer_text": "你要是真的把你说的这些都搞得很精的话 我感觉你一定非常之 掰了 不至于找个实习都困难 问题原因在于自己 问问你自己到底会了什么 而不是追求看得多 看得多你不一定掌握得多", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "公骁", "answer_id": 87417663, "answer_text": "楼主是大神！ ", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "宇宙核桃仁儿", "answer_id": 86121129, "answer_text": "我觉得题主最重要的是找导师要科研方向。我想题主学了这么多理论，恐怕志向不在应用。我觉得老师的指点就非常重要了。题主这样的情况，一定要选好导师，要让导师知道自己的兴趣所在。导师们对于方向的把握是学生没法相比的。有了好老师的指点，事半功倍。我可不信一个学生，可以通过自己翻论文做出好的研究。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 85700077, "answer_text": "明明是进阶结果变成了各种初学者如何入门的回答。首先感到奇怪的是题主研一学这些东西是导师要求的还是题主趁着这股浪潮自学一番。如果是导师要求的，那跟着导师走不就行了。如果研究生阶段再耗费大量时间自学与自己方向没有太大联系的感觉不是很有必要。要想厉害一点的话，鉴于题主有cv的基础，关注cv界最新技术，并且针对当前最先进技术有一丁点的改进就行了，nlp同。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "轩辕璞懿", "answer_id": 85395409, "answer_text": "帮我们解决实际的业务问题吧！哈哈", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "东风雅士", "answer_id": 82822697, "answer_text": "题主，你已经是无可争议的大神了！", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "诗与远方", "answer_id": 75727098, "answer_text": "题主，你已经是大神了", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "西蒙尼", "answer_id": 74811363, "answer_text": "两个方向，看毕业读博还是直接工作。如果读博公式推导是看家本领，如果工作还是建议攻深度学习，这个不懂到时找工作劣势较大。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 73431691, "answer_text": "业务实践", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 73150662, "answer_text": "读博", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 73087241, "answer_text": "去发顶会paper", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 72252799, "answer_text": "别的不说，都已深入学习PRML至少不是入门级别了。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 72075170, "answer_text": " Ng的课没有实践么？还有各本书的练习。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 71446403, "answer_text": "你都自问自答了嘛模型清楚，缺乏实践，那就去实践呗自己爬大量数据做，或者kaggle，或者阿里大数据竞赛", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "当然原谅她啦", "answer_id": 80460885, "answer_text": ".", "answer_votes": "0", "answer_comment": "​添加评论"}
