{"question_id": "37966242", "question_text": "大家其实很早就开始接触到孟浩然了，从小学的“春眠不觉晓”到中学的“故人具鸡黍”，但在大学课堂上，文化课老师却给我们说孟浩然虽然是山水田园派诗人，但其实在唐朝连二流诗人都算不上，顶多三流末端。我不敢苟同，但无奈自己所读其诗甚少，想了解一些。", "question_title": "孟浩然的诗水平如何？", "question_commet": "​8 条评论", "answer_number": "30 个回答", "question_followers": "139", "brower_number": "26,233"}
{"answer_author": "向宇", "answer_id": 74742674, "answer_text": "谢邀。这几天琐事太多，迟复为歉。what！？孟浩然在唐朝连二流诗人都算不上？！好大棒子、好大口臭啊！且待我降住此妖，鞭之三百！我素来喜欢存诗量大的诗人，因为大量的诗作，更能全面反映诗人的经历、个性与性情。但是，有几个存诗量不大的诗人却除外，其中就有孟浩然。因为他的诗是那般的清丽淡雅、超然脱俗，一如其名浩然。查《全唐诗》可知，孟浩然现存诗约270首。主要是五言律诗和五言古诗，这两种体裁的数量加起来超过240首，占了绝大部分。其中，数量最大的是五律，有120首左右。可以说，孟浩然的主要成就在其五律和五古。下面我主要就这两种体裁举例。现在多把孟浩然归入所谓的田园派诗人，这有一定的道理。孟浩然在40岁之前，基本都在老家襄阳隐居，很多佳作创作于此时。实际上，孟浩然是唐朝第一个大量创作田园诗的人，他的好友王维比他要小十几岁，创作田园诗也比他晚。夏日南亭怀辛大    山光忽西落，池月渐东上。散发乘夕凉，开轩卧闲敞。荷风送香气，竹露滴清响。欲取鸣琴弹，恨无知音赏。感此怀故人，中宵劳梦想。这首诗就是典型的孟氏风格：清幽空灵、细腻真挚。从开始纳凉看夕阳、池月的视觉，到微风飒来的触觉，到荷风送香、竹露滴响的嗅觉与听觉。然后，由鸣琴而联想到知己，再想到好友辛大。全诗以时间推移为主线，展现了作者在那个宁静美好的夏夜所感触到的全部自然物和淡淡幽怀。以气格胜，却井井有条，通篇写实，却悠然韵远。和同时代的诗人比，不似李白的豪纵，不似王维的深粹，不似杜甫的盘郁，却着实是孟襄阳的清雅。——虽然是大叔，但分明是小清新的路子有木有？万山潭作    垂钓坐盘石，水清心亦闲。    鱼行潭树下，猿挂岛藤间。游女昔解佩，传闻于此山。    求之不可得，沿月棹歌还。上面这首五律，也是孟氏最具田园风味的诗之一。全诗冲淡空灵，全以神行。孟浩然的这种诗，最难得的就是随着诗人性情而来的一种气格，潇洒而飘逸。请看王维的几句诗：“我心素已闲，清川澹如此。请留盘石上，垂钓将已矣。”这两首诗有极为相似的意境，甚至措辞都相似。但和同被划入田园诗人的王维比，孟浩然展现的是一种陶渊明氏的淡泊与享受，而王维则更多的表现出禅思与寂灭。以上列举了孟氏的几首田园诗。但是，孟的另一些佳作却是在游历羁旅中写的，充满了乡思与人生感喟。因此，仅仅“田园”一个词不是能概括他的诗风的。实际上，孟浩然出山以后，名流争相交接，交游甚广，他有将近一半的诗歌是不能归入到“田园”类的。可见文学史上的流派标签误人甚多，特别是容易误导不肯读书的人。望洞庭湖，赠张丞相    八月湖水平，涵虚混太清。    气蒸云梦泽，波撼岳阳城。欲济无舟楫，端居耻圣明。    坐观垂钓者，空有羡鱼情。这首诗连《唐诗三百首》都选了，可见传诵之广。诗意也比较简单明了，就是想请当时的宰相张九龄开开东阁，引荐一番，这在唐朝文人中很常见，李白、杜甫都做过。当然，孟浩然写的比较委婉含蓄，不像李杜那样鼓足力气为自己吹牛逼。这首诗展现了孟诗的另一面，亦即，除了清雅幽静的诗风外，孟浩然还能写出浑厚阔大、势如奔涛的诗句。本诗的颔联，历代传诵，被认为是摹写洞庭湖最为杰出的诗句，只有杜甫晚年的“吴楚东南坼，乾坤日夜浮”，可以与之分庭抗礼，即使是陈与义的“登临吴蜀横分地，徙倚湖山欲暮时”这样的句子也落了下风。再看一首：与诸子登岘山人事有代谢，往来成古今。    江山留胜迹，我辈复登临。    水落鱼梁浅，天寒梦泽深。    羊公碑尚在，读罢泪沾襟。这是首怀古诗。意思也不外乎“荒冢一堆草末了”的感叹，这是历代怀古诗跳不开的桎梏，不独孟浩然是这样。但是孟的这首诗首联却以理句开篇，破空而来，点出主题，非常高妙，在他之前很少有人这样做。在他之后，也只有杜甫等少数人使用这种方法。到了宋代，这种方式就比较多了，比如王安石的“烈祖孤身取二江，子孙多以百城降”、苏轼的“人生到处知何似，恰似飞鸿踏雪泥”，等等。也就是说，孟浩然的这种单刀直入的写法，开后世特别是宋诗派的无限法门。留别王维    寂寂竟何待，朝朝空自归。    欲寻芳草去，惜与故人违。当路谁相假，知音世所稀。    只应守索寞，还掩故园扉。上面这首是孟浩然失意回乡、开始漫游生活之前，写给好友王维的。据说，孟浩然有一天在王维家做客，突然唐玄宗来了，吓得他噌的一下钻到了床底下。王维不敢隐瞒，就告诉了唐玄宗。玄宗说，早就听说过他，快叫他把帽子戴好，出来吟诗。结果孟浩然一出来就念了一句“不才明主弃，多病故人疏”。唐玄宗听了不高兴了，说是你自己不求进，不要怪我疏远你。于是呢就不欢而散了。孟浩然从此也就无异于官场了。这首诗有什么特别的地方呢？特别就在于孟写给王维这首诗，诗刻意模仿王维的诗风，而且模仿的惟妙惟肖，将自己失落的心情用芳草、柴扉等意象精确地表达出来，这正是王氏所擅长的；此诗置于右丞集中，几可乱真。可见孟浩然具有极为敏锐的辨别力和借鉴能力。他的诗风绝不单一，更不是某些论家指出的“少材料”。孟浩然在世是就已经诗名远扬，王维喜欢他就不用说了，李白也崇敬他：“吾爱孟夫子，风流天下闻。红颜弃轩冕，白首卧松云。醉月频中圣，迷花不事君。高山安可仰，徒此揖清芬。”李白眼中无人，却对孟浩然有这样的评价。在看了上面列举的那首洞庭湖诗之后，宰相张九龄还真引用了孟浩然，并礼遇有加。孟浩然去世后，诗人刘昚虚还特地写诗给孟的好友求寄其遗文诗篇。杜甫也赞扬他“清时句句尽堪传”。孟氏的名声在后世，就更加显赫了。实际上，历代所谓田园诗人，从稍晚的韦应物，到宋代的范成大，直到清代的张问陶，没有一个人能够完全绕开孟浩然的影响，或者说，后世的这些大诗人的身上都有孟浩然的影子在。总结一下吧。孟浩然的诗，其气高古，其情真挚，其辞清雅；他是唐代第一个大量创作大量田园诗的人，对后代产生不可计量的影响；他的诗歌具有极高的独创性，其五言古诗和律诗的诗艺也达到非常高的境界。能达到这样成就的诗人，在整个中国诗歌史上都屈指可数。孟浩然不管从哪个方面看，都是唐代、也是整个诗歌史上最为杰出的诗人之一。那么，为什么有人会说孟浩然在唐代连二流都算不上呢？都是不读书惹的祸啊，不读书还话多，这是病，得治，不治将恐深。", "answer_votes": "105", "answer_comment": "​13 条评论"}
{"answer_author": "黎玉", "answer_id": 74462730, "answer_text": "许多风格不是每个人都会喜欢，但是喜不喜欢和好不好是两回事。即便要说孟是三流末端，也该说出依据来，再将一流二流的诗人陈列一番；有依据的支撑，再加上跟同行的对照，才能这么说吧。意思就是，你说孟是三流末端（还“顶多”）不是问题，虽然观点新奇不合主流，但重点是你的依据在哪，有没有能服人的理由，能不能进行中一番逻辑自洽的论证。如若不然，这些话说出来不过是胡搅蛮缠罢了。况且你老师这话，本身逻辑也捉急。“是山水田园派诗人”和“二流诗人都不算”根本不能构成转折关系，因为“山水田园派都是一流诗人”是真命题是这个转折关系成立的必要条件，而这个前提显然不为真命题。希望你这位老师能多提高姿势水平，不要总想着搞个大新闻把哪位诗人批判一番。图样图森破，上台拿衣服。你这老师啊，大概水平顶多也就三流末端。最后正经回答问题:孟浩然的诗到底怎么样？我认为@大卫也 的答案说得很好了。我自己还是最喜欢他的“野旷天低树，江清月近人”两句。孟浩然诗受两谢和陶潜影响挺大的（我感觉，尤其是陶潜），诗句浑然天成，不造作，这样读起来最舒服，这是他身上最让我喜欢的点。要我看，如果说李杜是唐代超一流的诗人，孟浩然怎么样也是算一流的。PS:我不过一介诗歌爱好者，读得不算很多，自己也不会写，只是喜欢所以接触的多一些。如果我个人有的看法有错误或不当的地方，还请指出，谢谢。", "answer_votes": "12", "answer_comment": "​3 条评论"}
{"answer_author": "大卫也", "answer_id": 74325810, "answer_text": "《新唐书》里写孟浩然“尝于太学赋诗，一座嗟伏，无敢抗。张九龄、王维皆称道之。”个人看孟浩然的诗主要体会意境。最喜欢的几句”天边树若荠，江畔洲如月“，”野旷天低树，江清月近人“，”松月生夜凉，凤泉满清听“尤其是那一句”气蒸云梦泽，波撼岳阳城”个人感觉不比王维”大漠孤烟直，长河落日圆“差。孟浩然的诗粗看是易懂的，仔细品味就奥妙无穷了。", "answer_votes": "24", "answer_comment": "​7 条评论"}
{"answer_author": "子之丑", "answer_id": 74327391, "answer_text": "你可以不喜欢他的风格，却也不能贬低他的成就。孟浩然是二流的话，整个唐以来的诗史，也就李杜敢称一流了。", "answer_votes": "5", "answer_comment": "​2 条评论"}
{"answer_author": "Kitn", "answer_id": 74499004, "answer_text": "&lt;img data-rawwidth=\"2448\" data-rawheight=\"3264\" src=\"https://pic1.zhimg.com/50/11ed85398c698d1145f7b82ea7d1a307_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"2448\" data-original=\"https://pic1.zhimg.com/11ed85398c698d1145f7b82ea7d1a307_r.jpg\"&gt;吾爱孟夫子，风流天下闻。红颜弃轩冕，白首卧松云。醉月频中圣，迷花不事君。高山安可仰，徒此揖清芬。                          ------李白《赠孟浩然》能被李白比作高山，很能说明问题了", "answer_votes": "10", "answer_comment": "​1 条评论"}
{"answer_author": "栖逸", "answer_id": 99810322, "answer_text": "在唐诗的国度里，若以风比诗人，李白是落山风吹过海洋，杜甫是马鸣风萧萧，李商隐是香风过连苑，王维是回风拂落花，自来还自去。而孟浩然，是清风在竹林。        孟诗深得清、雅、淡、朗四字，他的清，是骨貌清奇的清，他的诗清远恬淡，尤其山水诗，诗句铺展开来，恰似一幅优美的画卷，其中景致，非浓墨重彩，而是小桥流水，淡暮新月，微云远山，一切悠远的，恬淡的极适于隐士高卧的景色，如这首《夏日南亭怀辛大》：山光忽西落，池月渐东上。散发乘夕凉，开轩卧闲敞。荷风送香气，竹露滴清响。欲取鸣琴弹，恨无知音赏。感此怀故人，中宵劳梦想。        窃以为，浩然诗一大特点，便是词淡而意远。王维之才远胜孟浩然，但此中造诣，似颇不如。王维之淡，是“绚烂至极归于平淡”，而浩然，是“本身无一物，何处惹尘埃”。天性使然，是才气弥补不了的。如此诗，“闲淡”是一味，另有一味“闲散”便是其他诗人所欠缺，或者也可以说，是其他诗人所不擅表达也描摹不出的意境。诗的节奏极慢，诗人“散发乘夕凉”，于是整个时光静下来，慢下来，把心放空，感受自然的节奏。夕阳傍山而下，池边新月缓缓升起，随之缓缓升起的还有渐渐浓重的暮色，诗人无拘无束的在闲敞处卧下，荷风里暗香浮动，竹露滴落，清韵怡人。如此自在情景，恍如陶渊明之“五六月中，北窗下卧，遇凉风暂至，自谓是羲皇上人”。浩然是连“羲皇上人”也不必自谓的。此时，他便是这荷风，这竹露，是这步履迟迟的时光，是这自然本身。当你真正静下来，天地造化也只是驾驭在你的指间的节奏。        王孟常因山水诗之恬淡而并称，但王维之恬淡，是“运斤成风”，王维才高八斗，少年及第，他的诗大气有之，堂皇有之，即使是平淡，也是字句如锻，他的平淡里裹挟着厚重的才华底蕴和不可追及的文字功力，是一种对才华的不彻底抛掷和重新选择。如他的辋川，虽是自然山水，还是人为选择的奇美和精致。所以他的平淡是华贵缎子绣一株平常花草，是磋玉锻金做一枝木犀花。浩然则大不同，孟浩然的山水便是平常山水，他的田园也是襄阳随处可见的农家田园。他的平淡便是平淡，清逸便是清逸。与其说浩然是诗人，不如说他是诗一样的人。他的诗不过是他清逸雅淡的人生的表现和表述。常常想，无数诗人争相去啜饮诗神的泉水，但浩然无需如此，因为，他便是这泉水本身。       或许你们老师看过苏轼评价孟浩然的“韵高而才短”，但是两位高手之间的笑谈，我们俗人听就听了，可千万别学着说，比如李白说杜甫“借问别来太瘦生，总为从前作诗苦”，他是李白，如果我们也来说杜甫写诗费劲的话，你自己不笑话自己吗？     并且关于才学与才情，关于才与不才，庄子笑曰：“周将处乎材与不材之间。材与不材之间，似是而非也，故未免乎累。”所以评价孟浩然，还是苏轼的另一句诗比较恰当：人间有味是清欢！", "answer_votes": "14", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 74467474, "answer_text": "谢邀@潘安。（好帅的名字）说起孟浩然，还真是一位神秘的诗人。首先我们至今仍不知道孟夫子的大名，只知道他字浩然。一生中或隐居避世，或奔走酬唱，虽有经济之心，却一生未仕，写下『不才明主弃，多病故人疏』。在盛唐诗坛，孟浩然与王维齐名。其所在诗歌流派被总结为山水田园派，或者称王孟诗派。对于孟夫子的诗，诗仙诗圣颇为赞许甚至艳羡。不提李白赤裸裸的爱，杜甫也说过『复忆襄阳孟浩然，清诗句句尽堪传』。历代颇受赞许。在分析孟浩然的诗之前，先列几个名篇，惟愿熟读成诵。（参考王步高《唐宋诗词鉴赏》，朱东润《中国历代文学作品选》，《唐诗三百首》）《临洞庭湖赠张丞相》《夏日南亭怀辛大》《过故人庄》《与诸子登岘山》《春晓》《宿建德江》《耶溪泛舟》《秋登兰山寄张五》《宿桐庐江寄广陵旧游》《宿业师山房待丁大不至》《宴梅道士山房》《岁暮归南山》《秦中寄远上人》《留别王维》《江上思归》《早寒有怀》《晚泊浔阳望香炉峰》孟浩然是有唐第一个大量写作山水田园诗的诗人。其诗以山水诗居多，或为游历所见，或为家乡风光。其中往往在书写孤高的情怀中夹杂失落的情绪，在以景自娱中融入了羁旅思乡之情。如《宿建德江》、《临洞庭湖赠张丞相》、《江上思归》等。他的田园诗写隐居生活的高雅情怀和闲情逸致，如《过故人庄》、《游精思观回王白云在後》等。诗风平和冲淡，清新自然，淳朴真淳，不尚雕饰，或超凡脱俗，或极富生活气息，有渊明风。善于在平淡的语言中融入个人的主观感受和情感意蕴，艺术境界高，有情致韵味。如《春晓》、《宿建德江》。现通行《孟浩然集》收诗263首，不乏伪作。新、旧《唐书》有传。参考书目：袁行霈《中国文学史》万献初《中国文学史辅导及习题集》王步高《唐宋诗词鉴赏》朱东润《中国历代文学作品选》孙洙《唐诗三百首》", "answer_votes": "11", "answer_comment": "​添加评论"}
{"answer_author": "王泽程", "answer_id": 74349484, "answer_text": "原答案写错，删了。孟浩然早年不喜出名，所以只是闻名于朋友之间。像“故人具鸡黍，邀我至田家”，又如“春眠不觉晓，处处闻啼鸟”之类，闲情逸趣，自娱自乐，诗写得再好也没人知道。等到孟浩然40岁左右，才托在朝中的老友王维参加长安诗会，在对诗时作“微云淡河汉，疏雨滴梧桐。”王士源的《孟浩然集序》说道：（浩然）闲游秘省，秋月新霁，诸英华赋诗作会。浩然句曰：“微云淡河汉，疏雨滴梧桐。”举座嗟其清绝，咸阁笔不复为继。满堂皆静，再没有人敢再对了，所以这首诗也只有这一句，对自己有自信的人可以试试续诗。当时长安的诗坛可以说是唐朝最高的水平，能在长安诗坛秒杀全场，当时可谓是“风流天下闻”。可见当时孟浩然在唐朝的地位至少是一流水平，不然这么装逼不会被打脸？在孟浩然诗名满天下时，李白还是只是刚出茅庐，李白经常从安陆来到襄阳拜会孟浩然，向孟浩然请教诗歌，并由孟浩然通过荆州刺史韩朝宗向朝廷举荐。李白一生指名道姓写给孟浩然的诗有7首之多。李白的水平就不用怀疑了吧？李白在他的《赠孟浩然》中说:“吾爱孟夫子,风流天下闻。”对孟浩然给予了极高的评价和推崇，李白的《送孟浩然之广陵》更是至今广为流传并被收入中小学课本的名篇。杜甫评价孟浩然说的是:“复忆襄阳孟浩然,清诗句句尽堪传。”王维是孟浩然的好友，王维和白居易亲到襄阳凭悼或追思孟浩然。王维还亲自为孟浩然画像。并在襄阳为孟浩然建了孟亭。同为襄阳人的晚唐著名诗人、唐朝进士皮日休时时处处模仿孟浩然，在诗坛传为佳话。同时，孟浩然也是身为布衣，只凭借诗人身份觐见皇上的第一人。由此可见，孟浩然在当时诗词的水平也是最顶级的几个人之一，所以题主老师说孟浩然连二流诗人都算不上，顶多三流末端纯属妄言。对原本的答案表示歉意，不知道就该多读书。", "answer_votes": "17", "answer_comment": "​3 条评论"}
{"answer_author": "不羁放纵爱发昏", "answer_id": 74494209, "answer_text": "意思贵师比孟的朋友圈眼光都要高，比如高适，王维，王昌龄，张说等人，更不要提李白杜甫这类小粉丝啦", "answer_votes": "4", "answer_comment": "​添加评论"}
{"answer_author": "关张", "answer_id": 74502375, "answer_text": "我有特别的朗诵技巧，在诗的开头呢，我会摸他的后庭&lt;img data-rawwidth=\"448\" data-rawheight=\"336\" src=\"https://pic2.zhimg.com/50/df16ee1e3ac4bcc0d31412e56bbeb1fc_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"448\" data-original=\"https://pic2.zhimg.com/df16ee1e3ac4bcc0d31412e56bbeb1fc_r.jpg\"&gt;", "answer_votes": "5", "answer_comment": "​1 条评论"}
{"answer_author": "知乎用户", "answer_id": 74532548, "answer_text": "虽然也没有极爱孟浩然,但是看看贡献出\"还来就菊花\"\"知音世所稀\"\"江清月近人\"\"花落知多少\"这样诸多清丽好句的诗人被讲成三流,还是忍不住多几句.孟浩然诗的艺术价值确实远高于思想价值。以情兴串联景物，其总体艺术风貌呈现出清淡。这一特色的形成，与他在艺术形式上以复古为革新也密切相关。看看以复古为革新这样高级的事情他那么早就在干，而且并不自知。孟诗中地域特点也十分突出。孟浩然是荆楚大地孕育出来的诗人，他的诗是南方山水田园诗的代表，南方地貌和荆楚文化对其人其诗产生了不小的影响。好不好单说，确是不同的一类，给田园诗增加了不同的味道。孟浩然算盛世布衣吧。终身不遇的事实使人们长期将他看作一个隐士。可二十世纪以来，越来越多的学者将他判定为一个有着强烈仕进之心、热衷于功名的士子，并认定与其思想性格和一生命运密切相关的“御前诵诗”一事不可信。在对孟浩然“失约朝宗”原因的探究中，可以窥见他复杂而矛盾的内心世界, 他一生都在仕与隐之间矛盾挣扎。其实哪个文人没有一点挣扎呢，至今都有。从盛唐到如今的孟浩然确实也经历了一个被不断认识过程。但对人的接受和对诗的接受基本还是两码事。就思想人格的接受而言，历代文士塑造了孟浩然形象的两面：寒士和隐士。形象的塑造是往往都是动态的，在诗作长期接受流传过程中，隐士形象慢慢战胜了寒士形象，最终成为人们对孟浩然比较一致的看法。在这个过程中，发挥了重要作用、产生了巨大影响的，是王维的两幅图画。正是这两幅图，促成了孟浩然隐士形象的定型，时间大约是在元代。而这一形象，可以用八个字来表述：“骑驴灞桥，踏雪寻梅。”就诗歌的接受而言，在明代以前，对孟浩然诗歌的关注一直低于对其人的关注，此期人们对孟诗大多是给予比较概括、笼统的赞扬。从明代开始，孟浩然诗歌的接受伴随着王孟之争而展开，孟浩然的地位起起伏伏。虽然人们大多认同“孟不及王”，但有人持论公允，辨证地看待这一问题；有人偏激褊狭，对孟诗极尽诋毁。在王孟优劣的争论中，人们对孟浩然诗歌的认识还在改变。好啦，我是爱王维多过孟浩然一点，毕竟读诗是见仁见智的事情，况且女人的审美格外主观。但是，喜不喜欢是一回事, 好不好是另一回事。不管是人或者诗,孟浩然如果还是三流的话, 二流诗词应从缺吧.最后,钱钟书先生的一段诗批还蛮有意思:\"把末流当作本源的风气仿佛是宋代诗人里的流行性感冒。嫌孟浩然无材料的苏轼有这种倾向，把古人好对偶用尽的陆游更有这种倾向；不但西昆体害这个毛病，江西派也害这个毛病，而且反对江西派的\"四灵\"竟传染着同样的毛病。他们给这种习气的定义是：\"资书以为诗\" （刘克庄：《后村大全集》卷九十六《韩隐君诗序》，是用韩愈《登封县尉卢殷墓志》里的话。韩愈那句话在宋代非常传诵，例如强幼安《唐子西文录》里\"凡作诗平居须收拾诗材以备用\"条，文珦《潜山集》卷三《哭李雪林》、卷五《周草窗吟稿号\"蜡屐\"为赋古诗》等。），后人直率的解释是：\"除却书本子，则更无诗。\" （王夫之：《船山遗书》卷六十四《夕堂永日绪论》内编评苏轼、黄庭坚。）宋代诗人的现实感虽然没有完全沉没在文山字海里，但是有时也已经像李逵假洑水，探头探脑的挣扎。从古人各种著作里收集自己诗歌的材料和词句，从古人的诗里孳生出自己的诗来，把书架子和书箱砌成了一座象牙之塔，偶尔向人生现实居高临远的凭栏眺望一番。内容就愈来愈贫薄，形式也愈变愈严密。偏重形式的古典主义发达到极端，可以使作者丧失了对具体事物的感受性，对外界视而不见，恰像玻璃缸里的金鱼，生活在一种透明的隔离状态里。据说在文艺复兴时代，那些人文主义作家沉浸在古典文学里，一味讲究风格和词藻，虽然接触到事物，心目间并没有事物的印象，只浮动着古罗马大诗人的好词佳句（德·桑克谛斯(F．De Sanctis)《意大利文学史》(Storia della Letteratura Italiana)，1962年版第1册，第342页。）。我们古代的批评家也指出相同的现象：\"人于顺逆境遇所动情思，皆是诗材；子美之诗多得于此。人不能然，失却好诗；及至作诗，了无意思，惟学古人句样而已。\" （吴乔：《围炉诗话》卷一）这是讲明代的\"七子\"，宋诗的病情还远不至于那么沉重，不过它的病象已经显明。譬如南宋有个师法陶潜的陈渊（《默堂先生文集》卷四《小轩闲题》第二首：《渊明吾之师》，卷五《次韵令德答天启》：\"我师陶靖节。\"），他在旅行诗里就说：\"渊明已黄壤，诗语馀奇趣；我行田野间，举目辄相遇。谁云古人远?正是无来去!\" （《默堂先生文集》卷五《越州道中杂诗》第八首）陶潜当然是位大诗人，但是假如陈渊觉得一眼望出去都是六七百年前陶潜所歌咏的情景，那未必证明陶潜的意境包罗得很广阔，而也许只表示自己的心眼给陶潜限制得很褊狭。这种对文艺作品的敏感只造成了对现实事物的盲点，同时也会变为对文艺作品的幻觉，因为它一方面目不转睛，只注视着陶潜，在陶潜诗境以外的东西都领略不到，而另一方面可以白书见鬼，影响附会，在陶潜的诗里看出陶潜本人梦想不到的东西。这在文艺鉴赏里并不是稀罕的症候.\"", "answer_votes": "5", "answer_comment": "​2 条评论"}
{"answer_author": "捏捏狗脸", "answer_id": 74472098, "answer_text": "孟浩然（689—740），襄阳（今属湖北）人，主要活动于开元年间。他大半生居住在襄阳城南岘山附近的涧南园，中年以前曾离家远游。四十岁那年赴长安应进士试，落第后在吴越一带游历多年，到过许多山水名胜之地。开元二十五年（737），张九龄贬荆州刺史，孟浩然曾应辟入幕，不久辞归家乡，直至去世。有《孟浩然集》。在盛唐诗人中，孟浩然是年辈较早的一个，其人品和诗风深得时人的赞赏和倾慕。李白《赠孟浩然》云：“吾爱孟夫子，风流天下闻。……高山安可仰，徒此揖清芬。”于此可见一斑。孟浩然是唐代第一个倾大力写作山水诗的诗人。其诗今存二百余首，大部分是他在漫游途中写下的山水行旅诗，也有他在登临游览家乡一带的万山、岘山和鹿门山时所写的遣兴之作。还有少数诗篇是写田园村居生活的。诗中取材的地域范围相当广大。山水景物是南朝诗歌最重要的题材，经历长期发展，取得了显著的成就。到孟浩然，山水诗又被提升到新的境界，这主要表现在：诗中情和景的关系，不仅是彼此衬托，而且常常是水乳交融般的密合；诗的意境，由于剔除了一切不必要、不谐调的成分，而显得更加单纯明净；诗的结构也更加完美。孟浩然在旅程中偏爱水行，如他自己所说：“为多山水乐，频作泛舟行。”（《经七里滩》）他的诗经常写到漫游于南国水乡所见的优美景色和由此引发的情趣，如：落景余清晖，轻桡弄溪渚。澄明爱水物，临泛何容与。白首垂钓翁，新妆浣纱女。相看似相识，脉脉不得语。（《耶溪泛舟》）垂钓坐盘石，水清心亦闲。鱼行潭树下，猿挂岛藤间。游女昔解佩，传闻于此山。求之不可得，沿月棹歌还。（《万山潭作》）诗不仅起着纪实的作用，而且融和了诗人新鲜的感受和天真的遐想。在他的眼光中，无论是沐浴在夕照清辉中的人物，还是嬉戏于水下岸边的鱼兽，寓目所见的一切，仿佛都化作会心的亲切的微笑。这些诗境，确有晶莹剔透之感。孟浩然山水诗的意境，以一种富于生机的恬静居多。但是他也能够以宏丽的文笔表现壮伟的江山。如《彭蠡湖中望庐山》中：“太虚生月晕，舟子知天风。挂席候明发，渺漫平湖中。中流是匡阜，势压九江雄。黤黕凝黛色，峥嵘当曙空。香炉初上日，瀑布喷成虹……。”清人潘德舆以此诗和《早发渔浦潭》为例，说孟诗“精力浑健，俯视一切”（《养一斋诗话》），正道出了其意兴勃郁的重要特征。盛唐著名诗评家殷璠喜用“兴象”一词论诗，在评述孟浩然的两句诗时，也说“无论兴象，兼复故实”（见《河岳英灵集》）。所谓“兴象”，是指诗人的情感、精神对物象的统摄，使之和诗人心灵的颤动融为一体，从而获得生命、具有个性和活力。重“兴象”其实也是孟浩然诗普遍的特点。这通过几首不同的作品之间的比较，可以看得更清楚。八月湖水平，涵虚混太清。气蒸云梦泽，波撼岳阳城。欲济无舟楫，端居耻圣明。坐观垂钓者，徒有羡鱼情。（《望洞庭湖赠张丞相》）山暝闻猿愁，沧江急夜流。风鸣两岸叶，月照一孤舟。建德非吾土，维扬忆旧游。还将两行泪，遥寄海西头。（《宿桐庐江寄广陵旧游》）移舟泊烟渚，日暮客愁新。野旷天低树，江清月近人。（《宿建德江》）这三首诗都写了江湖水景，但性格各异。第一首作于孟应聘入张九龄幕府时。他为自己的抱负能够有一试的机会而兴奋，曾写下“感激遂弹冠，安能守固穷”（《书怀贻京邑同好》）、“故人今在位，歧路莫迟回”（《送丁大凤进士赴举呈张九龄》）之类诗句。正是这种昂奋的情绪，使他写下了“气蒸云梦泽，波撼岳阳城”这样气势磅礴的名句。第二、三首均作于落第后南游吴越之日，前者以风鸣江急的激越动荡之景写自己悲凉的内心骚动，后者则以野旷江清的静景写寂寞的游子情怀，它们的神采气韵是很不相同的。本之以“兴”，出之以“象”，突出主要的情绪感受而把两者统一起来，构筑起完整的意境，这是孟浩然写景诗的重要贡献。孟浩然诗歌的语言，不钩奇抉异而又洗脱凡近，“语淡而味终不薄”（沈德潜《唐诗别裁集》）。他的一些诗往往在白描之中见整炼之致，经纬绵密处却似不经意道出，表现出很高的艺术功力。例如他的名篇《过故人庄》：故人具鸡黍，邀我至田家。绿树村边合，青山郭外斜。开轩面场圃，把酒话桑麻。待到重阳日，还来就菊花。通篇侃侃叙来，似说家常，和陶渊明的《饮酒》等诗风格相近，但陶写的是古体，这首诗却是近体。“绿树村边合，青山郭外斜”这一联句，画龙点睛地勾勒出一个环抱在青山绿树之中的村落的典型环境。还有那一首妇孺能诵的五绝《春晓》，也是以天然不觉其巧的语言，写出微妙的惜春之情。另外，孟浩然在诗体的运用上往往突破固有程式的拘限，读来别有滋味。例如《舟中晓望》诗，平仄声律全合五律格式，但中两联不作骈偶，似古似律。胡应麟《诗薮》认为此类诗“自是六朝短古，加以声律，便觉神韵超然。”又如《夜归鹿门山歌》：山寺钟鸣昼已昏，渔梁渡头争渡喧。人随沙岸向江村，余亦乘舟归鹿门。鹿门月照开烟树，忽到庞公栖隐处。岩扉松径长寂寥，唯有幽人夜来去。这是一首歌行体的诗，但通篇只是把夜归的行程一路写下来，不事铺张。其篇制规模类似近体，并吸收了近体诗语言简约的特点，而突出歌行体的蝉联句法，读来颇有行云流水之妙。这些出入古近的体格饶有洒脱自在的情致，也是孟诗创造性的表现之一。摘自《中国文学史》章培恒 骆玉明　主编没文史哲类专业的大学文化课就tm是个坑…我们学校文化课老师上课就讲西方文化怎么怎么不行，西方人没有信仰，我国文化怎么怎么了不起，几千年前就什么都有了什么的= =所谓文化课老师d民科民哲民间文学大师居多", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 74507556, "answer_text": "知乎上没有一个人可以回答这个问题", "answer_votes": "12", "answer_comment": "​2 条评论"}
{"answer_author": "mgyg吴晓明", "answer_id": 74470763, "answer_text": "谢谢邀请有王孟之说，孟浩然是著名诗人王维的好友。40岁时，游长安，应进士举不第。曾在太学赋诗，名动公卿，一座倾服。其曾被王维引荐唐玄宗，但是孟浩然不会讨好，结果没成事。孟浩然的诗摆脱了初唐应制，咏物的狭窄境界，更多地抒写了个人的怀抱，给开元诗坛带来了新鲜气息，并得到时人的倾慕。李白称颂他「高山安可仰，徒此揖清芬」，杜甫礼赞他「清诗句句尽堪传」。可见他在当时即享有盛名。他死后不到十年，诗集便两经编定，并送上「秘府」保存。现有《孟浩然集》。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "den9yon9", "answer_id": 74488666, "answer_text": "原谅我很喜欢这位三流诗人", "answer_votes": "3", "answer_comment": "​添加评论"}
{"answer_author": "暗香", "answer_id": 77577467, "answer_text": "刚好在看相关的书，姑且引一段闻一多先生的话吧：闻一多先生说，由初唐的宫体诗跳到杜甫的严肃人生描写，中间有一个净化的过程。代表这个净化过程的，就是孟浩然。孟浩然对宫体诗有两重净化：思想上，淫靡变为闲淡。文字的净化，是他的诗诗人根本忘记辞藻，就像没有诗，惟其如此，乃有醇味。《唐诗小史》又补了“孟浩然的诗，开始了盛唐诗人对诗的情思和境界的净化过程”这么一句话，题主可以咂摸一下这种地位算几流……", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "冯庆", "answer_id": 130278087, "answer_text": "所谓田园诗，其实和山水诗、招隐诗、游仙诗其实是一个意思，都是把不慕功名的心思寄托在某种事物上，比如田园、山水、隐士、仙人，当然，也可以是美女。热心功名，却视功名为俗事，这是古文人的通病。不管是身居贤达，还是贬谪乡野，也包括屡试不第，总之，都要表示一下无意功名来体现自己的脱俗。陶渊明如此，谢灵运如此，李白如此，苏东坡如此，甚至杜甫居成都生活稍微安逸后也如此。古人明目张胆毫不掩饰要当官的，貌似只有孔子比较明显，但孔子不写诗。就算如此，孔子也有“乘桴浮于海”的表示。而孟浩然的田园诗，完全不在此列。他不是失意后寄情田园，也不是用歌诗田园的闲适来表示与世俗迥然。孟浩然是真的很享受这种生活。所以在孟浩然的田园诗里，实在看不到什么逃世的消极心态，也没有怨刺官场的矫情。他就是纯而又纯的喜欢和享受。他并非有意要选择田园为题材，这和王维写山水、田园是完全不同的。孟浩然写田园，完全是写自己，写目所能及。他大半生在农村，大半生在田园，视野非常有限，思想也单纯得很，所以只能写田园，乐意写田园，这叫随性，不叫矫情。不知道哪股劲儿上来了，突然就想试试，于是进京了，找到王维。终究没有能够当上官，然后有回去了，并没有多大的失意。因此前此后此的诗，都不见多少幽怨。他只是享乐，把进京和离京，都当成一种经历，游山玩水，拜访友人的过程。后来的田园诗人，之前的田园诗人，很少能有这个心气儿的。比如陶渊明，做官不如意，才撒娇去种菊花，不过是让世人尤其上司看看我多不如意，不如意的是官职小。再如苏东坡，被贬黄州儋州，才有些寄情自然的味道，不过是一种消遣排遣，并非真心喜欢这样的生活。神宗一死，有了机会，蹦着跳着就离开了，直奔京城而去。王安石那些非常唯美的诗，也是写于晚年罢官之后。孟浩然就是这么率性和真实。偶尔也要矫情，那是起了入仕的心思之后。什么“不才明主弃，多病故人疏”，纯属强说愁。这样的诗好不好？首先占了个真性情。有真性情未必就是好诗，还需要文采的支撑。孟浩然毫无疑问是才情超满的。他的诗句不仅清丽，还占个率性、真实。这种特性，必须是一流的，在唐代是仅有的，在整个诗的国度也是独一份儿的。那么应该在第几流呢？如果李白杜甫算一流，不允许有人比肩的话，那孟浩然必定的大批二流诗人里的一员。但从田园诗来看，是超迈所有人，前无古人，后无来者，必须第一流。", "answer_votes": "5", "answer_comment": "​1 条评论"}
{"answer_author": "黄细妹", "answer_id": 74500097, "answer_text": "王维的五律，是字字皆有味的。孟浩然没有精炼到这个地步。他的优点是写诗如熨衣般自然妥帖。一不留神就读过了，却如淡茶暖胃。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 235293066, "answer_text": "是一流诗人，但远不能和李白、杜甫、王维并列。地位大概和同时期的高适、王昌龄、岑参差不多，比较擅长一种题材（田园诗）和体裁（五言诗）。孟浩然的五言山水诗，佳作颇多，也大多浅近易懂但是却别有韵味，所以我们从小就学了很多，大家比较熟悉。老师常常把王维和孟浩然并列，其实是不对的。王维的成就超过孟浩然，无论是做官还是作诗。孟浩然一次次去追求功名，失败后又开始隐居，然后又求取功名，屡战屡败，直到在襄阳老家病死。如果唐代诗人非要分等级，下面这些（都是一流诗人）可以这么分：零等：李白 杜甫零点五等：王维、李商隐？一等：白居易（如果没有长恨歌和琵琶行就再入下一等）、杜牧、李商隐？、李贺、孟浩然、高适、岑参、王昌龄、张九龄剩下的唐诗三百首中有录诗的可以列入二等、三等。李商隐打了问号是因为我个人比较偏爱他，但他的佳作和李白杜甫王维相比数量有点少。", "answer_votes": "25", "answer_comment": "​43 条评论"}
{"answer_author": "冰糖葫芦五加皮", "answer_id": 74503566, "answer_text": "然而，我还是最喜欢《春晓》:春眠不觉晓，处处闻啼鸟。夜来风雨声，花落知多少。简练淳朴，信口吟出。不用华丽辞藻，每个字平平无奇，可写成一篇却非常自然，孟浩然不掉书袋不装13，几乎篇篇成为经典启蒙唐诗。能经过这么多代文人筛选流传下来，绝对不是没水平的。古代文人那么清高那么挑剔，我相信他们的文化眼光。 李白菊苣多么牛叉，一生交了很多朋友。认识孟浩然时他还小，写了《黄鹤楼送孟浩然之广陵》:故人西辞黄鹤楼，烟花三月下扬州。 孤帆远影碧空尽，唯见长江天际流。 这首诗是李白初居安陆时所作。出川未久，刚刚结束江南吴越之游的李白，这时结识了长他十二岁的孟浩然，两人一见如故，在送孟浩然东下扬州时，李白挥笔写下了这首传咏千古的杰作。能一见如故，说明孟浩然也差不到哪去。再来一个， 李白的《赠孟浩然》: 吾爱孟夫子，风流天下闻。红颜弃轩冕，白首卧松云。 醉月频中圣，迷花不事君。高山安可仰，徒此揖清芬。 我们可能连孟浩然的本名是啥都不知道，浩然只是他的表字。从古至今多少人名姓齐全却没能留下只言片语，孟浩然一个如此“神秘”的人，如果真是三流诗人，肯定早已淹没在历史之中了。题主老师可能一开始并不懂诗，只“见了些浅显的就爱”，“一入了这个境界，再学不出来的”╮(╯▽╰)╭", "answer_votes": "5", "answer_comment": "​添加评论"}
{"answer_author": "we we", "answer_id": 79847156, "answer_text": "这个诗呢，跟尿尿是一样的，只要尿过金线，再远一点，再远一点点，他就成了。至于你要说水篇，我想谁都有尿裤子的时候。春晓不简单，读到花落知多少，人都傻了，传音三千里，上下五千年呀。日暮客愁新讲述了一个悲伤的死循环，对，依然只有五个字。在人民群众日落而息的时候自动update一波乡愁，那叫透心凉，心飞扬，是不是很像海日生残夜的暗黑版本。再如我家襄水曲，遥隔楚云端。在古诗里面，我这个字呢，你懂的，专注作死一百年，行歌里面都不大用的，就是现代诗也不敢这么玩啊，显得low，而且还带了个家，我家，嘿嘿，家有儿女，我爱我家，以及，，，我家住在黄土高坡。。。。。。他就在律诗里面把这两个字塞进去了啊，你敢信？卧槽，竟然无损逼（shi）格（yi）啊。32个赞肯定是不够的，至少也得是去了小数点π，恩！最后我要说黄鹤楼送孟浩然之广陵，作者孟浩然。那是写得真好啊。比那啥凤凰台上游凤凰好多了啊，那是在和崔颢争义气，但是白哥哥，靠抄是没有前途的哟，你也写过黄鹤楼的嘛，还写的这么好。我就不信李白没有青白眼，只许他阮籍有哇。作为一个送别童子，他一生送过茫茫多的人，送友人，送蜀黍，送昌龄，送二甫，送浩然，送杨道士，当然还有送自己（仍怜故乡水，万里送行舟，突出一种新奇的自恋表达方式）。来，看看汪县令，桃花潭水深千尺，不及汪伦送我情。你唱首山歌也别写这种东西去敷衍人家嘛，要是我的话会觉得很受伤。但是，故人西辞黄鹤楼，烟花三月下扬州，孤帆远影碧空尽，唯见长江天际流就不一样了，这是内定了千古名句的哦，我以为要比送昌龄和二甫的要强。说白了，浩然不仅有青眼待遇，而且是红星闪闪照耀我心的那一等。此段表现手法为侧面烘托间杂侧面衬托。至于二甫，你们非要说这是排行我是不认可的，爱情在每个时代其实都一样。鲁郡东石门送杜二甫，自行感受。不过孟浩然可能确实不擅七言，我仿佛觉得他是写好了五言再上去补两个字的，如果不是这样，情各位赐教。", "answer_votes": "3", "answer_comment": "​添加评论"}
{"answer_author": "henryWang", "answer_id": 79613443, "answer_text": "这老师啊，想火可以爆照，脱光了围着天安门溜一圈也比胡说八道强啊", "answer_votes": "2", "answer_comment": "​1 条评论"}
{"answer_author": "言堇", "answer_id": 74808028, "answer_text": "三流诗人？移舟泊烟渚 日暮客愁新野旷天低树 江清月近人你感受下，这是诗还是画？", "answer_votes": "2", "answer_comment": "​1 条评论"}
{"answer_author": "匿名用户", "answer_id": 74460655, "answer_text": "我只想知道你老师眼里，谁是一流诗人谁是二流诗人，谁又是三流。", "answer_votes": "2", "answer_comment": "​1 条评论"}
{"answer_author": "熊霏", "answer_id": 75944156, "answer_text": "如钱钟书所言，小诗人中的大诗人。格调高，格局小。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "爱吃草的羊", "answer_id": 74498207, "answer_text": "直如羚羊挂角，无迹可寻。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "陆散绮", "answer_id": 257198820, "answer_text": "尔曹身与名俱灭，不废江河万古流。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 240952001, "answer_text": "你大学老师的品位很独特……在我看来，上下二千多年的诗作里，能跟「春眠不觉晓，处处闻啼鸟。夜来风雨声，花落知多少。」比的也没有多少首。一个诗人一辈子能写出这样一首诗，足够了。这世上古往今来，狗屁不通，大言不惭的人实在太多，不绝如缕，误人子弟！", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 74589334, "answer_text": "可悲可叹三尺三，万千同窗念悲凉。谁说浩然诗末流，满堂一席夫子言。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "残阳留", "answer_id": 74513718, "answer_text": "如果你们老师说的的生活质量，那倒也没有什么。 即便你们老师说的是孟浩然的诗歌水平，也不会妨碍我们去读孟浩然的诗。 另外我想问一下，李白杜甫算不算得上是当时的一流诗人，如果是，他们过的是什么日子我们也知道吧？", "answer_votes": "0", "answer_comment": "​添加评论"}
