{"question_id": "38585483", "question_text": "中学时代，背的那些诗句，大都停留在浪漫主义的幻想中，后来看了些李白的生平境遇，也许逆境和孤独才是才华绽放的源动力。春风得意马蹄疾，那天在清华西门的路上轻快的步伐，让我想起李白踌躇满志的赴京高升的意气风发。", "question_title": "李白的一生境遇？", "question_commet": "​添加评论", "answer_number": "5 个回答", "question_followers": "49", "brower_number": "18,892"}
{"answer_author": "秦州洋", "answer_id": 87330585, "answer_text": "仗剑天涯，扁舟散发，是多少人的梦想？李白他做过官，让玄宗崇拜不已；他做过侠客，师父是大唐第一剑客裴昱；他是旅行家，游遍三山五湖；他想异于常人，他的偶像是传说中的东方朔；做过道士，出家在紫极宫里。他聪明，五岁的时候就可以背诵启蒙诗:六甲诗；十五岁的时候，诗词便得到了社会名流的赞赏；十八岁游走蜀中，喜剑术，好任侠，确实是李谪仙人。后来他开始了他浪迹天涯的生活，过成都，下渝州，剑如长虹，豪情万丈。他不能做官，不能科举考试，因为他是商人的儿子，所以政府排斥他；但这也正好让李白不用被科举的制度所摧垮，才可以达到他“五岳寻仙不辞远，一生好入名山游”的生活状态。他对外说自己是天才，天才不用考科举，所以他也很可怜，也很幸运。李白继续行走，途中他结识了大唐书法家李邕李北海，诗人游子孟浩然；从24岁到26岁，行走江湖，眼界卓越，这绝不是一般唐朝人可以见到的。27岁那年，孟浩然给他推荐了一个女朋友，前时宰相许圉师的孙女，李白生平的第一个妻子。可惜这时许圉师已经死了四十年了，不能帮助李白什么。顺便一说，那一年，朝廷在民间选官，希望见一些被埋没的民间人才，李白的岳祖父如果活的，可以帮他。成家后，李白又行走天涯。许圉师的孙女给李白生下了孩子，这家家境富裕，而和李白也可能是纯粹的互相依靠的关系，李白不喜欢这家吧？反正他没有养家，又继续出行。一直走到30岁，李白做官的想法愈来愈严重。开元十八年，在安陆多次谒见裴长史，没有结果；来长安谒见宰相张说，也是没有结果。多次的谒见于各大王公大臣，多次没有任何结果。过了一年，到李白31岁的时候，他放弃了，长安的巨大花销使他潦倒长安，不得不去。到了河南，爬了嵩山，居住在朋友家里，无忧无虑，把酒唱歌，世俗的压力迫使李白有了归隐的冲动。第二年，李白路上认识了同为饮中八仙的催总之，便与其结伴出游半年，才回到安陆的家里。离家五年了。自此李白开始了他居家读书，喝酒，交友，出行的生活。终于，三年后，在35岁那年，玄宗狩猎，李白西游，命运交错，李白献上了《大猎赋》，受到玄宗赏识。又进长安，认识了玉真公主，见到了贺知章。贺知章叫他谪仙人，说他是天上的太白金星，偷渡凡尘。一派龙歌凤舞，一派春风得意，但可惜，38岁那年，李白的妻子去世了，对，就是宰相的孙女，在李白的生平列事中几可忽略的妻子，给他生了一儿一女的妻子，撒手人寰。结婚，对李白的一生是否是个错误？他这种人本不应该结婚，辜负了妻子的爱，冷淡了妻子的情。他得到了经费与人脉，却有污于他的仙风道骨。这一年，李白又回家了。一年后，李白娶了一个姓刘的女人，但分手了，因为他看不起李白。42岁那年，李白终于得到了真正的赏识。贺知章与玉真公主对李白赞不绝口，献上李白的诗篇名作给玄宗观赏。李白被召进京，出于崇拜，玄宗甚至亲手调羹给李白喝。而李白平生游走四海五湖，见到了世间疾苦，告诉了玄宗自己的见解，也让玄宗更加尊重李白。然后玄宗出行宴请，郊游玩乐，都带着李白，虽然只是写诗。李白不喜欢御用文人的生活，他说“世人不识东方朔，大隐金门是谪仙”“安能摧眉折腰事权贵，使我不得开心颜”等流传千古的诗句。而他让高力士脱靴，杨国忠捧砚的做法也引起了权臣的不满，最后离开朝廷，飘飘而去，留下了遗憾与不舍，还有对朝廷的愤怒。44岁那年，他在长安的墙壁上撒尿提诗，写了一首《梁园吟》:我浮黄河去京阙，挂席欲进波连山。天长水阔厌远涉，访古始及平台间。平台为客忧思多，对酒遂作梁园歌。却忆蓬池阮公咏，因吟“渌水扬洪波”。洪波浩荡迷旧国，路远西归安可得！人生达命岂暇愁，且饮美酒登高楼。平头奴子摇大扇，五月不热疑清秋。玉盘杨梅为君设，吴盐如花皎白雪。持盐把酒但饮之，莫学夷齐事高洁。昔人豪贵信陵君，今人耕种信陵坟。荒城虚照碧山月，古木尽入苍梧云。梁王宫阙今安在？枚马先归不相待。舞影歌声散绿池，空馀汴水东流海。沉吟此事泪满衣，黄金买醉未能归。连呼五白行六博，分曹赌酒酣驰晖。歌且谣，意方远。东山高卧时起来，欲济苍生未应李白走后，武则天时宰相宗楚客的孙女路过，看了诗后久久不能释怀，不惜千金买墙，成了一段佳话。后来，李白离开长安，到了洛阳，遇见了杜甫。他比杜甫大11岁，誉满天下，但没有在杜甫面前骄纵。他赏识杜甫，喜欢杜甫。两人相见恨晚，在洛阳饮酒称豪，并约定秋天的时候去开封会面。秋天，两人如约而至，寻仙防古，又认识了诗人高适。三人酒饮达旦，率性天真。秋冬之际，李白和杜甫分手，来了紫极宫，授了道箓，正式成了一个道士。也就是这一年，又接了真箓。我不懂真箓是什么，但现在李白的寻仙，是毫无虚行的。第二年，李白和杜甫第三次会面在山东，据说也有高适，他们去找了李白年轻时认识的书法家李邕李北海。冬天，李白和杜，高分手后，遇到了他的第三个老婆，在史书上都没有留下名字的老婆。李白身上带的大批金银，便在山东安居，购买了大批田产，和这个妻子在这里生活，还生下了一个孩子。五年后，这个连名字都不知道的女人去世，史书记载不多，无从考证。只知道李白和这个女人的感情超过了许家女的附庸关系与刘家女一时冲动。该女子去世后，李白碰见了他生命里最后一个女人，哪位千金买壁的宗家女子。不论新唐书还是旧唐书，对李白的传记一直都是寥寥数字，宗家女和李白后来如何相识，我没有明确的答案。只知道后来安史之乱爆发后，李白和宗氏一道南奔跑路，后玄宗入蜀，李白便到庐山隐居。五十七岁那年，李白提剑入军营，参加了永王的勤王活动，这个时候玄宗退位，肃宗继位，便和永王展开了争斗，永王兵败。李白被好友营救，最后只落了个被发配到云贵地区的惩罚。两年后，关中大旱，朝廷大赦天下，李白写了那首朝辞白帝彩云间的诗句。这一年，他59岁了。李白又恢复到了他以前的生活，这会可能有宗氏的陪伴。生活虽然窘迫，但他依旧活的有滋有味。62岁那年，与世长辞。《旧唐书》对李白的死，只记载了一句话:“以饮酒过度，醉死于宣城”。李白的故事讲完了，你能看到吗？要能看到，你就会有个答案吧？我只愿意讲故事。（PS，以上都是虚岁，李白701年生的，周岁要小一岁）不知耻的放一下公众号，希望有人看到会关注一下，哪怕你在认清我之前取关了呢？http://weixin.qq.com/r/fC4XD77E6_OUrfps93tu (二维码自动识别)", "answer_votes": "92", "answer_comment": "​16 条评论"}
{"answer_author": "Paddington", "answer_id": 94541273, "answer_text": "——痛饮狂歌空度日，飞扬跋扈为谁雄？那一双傲慢的靴子，至今还落在高力士羞愤的手里。人，却不见了。把满地的难民和伤兵，把胡马和羌笛交践的节奏，留给杜二去细细的苦吟。自从那年贺知章花了眼，认你做谪仙，你便更加佯狂。用一只中了魔咒的小酒壶，把自己藏起来，连太太，也寻不到你。你怨长安城小而壶中天长。在所有的诗里，你都预言会突然水遁。或许，就在明天。只扁舟破浪，乱发当风。-树敌如林，世人皆欲杀之。肝硬化，怎杀得死你？酒入豪肠，七分酿成了月光，余下的三分啸作剑气，绣口一吐，就半个盛唐！从开元到天宝，从洛阳到咸阳。冠盖满途，车骑的嚣闹，不及千年后，你的一首水晶绝句，轻叩我额头，当的一弹，挑起的回音。一贬世上，已经够落魄，再放夜郎，毋乃太难堪。至今成谜是你的籍贯。陇西或山东，青莲乡或碎叶城。不如归去？归哪个故乡？凡你醉处，你说过，皆非他乡。失踪，是天才唯一的下场。身后事，究竟你遁向何处？猿啼不住，杜二也苦劝你不住，一回头，囚窗下竟已白头。七仙，五友，都救不了你。匡山给雾锁了，无路可入。仍炉火未纯青，就半粒丹砂，怎追蹑葛洪袖里的流霞？-樽中月影，或许那才是你的故乡。常得你一生痴痴地仰望？而无论出门向东哭，向西哭，长安却早已陷落。二十四万里的归程，也不必惊动大鹏了，也无须招鹤。只消把酒杯向半空一扔，便旋成一只霍霍的飞碟，诡绿的闪光愈转愈快，接你回传说里去了。第一时间想到这首，余光中先生的《寻李白》，聊以共勉之。", "answer_votes": "9", "answer_comment": "​添加评论"}
{"answer_author": "潘水根", "answer_id": 82898278, "answer_text": "对自己人生有完美的设计，先“功成”，后“身退”。为了“功成”，遂漫游天下，交友、联宗，做的最多的是干谒权贵。常常用极认真的态度去做自己倍感恶心的事情，于是纠结、苦闷，也装。偶尔也跺一跺脚，声称不干了，“安能摧眉折腰事权贵，使我不得开心颜”，但看到尚有一丝希望，依然硬着头皮苦求。天宝初，人生有了转机，因制科得到了唐玄宗征召，一年半左右的京城政治生涯，也没有什么作为，或许是碰到了不可化解的难题，他只好含着泪请辞。之后的生活还是在“功成”与“身退”中打圈，结果差一点也把自己“圈”进了死牢。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "傲娇姐", "answer_id": 153045671, "answer_text": "将进酒杯莫停自我感觉怀才不遇能文能武不善权谋吃软饭好饮酒清高自傲没有兼顾好家庭不是一个好父亲不是一个好丈夫但是个好诗词人豪爽大气内有乾坤忧国忧民又不务实是个很好的朋友理想和现实之间的冲突碰撞在他身上体现的最为明显吧。以上个人见解。", "answer_votes": "1", "answer_comment": "​3 条评论"}
{"answer_author": "李白", "answer_id": 77155740, "answer_text": "谢邀，惭愧，鄙人对历史不甚了解，占坑，等高人来解~", "answer_votes": "2", "answer_comment": "​添加评论"}
