{"question_id": "39034196", "question_text": "机器学习工程师是否可以成长为CTO？工作内外应该注意提升自己哪方面的能力？", "question_title": "机器学习工程师如何自我提高？", "question_commet": "​添加评论", "answer_number": "9 个回答", "question_followers": "87", "brower_number": "2,256"}
{"answer_author": "桑文锋", "answer_id": 82719786, "answer_text": "可能什么工程师都能成长为CTO，当然机器学习的也包括。要清楚的是CTO是个管理职位，除了懂技术，把握技术方向，还要管理团队。所以除了本职工作，要想做CTO，就也多锻炼一下管理能力。", "answer_votes": "4", "answer_comment": "​添加评论"}
{"answer_author": "面包君", "answer_id": 88537988, "answer_text": "从机器学习工程师成长为cto、首席科学家的比比皆是。不管是创业公司的cto还是大公司的cto都是有一些背景和原因的。比如说鲁大哥做到阿里的cto，自己一方面很牛，另外也和公司一起成长到今天。公司的技术变革和调整方向，业务的发展，团队的成长都是非常清楚的。比如我们那个朋友的创业公司，cto是当初联合创始人中最懂技术的，公司的网站、服务器、机器学习平台、招人、培训团队、业务配合这些都是他一个人承担过来的，到目前发展的都还不错，自己是个技术控，不太爱和人打交道。还有像我们之前的一家公司，老板很有钱是个老外，从google挖了个技术总监来担任cto，主要负责广告的推荐。经验、技术、创新、背景、能力都有。还有我们的周涛哥哥，哈哈。当然人家也是神童啦，发了很多创新学术论文。现在在成都做了个pkbigdata，还有数之联、大数据基金之类的。所以其实不管是你做机器学习还是数据挖掘，要成长为cto都有些共性。你的技术蛮屌的，你的经验蛮丰富的，你的资源挺多的，老板蛮喜欢你的。", "answer_votes": "3", "answer_comment": "​添加评论"}
{"answer_author": "张馨宇", "answer_id": 84875413, "answer_text": "创业就行了，你相当CTO、CEO集于一身都行。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 250363603, "answer_text": "需要技能摘要计算机基础和编程计算机科学基础对于机器学习工程师来说重要，包括数据结构（堆栈，队列，多维数组，树，图等），算法（搜索，排序，优化，动态规划等），可计算性和复杂性（P vs NP，NP完整问题，大O符号，近似算法等）和计算机体系结构（内存，缓存，带宽，死锁，分布式处理等）。编程时，您必须能够应用，实施，调整或解决它们（如适用）。 练习问题和编码比赛是磨练你的技能的好方法。概率统计概率（条件概率，贝叶斯规则，似然性，独立性等）和从其衍生的技术（贝叶斯网络，马尔可夫决定过程，隐马尔可夫模型等）的形式表征是许多机器学习算法的核心; 这些是处理现实世界不确定性的手段。 统计学领域提供各种措施（平均值，中位数，方差等），分布（统一，正态，二项式，泊松等）和分析方法（方差分析，假设检验等） 这是从观测数据建立和验证模型所必需的。 许多机器学习算法本质上是统计建模过程的扩展。数据建模和评估数据建模是估计给定数据集的基础结构的过程，其目的是找到有用的模式（相关性，聚类，特征向量等）和/或预测以前看不见的实例（分类，回归，异常检测等）的属性。 这个估计过程的关键部分是不断评估给定模型的好坏。 根据手头的任务，您将需要选择适当的准确度/误差测量（例如分类的对数损失，回归的平方误差等）和评估策略（训练分析，顺序 vs.随机交叉验证等）。 迭代学习算法通常直接利用产生的错误来调整模型（例如神经网络的反向传播），所以理解这些措施相比于仅仅应用标准算法是非常重要的。应用机器学习算法和库机器学习算法的标准实现通过库/包/ API广泛提供（例如，scikit-learn，Theano，Spark MLlib，H2O，TensorFlow等），但是有效地应用它们涉及选择合适的模型（决策树，最近邻，神经网络，支持向量机，混合模型等），拟合数据的学习过程（线性回归，梯度下降，遗传算法，bagging，boosting和其他模型特定方法），以及了解超参数如何影响学习。 您还需要了解不同方法的相对优点和缺点，以及一些其他的概念（偏差和方差，过拟合和欠拟合，缺失数据，数据泄漏等）。 数据科学和机器学习的挑战，如Kaggle的挑战，是一个接触不同种类的问题及其细微差别的很好的方式。软件工程和系统设计在任务结束时，机器学习工程师的典型输出或可交付成果是软件。 通常它是一个适合更大的产品和服务生态系统的小部件。 您需要了解这些不同的部分如何协同工作，与他们进行沟通（使用库调用，REST API，数据库查询等），并为您的组件构建适合的接口以供其他人依赖。 这可能需要谨慎的系统设计以避免瓶颈，并且随着数据量的增加，您的算法可以很好地扩展。 软件工程最佳实践（包括需求分析，系统设计，模块化，版本控制，测试，文档等）对于生产力，协作，质量和可维护性是无价的。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "终端研发部", "answer_id": 251260277, "answer_text": "首先我觉得是完全有可能的。就看个人能力以及在工作过程中去和提升自。拿我而言：我12年来北京，就做了android。一开始就在创业公司里去磨练，跟着前辈学习。每天总是第一个到公司，最后一个走。所以有了更多的时间去学校和提升。后来跳了一家公司，在一家创业而公司了做了一年多，后来升职为项目小组长。建议慢慢的来。只要有技术，不断学习，我想总会能成功的。另外我现在也在学习python，学习语一段时间了。感觉python的强大。工作上 需要主要：      1、工作要细心，少出bug   2、说上要大度，圆滑   3、要学会知道老板的心意  5、把酒量练好，将来和老板好打交道 这是个人的经验和理解。觉得不错，可以关注微信号：终端研发部 。这里有更多你想要的", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "神彩飝扬", "answer_id": 140940335, "answer_text": "机器学习的路线图分为5个级别，每个级别都对应一本书必须要掌握的书。这5个级别如下：Level 0（新手）：阅读《Data Smart: Using Data Science to Transform Information into Insight》。需要了解电子表格、和一些算法的高级数据流。Level 1（学徒）：阅读《Machine Learning with R》。学习在不同的情况下用R语言应用不同的机器学习算法。需要一点点基本的编程、线性代数、微积分和概率论知识。Level 2（熟练工）：阅读《Pattern Recognition and Machine Learning》。从数学角度理解机器学习算法的工作原理。理解并调试机器学习方法的输出结果，同时对机器学习的概念有更深的了解。需要有算法、较好的线性代数、一些向量积分、一些算法实现经验。Level 3（大师）：阅读《Probabilistic Graphical Models: Principles and Techniques》。深入了解一些高级主题，如凸优化、组合优化、概率论、微分几何，及其他数学知识。深入了解概率图模型，了解何时应该使用以及如何解释其输出结果。Leval 4（宗师）：随便去学吧，记得反馈社区。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "Einstein", "answer_id": 118449990, "answer_text": "多看书，多阅读关于这方面的书籍，也要多操作，且学习经验", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "细尼玛", "answer_id": 84038449, "answer_text": "谢邀。当然有希望成为CTO，据我所知，去哪儿前任CTO是运维工程师出身（无意冒犯）。前面桑文锋兄的回答说的很在理，在追求技术进步的同时还要有意锻炼管理能力，特别是与其他人相处的能力，能够让其他同事的能力为你所用。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "王坤", "answer_id": 83199148, "answer_text": "第一次被邀，其实如果你还年轻的话，就先把技术做的很扎实，不要那么好高骛远，人的精力总是有限的，CTO怎么着也得30岁以后了，甚至更大一些", "answer_votes": "0", "answer_comment": "​添加评论"}
