{"question_id": "41754658", "question_text": "", "question_title": "有哪些古代文人的梗？", "question_commet": "​2 条评论", "answer_number": "90 个回答", "question_followers": "5,360", "brower_number": "261,826"}
{"answer_author": "朱权", "answer_id": 92480605, "answer_text": "1、唐代诗人张籍是杜甫的忠实粉丝，他将自己偶像的诗作烧成灰之后扮上蜜膏，每天早上吃三勺，意图“吃什么补什么”。（张籍虽不如杜甫有名，但也在文坛上算是名声斐然。晚年以创作乐府诗为专长，与王建并称“张王乐府”。）2、纪晓岚有过特别的买假货的经历。买几块墨，“余尝买罗小华墨十六铤，漆匣黯敝，真旧物也”，结果回家一看，是泥外面涂上黑色。买蜡烛，回去以后怎么也点不着，折腾半天才发现也是泥做的，外面裹一层羊脂。他的从兄万周，某天晚上上街去买只烤鸭，回来之后发现是鸭骨架糊上泥，再刷层油，夜晚灯光下根本看不清，啃了一嘴泥。奸商太多，纪大人很不爽，在自己的《阅微草堂笔记》里给这些个奸商狠狠的记了一笔，感慨“人情狙诈”。3、清代文学家石韫玉也是大藏书家，他给自己的藏书库命名为“孽海”。修《苏州府志》的时候，发现有黄书、淫秽色情刊物以及与正统思想不符的书一律烧毁。此人是朱熹的脑残粉，某天读《四朝闻见录》发现里面有诋毁自己偶像的字句，当即大怒。拉过自己婆娘来，把她头上身上的首饰都撸下来，去当掉换钱又凑了自己的积蓄，买下城里所有的《四朝闻见录》，一共三百四十多本，尽数烧毁。有点心疼他老婆4、北宋理学家程颢程颐兄弟俩曾经一起去朋友家赴宴，大家喝嗨了就叫了一群歌妓上来。程颐觉得有辱斯文，拂袖而去。程颢面不改色，继续嗨。第二天兄弟俩见面，程颐埋怨哥哥说你怎么能做这种事。程颢一脸正气道：“座中有妓，吾心中无妓。”这话不管你们信不信，我反正信了，呵呵。5、薛涛、鱼玄机、刘采春、李季兰合称“唐代四大女诗人”，这其中李季兰人缘不错，和当时的很多文人雅士都有往来。刘长卿有“阴重之疾”，也就是“疝气”，李季兰知道之后特意有一次大家聚会的时候问他：“山气（疝气）日夕佳？”取笑刘长卿的疝气病，刘长卿反应很快，当即也回以陶渊明的诗：“众鸟欣有托。”不要担心，我的鸟用布袋子托着呢。注：很多疝气病患者都用布兜托着以减轻痛苦6、东晋名士郗鉴，永嘉之乱时为避祸躲到乡下。家里太穷，天天挨家蹭饭。他不仅自己蹭饭，还带着侄子郗迈和外甥周翼。时间长了乡亲们不干了，说我们尊重你是名士才给你饭吃，你还带着两个拖油瓶，这不太好吧，我们也穷，供不起这么多人。话说到这份上，郗鉴以后再去蹭饭就不带两个孩子了。但是每次回来的时候都把自己弄得跟蛤蟆一样，两边腮帮子里塞的满满的食物，到家里吐出来给孩子吃。就这么把两个孩子带大，后来三人得以一同渡江入仕。这故事体现的是郗鉴的博爱和善良，可是我只觉得这俩孩子真可怜。7、魏藻德，崇祯年间状元，曾任内阁首辅。国破被俘之后，立马见风使舵，希望能成为大顺政权中的一颗螺丝钉，但是李自成并不鸟他。刘宗敏也看不上他，说就是因为首辅失职才搞乱了朝政。魏藻德还为自己辩解，称是“先帝无道”所致，没想到惹得刘宗敏大怒，臭骂他：“你一个书生，点你为状元之后不到三年就任命你做宰相，崇祯哪一点对不起你，你现在说他无道。小的们，给我抽丫的。”暴打一顿之后送刑官处拷打追赃，打出白银一万七千两。顺带一提，关于这个魏藻德的死说法很多，有的说他是和陈演（也是一位明末首辅，吏部尚书，他比魏藻德识相，主动交出四万两白银，所以待遇还不错，没挨揍，但还是没逃过一死）一同被杀，有的说他是自杀，有的说他是喝了一大碗凉水就死了，这个说法比较离奇。而明史的说法是“酷刑五日夜，脑裂而死”，很残忍的死法。但还有一种说法，这种说法就有点搞笑了，说他是因为扛不住打想贿赂一下负责看管的小校，钱已经没有了，就准备献上自己的女儿。但不知道是不是他女儿长得太丑把小校给恶心到了，不仅没当上老丈人，反而被当场打死。8、郭倪，南宋宁宗时期任京洛招抚使。此人一向自比诸葛亮，扇子上题诗都是“三顾频烦天下计，两朝开济老臣心”。甚至还制作了木牛流马，一心要cosplay诸葛亮。后宋军北伐失败，郭倪大败而归，被金兵打的稀里哗啦。败兵之后，郭倪再也不玩cosplay了，每天痛哭流涕。时人讽之为“带汁诸葛亮”。（汁指眼泪）9、唐代人王播年轻的时候很穷，天天在附近的寺庙里蹭饭吃，和尚们不愿让他吃白食又不好意思直接赶他就想了个损招。寺庙里开饭前按规矩要敲钟，王播就是踏着钟声准时来蹭饭的。和尚们把这规矩改了，吃完饭再敲钟，等他来了碗都刷完了。王播知道这是和尚们不想让他蹭饭了，也就不再去了。这个故事到这按理说就可以结束了，机智的和尚设计赶走了吃白食的穷小子，但是好戏还在后面。王播后来发迹了做到宰相，准备故地重游，回当初蹭饭的寺院看看。这个消息可把寺庙的老方丈给吓尿了，谁知道当年吃白食的穷小子能咸鱼翻身呢。思忖再三，老方丈想起来王播当年在寺庙墙壁上随手写下的诗，准备拿这个做文章。等王播来的时候，寺庙上下恭恭敬敬，特意领他去看他当年在墙上写下的诗，如今已经被重点保护起来了，还特意用青纱给罩上。王播感慨万千，在旁边提笔写下《题木兰院二首》：三十年前此院游，木兰花发院新修。 而今再到经行处，树老无花僧白头。 上堂已了各西东，惭愧阇黎饭后钟。二十年来尘扑面，如今始得碧纱笼。后来饭后钟演变成了一个典故，比喻贫困落魄而遭人冷遇。10、北宋文人刘辉，原名刘几。这人第一次参加科举的时候，主考官是欧阳修。当时的文坛流行的时尚是写文章的时候大量的堆砌华丽辞藻，引经据典，实际没什么内容（类似今天学生写作文大段大段的用排比句）而欧阳修对此是深恶痛绝的，他提倡朴实的文风。所以他做主考官，但凡看见辞藻华丽但没有内涵的文章一律让丫的落榜。刘几就是典型，欧阳修批卷时看到他的文章语意晦涩很生气，拿笔从头抹到尾，全否了，还批了“纰缪”两字。刘几落榜以后又回家接着苦读，一边读书一边游历四方，体察民间疾苦，文风也开始慢慢转型。之后再度科举，主考官还是欧阳修。这次他批卷的时候看见一篇文章大加称赞，拿给皇帝看，皇帝也说好，判为第一名。启封看名字，叫刘辉。旁边人告诉欧阳修，这就是当年的刘几啊，他改名了。欧阳修愕然良久。小样，换个马甲我就不认识你了？别说，还真没认出来11、明人何文渊在温州做官的时候，和虞原璩是至交好友。某天晚上闲着没事划着小船出去玩，划着划着就到了虞原璩家门口。趁兴进屋，俩人坐一起聊天。干聊没意思，准备喝两杯，可是家里偏巧没有酒。找了半天找来瓶醋，俩人你一杯我一杯，以醋代酒，彻夜长谈。此事后来传为佳话，时人称之为“何虞醋交”。不知道为什么，“醋交”这个词听起来有点怪怪的。————————————过百赞了，那就再更一发。12、著名的清末怪杰辜鸿铭，特别喜欢小脚，认为“女人之美，美在小脚。小脚之妙，妙在其臭”。他老婆淑姑就是小脚女人，据他自己称，每次写文章没灵感的时候就把老婆叫来，把玩着小脚，闻着脚臭味，就能文思泉涌。不用闻，我已经醉了。13、一提司马光，应该好多人第一反应就是他童年时期的壮举，司马缸砸光（这词居然搜狗还有词条）。这种公然打砸破坏公物的行为被记载在了《宋史》上，后来还有人据此画了幅画，叫《小儿击瓮图》。不过所有人的焦点都在司马光身上，没人注意那个掉缸里的倒霉鬼，史书上甚至都没记下他的名字（可能也是觉得太丢人了）。不过正史没说还有野史杂史，这类资料还是很八卦的，让我们得以知晓那个倒霉鬼的名字——上官尚光。据说这倒霉鬼长大之后还建了个亭子叫感光亭，感谢司马光救命之恩。这个故事真实性个人觉得很低，写下来大家看个乐就得了，别较真。14、狄仁杰做了宰相之后，去她姨妈家里做客。他表弟正从山里打猎回来，拿着弓箭和打到的野兔野鸡，看见已经发迹的表哥只是做个了揖。狄仁杰心里很不爽，就开启了装逼模式。很大方的冲表弟说，老弟啊，你表哥现在牛逼了，做宰相了，说，你想要啥，要银子还是要官位，哥都能整。姨妈在一旁淡淡说道：“我就这么一个儿子，我可不想让他去伺候一个女人。”狄仁杰羞愧的无地自容，只得黯然离开。神探狄仁杰也有装逼失败的时候啊15、陈献章，字公甫，号石斋，世称“白沙先生”。这人的长相特别有个性，“右脸有七黑子，如北斗。尝戴方巾，逍遥林下，望之若神仙。”自己脑补一下这人的长相吧，右脸上一把大黑勺子，这一看就不是普通人。《明语林》记载此人坐船出行的时候遇上打劫的，听说他在船上，不仅立马放下屠刀转身滚蛋，还退还了已经抢到的财物。按书上的说法是因为敬他是君子所以不抢他和他朋友的东西，不过我总觉得可能还是被他的样子给吓着了提到陈白沙还有一件事很有趣，这人是个大孝子。孝顺到什么程度，每次和媳妇打炮之前都有跟老娘请示。恭恭敬敬的到老娘面前，说：“献章求嗣，请示裁决。”我想要生儿子，老娘你同意不？他娘说：“可。”他才进屋和媳妇上床办事。后来这事被他的一个朋友知道了，他朋友教育他说：“你娘是孀居多年的寡妇，这种事你怎么能和她说？”陈白沙被说的哑口无言，之后就改了这个习惯。16、民国学者刘文典自称最好“云腿”（云南火腿）与“云烟”（云南烟土），外号“二云居士”。而关于他爱吃“云腿”这一项，汪曾祺老先生颇不以为然。汪老先生在其著作《做饭》里还特意提及此事，称“有一位名教授，外号“二云居士”，谓其所嗜之物为云土与云腿，我想这不可靠。走进大西门外凤翥街的本地馆子里，一屁股坐下来，毫不犹豫地先叫一盘“金钱片腿”的，只有赶马的马锅头。教授只能看看。”教书的先生只能看着人家吃肉，想想还有点心酸。17、杨继宗，明朝成化年间任嘉兴知府。某天他不在家，有人来送礼，一只熟鹅，一个猪头，他老婆就收下了。杨继宗回来之后也没问就吃了，吃完问老婆哪里来的，老婆说人家送的。杨继宗顿时捶胸顿足，召集所有属下开会，在会上做深刻的批评和自我批评，检讨自己没有教育好老婆，以致收人贿赂。最牛逼的是他当着众人的拿出肥皂。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。然后吃了下去。吃完肥皂，一顿狂吐，把吃人家的东西都吐了出来。散会之后又派人准备行装，把老婆送回了老家。我想知道他拿出肥皂的那一刻下面人都是什么表情顺便说一句，杨继宗这个人的确是个难得的大清官。连当时的大太监汪直都说：“天下不爱钱者，惟杨继宗一人耳。”有这样的人，是嘉兴百姓的福气，就是有点委屈了他老婆。18、清中期著名文学家桑调元，于教育方面也颇有成就。雍正年间曾出仕做官，后辞官回乡专职教书。按照《白下琐言》的说法，这位桑老师的治学格言是：放开肚皮吃饭，打起精神读书。他收学生的规矩特别怪，每顿饭吃不下四五碗饭的不要。嘉庆年间，南京有位著名的塾师叫胡心斋，这人和桑先生一样，也曾教育学生：你们要读书，就要先练饭量，吃得多才能读得好。老师，我不读书了，我实在是吃不下去了19、民国学者章太炎的大弟子黄侃是个很有性格的人物，狂傲不羁，人送外号“黄疯子”。他在某大学任教期间，讲课讲到一半突然停下来，跟学生们说学校发的工资只够讲这些的，想听剩下的内容你们得请我吃饭。你跟上面那条里桑先生的弟子们商量一下，你去吃那每顿的四五碗饭吧20、明中期思想家黄绾是朱熹的虔诚信徒，早年曾发奋苦读，修身养性。到什么程度呢？“闭户书实，以至终夜不寐，中日不食，罚跪自击，无所不至”，废寝忘食的读书，还闲着没事自己抽自己，有点苦行僧的意思。平时还拿个小册子，一边写“天理”两字，一边写“人欲”两字，“发一念由天理，以红笔点之；发一念由人欲，以黑笔点之。至十日一数之，以视红黑多寡为工程。”除了这些，人家黄先生还拿小木牌刻上名言警句座右铭之类的放在袖子里，时常拿出来看。黄先生的修行很刻苦，也很变态，但是效果貌似不咋的。他早年靠“大礼议”起家（“大礼议”是明嘉靖初年的一次重大政治事件，在此不细说了，不知道的自行百度），最初依附张璁，后来背叛张璁依附夏言，一辈子虽有起落但也算官运亨通，不过就是名声不好，“初附张璁，晚背璁附夏言，时皆以倾狡目之”。也不知道早年费那么大劲修行干吗的黄绾这个人还有件趣事，他曾经跟皇帝吹牛逼，说自己学习岳飞，背上也刺了尽忠报国四个大字。没想到皇帝较真了，让人把丫衣服扒了看，一看没有。皇上受到了欺骗很伤心，黄先生乱吹牛逼也被人笑话了好一阵子。顺带一提，在黄绾之前，正德年间，有个叫余刁宣的锦衣卫，也是跟皇帝说自己刺了尽忠报国四个字。皇帝把丫的暴打一顿发配岭南。唉，年轻人啊，就是总想搞个大新闻，不知道吸取教训。——————————————抱歉，之前第二条里说买到假烤鸭的事主角不是纪晓岚，是他的从兄万周，之前写错了，对不住大家。评论里有人说纪晓岚不吃鸭子，这个我看了一下，《阅微草堂笔记》里是有一条“鹅鸭凶兆”的故事。说的是雍正年间东光城里，某天晚上突然全城的狗都开始疯叫，大家出门看。发现月光下站着一个人，长发及腰，身披蓑衣，手里拿着一个巨大的袋子，袋子里全是鹅鸭的声音。这人站在房顶上，站一会又到别家房顶上。第二天，凡是被他站过的人家院子里都多了几只鹅或者鸭子。杀了吃肉，和普通的鹅鸭也没区别。但是得了鹅鸭的人家之后都死了人，大家才知道这是凶煞。纪晓岚在《阅微草堂笔记》里记录了这个故事，但好像没说自己因为这个就不吃鸭子了。不知道是不是还有别的资料上提到纪晓岚不吃鸭子的事，如果哪位知道，请告诉我，谢谢！", "answer_votes": "2.8K", "answer_comment": "​189 条评论"}
{"answer_author": "营三千", "answer_id": 92461434, "answer_text": "【3月27日上午第一次更新，3月27日晚第二次更新】李东阳！养啥死啥的天煞孤星+精分狂魔+重症痔疮患者+调戏基友爱好者（此答案多图预警）仰天长啸，我胡汉三又来安利他老人家啦~~大家都知道我们李阁老虽然官运不错，一直做到首辅，但一生各种克死亲人，弟弟克死三个，儿子克死三个，女儿克死至少三个（李盈、李菱，还有一个嫁给衍圣公孔家的女儿），老婆也克死俩……总之家里人全给他克死了（这个具体我们后面再扒），所以我们李阁老的内心特别脆弱，稍稍有点风吹草动就开始嘤嘤嘤~~比如说他南下的时候，走水路路过江西，正好船夫采了一种野菜，阁老不认识，就问船夫这东西叫什么，船夫说叫做连理菜。阁老一听“连理”二字，眼泪唰就下来了：野菜都能连理，我这一辈子怎么就连理不起来呢！！<img data-rawheight=\"182\" data-rawwidth=\"716\" src=\"https://pic4.zhimg.com/50/b9b5f1a3b5710d179dedeb9e27e616d8_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"716\" data-original=\"https://pic4.zhimg.com/b9b5f1a3b5710d179dedeb9e27e616d8_r.jpg\">也不知道是传染还是怎么地，跟李阁老玩的比较好的同志们，基本上都有死儿子的经历，像杨一清更惨，生都生不出来。阁老丧子没多久，刘大夏的儿子就也死了，于是李东阳写诗安慰他：“十日朝回不出门，两翁孤坐各黄昏。”所以二位都是这么聊天的么——“哎老刘，我儿子死了。” “没事老李，我儿子也死了。”然后俩老头面面相觑无语凝噎……话说刘大夏自号东山，李东阳自号西涯，唉好像还挺配的？【手动滑稽】家里人全死了，要不咱就养个动物吧？于是，李阁老跟好基友之一（他基友太多）谢铎要了一只猫回来养。然后，没过几天，小猫咪也死了……而且还是被！踩！死！的！<img data-rawheight=\"432\" data-rawwidth=\"686\" src=\"https://pic1.zhimg.com/50/d0bb95195c76f95620fd61dc9e91a52e_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"686\" data-original=\"https://pic1.zhimg.com/d0bb95195c76f95620fd61dc9e91a52e_r.jpg\">从这首诗中可以看出，李阁老伤心之余，把小猫咪埋在了自家种的竹子底下。于是乎……<img data-rawheight=\"226\" data-rawwidth=\"706\" src=\"https://pic4.zhimg.com/50/20beafde1a89bcf604257d117760b77e_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"706\" data-original=\"https://pic4.zhimg.com/20beafde1a89bcf604257d117760b77e_r.jpg\">嗯，没错，竹子也死了……一个悲伤的故事……李阁老不灰心，又养了一只鹦鹉。<img data-rawheight=\"370\" data-rawwidth=\"715\" src=\"https://pic2.zhimg.com/50/1e049cb889f0fd37f65278cc7f091cf1_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"715\" data-original=\"https://pic2.zhimg.com/1e049cb889f0fd37f65278cc7f091cf1_r.jpg\">完全预料之中的，鹦鹉也死了……阁老请问你家除了你自己之外还有啥别的活的生物吗？！然而，就连这唯一活下来的生物李阁老，人到中年，也有了难言之隐——痔疮。请看他的《求退录》：臣于弘治十七年十月初，得患痔漏脏毒等证，燥热秘结，累日不通，几至危殆。累日不通2333333……虽然我是阁老粉，但还是很想笑怎么破！！身体各种不行，家里又养啥死啥，李阁老终于受不了了，于是开始了调戏基友+精分之旅。怎么个精分法？请看这四首诗：<img data-rawheight=\"211\" data-rawwidth=\"619\" src=\"https://pic2.zhimg.com/50/cbb97eb58bb8a0c376e551da2495b6fb_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"619\" data-original=\"https://pic2.zhimg.com/cbb97eb58bb8a0c376e551da2495b6fb_r.jpg\">问自己的胡子：啊我的胡子，你为什么这么早就白了捏？<img data-rawheight=\"210\" data-rawwidth=\"600\" src=\"https://pic2.zhimg.com/50/9832a9191e47755a1fab2d9d677dad13_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"600\" data-original=\"https://pic2.zhimg.com/9832a9191e47755a1fab2d9d677dad13_r.jpg\">胡子的回答：关你屁事，我就白了怎么着？！<img data-rawheight=\"214\" data-rawwidth=\"555\" src=\"https://pic1.zhimg.com/50/c52e8a8002c38044bc4c8eb004f3936f_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"555\" data-original=\"https://pic1.zhimg.com/c52e8a8002c38044bc4c8eb004f3936f_r.jpg\">又问自己的头发：啊我的头发，你咋也跟着胡子一起白了捏？<img data-rawheight=\"203\" data-rawwidth=\"704\" src=\"https://pic4.zhimg.com/50/bbec0e60460d15190b42245f603049bd_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"704\" data-original=\"https://pic4.zhimg.com/bbec0e60460d15190b42245f603049bd_r.jpg\">头发的回答：你烦不烦啊一个大老爷们天天照镜子？以上角色全部由阁老自导自演，阁老你精分的累不累？要不要我帮你擦擦汗？除了精分之外李阁老还非常热衷于调戏好基友，但凡是跟他关系不错的，基本上都逃脱不了被他毒舌吐槽的厄运，今天先不八这么多，我就上一个预告图：<img data-rawheight=\"265\" data-rawwidth=\"690\" src=\"https://pic2.zhimg.com/50/993f5a6925728013516fc8e335bfcf2a_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"690\" data-original=\"https://pic2.zhimg.com/993f5a6925728013516fc8e335bfcf2a_r.jpg\">这个李白洲是谁呢，没错，就是跟着著名脑残宁王朱宸濠谋反的那个李士实！当然了这会儿宁王和朝廷还处于蜜月期，所以李士实和李东阳关系依旧相当好，比如这首诗的意思就很明显：听说李士实最近长胖了唉！那我去写首诗嘲笑他！李士实你说你是不是被他气晕头了才去谋反的！【再次手动滑稽】================一条活泼的分割线================今天我们就来八一八李阁老是如何花样吐槽其他同僚官员的~高能预警~1、调戏王守仁：王守仁弘治六年参加会试，落榜，因为他爹是状元，所以一堆官员跑来安慰他，李东阳也在其中，还对老王（这会儿还是小王吧）开玩笑：“没事没事，今年不中，下次肯定是状元！要不你写一个《来科状元赋》给大家看一看？”老王非常感动，然后，就在老李的忽悠下写出了一篇连题目都这么羞耻的文章…… 2、调戏陆釴：成化十三年，李东阳生病了，于是与好基友陆釴约定：从现在开始我们谁都不准写诗！谁再写罚谁！陆釴倒是很老实，说不写就不写，但是李阁老憋不住啊，憋不住怎么办？于是他就开始玩集句……集句，把古人的诗凑一凑就好了，怎么能算写诗呢？老陆听说之后很不开心，就写信寄给李阁老，说他耍赖，李阁老毫无压力，在回信中重申了集句不算写诗的观点，并且用唐诗集了一个句催老陆：你怎么还不开始写啊！你快写你快写！老陆没理他，果然最后首先破戒的还是李阁老，老陆大喜，罚了阁老一只鸡，然后带了一堆人去阁老家吃鸡，吃完了喝酒写诗，后来还为此编了个集子叫《鸡坛清话集》……调戏人多了，总会被反调戏咯【手动挖鼻孔】3、调戏焦芳焦芳的脸很长，很长……李东阳天天吐槽他的脸是驴脸，这是前情提要。成化十三年，李东阳与诸同年翰林聚会，并写了一篇《翰林同年会赋》记录这次盛会。在赋中，他根据各人的籍贯，用比喻手法夸赞了大家。如陈音是福建莆田人，就比之为福建的壶岭；刘淳是四川人，就比之为“蜀锦”；阁老自己祖籍湖南，乃自比为“楚璞”；焦芳是河南人，于是……就比之为……河马……<img src=\"https://pic4.zhimg.com/50/f118ef06a42698cf9066a06befe9775e_hd.jpg\" data-rawwidth=\"300\" data-rawheight=\"225\" class=\"content_image\" width=\"300\">河马是什么鬼啊！这还不如驴呢！好吧开玩笑的，河马应该是“河南的骏马” 的意思，当时大概还没有现在的“河马”这种用法，不过，嗯……骏马的脸好像也挺长的？总之焦芳的脸永远逃脱不了被吐槽的厄运……4、调戏陈音（师召）成化十三年（这一年事真多），李东阳与谢铎、焦芳、陆釴等人到陈音家喝酒，这时家人来报，说陈师召的孙子出生，众人便纷纷道贺。李东阳特高兴，乘醉提笔在陈师召家墙上题诗两首，据他自己回忆，整个过程中陈师召一直拽着他袖子叫他别写，然而阁老不鸟他，最后陈师召气的关门回自己屋蹲着去了…李东阳送给陈师召一匹马，陈师召只骑了一次就把马还给李东阳，李东阳很奇怪，就问他为什么。陈师召说，往常我骑马回家，一路上能写六首诗，怎么今天只能写两首？一定是这个马有问题。李东阳无语良久，然后说，大哥，是因为这马跑得快……为什么李东阳要送陈音马呢？因为他以前骑的，是一匹瞎马……你没看错，真的是瞎马……等陈音换新马，就把这瞎马卖了六百文，李阁老一听说就六百文呐，手痒又去写了首诗嘲笑他：<img data-rawheight=\"303\" data-rawwidth=\"933\" src=\"https://pic1.zhimg.com/50/085de9f6284cc31a903f30bd24340598_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"933\" data-original=\"https://pic1.zhimg.com/085de9f6284cc31a903f30bd24340598_r.jpg\">还有一次，陈音上朝之前一不小心穿错了衣服，穿着李东阳的衣服就去上朝了【谁能告诉我为啥会穿错？他俩在上朝之前都在干啥？】，李东阳于是又又又写诗嘲笑他：<img data-rawheight=\"347\" data-rawwidth=\"957\" src=\"https://pic4.zhimg.com/50/7f68dde3cfa9ced61bfc181ee7662dd9_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"957\" data-original=\"https://pic4.zhimg.com/7f68dde3cfa9ced61bfc181ee7662dd9_r.jpg\">注意这首诗里的“堪笑玉堂丛话里”一句，按玉堂丛话是焦竑写的笔记，在这本笔记中，就记载了陈师召同学无数囧萌囧萌的事，比如他本想去别家做客，结果被带错路又走回自己家，遂大惊失色：唉？怎么这么像我家啊！我家仆人怎么也跟过来了？（ps：经提醒，发现这书和李阁老年代对不上，但是也找不到其他名字叫这个的书啊……存疑存疑）当时嘲笑陈同学的呆确实已经成了一种风气，大家每天就是吃饭睡觉嘲陈音……后来陈音去世，李东阳给他写的神道碑文曰：“平居细事多不经意，或遭嘲謔，无所校。”我说李大爷，平时嘲讽他最多的好像就是你吧……你这是得了便宜还卖乖啊……5、调戏杨一清还有杨一清，这位小时候也号称神童，而且他和李阁老一样，长得都比较丑（貌寢），估计两人因为这个就惺惺相惜了。他们都是大儒黎淳的弟子，也是老朋友了。当年杨一清被刘瑾陷害时，是李东阳和王鏊一起救了他一命。后来李阁老的文集是他作的序，死后也是他给写的墓志铭。这份交情，可谓有始有终。但就是这样的死党好基友，李阁老还是要黑他一把，不信请看：邃翁（杨一清）冬天气盛，而西涯怯寒。二公同坐，西涯屡以足顿地作声。邃翁曰：“地冻马蹄声得得。”西涯见其吐气如蒸，戏云：“天寒驴嘴气腾腾。”嗯，阁老就是这么喜欢驴……李阁老病重的时候，杨一清跑过去看望他，跟他说，哎呀，我们开国以来还没有文臣谥号是文正的，要不我把这个谥号留给你吧？李阁老大喜，蹭蹭蹭就坐起来了，非要给杨一清磕头……【杨一清：你也有今天！】6、调戏杨廷和正德八年，杨廷和送给李阁老两棵梅花树，然后一个冬天都没开花【李阁老养啥死啥，这梅花树没死已经很神奇了】，李阁老非常感动，写了一首《石斋阁老赠梅二本，春半无花，用旧韵遣兴一首》，在诗中表示我不服！我要等明年！次年李东阳又送内阁众学士一人一筐核桃，并再度写诗留念。杨廷和收到这份核桃后也非常感动，又送给李东阳一块假山石，并写《石斋阁老送假山石，奉谢一首》……你们互相送礼能不能送点儿正常的？？7、调戏其他官员某次李东阳阁老过生日，祭酒赵永和司业鲁铎约好去他家贺寿。赵永带了两条白帕当礼物，鲁铎却找不到什么能送的，突然想起家里还有条咸鱼，一看才发现已经吃的只剩半条了，想了想，没法子，还是带到老李家。李阁老倒是不嫌弃，“烹鱼沽酒，以饮二公，欢甚，即事倡和而罢”。咸鱼吃的开心吗阁老…… 还有一次李阁老上朝时路过长安街，正好遇见翰林编修崔后渠，崔后渠那会儿也喝大了，没大没小的跟李阁老打招呼：“前请老先生少饮数酌，以敌寒气。”李阁老大喜，当即下轿，一口气喝了几大杯酒，然后才愉快的上朝去了。第二天崔后渠酒醒，觉得昨天对李阁老太没礼貌，十分后悔，就屁颠屁颠的到老李家准备道歉，没想到老李满不在乎，又和他喝了一顿。没办法，老李那么爱喝酒的人，而且还不用自己掏钱，那肯定不客气啊~再者，我阁老年轻的时候也是个“狂过相府慵通刺”的中二青年，对这种活泼好动的年轻人肯定有好感啦~~调戏了这么多基友，那么，有没有李东阳没法调戏的呢？当然有咯，那就是永远严肃正直的刘健同志！因为李东阳太爱写诗，而且过于活泼，刘健都看不下去了，某次，三位阁老一起到翰林院视察新进庶吉士，刘健对他们发表讲话的时候就旁敲侧击：“人间学问有三事……第三才是文章。好笑后生辈才得科第，却去做诗。做诗何用？好是李、杜，李、杜也只是两个醉汉！”李阁老：老子就是又爱喝酒又爱写诗，你打我啊！后来刘瑾用事，内阁三大佬集体请辞。刘健和谢迁都被批准了，唯有李东阳继续留在内阁。刘健临走时非常生气，瞧见送行的李东阳哭的眼泪汪汪，便恼怒的说：“何用今日哭为！使当日出一语，则与我辈同去耳！”看来对他甚是不满。但同去的谢迁同志则并未被影响，刚离开京城就写了《初出城怀李西涯》：“犬马意疲徒恋主，金兰意重更怀人。”嘿嘿……再后来，刘瑾事败，本来呢只是降职为南京奉御，张永恐其再起，和李东阳一合计，联合言官上疏，乃将他的罪名改为奸党律，处斩，顺便坑了张彩等依附刘瑾的官员。张彩知道后大爆发，立刻揭发了李阁老各种拍刘瑾马屁的黑历史，李阁老大怒，直接把奸党律改成谋反律，然后刘瑾就被剐了……一个悲伤的故事……腹黑的李阁老：你们啊，拿衣服！【又一次手动滑稽】================一条忧伤的分割线================嘿嘿，对不住，我来迟啦~~现在我们来八一八被李阁老克死的儿子女儿兄弟老婆们……1、兄弟篇：成化十年正月，三弟李东川去世，李东阳作《哭舍弟东川五首》其一树好连枝折，身危半臂存。乾坤几时梦，骨肉一生恩。寂寞空残语，苍茫有断魂。哀鸣时自触，痛极本无言。成化十二年五月，二弟李东山去世，李东阳作《哭舍弟东山十首》其一命也嗟谁及？悲哉祗有伤。万端皆触目，一日几回肠。晚岁归摇落，幽魂堕渺茫。诗成竟不及，身在恨难忘。2、老婆篇除了最开始八过的那首连理菜之外，还有另一首悼亡诗：独坐寒灯如梦寐，寂寥空馆雁声残。光阴隔眼三生易，尘事伤心一笑难。白雪冰弦怀旧侣，药囊诗卷托微官。只将颜色随甘旨，漫拂新雏弄羽翰。3、儿子篇因为其他两个儿子都是很小的时候就夭折了，这里重点就八他的长子李兆先吧。李兆先是个很有才华的年轻人，但是狂放不羁，不守规矩，有时候甚至还逛逛花街什么的。李东阳管不住他，加上对儿子的宠溺，使得李兆先越来越任性胡来。某一次李东阳实在受不了，就给他题了十六个字：“今日柳巷，明日花街。诵读诗书，秀才秀才！”李兆先回来之后看到了，竟然又反过来给他老爹也写了四行字：“今日猛雨，明日狂风。燮理阴阳，相公相公！”李兆先自负有才华，但是怎么考都考不中，某次落榜，竟然是因为名字写错了，也不知道该说啥好。后来呢，李阁老自个儿也看开了，考不中就考不中呗，健健康康就好，成绩嘛随他去好咯。弘治十三年，李阁老的女儿嫁到山东衍圣公孔家。阁老自己正好身体不好，就让李兆先一个人送妹妹到山东。兄妹二人上路没多久，李阁老就开始想他们了，一首诗一首诗的写，写完了就寄过去，其中一首是这么写的：“生年容易别时难，犹记回头忍泪看。”没想到的是，第二年李兆先就去世了。回头想想这首诗，真是一语成谶啊……李阁老当然悲痛万分，写了很多诗，后集为《哭子录》，这里也摘录一首：次王古直哭兆先韵柬方石二首极知世事如春梦，不信人生是昼游。今日眼看埋玉树，当年心许撞烟楼。空烦挂剑来吴季，却悔藏书似邺侯。回首西湖湖上水，一时和泪共东流。4、女儿篇李阁老的三个女儿，都死在他前头。第一个女儿名字叫李菱，夭折之后李阁老写了一首《哭女菱》：夜堂娇语坐生嚬，眉目分明画里身。谁遣一朝为骨肉？极知千古共埃尘。回头尚觉呼名误，入想犹疑见面真。漫抚哀琴不成调，他年空忆辨弦人。第二个女儿，名字叫李盈，死的也很早。第三个女儿名字不详，总之嫁给了衍圣公，但是后来也去世了。李阁老到了晚年，真个是孑然一身，某年除夕夜，李阁老终于受不了了，写了一首七律：独吟孤坐总伤神，谁伴长安守岁人。卦数已周无那老，年华初转又逢春。思亲泪尽空双眼，哭女声高彻四邻。还向灯前添旧草，拟从新岁乞闲身。唉……想想也是挺惨的一老头啊……好吧目前基本上把整个框架扒完了，其他细节还有更多梗我会慢慢补充。今天再分享一篇很有意思的文章，李东阳《祭老王文》。你没看错，标题就叫这个……老王原名叫王彦实，是李东阳的老仆，比李东阳还年长些。他死后李东阳悲痛不已，便写了一篇祭文祭奠他。老王不通文字，李东阳这篇文章写得也很朴实，但极有情致。<img src=\"https://pic2.zhimg.com/50/64e89dd2c3da2810a7cb45797578a548_hd.jpg\" data-rawwidth=\"440\" data-rawheight=\"350\" class=\"origin_image zh-lightbox-thumb\" width=\"440\" data-original=\"https://pic2.zhimg.com/64e89dd2c3da2810a7cb45797578a548_r.jpg\">是不是觉得写的很萌嘞~嘤嘤嘤~~求赞哟~~(￣ω￣)", "answer_votes": "894", "answer_comment": "​83 条评论"}
{"answer_author": "楚青箬", "answer_id": 94759522, "answer_text": "魏晋名士的就不说了梗太多了大家都说过了。先聊聊我家谪仙人李白的。李白是富二代,出手豪爽,二十多岁在扬州结交豪杰,散尽三十万。吴指南是李白在蜀中时的好友，他与李白一同出蜀漫游，不幸半路上死了。李白感到悲痛欲绝，“若丧天伦”。那时，正是炎夏时节，李白也顾不得令人难闻的恶臭，哭倒在吴指南的尸首上，哭得死去活来，“泣尽而继之以血”，猛虎靠近也不为所动,连行路的人听到李白的哭声，也都不禁伤心落泪。李白按照巴蜀旧俗,权且把吴指南殡葬在洞庭湖侧之后，便到金陵去了。几年以后，他又回到洞庭湖滨，见指南的“筋肉尚在”，于是便亲自用剑削刮指南的遗骨，把它刮净洗清，然后“丐贷营葬”，移葬到鄂城之东。李白最喜欢的书是《世说新语》,喜欢魏晋名士的做派,但是魏晋名士要有门第做支撑,李白不缺才,不缺钱,就缺门第,所以李白要当官,不仅结交各路达官显贵,文人道士,而且有两任妻子都是前宰相的孙女。李白写诗骂第三任妻子刘氏是“会稽愚妇”,还骂她“彼妇人之猖狂，不如鹊之疆疆；彼妇人之淫昏，不如鹊之奔奔，坦荡君子，无悦簧言。”因为当时李白事业上失意,两个人感情不和,刘氏居然看不起谪仙人,哎!据说李白和王维是情敌。李白和王维同岁,都是当时著名的大诗人,都和孟浩然交好,但两人没有任何有记载的往来。两人都是由唐玄宗的妹妹玉真公主引荐入仕的,不过王维是18岁就由玉真公主推荐状元及第名动京师,李白直到41岁才被唐玄宗召见入宫。李白曾经写过“相看两不厌,只有敬亭山”,当时玉真公主在敬亭山修道。公元762年，玉真公主去世，葬于敬亭山。李白也于同一年死于敬亭山下的当涂县。宁王宫有乐妓宠姐者，美姿色，善讴唱。每宴外客，其诸妓女尽在目前，惟宠姐客莫能见。饮及半酣，词客李太白恃醉戏曰：“白久闻王有宠姐善歌，今酒肴醉饱，群公宴倦，王何吝此女示于众！”王笑谓左右曰：“设七宝花障。”召宠姐于障后歌之，白起谢曰：“虽不许见面，闻其声亦幸矣。”杜甫是李白控,脑残粉,现存的写给李白的诗有14首,《唐诗三百首》中收录了3首。李白的两大愿望:一是做宰相,二是成仙。据《广仙列传》记载,李白向水捞月而死是向水解（以往借水解方式解脱）而成仙的障眼法,确实是成仙了，李白成仙后的法号是“东华上清监清逸真人”。李白的老师名叫赵蕤,是个纵横家,著有《长短经》。李白的剑术当世第二,第一是他师父剑圣裴旻,唐文宗曾经下诏,将李白的诗、张旭的草书、裴旻的剑舞为\"三绝\"。李白青少年时期任侠使气,杀过人,还因为杀人藏匿在寺庙。李白是道教徒,正式入过道籍,在齐州(今济南)紫极宫被高如贵天师授过道篆。李白迷恋炼丹,服食丹药,所以他经常能看到神仙。    唐末所谓的才子三罗之一的罗隐，有个粉丝是宰相郑畋的女儿。宰相知道以后，决定撮合俩人，把罗隐请到家里吃饭，女儿就站在帘幕后面偷看……    到这里为止，几乎都是卓文君跟司马相如的前半段故事。　　后来，事情如期进行，罗隐赴宴、郑姑娘在后面看，但是，就因为这一眼，罗隐失去了做宰相乘龙快婿的机会，郑姑娘心中那个安静美好风一样的男子也幻灭了——罗隐长得太丑了。　　姑娘后来想到自己曾经在心里仰慕过这个人都要吐，把他的诗作赶紧从枕头边丢开了。罗隐见光死，被拉黑，郑姑娘的完美爱情破碎……好悲剧的爱情故事啊，哈哈哈。花间派鼻祖温庭筠有两个外号。一个叫“温八叉”，说他才思敏捷，“八叉手而成八韵”，另一个叫“温钟馗”，丑得像钟馗。还有一个以丑闻名的是写“梅子黄时雨”的贺铸他的外号也有两个，一个是“贺梅子”，另一个是“贺鬼头”。唐朝的人喜欢诗,从黄口小儿到到80村妇都喜欢诗,甚至连打家劫舍的强盗也是诗歌爱好者。有一个诗人,叫李涉,晚上在船上遇到一群强盗,强盗问:“何人?”船夫答道:“李博士也。”强盗头子一听,立马下令停止抢劫:“若是李博士,俺们就不抢劫了,久闻李博士诗写得好,是俺偶像啊,今天如果能得到偶像的一首诗,此生足矣。”于是李涉写了一首诗赠给强盗:    暮雨潇潇江上村,绿林豪客夜知闻。    他时不用逃名姓,世上于今半是君。强盗得诗大喜,不仅不抢李涉了,还给李涉送了许多钱财。白居易十六岁时，就写出那首著名的《赋得古原草送别》唐诗三百首没有李贺的。闻一多评价为孤篇压全唐的《春江花月夜》，没有入选《唐诗三百首》,其作者张若虚在张扬的盛唐低调的另类,除了知道他是和贺知章、张旭、包融齐名的“吴中四士”之外,几乎没有什么事迹流传。张若虚流传下来的诗只有两首,另一首是《代答闺梦还》。凭《春江花月夜》,站在唐诗之巅,成就高调的奢华。初唐四杰之首的神童王勃，，曾经脑子一热藏匿了一名犯有死罪的官奴，事后觉得害怕，于是就把那个官奴杀了。杨炯也是神童，不过他是正正经经参加“神童科”考上的神童，杨炯对初唐四杰的排名不满，说愧在卢前，耻居王后”，杨炯写过不少边塞诗，却从未上过战场。卢照邻体弱多病，喜欢吃丹药，但是吃了丹药不仅没成仙，病也没治好，就为自己挖了一处墓穴，没事就卧在墓穴里搞行为艺术，最后投水自尽。七岁成名的骆宾王，写诗喜欢用数字对仗，所以得了个外号“算博士”。宋之问自荐当武则天的男宠：“明河可望不可亲，愿得乘槎一问津”，但是武则天嫌弃他有口臭。宋之问是刘希夷的舅舅，刘希夷写出的“年年岁岁花相似，岁岁年年人不同”的佳句，宋之问非常喜欢，就让刘希夷让给他，刘希夷不同意，于是宋之问就让人用土袋把刘希夷压死了。上官婉儿的母亲怀孕时，梦见神仙给她一杆秤，说她女儿将来可以称量天下人的才华。唐中宗后来举办诗歌比赛，就让上官婉儿担任裁判官。杜甫的祖父杜审言，是唐朝第一狂妄自恋，他说自己的文章比屈原宋玉都好，他了书法可以当王羲之的老师。伯玉摔琴的故事说的是陈子昂，陈子昂是富二代，为了炒作自己的诗才，找了一个老头在长安闹市兜售一把胡琴，要价百万，大家都买不起，于是陈子昂就出现了，一掷百万买下胡琴，然后发了一个头条公告，某月某日将在某处演奏这把绝世名琴。到了那一天，陈子昂把那把百万胡琴当众甩碎，把准备好的诗文分发给围观群众，一举成名。金圣叹死的时候，玩了一把行为艺术。刽子手手起刀落，金圣叹人头落地，从两只耳朵里各滚出来一个小纸团，打开一看，右边是“好”，左边是“疼”。白居易和元稹是cp，柳宗元和刘禹锡是cp，柳宗元曾经为刘禹锡写过“晚岁当为邻舍翁”。后元稹和柳宗元早逝，白居易个刘禹锡做了邻舍翁，哎，贵圈真乱。写“曾经沧海难为水”的元稹，泡过唐朝四大才女其中的薛涛和刘采春，鱼玄机和李季兰要不是因为生的太晚或太早，估计元稹也要泡一泡。写《幽梦影》的张潮发了一条朋友圈：“春听鸟声;夏听蝉声;秋听虫声;冬听雪声;白昼听棋声;月下听箫声;山中听松风声;水际听内乃声;方不虚生此耳.若恶少斥辱;悍妻诟谇;真不若耳聋也. ”其友在后评注曰：读此方知先生耳聋之妙。 孔子出生时候他父亲已经六十多岁了，他母亲才16岁。", "answer_votes": "71", "answer_comment": "​11 条评论"}
{"answer_author": "贺仙", "answer_id": 92465192, "answer_text": "萝莉堪折只须折，莫待嫁作他人妇。—— 观杜牧装逼失误有感杜牧是一条著名的色狼，当然，他也是一条很有道德，很有节操，很有品味的色狼，堪称色狼中的楷模。这哥们的轶事颇多，比如唐文宗大和年间（神马年号。。。），杜牧在湖州市长的陪同下考察湖州的妇女工作，结果杜牧口味太高，竟没有一个妹子能入得了他的法眼。市长一时间不知所措，杜牧曰“不如我们赛艇，哦不，搞水上乐园吧，到时候市民全来观看，我正好在船上偷窥”果然当天人山人海，一直到晚上，杜牧还是一个妹子都没看中，靠岸的时候在人群里看到一个老太婆带着一个十几岁的萝莉，一霎时唤醒了他心中的萝莉控之魂。杜牧当即把两人接到船上，老太婆和萝莉大概是被市长大人的官威和杜牧的淫威给吓到了。杜牧表示要包养萝莉，而且还是十年之后来包养，老太婆问“万一你失信咋办”杜牧“我十年之内来当市长，来不了你们就随意啦”。老太婆答应此事，还收了杜牧的聘礼。后来杜牧一直想去湖州当市长，一直没成功，终于他哥们周墀当上了国务院总理，杜牧连写了三封信请求调去湖州，还敢没说这茬事，借口自己的弟弟眼睛有病，要去江南治疗，终于获批成行。等他赶到湖州的时候已经是第十四年了，萝莉已经成人妻，成人母，带着自己的三个孩子欢迎杜牧。杜牧：悔不当初 (ಥ_ಥ) 于是写下了一首悲伤的诗自是寻春去较迟，不须惆怅惜芳时。狂风落尽深红色，绿叶成阴子满枝。这个故事告诉我们，不要许下自己能力范畴之外的承诺。", "answer_votes": "852", "answer_comment": "​92 条评论"}
{"answer_author": "赵隽祺", "answer_id": 176091670, "answer_text": "居然没人提王安石不洗澡的梗？（谢谢大家提醒，这跟皮肤病也有关系）当年王安石还在地方任职的时候，同僚兼好友的吴充和韩维为了督促他洗澡，便每个月约他一起去寺里聊天，顺便洗澡，之后趁王安石洗澡的时候偷偷把他那许久未洗的脏衣服拿出来换成干净的。王安石洗完澡后换上干净衣服出来，居然毫无察觉。然后再来看看司马光的《和王介甫烘虱》吧：      天生万物名品夥，嗟尔为生至幺麽。      依人自活反食人，性喜伏藏便垢涴。      晨朝生子暮生孙，不日蕃滋逾万个。      透疏缘隙巧剧端，通夕爬搔不能卧。      我归彼出疲左命，备北惊南厌搜逻。      所擒至少所失多，舍置熏烧无术奈。      加之炭上犹晏然，相顾未知亡族祸。      大才洋洋迷所适，奔走示停身已堕。      细者懦怯但深潜，乾死缝中谁复课。      黑者抱发亦忧疑，逃入幧头默相贺。      腥烟腾起远袭人，袖拥鼻端时一唾。      初虽快意终自咎，致尔殓夷非尔过。      吾家箧笥本自贫，况复为人苦慵惰。      体生鳞甲未能浴，衣不离身成脆破。      朽缯坏絮为渊薮，如麦如麻浸肥大。      虚肠不免须侵人，肯不夷齐甘死饿。      醯酸蜹聚理固然，尔辈披壤我当坐。      但思努力自洁清，群虱皆当远逋播。更新：关于评论区里说的那个吃鱼饵的梗，是这样的：宋仁宗宴请百官，邀请大家钓鱼，结果发现鱼饵不见了，后来才发现是被王安石吃完了。宋仁宗心想：误食几粒尚有可能，吃完一盘就有作秀之嫌了。于是他就认为王安石是在作秀。（宋仁宗：好感度-1）孰不知王安石平日在家吃饭时，永远只吃眼前那盘，哪怕换一盘菜也毫无反应，经常是边吃饭边读书，虽然这跟近视可能也有一定关系……不过拗相公的味觉确实令人着急啊。发现评论区有人提到过了，于是再补一个：王安石儿媳妇的亲戚有个姓萧的公子，王安石做宰相的时候，有一天，萧公子到访。王安石设宴款待。菜单是这样的：几个馅饼，几块猪肉（不准提清真梗），一小壶酒。萧公子心想：好歹也是宰相，就这么打发人？但碍于面子，还是把馅饼的肉馅吃了。王安石见状，便把馅饼剩下的皮吃了。萧公子：mdzz……", "answer_votes": "258", "answer_comment": "​64 条评论"}
{"answer_author": "知乎用户", "answer_id": 92524415, "answer_text": "世说新语里全都是梗啊，挑几个好玩的说说吧。1.西晋的王戎，抠门得要死，家里有棵李树，长的李子特别好，于是就拿出去卖，但为了防止别人吃了李子之后把李子核留下来自己种，于是就把每颗李子的核都给钻透了才卖……2.还是王戎，他老婆跟他特别恩爱，每回一见他都“卿、卿”的叫，可在当时“卿”是只有上级对下级、长辈对晚辈才能这么喊，王戎就抗议说：“自己老婆管我叫卿，这在礼法上是不敬的，以后不许这样了！”可他老婆却反驳道：”我亲爱卿喜欢卿，所以才称卿为卿，我不管卿叫卿，卿想让谁叫卿卿？！“——没错，后世的卿卿我我这就是出处。3.还还是王戎，这是他小时候的事情，那时候他还是一只机智的少年。有天，他跟着一群小伙伴出去玩，看见路边的李树挂了很多果子，把树枝都压弯了，小孩儿们见了馋的不行，全都争先恐后跑去摘李子，只有王戎站着不动。别人问他为啥不也去摘，只见他回答说：”树长在路边，还有这么多李子，这一定是苦的李子。“拿过李子来一尝，果真是苦的。——我总觉得王戎知道这是苦的，其实是因为他把甜的早就都摘走了吧，第一条里他家的甜李树没准就是偷得人家这棵树的种子呢（脑洞好大= =4.割席断交的故事大家都知道吧，管宁和华歆俩人一起在园中锄菜，看到地上有片金子，管宁依旧挥锄，视之如同瓦石一样，华歆却拣起来给扔了。俩人还曾坐在一张席上读书，有人乘华车经过门前，管宁读书如故，华歆却丢下书，出去观望。管宁就把席子割开，和华歆分席而坐，并对华歆说：“ 你已经不是我的朋友了。”——后来，华歆在飞黄腾达以后，曾经数次举荐管宁，甚至愿意自己退休让管宁接替自己的位置，可惜管宁就是死活不肯来，这俩人真是……5.虽然三国演义里华歆被黑成了非洲人，但就他早期经历来看，他其实是挺正直的一人，比如世说里记载过这样一事：华歆和王朗一起乘船避难，有一个人想搭乘他们的船，华歆很为难。王朗却说：\" 幸好船还宽敞，有什么可为难的。\" 一会儿贼寇要追上来了，王朗想丢下刚才搭船的人。华歆说：\" 刚才我所以犹豫，正是这个原因。既然已经接纳了他来船上托身，哪里能因为情况危急就丢下他呢。\" 于是就继续带着他赶路。——要么直接拒绝，要么答应了人家就生死与共绝不半路相弃，哪个奸臣能有这一诺千金的气概。6.一个寒冷的雪天，谢太傅把家人聚会在一起，跟子侄辈的人谈诗论文。忽然间，雪下得紧了，太傅高兴地问：“白雪纷纷何所似?”他哥哥的长子胡儿说：“撒盐空中差可拟。”他哥哥的女儿道韫说：“未若柳絮因风起”太傅高兴得笑了起来。——很著名的故事，红楼梦里关于宝姐姐和林妹妹的判词中”可叹停机德,堪怜咏絮才。“中的咏絮才就是从这来的。7.王子猷，居住在山阴，一次夜里大雪纷飞，他一觉醒来，打开窗户，命令仆人上酒，四处望去，一片洁白银亮，不觉心生悲凉，一面饮酒，一面吟诵起左思的《招隐诗》。喝着喝着忽然间想到了戴逵。当时戴逵远在曹娥江上游的剡县，即刻连夜乘小船前往。经过一夜才到，到了戴逵家门前却又转身返回。有人问他为何这样，王子猷说：“我本来是乘着兴致前往，兴致没了自然就回来了，何必一定要见戴逵呢？”——我觉得划船的那人一定恨死他了。8.说几个唐朝的事，娄师德，曾担任过宰相，也当过武将。有次，他的弟弟被任命为代州刺史，临行之时，娄师德问道：“我是宰相，你也担任州牧，\n我们家太过荣宠，会招人嫉妒，应该怎样才能保全性命呢？”弟弟道：“今后即使有人吐我一脸口水，我也不敢还嘴，把口水擦去就是了，绝不让你担心。”娄师德\n道：“这恰恰是我最担心的。人家朝你脸上吐口水，是对你发怒。你把口水擦了，说明你不满，会使人家更加发怒。你应该笑着接受，让唾沫不擦自干。”——那要是那人有口臭呢，还不让擦，您弟弟当时不得死那啊……9.还是娄师德，武则天时期曾颁布禁屠令，禁止屠宰禽畜。当时娄师德担任御史大夫，到陕西公干，吃饭时厨子送上一盘羊肉。娄师德道：“皇帝严禁屠杀，怎么会有羊肉？”厨子道：“这只羊是豺咬死的。”娄师德笑道：“这只豺太懂事了。”于是吃了羊肉。厨子又端上一盘鱼脍，娄师德又问。厨子又道：“这只鱼是豺咬死的。”娄师德斥骂道：“你这个蠢货，豺怎么能咬死鱼呢，你应该说是水獭咬死的。——堂堂御史大夫得从豺和水獭嘴里夺食，也是够不容易的（斜眼10.淮南有个人叫卢婴，无论是气质还是文采，都是郡中一绝，人们都亲切地称他叫卢三郎。可三郎就有一点不好，运气太差，总倒霉，而且倒霉不是倒霉在自己身上，而是周围人的身上。他如果上谁家去，那主人家不是小孩掉井里了，就是被火烧了烫了，百试百灵。人们都有点嫌弃他。那时元载为郡守，听说卢婴很有才气，就特地设宴请他来，好多宾客也都来了。大家吃完饭以后，元载就故意问左右说：”小孩没掉井里吧？“曰：”否。“又问：”也没被火烧了烫了的吧？“曰：”否。“元载很高兴地说：”还是我厉害吧，你们出事那是因为你们镇不住他！“之后又接着开始喝酒，客人们你看看我，我看看你，心里终究不放心。结果这天还没过去呢，元载的宅子就被军吏们抄了，元载本人被弃市。但还是有人不信邪，当时的节度使陈少游觉着这卢婴实在是太神奇了，又看他无论才华还是相貌都特别好，就推荐他上都城长安去试一试，卢婴受了金帛，就开始向长安出发，结果刚到潼关，就望见向长安方向的路上烟尘滚滚，往东边逃的人们告诉他说：”朱泚造反了，皇帝已经跑去奉天县了！“", "answer_votes": "463", "answer_comment": "​80 条评论"}
{"answer_author": "梁豆子", "answer_id": 92588006, "answer_text": "杜牧！杜牧！杜牧！写了四个小时的干货贴~鞠躬谢邀，一不小心又是个长答案。古代文人的梗太多啦，基本上每个诗人身上都有过这样或者那样的奇闻异事。不过刚才翻答案的时候看到有朋友写到杜牧，脑袋里就浮现了很多以前听说的关于杜牧的风流韵事。关于杜牧的梗真的太多了，他的很多诗句几乎可以称得上是“一句诗即是一段风流”，忍不住想要扒一扒。嘿嘿，客官们都坐好了，且容我慢慢道来。诗句一：“十年一觉扬州梦，赢得青楼薄幸名。”牛僧孺任淮南节度使，大约在唐文宗大和七年（833年），请杜牧去做书记官。淮南节度使治所在扬州。扬州那时是个商业繁华、妓女如云的大都市。杜牧在牛僧孺幕府下，白天办公，晚上便出去狎妓饮宴。牛僧孺为了确保杜牧的安全，便派了一些士兵暗中保护他。\n大和九年（835年），杜牧被任命为监察御史去洛阳。临行前，牛僧孺设宴为其送行。席间，牛僧孺说：“老夫佩服你的才华，日后前途无量，只是老夫担心你喜欢花街柳巷，要注意不要伤及身体才是。”杜牧婉言拒认（当然打死也不能承认啦）。 牛僧孺闻言大笑，命人取来一只木匣子，交给杜牧。杜牧打开一看，都是牛僧孺部下士兵的报告，一条条写着：“某月某日，杜书记在某处宴饮。”“某月某夜，杜书记在某青楼过夜。”等等。杜牧一看，大为羞愧，也深深感激牛僧孺的宽容大度。再后来杜牧离开扬州时，写了如下三首诗。前两首是赠给他所眷恋的伎女的离别诗，如下：《赠别二首》其一 娉娉袅袅十三余，豆蔻梢头二月初。 春风十里扬州路，卷上珠帘总不如。 《赠别二首》其二 多情却似总无情，唯觉樽前笑不成。 蜡烛有心还惜别，替人垂泪到天明。最后一首诗是他对扬州这一段浪漫生活的总结，也算是忏悔书： 《遣怀》 落魄江南载酒行，楚腰肠断掌中轻。 十年一觉扬州梦，赢得青楼薄幸名。 （典故出自《唐才子传》）诗句二：“骰子逡巡裹手拈，无因得见玉纤纤。”据《唐摭言·卷十三》记载，杜牧和当时的著名诗人张祜极为要好。有一次，“张祜客淮南，幕中赴宴，杜紫薇（杜牧）为支使”，而当时两人都爱恋座中一位漂亮的歌妓，于是决定索取骰子用赌输赢的方式来决定谁有权去继续爱恋。杜牧当下遂开始悠然吟道：“骰子逡巡裹手拈，无因得见玉纤纤。”张祜一听，也不甘示弱地接口续吟着：“但须报道金钗落，仿佛还因露指尖。”语音刚落，两人就不觉大笑着，反而把原本赌酒取妓的事儿给忘了。诗句三：“自是寻春去校迟，不须惆怅怨芳时。”杜牧在宣州幕下任书记时，听说湖州美女如云，便去那里寻找美女，湖州刺史崔君素为他召集本州所有名妓，但杜牧都没有选上，略带遗憾道：“美是很美啊！但还不够尽善尽美。”于是，杜牧要求在江边举行一次竞渡的娱乐活动，让全湖州的人都来看，他也好趁机挑选。活动当天，杜牧从早至晚，都没有选中一个。眼看就要收船靠岸，不抱希望的杜牧却发现一绝色天仙，“目成一女子，方十余岁”。杜牧与女孩的母亲“约十年后吾来典郡，当纳之，结以金币”。然而，杜牧直到41岁才当上湖州刺史，比当年的约定晚了四年，“洎周墀入相，牧上笺乞守湖州，比至，已十四年”。杜牧才得知，当年的女孩已经出嫁三年，“前女子从人，两抱雏矣”。为此，杜牧伤心欲绝，写下这样一首诗，名曰《叹花》（又名《怅诗》）： 自是寻春去校迟，不须惆怅怨芳时。狂风落尽深红色，绿叶成阴子满枝。（此典故出自于《唐语林》，其真实性尚有争议。）诗句四：“忽发狂言惊满座，两行红粉一时回。”大和九年（835年），三十三岁的杜牧由扬州赴长安任监察御史，主要负责洛阳一带。那时的洛阳也是一个繁华之地，娱乐业并不比扬州差多少。杜牧仍然改不了风流的本性，闲暇之余经常出入青楼歌馆，乐在其中。而那时恰有个叫李愿的官员，退休后在洛阳闲居，经常在家中举办酒会，遍邀城中名流，但每次都不敢给杜牧发请帖。因为杜牧是监察御史，就是负责监督官员生活和工作作风的，哪里敢上门找死。可是杜牧不乐意了，他也不是不知道李愿的顾忌，但是生性如此，如此繁华热闹场所怎能少了他的身影。他暗地里让人捎信给李愿，表达了自己想参加宴会的愿望。李愿一看，人家监察御史主动要求，哪里敢抗命，只得给杜牧送了请帖。席间，名妓如云，歌舞升平。杜牧单独坐在南边一排，瞪眼注视，三杯之后问李愿：“听说有个叫紫云的姑娘，是哪位?”李愿指给他看。中间的一个，正身披薄纱翩翩起舞，面如英蓉，婀娜多姿，果然是妖冶美俏。杜牧目不转睛地注视了很久，道：“李公，此女果真名不虚传，把她送给我吧。”此言一出，举座皆惊，李愿大为尴尬，连席间的歌伎们都抿嘴轻笑起来。杜牧自觉失言，赶紧即兴吟诗一首，略作遮掩。诗名曰《兵部尚书席上作》： 华堂今日绮筵开，谁唤分司御史来。 忽发狂言惊满座，两行红粉一时回。以上这首诗颇有几分自我调侃之意，倒是化解了现场的尴尬气氛。众人皆夸杜牧出口成章，才华过人，纷纷向他敬酒。宴会结束后，李愿又不想得罪这位御史大人，干脆顺水推舟，把紫云真的送给了杜牧。能够抱得美人归，得偿所愿，杜牧自是感激不尽。然而，紫云姑娘是个性情中人，感恩于李愿的宠爱，心中不大愿意离开李府，却又无可奈何，在临行前作一首《临行献李尚书》：从来学制斐然诗，不料霜台御史知。 忽见便教随命去，恋恩肠断出门时。诗中夹杂的无奈与幸酸，明人自知。诗句五：“洛城重相见，婥婥为当垆。怪我苦何事，少年垂白须。” 以上的这个诗句背后隐藏了一个凄婉而悲伤的爱情故事，所以特意放到最后来说。可以说，杜牧后来会有那么多风流韵事，与我接下来要提到的女子息息相关，且容我慢慢道来。故事之初发生在公元829年，沈传师到江西当观察使，杜牧在他手下做团练巡官，这个职位属于军事幕僚，没有多少实权。那时候的杜牧属于初入官场，官职低，胆子小，对于男女之事，起初并不是很放得开。团练巡官的官位虽不高，可杜牧运气却很不错。在工作中，他遇到了一个好上司，这就是江西团练副使卢弘止。卢弘止赏识杜牧，经常帮他分担工作，让杜牧有更多时间参加宴饮之类的交际活动。在迎来送往的公务接待活动中，杜牧认识了沈传师幕府中的官妓张好好（女主角第一次出场）。在唐代，观察使、节度使或者刺史的治所，都有一定数量的官妓，为官员们表演歌舞，以丰富他们的业余生活。张好好当时只有十三岁，色艺双绝，杜牧和她关系很不错，两人经常见面，杜牧曾借《赠沈学士张歌人诗》抒发对张好好的倾慕，诗里描写她唱歌，“断时轻裂玉，收处远缲烟”。张好好长相如何，杜牧在后来写的《张好好诗》中即有描述，说她“翠茁凤生尾，丹叶莲含跗”，像一只羽毛刚刚丰满的彩凤，一朵含苞欲放的莲花。除了倾国倾城的长相，张好好最为人称道的还是她的歌声，据说每当她开唱总能惊动四座，她的声音就像雏凤长鸣，压倒了席上伴奏的管弦。这按照现在的说法，张好好应该是一个气质绝佳的优秀女高音歌手。“主人再三叹，谓言天下殊”，上司沈传师再三赞叹，认为她的好嗓子天下少有。而杜牧自己呢，也曾在座下坦言“自此每相见，三日已为疏”。毋庸置疑，那时他已经喜欢上了张好好，但不好意思向沈传师张口。张好好对杜牧也有好感，眉目传情当然是有。但是有没有时间单独相处，两人关系究竟发展到了什么样的地步，我们就不知道了，反正杜牧在《张好好诗》里守口如瓶。郎才女貌，又互相有情，理论上如果中间没有人横插一杠子，杜牧与张好好就有故事了。只可惜迟了一步。上司沈传师有个弟弟叫沈述师，也看上了张好好，想纳她为妾。弟弟向哥哥一说，哥哥立马应允。沈传师当时的地位相当于现在的省委书记，人家的弟弟对张好好动了心思，杜牧胳膊扭不过大腿，只好靠边站。其实论家世门第，沈述师的条件也算不错，有哥哥做靠山，并且也是个雅好诗文的文化人。李贺去世后，他曾为李贺编了一个集子，叫《李贺集》，还请杜牧为诗集作过序呢。所以，沈述师与杜牧是朋友，是老熟人。从这一点来说，杜牧也不好意思和他竞争。然而对于张好好而言，其实她早已把杜牧当作知音，可她作为沈传师家中的一名家妓，根本无力掌控自己的命运，杜牧亦官位低微，两人只好认落花流水空余恨，就此相互别过。张好好在出嫁前曾写了一首诗，诗云：“孤灯残月伴闲愁，几度凄然几度秋。哪得哀情酬旧约，从今而后谢风流。”从诗中不难看出，张好好和杜牧可能是有“旧约”的，两人的关系非同一般。不能嫁给杜牧，她的心也死了，再也没有了风花雪月的兴致。杜牧原以为，张好好做了沈述师的小妾，从此就能过上比较幸福的生活，他和张好好也可从此彻底别过。奈何天命无常，几年之后，沈述师病逝，张好好被沈家人赶出来，几经辗转，最终流落到洛阳东城的一个酒家当垆卖酒。而那时的杜牧正好在洛阳，也不知是不是缘分使然，两人最终在洛阳东城再次相见。 杜牧从不曾想过，自己和昔日情人会在这种情况下相见；他更不曾想到，那个往日朝思暮想出类拔萃的丽人，现在是这样一副落魄模样。时过境迁，早已物是人非，杜牧“感旧伤怀”，题诗一首赠予张好好，名曰《张好好诗》。诗内容如下：《张好好诗（并序）》牧大和三年，佐故吏部沈公江西幕，好好年十三，始以善歌来乐籍中。后一岁，公移镇宣城，复置好好于宣城籍中后二岁，为沈著作以双鬟纳之。后二岁，于洛阳东城重睹好好，感旧伤怀，故题诗赠之。 君为豫章姝，十三才有余。 翠茁凤生尾，丹脸莲含跗。高阁倚天半，晴江联碧虚。 此地试君唱，特使华筵铺。主公顾四座，始讶来踟蹰。吴娃起引赞，低回映长裾。双鬟可高下，才过青罗襦。 盼盼乍垂袖，一声离凤呼。繁弦迸关纽，塞管裂圆芦。 众音不能逐，袅袅穿云衢。 主公再三叹，谓言天下殊。 赠之天马锦，副以水犀梳。 龙沙看秋浪，明月游东湖。 自此每相见，三日已为疏。 玉质随月满，艳态逐春舒。 绛唇渐轻巧，云步转虚徐。 旌旆忽东下，笙歌随舳舻。 霜凋谢楼树，沙暖句溪蒲。 身外任尘土，樽前且欢娱。 飘然集仙客，讽赋欺相如。 聘之碧瑶佩，载以紫云车。 洞闭水声远，月高蟾影孤。 尔来未几岁，散尽高阳徒。 洛城重相见，婥婥为当垆。 怪我苦何事，少年垂白须。 朋游今在否，落拓更能无？ 门馆恸哭后，水云愁景初。 斜日挂衰柳，凉风生座隅。 洒尽满襟泪，短歌聊一书。从以上的诗中我们不难看出，杜牧为张好好飘零的身世伤感不已，张好好却“怪我苦何事，少年垂白须”。\n她怜爱地问诗人这些年忙什么，怎么年纪轻轻就有了好些白头发。当杜牧再遇到张好好时，已没有了爱情，只有种怜惜与同情，但大概是因为杜牧是张好好爱上的第一个男人，使她对他的感情依旧。然而两人已经再也回不去了。这么多年来，杜牧与张好好的爱情故事也许早已告一段落，但是当年杜牧赠予张好好的《张好好诗帖》原作却有幸流传了下来。这也是唐代诗人、书法家杜牧的仅存墨迹，也是稀见的唐代名人书法作品之一。该卷书用麻纸，制作相当精细。书用硬笔，笔法劲健，颇多叉笔。这些都是唐代书法的用纸、笔法的特点。《宣和书谱》一书评杜牧书法：“气格雄健，与文章相表里”，是说作者诗文、书法有统一的风格。卷前有宋徽宗赵佶书签“唐杜牧张好好诗”，并钤有宋徽宗的诸玺印，保存着当时内府装潢式样。兹后曾递藏于宋贾似道、明项元汴、张孝思、清梁清标等人，乾隆年间入藏内府。据《式古堂书画记考·卷七》所记，该卷后元人诸跋，是从唐赵模《千字文》后移来。《宣和书谱》、《悦生所藏书画别录》、《平生壮观》、《大观录》、《吴越所见书画录》、《石渠宝笈·初编》等书著录。该卷曾被清逊帝溥仪携出宫外，流散民间后归张伯驹所有。1956年张伯驹先生将其捐赠政府，此珍贵文物重为故宫博物院收藏。<img src=\"https://pic3.zhimg.com/50/7d03d5e7cc2f6c04c3ceb7ee40432373_hd.jpg\" data-rawwidth=\"719\" data-rawheight=\"950\" class=\"origin_image zh-lightbox-thumb\" width=\"719\" data-original=\"https://pic3.zhimg.com/7d03d5e7cc2f6c04c3ceb7ee40432373_r.jpg\">最后再说一些话—— 扒了杜牧这么多风流往事，可能给很多知友以误导：大诗人杜牧原来不过只是一个纵情声色的浪子。 如果以上文字给大家造成了这样的错觉，我在这里要为此道歉，以上文字只是针对“古代文人有哪些梗”这个问题的回答，而不针对诗人杜牧本身。 在我看来，杜牧之所以选择这种声色犬马的生活方式，其实也是一种迫于时局的无奈之举。 除了出众的诗歌创作天赋，其实杜牧还有出众的政治才华，他专门研究过《孙子》，写过十三篇《孙子》注解，也写过许多策论咨文，其中的名作《阿房宫赋》流传至今。深厚的史学见解，使得他能够在历史的烟尘深处，俯看端倪，指陈得失。 杜牧和陈子昂、李白一样，期望在时代的大潮中能够有用武之地，也曾上书给有关权要，坦陈自己对“治乱兴亡之迹，财赋甲兵之事，地形险易远近，古人长短得失”颇有研究。其中最令他得意的是，有一次献计平虏，终于被朝廷采用，并且大获成功。 可惜杜牧有相才，而无相器，又生不逢时。在江河日下的晚唐，盛唐气息已一去不返。诸帝才庸，唐敬宗、唐武宗、唐宣宗相继服食所谓仙丹妙药而亡；边事不断，“房谋杜断”式的智囊决策人业已成为凌烟阁上的寂寞画像；宦官专权，党争延续，“文官不爱钱，武将不惜死”的太平基石早已分崩离析，一系列的内忧外患如蚁穴溃堤，帝国之舟外渗内漏。 怀才不遇的杜牧无法力挽狂澜，只能无奈地将一腔抱负交于酒肆。或许对于杜牧而言，饮酒和风流，早已成了他疗伤祛痛的乐事，而风流本身，也成了杜牧逃避现实纷争的一种手段。 唉，难怪李国文先生曾说：“文人要不风流，要不浪漫，想成为大文人，也难。”公元853年，杜牧逝世，享年五十岁。 杜牧临死之时，一知大限将至，自撰墓志铭。平心而论，这篇短文写得却是平实无奇，丝毫不显文豪手笔。 据《新唐书》载，墓志铭写就，杜牧闭门在家，搜罗生前文章，对火焚之，仅吩咐留下其中的十之二三。 或许，在外人看来，杜牧一生，俊赏豪健，而在他强作笑颜、把酒尽余欢的背后，却是不欲示人的悲凉吧。", "answer_votes": "217", "answer_comment": "​19 条评论"}
{"answer_author": "捏捏狗脸", "answer_id": 92502006, "answer_text": "庾太尉与苏峻战，败，率左右十馀人乘小船西奔。乱兵相剥掠，射，误中舵工，应弦而倒，举船上咸失色分散。亮不动容，徐曰：“此手那可使著贼！”众乃安。 舵工：…有人关心一下我吗？潘岳妙有姿容，好神情。少时挟弹出洛阳道，妇人遇者，莫不连手共萦之。左太冲绝丑，亦复效岳游遨，于是群妪齐共乱唾之，委顿而返。长得丑的人感到世界深深的恶意…", "answer_votes": "15", "answer_comment": "​8 条评论"}
{"answer_author": "我有一个仙女棒", "answer_id": 92445748, "answer_text": "杜甫作品：《赠李白》《冬日有怀李白》《春日忆李白》《梦李白两首》《天末怀李白》李白作品：《赠孟浩然》：\n吾爱孟夫子 ，风流天下闻。杜甫：\"我可以哭吗？\"", "answer_votes": "209", "answer_comment": "​50 条评论"}
{"answer_author": "四月黄花似阳光", "answer_id": 92742211, "answer_text": "我高中的时候有学到中国以狂草出名的有两个人，一个是怀素一个是张旭，当我看到张旭最出名的作品《肚痛帖》的时候差点笑岔气，不说什么了上图让你们感受下。&lt;img src=\"https://pic2.zhimg.com/50/ee0cae6ccd953e9400cf323ea41b917c_hd.jpg\" data-rawwidth=\"984\" data-rawheight=\"851\" class=\"origin_image zh-lightbox-thumb\" width=\"984\" data-original=\"https://pic2.zhimg.com/ee0cae6ccd953e9400cf323ea41b917c_r.jpg\"&gt;&lt;img src=\"https://pic3.zhimg.com/50/2d05e77cb368f4e9ee1b7ba0f5d63116_hd.jpg\" data-rawwidth=\"720\" data-rawheight=\"539\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic3.zhimg.com/2d05e77cb368f4e9ee1b7ba0f5d63116_r.jpg\"&gt;哇，前面这几个字写得还算正常，后面就完全看不懂他在写什么了，这个就是明摆这几天肚子不舒服，在自诊写字的时候突然拉肚子想上厕所但是又没写完就赶紧哗哗两下搞定去茅厕的情景嘛，不说了我有画面了哈哈哈哈哈哈&lt;img src=\"https://pic2.zhimg.com/50/ee0cae6ccd953e9400cf323ea41b917c_hd.jpg\" data-rawwidth=\"984\" data-rawheight=\"851\" class=\"origin_image zh-lightbox-thumb\" width=\"984\" data-original=\"https://pic2.zhimg.com/ee0cae6ccd953e9400cf323ea41b917c_r.jpg\"&gt;", "answer_votes": "56", "answer_comment": "​15 条评论"}
{"answer_author": "臧一词", "answer_id": 92471563, "answer_text": "说几个和文人好色有关的。(1)宋玉与登徒子的色鬼之争战国时楚国有个叫登徒子的家伙，在楚王面前说宋玉坏话，说宋玉这小子是个大色鬼，长得又帅口才又好，可不能让宋玉进大王您的后宫啊，要不然肯定得绿。楚王一听这还得了⊙▽⊙就问宋玉，有这茬么？→_→宋玉说，我长得帅是爹妈遗传的，口才好是老师教的，怪我咯？⊙﹏⊙楚王说，不要避重就轻，好色呢？！你到底是不是色鬼！(╯‵□′)╯︵┻━┻宋玉说，卧槽登徒子才是色鬼啊，她媳妇丑的跟什么似的，蓬头垢面，翻嘴龅牙，弯腰驼背还是个瘸子，这种女人他登徒子都下的去手/口/diao，日夜奋战生了五个孩子，大王您想这孙子口味得多重。还有，不是我跟大王您吹，我的邻家小妹，哦不，我隔壁家的姑娘，嚯，美得跟什么似的，太完美了，整容都没地方下刀，多一分太多少一分太少，简直黄金比例。就这么天仙似的姑娘，爬墙头偷窥我三年我都没理她，您说我好色吗？楚王一听，这么漂亮的姑娘你都不动心思，你肯定是个gay，又这么帅，肯定是受，口活儿…哦…口才又好，得了你留下吧，嘿嘿嘿(大雾…… 这段我瞎编的……后来登徒子就成了色鬼的代名词。这个故事告诉我们，男人喜欢漂亮姑娘——很正常，男人连丑姑娘都喜欢——口味重，男人连漂亮姑娘都不喜欢——你是g…gao…高洁之士。(2)老牛吃嫩草的张先张先是宋朝挺厉害的词人，跟苏轼是忘年交。张先好色是出了名的，而且老当益壮，八十岁的时候娶了个十八岁的小老婆。请苏轼来喝喜酒，苏轼送了老小两口一首诗。十八新娘八十郎，苍苍白发对红妆。鸳鸯被里成双夜，一树梨花压海棠。其中“一树梨花压海棠”是名句，什么意思呢，梨花是白的，代指白头发的张老爷子。海棠的红的，代指粉嫩的小姑娘。私以为这个“压”字用的妙，信息量巨大。张老爷子八十岁了还能男上位，说明老爷子身体好。至于苏轼为什么知道张先身体好……(大雾……我什么都没说(3)一日不日浑身难受的纪晓岚纪晓岚好色也是出了名的。修四库全书的时候，大家基本上都住在四库管。纪晓岚第一天去的时候，到了晚上两眼通红，浑身难受，燥热难当。于是纪晓岚是四库管里唯一一个带女眷入住的人，以便随时清热消火。", "answer_votes": "86", "answer_comment": "​11 条评论"}
{"answer_author": "王奕鑫", "answer_id": 92443956, "answer_text": "莫名想到这个天涯上的帖子。。。。。。图源：微博@我的极品评论  本答案已涉及人物：屈原、三曹、王维、孟浩然、王昌龄、李白（主角）、杜甫、柳宗元、白居易（主角）、李商隐、贾岛、孟郊、李煜、柳永、王安石、司马光、李清照、三苏、辛弃疾&lt;img data-rawwidth=\"640\" data-rawheight=\"1152\" src=\"https://pic3.zhimg.com/50/e9f1fa749cf334883421542832b07e29_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"640\" data-original=\"https://pic3.zhimg.com/e9f1fa749cf334883421542832b07e29_r.jpg\"&gt;&lt;img data-rawwidth=\"1050\" data-rawheight=\"1600\" src=\"https://pic2.zhimg.com/50/3e122a56f7c154053d5abde4da60a648_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"1050\" data-original=\"https://pic2.zhimg.com/3e122a56f7c154053d5abde4da60a648_r.jpg\"&gt;&lt;img data-rawwidth=\"1078\" data-rawheight=\"1600\" src=\"https://pic1.zhimg.com/50/e577528ee0a00f385297229bbae91bbc_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"1078\" data-original=\"https://pic1.zhimg.com/e577528ee0a00f385297229bbae91bbc_r.jpg\"&gt;&lt;img data-rawwidth=\"480\" data-rawheight=\"726\" src=\"https://pic4.zhimg.com/50/9217b4152bf0075e73e001681af13d6e_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"480\" data-original=\"https://pic4.zhimg.com/9217b4152bf0075e73e001681af13d6e_r.jpg\"&gt;&lt;img data-rawwidth=\"1096\" data-rawheight=\"1600\" src=\"https://pic3.zhimg.com/50/475992f69d9f93271601912ad15a0b0a_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"1096\" data-original=\"https://pic3.zhimg.com/475992f69d9f93271601912ad15a0b0a_r.jpg\"&gt;&lt;img data-rawwidth=\"640\" data-rawheight=\"1354\" src=\"https://pic3.zhimg.com/50/ca1c511db7f0dd1a2af583eb4f33634e_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"640\" data-original=\"https://pic3.zhimg.com/ca1c511db7f0dd1a2af583eb4f33634e_r.jpg\"&gt;&lt;img data-rawwidth=\"550\" data-rawheight=\"1600\" src=\"https://pic2.zhimg.com/50/0290fc67a859e0207348469c0559c704_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"550\" data-original=\"https://pic2.zhimg.com/0290fc67a859e0207348469c0559c704_r.jpg\"&gt;&lt;img data-rawwidth=\"480\" data-rawheight=\"747\" src=\"https://pic4.zhimg.com/50/9eef3b914d06834cd57e4f1eeabe23bc_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"480\" data-original=\"https://pic4.zhimg.com/9eef3b914d06834cd57e4f1eeabe23bc_r.jpg\"&gt;&lt;img data-rawwidth=\"899\" data-rawheight=\"1600\" src=\"https://pic3.zhimg.com/50/2b2ee63219e38dcfb1d79d9ae0647f46_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"899\" data-original=\"https://pic3.zhimg.com/2b2ee63219e38dcfb1d79d9ae0647f46_r.jpg\"&gt;知乎发图抽了，答主强迫症编辑了好几次。看到的将就看吧开心就好。————————————————3月27日   分割线——————————评论区要的原帖链接   呵呵隔壁贴那个踩李白的，你家白居易宇宙最强好了吗，如此拉踩也是醉醉哒这是模仿明星饭圈撕逼闹着玩儿的，注意是模仿，模仿，模仿= =！帖子很长答主挑几段图上没截的发出来，文人间说不尽的爱恨情仇（手动滑稽表情）作者：道友君\t\t\t\t\t\t时间：2015-06-24 23:35:34\t\t\t\t\t\t\t　　你家李白爱豆仗着自己长于碎叶城还真把自己当个混血小鲜肉，拽得不要不要的，就因为元稹扒皮你家爱豆是山东国产货，一堆黑酸挑都气得跳脚2333我是路人，你可以翻我回帖，我就是看不过去你们这么黑一个踩一个　噗，说起来你家大大一边还喊着一帮职粉成天刷存在，草热度，微博营销号转发，回回打开今日大唐热搜榜都有你们，边塞诗有你们，闺阁诗有你们，怀古诗还特么有你们！连去旅个游，找朋友吃个饭都恨不得发长微博！一边又白莲花似的皇上~皇上咱们不约~我就呵呵了。要说拉郎配，扯皮cp，难道不是你家扯得最欢吗！萌浩然都有cp了好嘛，当人家是王右丞是死的啊(人家水表圈都不稀罕和你唱和),拼不过人家温润如玉朝堂宠腻攻，就暗搓搓得写什么吾爱孟夫子，唯有敬亭山，被指出来就你们想多了。也是醉了。不就是抱大腿，遛你们这帮萝莉粉玩，你们傻啊?结果呢人家王萌隔天就被拍到同住一屋，还躲床底。怎么样？打脸了吧，papapa　　劝你家大大别那么绿茶，明里一幅对粉丝好得不的了的样子，粉丝去机场送一下都巴巴地写一首赠汪伦，果然是大唐一哥，暖男担当，转身就问杜甫你是谁?我们见过吗?那一夜跟我醉眠秋共被的是你吗？路人都看不下去了，渣男！不就是看对家粉好欺负嘛！作者：道友君\t\t\t\t\t\t时间：2015-06-24 23:43:27　　三李就了不起吗！拉着杜甫凑个李杜cp还不够，转身还拉着李商隐个小鲜肉炒，俩人年份差好几倍，粉也好意思！一会才压这个一会才压这个，去皇宫里蹭个毯还被赶出来了2333也就是有个好cp帮他写了句天子呼来不上船才保住脸面！现在的粉还敢来压三苏了！我就呵呵了       小呆逗逗飞    2015-06-24 23:40:44　　李白他醉驾你们知道吗？作者：上杉家的达也\t\t\t\t\t\t时间：2015-06-25 00:11:24\t\t\t\t\t\t\t　　呵呵，一群傻逼，脑残粉何弃疗，几个会写几句非主流打油诗的小鱼也就特么在网络上有点存在感了。唉，怀念当年三曹、屈原那些巨星不炒作不水军实打实靠作品说话的黄金年代啊。小呆逗逗飞 2015-06-25 00:18:25　　就我一个人觉得汨罗江小公举矫情的要死吗？还那么自恋，所有人都嫉妒你的美貌，长篇大论夸自己也是够够的，作　　-----------------------------　　就三曹那乱臣贼子，父子都去当三抢人妻的，还想洗白，当路人不知道你家那老底呢，脑残粉的三观也是醉作者：王失聪\t\t\t\t\t\t时间：2015-06-25 01:22:01\t\t\t\t\t\t\t　　李白嘴上一副不在乎功名利禄的样子，其实内心特别想红。作者：周郎曾顾\t\t\t\t\t\t时间：2015-06-25 01:22:06爹爹的小精灵 2015-06-25 01:19:50小呆逗逗飞    2015-06-25 01:18:56.0　　我家白居易写个诗都得看老太太能不能听懂，几个能做到　　—————————————　　我家柳永笑而不语　　-----------------------------　　简直了，词圈的都来找存在感也是呵呵，什么事都能进来插一脚以此来帮你们家提升存在感，有这空麻烦告诉你家那位回去磨练磨练诗技再来我们这说话行吗，词圈凑什么热闹爹爹的小精灵  332楼  2015-06-25 01:29:00掐架专用披肩2015-06-2501:27:14.0　　王昌龄粉公开支持大白！　　—————————————　　18线也想来蹭热搜？？？？？？？？？？？？？？？？？？　　—————————————————　　尼玛我家昌龄七绝圣手作品人品杠杠的，凭什么被你说成十八线？我家爱豆和大白关系这么好粉出来支持一下碍着你什么事了？凭什么人参公鸡？作者：掐架专用披肩\t\t\t\t\t\t时间：2015-06-25 01:56:30\t\t\t\t\t\t\t　　这你就孤陋寡闻了吧，我家龙标不仅心系边疆关心国家大事，“悔教夫婿觅封侯”还关心广大女性同胞的生活心理问题，这么一个三观正，正能量的优质诗人已经不多了！爹爹的小精灵 2015-06-25 02:09:59　　这个帖竟然没有王安石粉，果然他现在已经flop了吗　　-----------------------------　　嘘，人家水表圈的，可不敢随便扒作者：道友君\t\t\t\t\t\t时间：2015-06-25 02:32:12粉红娘娘i  421楼  2015-06-25 02:16:00　　楼上别急撕完唐朝才轮到王安石，你慌什么，官圈混不下去就跑去词圈艹人气的墙头草你以为黑点还少吗？呵呵哒　　—————————————————　　就是，着什么急，他和对家司马光那可是相爱相杀至死方休的虐恋cp作者：掐架专用披肩\t\t\t\t\t\t时间：2015-06-25 02:32:35爹爹的小精灵  426楼  2015-06-25 02:20:00掐架专用披肩2015-06-2502:15:09.0　　还有柳宗元粉，千山鸟飞绝，万径人踪灭。第一次听就印象深刻啊！　　—————————————　　还有杜牧的粉呢，孟郊粉呢？？？？？现在十八线都有粉丝，这俩上了语文课本的课本咖竟然没有粉？让我看到你们的双手！　　—————————————————　　杜牧人品渣纯自己作的粉都掉光了。孟郊没红的命啊诗红人不红拉着贾岛炒cp结果两人都开始走小众非主流观众不买账，上课本又咋的？作者：粉红娘娘i\t\t\t\t\t\t时间：2015-06-25 02:35:45        马甲de马甲是马甲 2015-06-25 02:34:21.0        王维粉看着你们对撕很清新我家idol低调惯了，黑粉不多，我跟着一起默默装逼就好～         —————————————        王维就是空山新雨后天气晚来秋那货吗？官二代谁敢撕啊我害怕 ^_^作者：morningborn\t\t\t\t\t\t时间：2015-06-25 04:16:32Asdfghjkl1232015 2015-06-24 23:21:30　　切，三苏捆绑炒作，买一赠二，字不够家属凑，还不是抱欧阳修大腿的货。还说别人水军，你才是水军。你家主子行贿你造么，“糖送八大家”，我们都懂得！　　-----------------------------　　你了解过苏轼吗，你知道他有多努力吗，以3000:1的比例被选拔去的翰林院，过着从黄州到惠州四川漂泊的生活，每天练习将近20小时，晚上还要学习古代的散文，连脚骨折了却浑然不知。　　再说了，楼上捧的那两个过气的文人，那什么和我们苏轼比？书法能和我家苏大大比吗?散文能和我家苏大大比吗？填词能和我家苏大大比吗？做菜有我们苏大大好吃吗？苏大大作为团队的核心人物，关心提携新人队员，苏门四学士都是他一手带红的，李白和白居易能比吗？　　楼上肯定是工作室雇来的水军，你家白居易早年出道时被顾况包养的事情都烂大街了，这地是洗不干净了。帖子太长了。。。。。有兴趣自己去看吧，如果答主有时间也有人想看的话再更", "answer_votes": "82", "answer_comment": "​31 条评论"}
{"answer_author": "黄粱", "answer_id": 92306471, "answer_text": "苏轼，中国历史上最有女人缘的男人。别的才子女人缘好，不外乎吸引的是才女，大多还是青楼女子。然而苏轼不仅能吸引才女，还吸引了三代皇后——仁宗曹皇后、英宗高皇后还有神宗向皇后都喜爱苏轼。仁宗曹皇后是公元1079年去世的，此年正赶上苏轼遭遇乌台诗案。此时病危的曹皇后仍然不忘苏轼的安危，对神宗说道：“我还记得仁宗皇帝制科后得到苏轼苏辙兄弟，高兴的说：我为子孙寻得宰相二人！如今我却听闻苏轼因诗入狱，这该不会是受了仇人的诬蔑吧？从诗句中搜寻过错，即使有错也是小错。我的病已经很重了，不能再因为冤枉好人、滥加罪名而伤害天地的中正和平之气。对苏轼一案，还要仔细审查才好。”神宗听完后哭泣不已，于是赦免了苏轼。苏轼以诗得罪，下御史狱，人以为必死。后违预中闻之，谓帝曰：“尝忆仁宗以制科得轼兄弟，喜曰：‘吾为子孙得两宰相。’今闻轼以作诗系狱，得非仇人中伤之乎？捃至于诗，其过微矣。吾疾势已笃，不可以冤滥致伤中和，宜熟察之。”帝涕泣，轼由此得免。——《宋史·卷二百四十二·慈圣光献曹皇后传》英宗高皇后在哲宗在位时期垂帘八年，其时当然她已经是太皇太后了，也就是之后的宣仁皇后。她在哲宗即位后便召苏轼为礼部郎中，第二年则升为翰林学士。故而太皇皇后在宫中对苏轼道：“你从前年的团练副使（寄禄官，无权）升到如今的翰林学士（三品），为什么如此之快？”苏轼言道是太皇太后和陛下的恩宠。太皇太后则说道这是神宗皇帝的意思，谈到神宗非常喜爱苏轼的文章，称为奇才，可惜来不及用而已。听完后，苏轼不觉哭得失声，而太皇太后和哲宗也跟着哭了起来，之后太皇太后赐座赐茶，并撤御前金莲烛送苏轼回翰林院。撤御前金莲烛，这种待遇，宋朝三百年享受此殊荣的不过六人而已，可见宣仁太皇太后对苏轼的喜爱了。轼尝锁宿禁中，召入对便殿。宣仁后问曰：“卿前年为何官？”曰：“臣为常州团练副使。”曰：“今为何官？”曰：“臣今待罪翰林学士。”曰：“何以遽至此？”曰：“遭遇太皇太后、皇帝陛下。”曰：“非也。”曰：“岂大臣论荐乎？”曰：“亦非也。”轼惊曰：“臣虽无状，不敢自他途以进。”曰：“此先帝意也。先帝每诵卿文章，必叹曰‘奇才！奇才！’但未及进用卿耳。”轼不觉哭失声。宣仁后与哲宗亦泣，左右皆感涕。已而命坐赐茶，撤御前金莲烛送归院。——《宋史·卷三百三十八·苏轼传》哲宗亲政后【务反前政，报复善良，驯致党籍祸兴，君子尽斥】，其驾崩后徽宗即位。徽宗让神宗向皇后一起处理国事，向皇后则下令召回之前被章惇斥逐的贤士，这自然也就包括了当时身在海南岛的苏轼。这也不难看出向皇后对苏轼等人的惋惜，苏轼为此还作了一首诗《儋耳》，诗中表达他得知召还后的喜悦之情，可惜不久他便在归途中病逝了。徽宗立，请权同处分军国事，后以长君辞。帝泣拜，移时乃听。凡绍圣、元符以还，惇所斥逐贤大夫士，稍稍收用之。——《宋史·卷二百四十三·钦圣献肃向皇后传》丁巳，诏范纯仁等复官、宫观，苏轼等徙内郡居住。——《宋史·卷十九·徽宗纪》霹雳收威暮雨开，独凭栏槛倚崔嵬。垂天雌霓云端下，快意雄风海上来。野老已歌丰岁语，除书欲放逐臣回。残年饱饭东坡老，一壑能专万事灰。——《儋耳》", "answer_votes": "249", "answer_comment": "​81 条评论"}
{"answer_author": "严肃", "answer_id": 92382904, "answer_text": "这个问题吼啊，来说说李白吧，古代自我炒作第一人，也是写软文的前几号人物。屌丝时代默默无闻的李白，一心想做官，但是苦于自己是社会地位低下的商人出身，不能科举，只好”干谒“，去找当时的大佬，天使投资人刺史李邕，拦轿自荐（和电梯间相比如何？），还写了一首《上李邕》的BP： 　　大鹏一日同风起，扶摇直上九万里。　　假令风歇时下来，犹能簸却沧溟水。　　世人见我恒殊调，闻余大言皆冷笑。　　宣父犹能畏后生，丈夫未可轻年少。翻译一下第一二句，李白先把自己比作大鹏，自我吹捧，堪比王林大师，这个逼装的，我给满分。<img src=\"https://pic2.zhimg.com/50/93468f6d7d6f3adbb0ce84dd2eef2ef1_hd.jpg\" data-rawwidth=\"396\" data-rawheight=\"351\" class=\"content_image\" width=\"396\">而第二句“世人见我恒殊调，闻余大言皆冷笑”的意思是“我的宏大抱负，常常不被世人所理解，被人当做“吹牛逼”来耻笑。我没有料到，李邕你这样的名人竟与凡夫俗子一般见识“，但是我要劝你两句，\"宣父犹能畏后生，丈夫未可轻年少\"，孔子都说后生可畏，你不要看不起我啊。好比一个青年拿着自己的BP去找马云，“我有一个idea，可以改变世界”，又好比一个中年胖子吹牛逼说：我死了不要紧，但中华民族可怎么办啊？我可是下一个乔布斯啊。显然大佬李邕并没有鸟他，不要紧，那个时候没有朋友圈，他的吹牛逼事迹并没有传开，于是他开始去找其他的大佬。他到了襄阳一带时，去蹭了地方长官韩朝宗举办的party。韩朝宗敬酒，李白居然第一个站起来跟人家碰杯。韩老师是地方最高长官啊，当然就很生气，哪里冒出来的不懂规矩的屌丝。不过李白肯定是故意的，和凤姐一样？接着，李白就向韩朝宗道歉，写了《与韩荆州书》，白闻天下谈士相聚而言曰：“生不用封万户侯，但愿一识韩荆州。”何令人之景慕，一至于此!岂不以有周公之风，躬吐握之事，使海内豪傻，奔走而归之，一登龙门，则声价十倍。所以龙蟠凤逸之士，皆欲收名定价于君侯。君侯不以富贵而骄之，寒贱而忽之，则三千之中有毛遂，使白得颖脱而出，即其人焉。白。陇西布衣，流落楚汉。十五好剑术，遍干诸侯；三十成文章，历抵卿相。虽长不满七尺，而心雄万夫。皆王公大人许与气义。此畴曩心迹，安敢不尽于君侯哉!。。。。请日试万言，倚马可待。今天下以君侯为文章之司命，人物之权衡，一经品题，便作佳士。。。。。。省略大话若干。。。。。这一次，李白显然更有策略，上来就拍马屁， ”生不用封万户侯，但愿一识韩荆州”， 就好比跟徐小平说 “哎呀徐小平先生，你不要给我一千万，我只要和你认识一下就是我八辈子的福气啦！简直祖坟冒青烟了”。这个马屁拍的，我给满分。<img src=\"https://pic2.zhimg.com/50/71c433401f0a7f3f62f1b2ae483b5e1e_hd.jpg\" data-rawwidth=\"250\" data-rawheight=\"250\" class=\"content_image\" width=\"250\">接下来，就是继续自夸和拍马了，您可是真天使啊，有多少青年才俊踏破门槛想来找你，只要有你罩着，这身价都是翻几万倍啊，你看我面相怎么样？是不是可以在三千人中脱颖而出？我李白屌丝出身，但是我是full-stack engineer啊（既会剑术，又会写诗），我虽然不高，但是我很会marketing啊，大家都说我很会牛逼啊（皆王公大人许与气义）。。。而且我move fast 啊， 精通agile开发啊，不信啊，你提几个需求，我分分钟出活，（请日试万言，倚马可待）当然韩老师十分感动，然后拒绝了他。23333333333333333333333是个，这就是“仰天大笑出门去 我辈岂是蓬蒿人”李白的奋斗过程。继续八一八李白“自我炒作”，现在创业都讲究出身，什么BAT啊，清北啊, GSB啊。李白说自己是北凉武昭王李暠的后人，说自己是太白金星下凡，说贺知章称他\"谪仙人\"，当然这些事情的真假，比西太平洋大学博士查起来难多了。李白还喜欢标榜自己轻财好施，存交重义，这个有空再八，但是的确是豪爽，挥金如土。李白先后结了四次婚，第一个夫人姓许，最后一个夫人姓宗，都是前宰相家的孙女。中间两次好像不是正式的结婚。宰相家除了大笔遗产，还有人脉关系网，第一次结婚是二十七岁，李白是入赘，这在以前的传统里面不是特别光彩。心机boy啊<img src=\"https://pic3.zhimg.com/50/5e3bd5407aff54af83db1f5a8dc33262_hd.jpg\" data-rawwidth=\"349\" data-rawheight=\"220\" class=\"content_image\" width=\"349\">而且李白在古代软文界也是排的上号的，写软文是他的现金牛啊。他的文章主要就两类：一类是替寺庙写的，一类是应地方官之邀写的。李白喜欢道教，为什么写佛家寺庙，无非是因为寺庙可以给润笔费。唐代的寺院非常有钱，所以寺院立一个碑，造一个像，碑记也要李白来写，例子有《为窦氏小师祭璿和尚文》李白为地方官僚歌功颂德的文章，基本是按一个模子写的，全部是行仁政，垂拱而治，爱国爱民，功德无量，大贤大德啥的，毫无诚信可言。他写过《天长节使鄂州刺史韦公德政碑》《虞城县令李公去思颂碑》《武昌宰韩君去思颂碑》等软文，少不了润笔费和利益输送。还有其他碑文，比如《溧阳濑水贞义女碑铭》，按规矩都是要收润笔费的，因为他后来已经是大V啦。才华横溢的软文狗啊！--部分内容选自檀作文的《李白实录》，安利一下这本书借古讽今的另外一个高峰 中国古代名妓的生活和工作是怎样的？ 觉得对你有启发/帮助/娱乐功能的请点赞吧，这个答案被很多人点反对了。", "answer_votes": "363", "answer_comment": "​38 条评论"}
{"answer_author": "优雅的野兽", "answer_id": 92517611, "answer_text": "转载一个，之前在网上看到的　　一 　　话说在唐代，有一些地方，是诗人们PK谁更猛的地方，就好像武林中的华山。 　　当时，在山西蒲州有一个楼，叫作鹳雀楼，一共三层，挺壮观。 　　沈括在《梦溪笔谈》里说，唐代很多诗人都一窝蜂跑到鹳雀楼去写诗。他们互相PK，看谁最猛。 　　要知道，唐代是什么时代？是诗人一个比一个猛的时代，没有一点底气是不敢乱写的，估计宋江之流到了鹳雀楼，也不好意思把“敢笑黄巢不丈夫”之类的打油诗写上墙去。不像现在，阿猫阿狗都敢留个“某某某到此一游”。 　　这一年，鹳雀楼来了一个大猛人，名叫李益。 　　没听说过不要紧，记住他是唐代诗坛的一个大猛人就行了。 　　读了其他诗人的作品，李益冷笑一声，挥毫泼墨，留下了八句：“鹳雀楼西百尺樯，汀州云树共茫茫。汉家箫鼓空流水，魏国山河半夕阳。事去千年恨犹速，愁来一日即为长。风烟并是思归望，远目非春亦自伤。” 　　看着那挥洒淋漓的墨渍，李益嘴边浮现出了微笑。他知道，这首诗会流芳千古。 　　果然，这首诗被人们争相传诵：猛，真猛！ 　　然而，它居然没有成为鹳雀楼上最猛的诗，甚至连第二猛的都排不上。这不怪李益，要怪只怪唐代的猛人实在太多了。 　　又一个猛人来到了鹳雀楼。他叫畅当。 　　他读了李益的诗，却只淡淡一笑。八句？七言？有必要吗？畅当挥毫泼墨，写下了一首诗，只有四句：“迥临飞鸟上，高出世尘间。天势围平野，河流入断山。” 　　绝了。简直绝了。 　　这首诗，不但被认为压过了李益那首，更是让成百上千写鹳雀楼的猛人没了脾气。 　　这叫其他的诗人还怎么写？还能写得比这景色更壮阔吗？还能比这心胸更宏大吗？ 　　能！这是唐代，没有什么不能发生。还有一个更猛的人飘然而来，登上了鹳雀楼。让我们记住他的名字――王之涣。 　　顺便说一句，这个猛人在《全唐诗》里只留下了六首诗，其他的都散佚了。关于他的资料很少很少。 　　王猛人登上了鹳雀楼。这里已经来过很多诗人，留下了无数名篇。它们都才华熠熠，猛气十足，犹如铜墙铁壁，封住了他的出路。 　　他必须另辟蹊径，再升逼格！ 　　然而，猛人就是猛人。眺望着眼前的苍茫落日、滚滚黄河，王之涣拿起笔来，写下了四句：“白日依山尽，黄河入海流。欲穷千里目，更上一层楼。” 　　这就是大唐的气象，是大唐一代猛人的胸襟。 　　由于这首诗太猛了，以至于一千多年后的今天，小孩子启蒙学唐诗，往往第一个就要学这首。 　　二 　　王之涣先生也交了一些猛人朋友，其中最猛的有两个，一个是绝句猛人王昌龄，一个是边塞猛人高适。 　　猛人之间是互相不服气的。他们找各种机会PK，看谁最猛。 　　王昌龄可不是一般人。李白的七言绝句厉害吧？想想“朝辞白帝彩云间”“故人西辞黄鹤楼”就知道了。但是王昌龄的七言绝句恨不得比李白还猛。“七言绝句，古今推李白、王昌龄”“天生太白、王昌龄以主绝句之席”。 　　高适也是个大猛人。岑参的边塞诗厉害吧？想想“忽如一夜春风来，千树万树梨花开”就知道了。但是高适的边塞诗恨不得比岑参还猛。别告诉我你没听过“战士军前半死生，美人帐下犹歌舞”。大猛人杜甫是怎么评价高适的？“独步诗名在！”　　可想而知，要PK掉这两个猛人，让他们彻底服气认怂，多不容易。 　　但是我们的一代猛人王之涣做到了。 　　这一天，下着小雪，三个猛人跑到一起吃酒。忽然酒楼上来了几个美丽的梨园女子奏乐唱曲，唱的是当时最流行的诗，相当于现在的流行歌曲。 　　绝句猛人王昌龄主动挑起了PK。 　　他说，我们三个都很猛，但到底谁最猛呢？不如今天比一比，这些美女唱我们谁的诗最多，谁就最猛。 　　另外两个都没有意见。于是，一段千古佳话就此开场。 　　一个歌女首先唱：“寒雨连江夜入吴，平明送客楚山孤。洛阳亲友如相问，一片冰心在玉壶。” 　　王昌龄微笑起来，伸出中指（我猜的，其实我不知道他伸的是哪根手指）在墙壁上画了一道：“我一首了。” 　　又一个歌女唱道：“开箧泪沾臆，见君前日书。夜台何寂寞，犹是子云居。” 　　高适也伸出中指画墙壁：“我也一首了。” 　　王之涣只是浅笑着，虽然落后，但并不慌张。 　　又一歌女开口唱了，又是王昌龄的一首绝句。王昌龄得意洋洋起来，提醒王之涣：“喂，我已经两首了。” 　　这时，一直很安静的王之涣终于表态了。他说，刚才这些歌女档次不高，她们唱的曲子怎么能算呢。 　　他伸手指向最美丽的一个歌女，微笑着说：“如果她唱的不是我的诗，我就承认自己是撸瑟；如果她唱了我的诗，那你们就拜在我座下，拜我当老大吧。” 　　终于，轮到这个最美丽的女子唱了。 　　只听她唱的是：“黄河远上白云间，一片孤城万仞山，羌笛何须怨杨柳，春风不度玉门关。” 　　寂静。死一般的寂静。 　　王之涣回过头来，微笑着看着王昌龄和高适。这首诗正是他的不朽名篇《凉州词》。 　　我们不知道，王昌龄和高适有没有当场下拜认老大。 　　但我们知道，后来的文艺批评家们争论哪首绝句是唐朝第一猛，费了很多口水。 　　明朝的文坛霸主李攀龙说，要数王昌龄的“秦时明月汉时关”最猛；继任的霸主王世贞说，是王翰的“葡萄美酒夜光杯”最猛；但清代的大才子王渔洋不服。他抱来了四个重磅炸弹，说每一颗都可以把你们的那些“最猛”炸了。 　　这其中，第一颗是王维的“渭城朝雨轻尘”；第二颗是李白的“朝辞白帝彩云间”；第三颗是王昌龄的“奉帚平明金殿开”；而第四颗，就是王之涣的“黄河远上白云间”。 　　是的，王之涣只留给我们六首诗。 　　但已经足够了。 　　我们不能要求更多了。 　　三 　　诗也是有套路的。写着写着，猛人们就逐渐发现了一些创作的套路。 　　比如，想成为唐代最猛的诗，最后一句就要用否定的结尾。 　　朱自清说，八首最猛的唐诗绝句，它们的结尾全部是否定式的：“西出阳关无故人”“不教胡马度阴山”“两岸猿声啼不住”“玉颜不及寒鸦色”“醉卧沙场君莫笑”“春风不度玉门关”“不知何处吹芦管”“商女不知亡国恨”。 　　难道这种套路就不能打破吗？ 　　能。 　　这一年，一个孤独的诗人来到了苏州。他叫张继。 　　他的名气不大，和王之涣、王昌龄、王维、李白、高适、李益等猛人比，他只算是个小诗人。历史也没有详细地记录他的生平。 　　我们只知道，他一生不太得志，快50岁才有了正经职位，长期在外漂泊。那一个夜晚，在苏州，他很想家。 　　大雾弥漫的晚上，他睡在船舱里，思想着故乡和前程，辗转反侧。 　　不知道是什么魔力，让这个一直好像并不太猛的诗人小宇宙爆发，写出了一首超级猛的千古名诗：“月落乌啼霜满天，江枫渔火对愁眠，姑苏城外寒山寺，夜半钟声到客船。” 　　清代的蘅塘退士编了那本著名的《唐诗三百首》，只选了张继同学的一首诗。 　　他只能选一首，因为张继流传后世的诗本来就很少，也都不太猛；但他也不敢不选这一首，不然他的《唐诗三百首》要被骂死。 　　有不少人坚持说，这首诗是唐代第一名。 　　就是这一首诗，让毛宁哥哥唱了又唱，余秋雨伯伯含泪赞了又赞。 　　写完这一首，我不知道张继是否喷出一升鲜血，大叫一声，毕生功力散尽，倒在船舱中；就好像王真人竭尽全力发了一招一阳指，破了蛤蟆功，然后倒栽葱倒了下去。倒下去的时候，他应该是微笑着的：我作为一个小诗人，却写出了诗歌史上最伟大的作品。谁说结尾要用否定句，才能写出猛诗？ 　　人，一辈子有这一次巅峰体验，足矣。 　　摘自《疯狂阅读》2014年第6期原文地址：http://www.xzbu.com/5/view-6315943.htm", "answer_votes": "155", "answer_comment": "​23 条评论"}
{"answer_author": "虫离小僧", "answer_id": 92577958, "answer_text": "不算梗，一些跟死有关乱七八糟的事儿晚唐，李商隐、温庭筠、段成式三人齐名，段郎在今天名头不显，当时也是文坛上响当当一号人物。段、温两人一般的风流浪荡，情投意合，好得实在没法分开，就干脆结成儿女亲家，温家千金嫁了段家公子。荏苒间，忽忽几十年眨眼过去，段成式先飞卿一步撒手人寰。这年冬，大雪，年迈的温庭筠独坐僻室，心下犹自追思六月故去的段郎。忽有人急叩门，家仆出去查看，须臾回来，交给温庭筠一支竹筒，说：“段少常（段成式曾任太常寺少常）送书信给老爷。”温庭筠以为自己听错了，狐疑打开竹筒，内有信笺，正是故友手迹，而墨渍未干。温大惊，再也顾不得身体老朽，撞门奔出，四下遥望，只见大雪茫茫，天地肃杀，哪有人迹？白居易迟暮之年，行动不便，仍然为诗着魔，对李商隐尤其激赏，跟李商隐说：“我快死了，我死后要投胎作你儿子。”后来小李果然生了儿子，也拿不准究竟是不是老白转世，就先取名叫白佬，万一能勾起这孩子前世的回忆，平添一甲子功力啊。然而这个白居易2.0不太上道，毫无天分，作叔叔的温庭筠赴李府玩耍就揶揄他：“听说你是白居易转世？别丢人啦！”几乎可以想象，飞卿每次造访，固定节目之一就是笑话白佬。好好一个孩子，在温庭筠叔叔坚持不懈的努力打击下，终于枯萎了。\n初唐四杰有三个不得好死：王勃南下交趾探望被他连累贬谪不毛的老爹，去时相当顺利，春风得意，写下《滕王阁序》，回家路上落水吓死了；卢照邻吃药吃得手足残废，四十岁上不堪折磨投颖水自杀；骆宾王参与颠覆中央的阴谋，兵败失踪。初唐另一位宗匠陈子昂也不得好死，被武三思指使县令罗织罪名下狱，陈家殷富，花钱如流水竭力搭救，却如何捞得出来，死于囹圄。孟浩然挺喜欢吃鱼的，单说鳊鱼这一种鱼，孟就多次赋诗表示想吃。《冬至后过吴张二子檀溪别业》有“鸟泊随阳雁，鱼藏缩项鳊”；《岘潭作》有“试垂竹竿钓，果得槎头鳊。美人骋金错，纤手脍红鲜”；《送王昌龄之岭南》有“土毛无缟纻，乡味有槎头”，槎头就是槎头鳊，即鳊鱼。他晚年生了背疽，险些丧命，折腾几年，好不容易行将痊可。王昌龄路过，还记得两年前自己被贬岭南时孟浩然送给自己那首诗里约他一起吃鱼的事。孟也时常惦记着，说，来得正好，鱼美蟹肥，一定要尝尝，在襄阳多留些日子，大哥尽尽地主之谊。是日设宴待客，孟浩然心情大佳，吃了很多鲜活水产，背疽发作死了。\n杜甫路上困于洪水，旬日不得食，耒阳县令得知，亲自棹舟接出来，奉牛肉、好酒，杜甫大快朵颐，不久逝世。现针对杜甫死因，有疾病说、食物中毒说，甚至说他饿极暴食撑死的，莫衷一是。\n杜司机这则跟死没关系杜牧干得那些破事，楼上各位已经列举了许多，那个硕大的豆蔻看得人血脉贲张，以及现代人津津乐道的“停车坐爱枫林晚”，另一句津津乐道的“隔江犹唱后庭花”，让人浮想联翩，这两句加“玉人何处教吹箫”并称不爱背诗的小伙伴最喜爱三巨头……but……等等，这，这句吹箫教程好像也是杜牧的吧？Excuse me？三种常见体位都写出来了，杜老司机实践经验丰富。《唐才子传》说他美姿容，好歌舞，风情颇张，不能自遏不能自遏是什么鬼？泰迪？况这厮熟读兵书，文武兼资，男神一流人物。然而因为他不能自遏，大家请客都不愿请他。兵部李尚书赋闲在家，府上家妓号称京华第一，宴请朝官时从来不喊杜牧。杜牧觊觎已久，见这帮熊玩意儿吃独食，于是派人上门去问，喂，听说你们家最近请客，我也想来吃。话都说到这份上了，还能搪塞？于是撩妹高手长驱直入：时会中已饮酒，女奴百余人，皆绝艺殊色。杜独坐南向，瞪目注视，引满三巵，问李云：‘闻有紫云者，孰是？’李指示之。杜凝睇良久，曰：‘名不虚传，宜以见惠。’李俯而笑，诸妓亦皆回首破颜。杜又自饮三爵，朗吟而起曰：‘\n华堂今日绮筵开，谁唤分司御史来？\n忽发狂言惊满座，两行红粉一时回。’意气闲逸，旁若无人。（《本事诗》）这位紫云姑娘又不免矣。他年轻时跟着牛僧儒在扬州混的时候，上街嫖娼是日常。牛增儒收到各街道办报告杜牧嫖宿的文书积了一满筐。在湖州邂逅个漂亮妹纸，人家才十来岁，杜牧就要（chu）娶（sheng），<img src=\"https://pic4.zhimg.com/50/6adcadd635fa60af14fe90dbad4ecb59_hd.jpg\" data-rawwidth=\"440\" data-rawheight=\"677\" class=\"origin_image zh-lightbox-thumb\" width=\"440\" data-original=\"https://pic4.zhimg.com/6adcadd635fa60af14fe90dbad4ecb59_r.jpg\">还当场下了聘金，定下十年之约。最后当然没娶成，十四年后再相逢，罗敷有夫，佳人已是人母，“如今风摆花狼藉，绿叶成荫子满枝”。所以我们现在怀疑杜牧有娈童倾向，另外的证据是他《清明》最后一句：“借问酒家，何处有牧童？遥指杏花村。”为什么要打听哪里有牧童？要牧童用来做甚么？再考虑到他有“玉人何处教吹箫”嗜好，而牧童们多擅长吹管乐器。以及他为甚么要取名叫杜牧？我们知道“杜”有“堵塞、冲击”的意思，“牧”自然不是指牧羊犬，多半还是指牧童。所以！他这个名字直译就是操！牧！童！畜生！简直难以想象与牧童形影相随的牛都会看到些什么！尚能安心吃草否", "answer_votes": "45", "answer_comment": "​9 条评论"}
{"answer_author": "芦笛", "answer_id": 92540618, "answer_text": "欧阳询，隋唐时期的大书法家。稍微学过一点历史的人，都听说过他的大名吧。&lt;img src=\"https://pic1.zhimg.com/50/b1634f227fb523dc6ce8face2cff65da_hd.jpg\" data-rawwidth=\"400\" data-rawheight=\"571\" class=\"content_image\" width=\"400\"&gt;不过字写得这么捧的一个人，长得奇丑无比。丑到什么地步呢，同事长孙无忌一看欧阳询，心里嘀咕，“我靠！这人怎么长这样儿啊？白瞎了这手好字了！写首诗嘲笑他一下吧”：“肩膀一耸就是个山字，头看不见在哪里。谁家的功劳薄上，画了一只猿猴啊？（耸膊成山字，埋肩不出头。谁家麟阁上，画此一猕猴。）”欧阳询一听不高兴了，我靠！一个死胖子还好意思说我！“索头连背暖，漫裆畏肚寒。只缘心混混，所以面团团。” 一脖子毛，跟背上都连起来了，这个大盖帽真暖和啊，你肚子那么大，裤裆都被你撑开了。大概是心里脏吧，所以脸才这么大！——《大唐新语》&lt;img src=\"https://pic1.zhimg.com/50/e647dc59661f4a2301b98f9e0949aa41_hd.jpg\" data-rawwidth=\"400\" data-rawheight=\"488\" class=\"content_image\" width=\"400\"&gt;（长孙无忌画像。）欧阳询像猴子，大概天下共知了。有刻薄鬼还专门写了一个小说《补江总白猿传》来讲述这段八卦。欧阳询“他爹”欧阳纥在梁朝当官的时候，带着家眷平定南方，来到长乐（今福建长乐市），一天晚上，老婆不见了。有一天欧阳纥进山，发现了老婆的一只绣鞋，他就带着一群人，终于在离家200多里外的山里找到一群女人，穿着华丽，唱着歌儿，过得很快乐嘛。欧阳纥问老婆的下落，女人们说：“你老婆来了一个月了，现在病在床上，你去看看吧。”欧阳纥进了洞里，发老婆睡在床上，身边堆满了山珍海味，看了他赶紧摆手叫他走。（老娘过得很舒服，不想跟你回去！）女人们告诉他：“那是个神物，才大能杀人，但是爱喝酒，爱吃狗肉，十几天后，你带着美酒狗肉来吧。”欧阳纥准备好东西，按照约定的日子去了洞里，女人们告诉他：“那东西力大无穷，经常让我们用丝帛把他绑起来玩捆绑play，一挣就断了。现在用麻绳藏在丝帛里，谅他无法挣断，他浑身坚硬如铁，刀枪不入，可常常用手掩着脐下几寸，这里肯定不能防。“欧阳纥藏了起来，一会儿，来了一个身穿白衣的大汉，左拥右抱，和女人们喝酒吃狗肉、打情骂俏，慢慢没声音了。好久、好久……女人们叫欧阳纥出来，只见一只大白猿给绑了起来，欧阳纥赶紧拿刀刺他的脐下几寸。白猿长叹一声：”天之亡我，非淫之罪也。不过你老婆已经怀孕了，生下孩子，别害了他啊。他长大后一定能光宗耀祖啊！“然后就死了。欧阳纥在洞里找到好多人间没有的珍宝，女人们告诉欧阳纥：“他性能力可好了，一晚上搞好几个女人，都不睡觉的。”欧阳纥遣散了女人，带着老婆回去了。后来，老婆生了个男孩，长大后，果然成了著名书法家！这明明就是个老婆出轨，丈夫喜当爹的故事嘛！发现不，从头到尾，老婆跟他一句话没说。老公因为长期肾虚，在老婆面前抬不起来头来，老婆为了追求性福，就跟人私奔了。丈夫杀死了情夫。&lt;img src=\"https://pic2.zhimg.com/50/9c30b86315211c2db6c0cb79d653b664_hd.jpg\" data-rawwidth=\"460\" data-rawheight=\"339\" class=\"origin_image zh-lightbox-thumb\" width=\"460\" data-original=\"https://pic2.zhimg.com/9c30b86315211c2db6c0cb79d653b664_r.jpg\"&gt;这是欧阳询的画像。肯定给了画师很多钱，把自己画得这么帅。《疯狂动物城》里有哪些隐喻？ - 芦笛的回答如何以《金瓶梅》的手法写《三国演义》？ - 芦笛的回答如何把《水浒传》写出《红楼梦》的感觉（或反之）？ - 芦笛的回答为什么探春强烈反对搜检大观园？ - 芦笛的回答", "answer_votes": "18", "answer_comment": "​2 条评论"}
{"answer_author": "区文聪", "answer_id": 92389933, "answer_text": "扒灰，又称爬灰，是一个形容乱伦的词语，而且是专指公公和儿媳之间发生性关系的乱伦。关于扒灰一词的来历有许多种故事传说，我个人觉得比较好玩的一个是关于王安石的。故事说，有一次王安石走过儿媳的房间，看见儿媳睡在透明纱帐的床上，眼球不由得为之而发光。王安石毕竟是诗人，于是在充满灰尘的墙上写了一句：“缎罗帐里一琵琶，我欲弹来理的差。”写完后躲在一旁观察儿媳的动静。儿媳看到公公在外面鬼鬼祟祟的，于是出来看公公在墙上写了什么，一看到公公留下这样的词句，当即明白了是什么意思，于是在公公的诗句后续上了一句：“愿借公公弹一曲，尤留风水在吾家。”王安石看见儿媳的话后，正在暗自高兴，没想到这时儿子出现了，于是赶紧用袖子去擦拭墙上的字迹。儿子奇怪，问老父在做什么，王安石说，在扒灰。又专家考证说，扒灰一词不是出于王安石，而是出自大学士苏东坡先生，但是故事情节大同小异。--------------------------------------------------------------分割线-------------------------------------------------------------------故事精彩，听听就好，真假自己判断，不必过于计较--------------------------------------------------------------------------------------------------------------------------------------------一个大学阅读了260+本书和每天近百篇新闻阅读所打造出来的思维体系，微信公号owcctyhttp://weixin.qq.com/r/mj_Ti63EHPBjreno92qI (二维码自动识别)--------------------------------------------------------分界线--------------------------------------------------------汉成帝的偷窥癖　　“瘦燕肥环”，瘦燕是指赵飞燕。赵飞燕和她的孪生妹妹赵合德生在江南水乡姑苏。赵合德风姿迥异，生得体态丰腴，玉肌滑肤，美艳妩媚与赵飞燕不相上下。她们都是汉成帝的宠妃。　　最令汉成帝入迷的是赵合德兰汤沐浴。自从汉成帝一次无意间从门窗隙缝中窥见了赵合德洗澡后，“看澡”就成为他找到的新鲜刺激。一幕幕活色生香的旖旎画面，有景象、有动作、有表情、更有声音，是汉成帝的经验里从来没有过的。他对身边的太监说：“自古以来皇帝没有两个皇后，如果有的话，我一定要把昭仪(此时赵合德已为昭仪)立做皇后。”后来为赵合德修宫殿，汉成帝特地关照用蓝田玉镶嵌了一个大浴缸，注入豆蔻之汤，更显水光潋滟。　　赵合德知道了自己入浴的过程竟能如此使皇帝神魂颠倒，于是便将计就计不予揭穿。更运用欲擒故纵的手法，尽量铺排无限的媟艳风光，甚至连浴罢的情态也刻意加以美化，以吸引汉成帝的注意力。　　赵合德入浴时的美态，紧紧地扣住了汉成帝的心弦。赵飞燕听到了风声，便有一种失落感，害怕失宠衾寒枕冷，于是，也如法炮制地想要吸引她的皇帝丈夫。汉成帝来了以后，赵飞燕才开始沐浴，她赤身裸体，千娇百媚地挑逗皇上，还不时地故意往皇上身上洒水，以为会给皇上带去新鲜的刺激，谁知这一招让成帝大倒胃口，没等她洗完就匆匆离去了", "answer_votes": "28", "answer_comment": "​24 条评论"}
{"answer_author": "匿名用户", "answer_id": 92448374, "answer_text": "这个问题，回答一下我们的阿丕同学好不好啊！我丕虽然是皇帝，但他的才子身份明显比他的皇帝身份还耀眼。前有幽燕老将，气度雄浑的父亲曹操。后有三河少年，风流自赏的亲弟弟曹植。敌国之中，还有渣权，丞相。就是曹丕的亲友团里，司马宣王后来的存在感，也比我丕强。才子气魏文慕通达，天下贱守节。遍观史籍文章，曹丕身上的才子气一直很浓。因为是才子，所以喜欢酒酣耳热，仰而赋诗。敢爱敢恨，睚眦必报，往往流于意气。和吴质交好，可以让吴质看看自己漂亮自己的老婆。但另一方面，救过父亲曹操的曹洪差点被他逼迫到死路。对待自己的子侄骨肉，不能不说是刻薄，后来陈寿感叹，作法之弊，以至此乎！但我们的文帝，和那些英明神武，喜怒不行于色的权力野兽相比。他有人情味，或许也更容易让人理解吧。他很有幽默感，很有点黑色幽默的感觉，带着点文人的促狭和机灵。王粲死后，墓前响起此起彼伏的驴叫。但很少有人记起，王粲的两个儿子后来正是在魏讽案事死在曹丕的手里。于禁的死亡壁画，王忠马前悬挂的人骨。他爱吃葡萄，说“南方有龙眼荔枝，宁比西国葡萄石蜜乎？他兴趣广泛，允文允武，能写诗作赋，也会舞戟弄剑，喜爱弹棋游猎。拿着甘蔗对剑，能击中邓展的手臂。这样的一个人，有时候天资浪漫，有时候又伤春悲秋，由着自己性子来。曾经海誓山盟的甄宓，终于被他逼死。鲍勋是个好官，多人为他求情。但是不能相容，在文帝死前二十多天被处死。史书上说文帝矫情自饰，谋得了储位，真不知道对文帝是种怎样的折磨。获封时候，大喜过望，抱着了辛毗的脖子。辛毗的女儿辛宪英都在感叹，不知忧患，魏祚不长。曹丕其实是一个蛮有人情味的人，对吴质司马懿等小伙伴推心置腹，连为了小妾抑郁而死的夏侯尚，也曾经被他赋予杀人活人，威福自作这样的权力，与吴质书写的情意悠长。可建安风度中的才子曹丕，更像一个个当皇帝的文人。与那种审慎与冷漠的帝王心思，终究差了许多。曾经美好的愿望，终将如水东流，正如那个美丽又残酷的时代。盖文章经国之大业，不朽之盛事。", "answer_votes": "29", "answer_comment": "​6 条评论"}
{"answer_author": "蔚蓝.Alongs", "answer_id": 92495733, "answer_text": "居然没人说元稹？元稹的《离思（其四）》曾经沧海难为水 除却巫山不是云取次花丛懒回顾 半缘修道半缘君这个诗 是在他老婆（韦从 27岁）死后写的 很棒对不对！ 特别是“取次花丛懒回顾 半缘修道半缘君”这一句！！是不是觉得他是好男人！ 还有前面两句 “曾经沧海难为水 除却巫山不是云” 啊你看 妻子你是沧海 我怎么看得上那些河水小溪流呢？ 你就算死去我也是对你思念着 于是 接下来元稹现出了原形 在韦从死后两年 元稹在江陵府纳妾 然后又有一个叫薛涛的才女 （当时40+） 都有才华对吧 有共同爱好对吧 好 关系就复杂起来了 薛涛说自己老了 （毕竟当时元稹30+）好 那你是风韵犹存 但最后还是没有在一起 这里放一首元稹给薛涛的诗   春望词四首（节选）风花日将老 佳期犹渺渺不结同心人 空结同心草虽然有人说元稹是内心深爱 只是身边孤独想要个女人而已 但是说到底 他这一生的感情纠葛也是挺多的 这个歌妓看上了写首诗讨个欢心 那个妹纸好像蛮不错的又去勾搭一下 啊喂说好的取次花丛懒回顾呢！ （x）希望大家看看就好 不要太当真哈 （///）顺带一提 （知乎首答）以上~", "answer_votes": "21", "answer_comment": "​9 条评论"}
{"answer_author": "Paul.Lee", "answer_id": 95333160, "answer_text": "泻药。不知道为什么看到\"梗\"字就不舒服，这大约是因为看惯了\"哏\"字吧?还是说三句话1.笑林广记里都是古人的哏。2.苏东坡妹妹脸长，苏就笑话小妹，眼泪从初一开始流，第二年十五才流到嘴角。3.苏东坡和佛印和尚讨论屎。", "answer_votes": "6", "answer_comment": "​2 条评论"}
{"answer_author": "古四月", "answer_id": 92380103, "answer_text": "&lt;img src=\"https://pic3.zhimg.com/50/5dba73d42c094746e62dccc595940667_hd.jpg\" data-rawwidth=\"984\" data-rawheight=\"554\" class=\"origin_image zh-lightbox-thumb\" width=\"984\" data-original=\"https://pic3.zhimg.com/5dba73d42c094746e62dccc595940667_r.jpg\"&gt;", "answer_votes": "24", "answer_comment": "​21 条评论"}
{"answer_author": "霍浩云", "answer_id": 92513930, "answer_text": "纪晓岚=_=，嗜肉如命：栗子很多，随便摘一个《虫鸣漫录》：纪文达公自言乃野怪转身，以肉为饭，无粒米入口。日御数女，五鼓如朝一次，归寓一次，午间一次，薄暮一次，临卧一次，不可缺者。此外乘兴而幸者，亦往往而有。然而这样，，他活了八十多岁。。", "answer_votes": "5", "answer_comment": "​5 条评论"}
{"answer_author": "陆梅英", "answer_id": 92658079, "answer_text": "一天深夜，小偷钻进了郑板桥家的院子。郑板桥为官清廉并不怕偷，只是担心小偷碰翻了他的兰花，更担心小偷被小黄狗咬伤，于是在黑暗中‘献’诗一首:细雨蒙蒙夜沉沉，梁上君子进我门。小偷一听吓了一跳，正欲躲藏，但听的郑板桥吟道:出门休惊黄花犬，越墙莫损兰花盆。小偷听了非常感激，但小心翼翼的爬墙出去，而且又听到了那个极亲切的声音:天寒不及披衣送，趁着月色赶豪门。", "answer_votes": "29", "answer_comment": "​13 条评论"}
{"answer_author": "伊丽莎黑", "answer_id": 108951894, "answer_text": "大概可以开个专门讲古代八卦的栏目。白居易。自从知道他那点破事儿后再也不能直视他了。你个臭流氓！“他买了一批十五六岁的少女当家妓，玩两三年，到十七八岁就嫌他们老了，当废品处理掉，再进一批新鲜货色。一而再，再而三，公然写进诗句，以此炫耀。”（摘录自舒芜《哀妇人》）对应诗文“十载春啼变莺舌，三嫌老丑换蛾眉”樱桃樊素口，杨柳小蛮腰。樊素、小蛮都是白居易的家姬。那时候的樊素、小蛮才十来岁吧。白居易都五十多了。老到70岁，实在不行了，患了风痹之疾，才算放了她们，并作诗标榜自己：“既解风情，又近正色。”刘禹锡有段时间看上了樊素：“终须买去名春草，处处将行步步随。”意思是要把樊素买去，改名春草。老白不让，说要不把小蛮给你吧。“还携小蛮去，试觅老刘看。”大概自己也觉得这事儿作诗文让来让去，流传后世多不好看啊。老白在后文此地无银三百两地补了句：小蛮，酒杯也。意思是他们推让的不过是盏酒杯。另外呢。老白还作诗骂死了位美艳少妇。（这是野史，但是我相信无风不起浪。）关盼盼和张建封情投意合。张建封英年早逝。关盼盼恋旧情，不愿改嫁。白居易赞过其美貌“醉娇胜不得，风袅牡丹花。”但是后来就不对劲了，开始说她：“歌舞教成心力尽，一朝身去不相随。”大意是，你老公死了，你干嘛不跟了一起去？关盼盼也是个想不开的，绝食自尽了。总之这位士大夫的黑料太多了。没想到你是这样的白居易。", "answer_votes": "3", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 92618818, "answer_text": "例会时间，我也整理一些。1官二代在宋代并不是真的那么吃香。有个叫沈遘的官二代本来当了一个小官，参加科举考试被评为第一。但是朝廷说，你都已经因为老爹的恩德当官了，就不要跟老百姓抢了，你还是当第二吧。这个沈遘，是沈括他哥。2“以后你还敢不敢？”“我不敢了。”“以后还听不听话？”“听话。”“那就好。滚！”这是一场注定要载入史册的家暴案施暴的人是妻子，叫张氏。被虐的人是丈夫，叫沈括。没错，就是那个沈括，那个被《宋史》评价为“天文、方志、律历、音乐、医药、卜算无所不通”古今无双，才华横溢的科技通才——沈括，沈括的晚年巨著《梦溪笔谈》，就是在这样的家暴氛围中完成的。3褒姒，周幽王的宠妃褒姒姓什么？姓姒。因其为褒人所献，故名褒姒。《辞海》载：“褒姒，褒国（今陕西勉县东）人，姒姓。 ”4孟姜女，按照先秦的女子称呼，孟姜女其名在前，即“孟”；其姓在后，即“姜”。“孟”在此处是排行的称谓。在古代的排行中，老大称“孟”或“伯”，老二称“仲”，老三称“叔”，最小的称“季”，孟姜女就是“姜家的大姑娘”。5俞伯牙姓什么？姓伯。陈奇猷《吕氏春秋新校释》：“高注：伯，姓；牙，名，或作‘雅’。钟，氏；期，名；子，皆通称。悉楚人也，少善听音，故日为世无足为鼓琴也。”王昕《漫说“三言”“二拍”》：“‘伯’是姓，‘牙’是名，或者也写作‘雅’；‘钟’是姓，‘期’是名，‘子’是通用的敬称。所以主人公的名字就是伯牙、钟期，而非俞伯牙、钟子期。”6据《史记·孔子世家》说，孔子的祖先是宋人。宋本是殷商的后裔封国。商的始祖叫契，契的母亲叫简狄。相传有一年春分时分，简狄在郊外祈祝祷，忽然飞来一只玄鸟（燕子），简狄无意中吞吃了燕卵怀孕生下契。契长大后辅佐舜帝有功，被舜封在商（今河南商丘）。因契是其母吞食玄鸟之“子”（卵）而生的，所以舜就赐予契姓“子”。如果一定要追根究底孔子的姓，那就是姓“子”了。不过，秦汉以前姓氏有别，男子称氏不称姓。先秦以后，姓与氏合而为一，氏也就成了姓。孔子的先世就以祖先孔父嘉的字“孔父”为氏。7陕西饥荒，范仲淹的儿子范纯仁私自开仓赈灾。到了秋收，有人举报范纯仁，朝廷就派人来调查。被他救活的老百姓知道了就说：“范公救了我们，怎么也不能连累他！”于是昼夜抢着运粮到仓库，调查人员还没到就补足了赈灾发放的粮食。8一个15岁的孩子，为了帮父亲澄清冤枉，跟宰相当庭辩论，说得宰相哑口无言。完事儿之后，这孩子不但没有遭受到宰相的报复，反而可以正常参加考试并且当官。这个孩子叫李师中。9唐太宗时期，洛川县，每逢农忙的时候，监狱里的囚犯都会被放回家忙农活，等忙完了再自己回来接着坐牢，没有一个逃跑的。这个县的县令，就是刚刚说到的李师中。10诺贝尔在遗嘱中提到：奖励那些对人类做出巨大贡献的“发明或发现”。他不认为数学是人类可藉以得益的实践科学，因而数学被排除在诺贝尔奖之外。11苏秦一直努力说服六国联合抗秦，史称“六国封相”。但苏秦在齐国的时候被刺客杀了，齐王为了抓出刺客，特贴出告示，声称苏秦为大内奸，刺杀苏秦者赏金千两。告示一出，立刻有四个上钩，声称是自己所为。齐王正恨刺客牙痒，怒：千两黄金每人二百五，顺便把这四个二百五推出去砍了！12宋人笔记《青琐高议》中则有一个“男追女”的故事：京城人周默，对邻居一老秀才的21岁妻子孙氏一见钟情，展开猛烈攻势，接连写了几封情书。孙氏对周默似也有情意，但既已婚嫁，便严词拒绝了周的追求。后来周默宦游，写信告诉孙氏：愿终身不娶，等她，直至她丈夫去世，便回来迎娶她过门。三年后，周默回乡，得知孙氏丈夫已离世，便托母亲遣媒求婚。两人终结成秦晋之好。孙氏是嫁过三次的妇人，但周默以及彼时社会，都没有对她有什么歧视。宋代社会之开放，可窥一斑。13中国最复杂、人格分裂最严重的人——杨度：拿过秀才，参与过公车上书，当过满清四品。和康有为、梁启超、黄兴是好友，跟汪精卫、蔡锷、齐白石是同学，怂恿袁世凯称帝，赞同孙中山共和，北伐时说毛泽东能得天下，营救过李大钊，是杜月笙的师爷，入过佛门和国民党，最终经周恩来介绍加入中共。皇帝的伙食费系列----14清朝早朝时间从凌晨5点开始，大臣们为了不迟到，每天起得比鸡还早。有一天，一代英主乾隆帝亲切地问候一个大臣：“你天天上班这么早，在家吃早点了吗？”大臣说吃了，乾隆又好奇地问：“早点吃什么呀？”大臣答：“俺家不富裕，随便吃几个鸡蛋。”乾隆惊讶得倒吸一口气：“天哪，10 两银子一枚鸡蛋，我都不敢多吃，你还哭穷！”大臣立即明白是有人搞鬼，但也不好乱说，只好顺着敷衍道：“外面卖的鸡蛋都是残次品，特便宜，质量好的鸡蛋我们哪里吃得起。”乾隆这才释怀，反过来安慰大臣：“别急别急，咱以后涨工资。”15到光绪帝时期，因为贪官，宫廷里的鸡蛋进价已变成30 两银子一枚，其实市场上才卖三四个铜板。光绪偏偏好这一口，因此每年要“吃”掉上万两白银的鸡蛋，弄得自己都有点儿负罪感。有一天跟翁同龢闲聊,光绪问:“鸡蛋好吃是好吃，就是太贵了, 翁老师你能吃得起吗?”翁同龢也不敢直言:“过年的时候买个把鸡蛋，给孩子们解解馋，平时不敢想。”可怜的光绪皇帝，终生都以为吃鸡蛋属于高档消费。16道光皇帝特别节俭，每年全部的生活支出，还不及后来他的儿媳妇慈禧的一半，弄得后勤部门清汤寡水，大家都很郁闷，就不断创新贪污思路。时间一长，道光隐约感觉不对，就想搞搞调研。有一天开早会，道光帝突然问大军机曹振镛：“你家平常做饭，都是谁买菜？”曹振镛知道皇上最欣赏艰苦奋斗的干部，痛快地回答：“保姆买菜我不放心，下了班俺自己上菜市场。”这是实情，曹振镛不但亲自买菜，还时常因为一个土豆半截葱跟菜农吵架，一点儿领导干部的样子也没有。道光帝切入主题：“那鸡蛋多少钱一个呢？”曹振镛是个情商超常的老江湖，他一盘算，管后勤的可都是皇帝身边人，岂能瞎掺和，便顺口编了个故事，把领导往沟里领：“我小时候得过一场大病，差点儿死了，医生嘱咐千万不能吃鸡蛋，一吃就没命，所以我家从来不敢买鸡蛋，真没口福啊！”17道光帝上任前，曾在前门一家小吃店吃过一碗汤面。这家的汤面做得实在是好，以至于道光帝念念不忘。登基后，皇上有一天发现吃饭开支过大，就明确指示伙食不要太讲究，多搞点儿家常的，比如汤面之类的。第二天，后勤事务管理部门内务府递上一份报告，建议设立汤面管理处，选派得力干部挂帅；修建汤面厨房一所，增加事业编制若干；请求拨付筹办费六万两，此后每年需要15000 两保证运行。皇上一看差点儿晕过去：“这也太夸张了吧，前门外就有一家汤面馆，不能让太监去买吗？”过了几天，内务府的人报告说，前门外的那家馆子早就关张了。可怜的道光皇帝只好认栽：“算了算了，我不吃汤面了！”", "answer_votes": "34", "answer_comment": "​11 条评论"}
{"answer_author": "赵子龙", "answer_id": 97570986, "answer_text": "王艮，明代王阳明的弟子之一，阳明去世后他创立泰州学派以传承阳明的心学。话说这位王艮，算是一位奇人。他二十九岁的一天夜里做了一梦，梦见天塌了下来，人们都哭号着奔跑逃命，于是王艮独奋臂托天而起。看到日月星宿失乱而无序，又亲自用手进行了排布，使之恢复到原来的样子。醒来后出了一身的汗，并且觉得心体洞彻光明（一夕梦天堕压身，万人奔号求救，先生举臂起之，视其日月星辰失次，复手整之。觉而汗溢如雨，心体洞彻）后来他在四十岁时还作过一篇《鳅鳝赋》，在赋中，他将对自身悲惨状况麻木不仁的众人比喻为鳝，而将充满使命感和精神活力的先知先觉者比喻为使鳝焕发生命力、像神龙一样的泥鳅。他借鳅之奋身化龙，救鳝脱牢笼，表达了自己“为天地立心，为生民请命”，救民于水火的宏大志愿，于是“整车束装，慨然有周流四方之志。”企图通过讲学实现他唤醒广大群众，让广大群众奋发起来，共同建设一个美好的世界。可见他是个有“救世主”类似的情节的人。王艮不同于一般明代官员学者的官宦出身，王艮出身贫寒。其生于明宪宗成化十九年（1483），为“灶丁”（烧盐的苦力）阶级，世代为灶户，“七岁受书乡塾，贫不能竟学”，十一岁时家贫辍学，随父兄淋盐。十九岁时随父王守庵经商至山东，可见他从小因家境贫寒而并未系统地接受过儒家特别是理学的教育。但他毕竟读过些书，还是有志于圣人之道的，在山东拜谒孔庙时，突发奇想，认为“夫子亦人也，我亦人也，圣人者可学而至也”（这话并不奇怪，早在孟子里就有“人皆可以为尧舜”的言论，并且这一点在当时的宋明理学中也得到了提倡）。于是日诵《孝经》、《论语》、《大学》，置书于袖中，逢人质难，久而信口谈解，如或启之”。他不再贩私盐，立志要做一个受人尊敬的文化人。在文化基础极差、居所又偏处在海滨辟地、且无名师指点的困难条件下，发愤刻苦自学，“默坐体道”、“闭关静思”。这样的苦心孤诣，踽踽独行的刻苦学习精神，是奇突而又感人的。毫不夸张地说，王艮是一位非常出色的“自学成才”者。就这样几年下来，他学通儒家主要著作，居然聚众讲学，广收学生，成了当地小有名气的学者。但他毕竟没有师承，没有学派的渊源所在。用宋明理学家的话说，就是道统之所在，他虽然自己下苦功学习，但毕竟都是个人的野路子，局限性很大。有一个了解王阳明学说的黄文刚在听说了王艮的格物说后，就说王艮的观点很类似于江西巡抚王阳明的心学，王艮就前往南昌拜见王阳明。王艮做事就是奇特，奇特到惊世骇俗，让人瞠目结舌。他坐船从泰州来到南昌，进城时换成一副道人打扮，怪模怪样。只见他头戴自制的方形“五常冠”，身着古人穿的长袍，脚下是一双麻鞋，双手合拢，执一笏板，加上王艮身材高大，满口是半文半白的孔孟语录，活像是一个复活的两千年前的古人。王艮身后是他9岁儿子王襞，也是道人打扮。南昌市民从未见过如此怪人，围观王艮父子的人越来越多，水泄不通。王阳明接见了王艮，对他的怪模怪样并不在意。（即日启行，以古服进见，至中门举笏而 立，阳明出迎于门外）王艮说：“昨天来到南昌，就梦见在此拜会先生。”王阳明不以为然，说：“有真知之人不信梦幻之说。”王艮反问道：“那么孔子何由梦见周公？”王阳明一时语塞，说：“这是他人写的真知。”两人互不相让，话不投机。王阳明接着说：“君子善思考，但不出其位。”王艮说：“我一介草莽匹夫，而对尧舜君民之心，未尝一日敢忘。”王阳明说：“舜独居深山，与鹿豕木石相伴，居住一生，快乐得忘了天下。”王艮也不以为然，说：“那是因为有尧在上，舜才忘了天下。”两人谈及“致良知”，王艮深为佩服地说：“你的学说简易直截，我所不及。”当即拜王阳明为师。第二天，又想了想谈话，再次拜见王阳明，说：“昨日我考虑不周，就轻易拜你为师，我后悔了。”王阳明非常大度，说：“好！有疑便疑，可信便信，不要勉强认同，我对你的态度非常高兴。”王艮与王阳明反复辩论，深知他的“格物说”远不及王阳明的“致良知说”，心悦诚服，于是执弟子礼拜王阳明为师。（论毕，乃叹曰：“简易直截，艮不及也。”下拜自称弟子。退而绎所闻，间有不合，悔曰：“吾轻易矣！”明日入见，且告之悔。阳明曰：“善哉！子之不轻信从也。）王艮思想的一个有特色的地方是他的“百姓日用是道“、“百姓日用之学”，这是王艮思想的闪光点和泰州学派思想的主旨和重要的进步命题，具有鲜明的人民性。“百姓日用”一词，在古代儒家虽然提出过，但被“大儒们”说成百姓是不知道“用”的。《易·系辞》云：“一阴一阳之谓道……仁者见之谓之仁，智者见之谓之智，百姓日用而不知，故君子之道鲜矣”。这就是说：道，只有天生的君子、圣人甚至“神”，才可以认识它、掌握它、运用它，凡夫俗子——百姓，是绝不可能知道“道”的。王艮一反经典的传统和说教，匠心独具地认为：“百姓日用即是道”，“愚夫愚妇”都“能知能行”。他具体地形容“僮仆之往来，视听持行，泛应动作，不假安排”就是“道”，此乃“即事是学，即事是道”。他还把“百姓”和“圣人”放在等同的地位，说：“百姓日用条理处，即是圣人之条理处”，“圣人之道，无异于百姓日用，凡有异者，皆谓之异端”。这样，“百姓日用”就成了检验是“道”还是“异端”的标准。他还这样说：“满街都是圣人”，“人人君子”，“尧舜与途人一，圣人与凡人一”，“圣人不曾高，众人不曾低”，“庶人非下，侯王非高”。", "answer_votes": "5", "answer_comment": "​2 条评论"}
{"answer_author": "吴儿夜啼张文远", "answer_id": 92456850, "answer_text": "杨素牛弘退朝，遇侯白，白谓素曰日之夕矣侯白是东方朔一类的人物，我怀疑黄易的小说里有个人就是他化来的。", "answer_votes": "10", "answer_comment": "​7 条评论"}
{"answer_author": "知乎用户", "answer_id": 92504131, "answer_text": "陈年老梗十八新娘八十郎，苍苍白发对红妆。鸳鸯被里成双夜，一树梨花压海棠。", "answer_votes": "6", "answer_comment": "​4 条评论"}
{"answer_author": "自来也", "answer_id": 92661028, "answer_text": "左耳好，右耳疼，好疼的金圣叹豆腐加花生米能吃出烤鸭味。", "answer_votes": "0", "answer_comment": "​3 条评论"}
{"answer_author": "浮苍", "answer_id": 92508194, "answer_text": "曾经沧海难为水  除却巫山不是云转头小妾拥入手 何顾前妻是个愁", "answer_votes": "11", "answer_comment": "​10 条评论"}
{"answer_author": "公孙驷", "answer_id": 208593762, "answer_text": "看你们写的热闹，我也讲一个。话说苏子由使辽，辽人一听苏学士来了，蜂拥而至来追星。问：可是“大江东去”的苏学士？或问：可是“左牵黄,右擎苍。锦帽貂裘,千骑卷平冈”的苏学士？或问：可是“明月几时有，把酒问青天”的苏学士？或问：可是“拣尽寒枝不肯栖，寂寞沙洲冷”的苏学士？或问：......苏子由答：我是他弟。辽人说：嗨~原来只是个小苏学士！然后作野兽散。子由公郁闷得要吐血，曰:何事纷纷问大苏！", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 92437457, "answer_text": "《西江月·师师生得艳冶》年代:宋 作者: 柳永师师生得艳冶，香香於我情多。安安那更久比和。四个打成一个。幸自苍皇未款，新词写处多磨。几回扯了又重挪。姦字中心著我。这首词，我能读三年.....ps:看不懂就不要强求了，大概就是三变哥哥和三个年轻的女孩子一起打闹嬉戏的意思，真没什么特殊含义，真的。———————————————————李后主（李煜）老婆大周后生病作死不吃药，死了。于是李后主娶了她妹妹小周后，俩姐妹小名一个是娥皇一个是女英。同样的还有东坡先生，更有趣的是，无论是和姐姐还是和妹妹，夫妻的感情都非常非常非常好，恩爱无比。一斛珠·晓妆初过晓妆初过，沉檀轻注些儿个。向人微露丁香颗，一曲清歌，暂引樱桃破。罗袖裛残殷色可，杯深旋被香醪涴。绣床斜凭娇无那，烂嚼红茸，笑向檀郎唾。李煜早期作品，写他和大周后闺房生活，仔细看辣！炒鸡棒。菩萨蛮花明月黯笼轻雾，今霄好向郎边去！ 刬袜步香阶，手提金缕鞋。画堂南畔见，一向偎人颤， 奴为出来难，教君恣意怜。讲李煜和小周后的偷情生活，整首词都很有味道的说。———————————————————再补充一个白居易，老爷子一生只娶了一个老婆，但蓄妓.....蓄了好多妓.....68岁时中风，遣散众女。杨柳枝两枝杨柳小楼中， 袅娜多年伴醉翁。明日放归归去后，世间就不要春风。这首诗是写给樊素和小蛮的，两个不愿意离开老爷子的妹子，以及，很多人因此诗抨击他老牛吃嫩草.....———————————————————楼上辣个姐姐写鱼玄机，有点不全（bug），我补充一下。鱼玄机字幼微，道号玄机，本名不知。（版本不一，我也很为难，但唐朝能知道名字的女人实在是太少了，所以选择了这个版本ಥ_ಥ）平民出生，幼年丧父。早有诗名，十二岁写“影铺春水面，花落灼人头”获温庭筠盛赞。（温大她30岁，据说长得像门神钟馗，而且屡试不第。鱼玄机年轻俏丽，才华横溢，温觉得配不上也正常，但爱情中哪有配不配，只有够不够勇敢），明朝学者称鱼玄机为“才媛中之诗圣”。鱼玄机十五岁时在崇真观题诗一首，因此结识了李亿。后来在十六七岁时嫁给这个已婚状元郎为妾，两人度过了近百日恩爱缠绵、刻骨铭心、和谐美满的生活。但因李亿夫人裴氏嫉妒不容，被休弃，鱼玄机曾独自一人三番两次去山西找情郎，最后心死，去咸宜观做道士。在绝望之余写下《赠邻女》，中有名句“易得无价宝，难得有情郎”。花容月貌的才女，连个箕帚小妾都但做不成。只让人叹息。鱼玄机和山西才子左名扬也有一段情。和温郎.....温老师总是触犯权贵被贬出长安....还有什么好说的捏눈_눈。后来好像是因为长安缙绅李近仁鱼玄机才抽死了侍婢绿翘，大抵又是女人间的那点破事。“戕奴”致死，杀人偿命，没有什么可以美化的。值得一提的是，当时的京兆尹温璋，也是山西人，还是温庭筠老乡。我鱼玄机，这辈子就坑在山西人手里了。（掩面cry）", "answer_votes": "44", "answer_comment": "​18 条评论"}
{"answer_author": "伊笛额特", "answer_id": 94304072, "answer_text": "当然是李白杜甫这对基了。杜甫可是写过《春日怀李白》和《秋夜怀李白》的。然而李白的心上人却是孟浩然，咱们的李白同志怀念孟浩然，第一句诗就是“吾爱孟夫子，风流天下闻”(˶‾᷄ ⁻̫ ‾᷅˵)求杜甫的心理阴影面积。", "answer_votes": "13", "answer_comment": "​添加评论"}
{"answer_author": "暗香", "answer_id": 94221762, "answer_text": "文不对题的说两个近代文人的段子我有个安徽老乡叫刘文典，是研究庄子的第一流专家。在抗战时期，这位老先生和当时很多第一流的学者一起搬到了位于昆明西南联大去教书。那时候日本飞机经常轰炸昆明，几乎每天都有，有时一天甚至两次。昆明也没有什么防空力量，日本飞机想什么时候来就来，随意得很。每当飞机来袭，昆明就会拉响防空警报，一有警报，联大的师生们就都往郊外跑，这叫做“跑警报”。有一次日本人的飞机又来轰炸，刘文典跟着大家一块“跑警报”，突然看见沈从文也混在人群里跟着朝外跑，就跑到他前面张嘴就骂：“我跑是为了保存《庄子》，学生跑是为了保留下一代的希望。你的那些东西又没什么用，跑什么跑啊！”据说他老人最推崇的是陈寅恪，曾经这么说过：“要讲教授嘛，陈寅恪可以一块钱，我刘文典一毛钱，沈从文那教授只能值一分钱。”这个段子顺口又给了沈从文先生一刀，看来这两位是真爱。说起来这个段子可以看成是当时搞国学、搞学术的所谓占据“正朔”的学者对于某些“不务正业”的新时代学者整体偏见的一个缩影，只是刘文典先生的脾气比较“怪”，才留下了这么好的段子。说起文人的狂气，钱钟书先生也有个挺好的段子，也是在西南联大。当时西南联大有外文系三个顶尖教授，算是学校招牌。钱钟书是怎么评价这三个人的呢？西南联大的外文系根本不行，叶公超太懒，吴宓太笨，陈福田太俗。说这话的时候钱先生刚进学校任教不久，吴先生还是他的引荐人和老师，但是钱先生照样毫不留情的开地图炮全面打击，年少轻狂，说的就是这种情况了……钱钟书先生后来变成了一个温润君子，虽然在文章中偶然也能看到狂气，不过远不像早些年那样锋芒毕露了，人总是要经过磨难才能成长吧。说的兴起，就再补充一个吧。阮籍是古代有名的狂生，留下的趣闻也分外多，这里不去说那些有趣的，只想说点让人感慨的东西。据说阮籍曾登广武古战场，观楚汉交兵之处，不见古时豪杰，只余萧瑟黄土，乃叹息道“时无英雄，使竖子成名！”又时常不辨路径，随路独行，每当到了途穷之处，就一个人抱头痛哭。这样的情形让我分外感慨，魏晋世风重老庄，说到底还是一个“逃”字，世情人心俱不堪言，那就逃的远远的，不与常人扎堆才好。所以竹林名士以放诞为达，陶渊明也伪托桃花源试图逃入无人能到的理想世界。但是世上毕竟没有桃花源，就算你有再美丽得精神世界终归还是要回到尘世中生活。既然在尘世中生活，就终究还得看这世上得丑态，可是整天对着这些，我心匪石，岂能无感？只是吞声踯躅不敢言罢了。情绪堆积之下，嵇康阮籍以饮酒为业、刘伶阮咸以狂诞为高，可是那又有什么用呢？逃不出去又融不进来，饮酒放诞都是麻醉而已，哪里消解得了内心的痛苦呢……所以“口不臧否人物”的阮籍会在广武战场上忍不住叹息“时无英雄”，会忍不住一个人命架狂奔直至途穷痛哭，会写《大人先生传》嘲讽当涂诸公为“裈中群虱”，会醉生梦死不理世事最终还是逃不过一张劝进表……世说新语上说嵇康死后向秀举郡计入洛，司马昭问他说：“闻君有箕山之志，何以在此？”对曰：“巢、许狷介之士，不足多慕。”王大咨嗟。好一个“王大咨嗟”，好一个“巢许狷介之士”，你写大人先生传或者思旧赋我都随你，可是在我面前任你怎么想都得回一句“巢、许狷介之士，不足多慕。”骨气是什么，硬的过我的刀么？", "answer_votes": "4", "answer_comment": "​1 条评论"}
{"answer_author": "失流光", "answer_id": 93494374, "answer_text": "啊，清明节到了，是时候奉献一波“被嫌弃的感觉是怎样的”系列回答了。1.有着“柳絮之才”的谢道韫妹子嫁给了王羲之的儿子王凝之，但对他很不满意。谢安就问自家侄女为啥啊，结果才女大人义正言辞地说了一番话（请大家自行脑补嫌弃脸）:“他本家的叔叔，（牛的有）王恭、王大，他的同族兄弟，（好的有）封胡遏末，没想到天地之中，竟然有他这种人（不意天壤之中，乃有王郎）！”就是那种“堪怜咏絮才”的感觉～封胡遏末已经成了一个成语……唉，别的我不多问，王凝之同学，你能说说娶了个名气比你大的老婆且被她嫌弃是怎样的一种体验吗？2.梁元帝萧绎有目疾。当年他还没被立为太子，是长沙王之时，有一天他率一众僚属登高望远，有一位官员拍马道:“今天可谓是‘帝子降兮北渚’了。”小萧同志瞟他一眼说：“你的意思其实是想说‘目眇眇兮愁予’吧？”眇的意思是一只眼盲……（涉事官员:我勒个去，王爷，我真没这意思……）这告诉我们读书要背好下半句的重要性……3.再来一个关于梁元帝同志的。他登基后，有位徐妃，每次被翻了牌子，只化半面妆迎接（摆明嫌弃他瞎嘛～），后来还出轨啦出轨啦……于是小萧同志又一次愤怒了，处理完徐妃后写了篇《荡妇秋思赋》发泄一下（扶额，不解他老人家的脑回路……），最有名的就是那两句“徐娘半老，风韵犹存”。先写这么多，点赞了再更。", "answer_votes": "17", "answer_comment": "​2 条评论"}
{"answer_author": "阿哥", "answer_id": 92769174, "answer_text": "东坡问少游(就是秦观)别后有何作，，少游举“小楼连苑横空，下窥绣毂雕鞍骤”。坡高冷曰：“十三个字只说得一个人骑马楼前过”。对了，出处也挺有意思，即俞文豹的《吹剑三录》。", "answer_votes": "2", "answer_comment": "​6 条评论"}
{"answer_author": "匿名用户", "answer_id": 92576699, "answer_text": "古代文人的梗…我每天备课查资料都能看到各种段子，这个问题我能日更…——————————————————————————————1.孟浩然昨天上课讲《夜归鹿门山歌》，那就先更个孟浩然的吧。孟浩然一生经历非常简单，生于襄阳长于襄阳死于襄阳，所以人们又叫他孟襄阳。（恩，我一直觉得金庸先生是从孟浩然这里得到启示才有了郭襄这个名字的。）孟浩然少时隐居鹿门山，但他的隐逸跟陶渊明不一样，他是在凹造型！！！这种隐逸是积极入世的，可以给自己积累名声。恩，心机boy！大约四十岁的时候，他进京求仕，然而失意而归，这中间发生了什么呢？这里得提到另一个人——王维，在文学史上王孟常常并称，山水田园派两巨头，这俩人私交也不错。孟浩然进京先考的进士举，然而失利了，但他并未灰心，还想着走点捷径。有一天王维偷偷把他带进了宫，结果遇上了唐玄宗。孟浩然一慌就躲床下去了，王维不敢欺瞒皇帝如实以告。玄宗那时也听过孟浩然的大名，于是让他出来一见，还让他诵一首自己写的诗。然后，wuli浩然同志就高高兴兴地读了自己前不久刚写好的一首诗——《岁暮归南山》，诗里有这样一句话叫”不才明主弃，多病故人疏“。玄宗一听，心想：“额，你这是在讽刺我咩？”遂言：“你是个隐士不想着出来混官场，我也从来没有弃你不用，你特么干嘛诬陷我！！！”恩，然后孟浩然先生就回襄阳继续隐居去了……孟浩然，字浩然，襄州襄阳人。少好节义，喜振人患难，隐鹿门山。年四十，乃游京师。尝于太学赋诗，一座嗟伏，无敢抗。张九龄、王维雅称道之。维私邀入内署，俄而玄宗至，浩然匿床下，维以实对，帝喜曰：\"朕闻其人而未见也，何惧而匿？\"诏浩然出。帝问其诗，浩然再拜，自诵所为，至\"不才明主弃\"之句，帝曰：\"卿不求仕，而朕未尝弃卿，奈何诬我？\"因放还。采访使韩朝宗约浩然偕至京师，欲荐诸朝。会故人至，剧饮欢甚，或曰：\"君与韩公有期。\"浩然叱曰：\"业已饮，遑恤他！\"卒不赴。朝宗怒，辞行，浩然不悔也。张九龄为荆州，辟置于府，府罢。开元末，病疽背卒。《新唐书》《新唐书》中提到孟浩然的死是——“开元末，病疽背卒”，是说他背上长了疮然后死掉了，不过据说事情没那么简单……这里又得提到另外一个姓王的，就是王昌龄，恩，李白的那句“我寄愁心与明月，随君直到夜郎西。”就是写给他的。话说孟浩然有段时间背上长疮了，经过一段时间的调理差不多快好了。有天王昌龄路过襄阳，顺便去拜访孟浩然，二人相谈甚欢。襄阳就是现在的襄樊，靠着汉水，水特产丰富，其中有种叫槎头缩项鳊的鱼，孟浩然的诗里面还提到过不止一次。他见王昌龄远道而来，就拿各种河鲜招待他，自己也吃了不少。然而，河鲜是大发之物啊……孟浩然本来就快好了的背疮全面复发，卒！孟浩然一生没有什么大起大落，就栽在一对王上了。------------------------------------------------------有空了再来更李白和杜甫的基情、王维跟公主不得不说的故事、永远的热血少年陆游、爱赌博的著名女词人……", "answer_votes": "15", "answer_comment": "​8 条评论"}
