{"question_id": "47345129", "question_text": "有人把机器学习和云计算、大数据还有个什么别的并列，称为计算机专业“四大俗”。究其原因，还是因为机器学习这个领域。“朝市之学必成俗学”。请问机器学习这块真的是这么俗吗？", "question_title": "机器学习是计算机专业“一大俗”吗？", "question_commet": "​4 条评论", "answer_number": "82 个回答", "question_followers": "1,305", "brower_number": "243,642"}
{"answer_author": "Excelle Su", "answer_id": 105786673, "answer_text": "当一个领域随着通用框架和库的出现而门槛降低，火起来了，以至于做什么都要扯上它，有时候都不管能不能真正解决问题，它就开始俗了。但是，俗的是这个概念，或者说用它的人，而不是技术本身，真正作为生产者做核心技术的人永远都不会俗，都是大牛。机器学习是不是，我觉得是。现在做什么东西，不管是科研还是工程，干什么都想把这个机器学习用进去。然而问题是它到底能不能真正解决这个项目的问题，是真正明白机器学习能做什么不能做什么还有它的真正原理，还是只会用现成库盲目写一堆Java，甚至是代码都不会写只会在presentation里面大谈机器学习大数据这些。当后者的人变多的时候，这个概念就变俗了。很显然，现在我们经常听到太多的人在吹这些东西，所以做技术的我们就觉得机器学习什么的变成了计算机四大俗。那么问题来了，是谁让机器学习从高大上的东西变成现在的四大俗之一呢？没错，就是各路的创业人士。过热的创业风是万恶之源，太多的小白什么也不会就天天堆砌各种名词做着被玩烂的概念来忽悠比赛评委和投资人，到最后的结果就是这些本来非常好的东西被他们搞成俗不可耐的概念。机器学习是，云计算和大数据更是(关键是还有人在带头去吹这个，比如我院所有实验室都得名义上跟大数据沾点边，就连做网络安全的都不例外，具体为什么大家都懂)，NLP倒还好一些。不过话又说回来，这些东西毕竟还是有真正的技术在里面的，我觉得互联网的一些概念才是俗不可耐，low不可遏，比如社交，电商，O2O和互联网+(这个是大boss)，这四个被玩烂已有成熟解决方案的东西我觉得应该被归为互联网四大俗。要是哪个创业项目大谈特谈这四样东西，发起者又是在校或者刚毕业的大学生，基本就可以把proposal当场撕成粉末扔出窗外了。全是垃圾，根本就不靠谱。如果是工作了几年的人想去创业做这个，也可以认为80%的概率脑子进shi了，支付宝脑子进shi还有人给兜底，你脑子进shi了就挂了。大吹互联网+的人，我认为他脑子被互联网的门夹了。=========================对了，评论区指出了还把我大VR给忘了，这个更是，现在技术都没成熟呢，就一帮人吵吵着要创业，连这个领域得多烧钱都不知道。这个VR早晚也得让你们给玩坏。我在今年的Imagine Cup上看见过一个团队就是做的VR，具体项目是虚拟中学化学实验室。然后他们也没做出真正的产品，只是给了一个效果视频。反正我觉得他们做的那个东西就跟刚学会3DMax的人做的一样。", "answer_votes": "251", "answer_comment": "​40 条评论"}
{"answer_author": "匿名用户", "answer_id": 105521906, "answer_text": "肯定不是扯上机器学习的就是俗吧。。sanjeev arora这几年还有他那几个学生搞得东西，还要那帮子搞代数统计做相关的东西的人，门槛可比所谓“X大浪漫”是要高的多的。。。况且\"X 大浪漫\"也不是最 fancy 的东西啊，最 fancy 的东西通常大多数人并不知道它们的存在。。虽然大家说的机器学习指的东西差别不会小但是现如今抓个人大概率做机器学习。。丫的，都这样了还能不俗么？准确点说，在大多数人所知道的机器学习范围内，这东西是俗不可耐的。", "answer_votes": "32", "answer_comment": "​10 条评论"}
{"answer_author": "张馨宇", "answer_id": 105524402, "answer_text": "俗，简直俗不可耐，各行各业都表示要转行做机器学习，我们公司不远处有个培训班，学员统一着装，每天集体高喊口号『月薪过万不是梦』。我原来一直以为这种培训班只有安卓开发、UI设计、PHP，结果后来朋友告诉我里面还有机器学习班。", "answer_votes": "107", "answer_comment": "​58 条评论"}
{"answer_author": "竹熙佳处", "answer_id": 105839996, "answer_text": "&lt;img src=\"https://pic2.zhimg.com/50/1546ba08ff926b180f50fb9570be3ab6_hd.jpg\" data-rawheight=\"213\" data-rawwidth=\"380\" class=\"content_image\" width=\"380\"&gt;图片来自南大周志华微博", "answer_votes": "109", "answer_comment": "​11 条评论"}
{"answer_author": "知乎用户", "answer_id": 106177620, "answer_text": "这些词汇确实变得越来越俗，确切来说：机器学习在还没有取代任何低端劳动力的情况下，会首先取代高端行业从业人员本有的行事逻辑，说简单点，就是思考上的偷懒。比方说搞金融，有些上来就是xx学习，xx聚类用于xx分析，可能里面的金融逻辑都不通，只是机器告诉我们一个貌似不错的结果而已。即便对方能将各种学习算法钻的很透彻，也不可否认是种行业精神的堕落。更不用说科研行业也有些人拼尽跟风之力追求炫酷，比如我，此为大俗。提个反观点：不过反过来说，人类社会不就是这样一边骂着思想偷懒的，一边想尽办法偷懒，并美化其懒惰为人工智能的必经之路嘛？搞机器学习的人的最终目的是啥？写一堆开源库的目的是啥？难道是为了增加从业人员思考的负担，然后换来一句：你真得很高雅！对于一股劲喊着两分钟推导SVM，三分钟写个CUDA并行LR这些。我的观点是：如果掌握的知识无法转化成解决问题的工具，一股劲憋这些太过久远的数学，代码的，变换几十套方式推导的。也是一种俗！是种装情怀的俗！如果有人问：这个问题为何要SVM？保证，还是因为SVM在这个问题上的效果出群才需要，而不是它的数学推导多么漂亮！而SVM在这个问题上的效果出群也不是因为大部分人理解了什么，而是有人试了！机器学习，本来就不是一个用来理解为什么的行业，是一个帮助人们解决为什么的工具。天生就俗不可耐！有人把工具用不好归咎到不会数学推导上的，对吗？", "answer_votes": "31", "answer_comment": "​4 条评论"}
{"answer_author": "何钦尧", "answer_id": 105754327, "answer_text": "如果有些人，才刚刚学会了调几个库跑点demo，对里面的原理一无所知，也不知道在现实世界的应用里面需要些怎么样的姿势，就开始大吹特吹自己搞机器学习，那还真是挺俗的。", "answer_votes": "122", "answer_comment": "​9 条评论"}
{"answer_author": "寒符", "answer_id": 105568100, "answer_text": "俗的不是技术，是人", "answer_votes": "28", "answer_comment": "​1 条评论"}
{"answer_author": "知乎用户", "answer_id": 105577645, "answer_text": "首先回答，这个说法是单纯而片面的。机器学习并不是计算机科学的子学科，它更应该被看做是计算机科学，统计学，数学的交叉学科。同时它还在生物学，医学，社会科学等诸多与计算机科学关联较少的学科有诸多应用。因此，机器学习绝不仅仅是计算机科学的一大俗。这么说太狭隘了。它是计算机科学，统计学，数学，社会科学，经济学等等诸多领域的一大俗。", "answer_votes": "47", "answer_comment": "​7 条评论"}
{"answer_author": "find goo", "answer_id": 132120680, "answer_text": "古代有苗族人养蛊，现代有人工智能算法竞争法。给个无法穷举的最优化问题，把下面的算法写好后相互pk，得到最后是最优的。不管俗不俗，斗蟋蟀是一种乐趣，斗算法也是一种交流方式。高校好这口子，公司也爱开会交流，国家也希望创新，个人想搭顺风车。天下熙熙，皆为利来，天下壤壤，皆为利往。智能算法是个框，想装什么有什么，什么数学，哲学，生物，艺术，硬件，量化交易，工程，管理，产品，大数据，数据挖掘，在线分析，都可以往这个框子里装。这些算法里面又有很多分支，光一个神经网络资料都是汗牛充栋，一个遗传算法论文更是普天盖地，更不要说被谷歌阿法狗引爆的深度学习了。你可知道数学中一个无穷大，可以争论几个世纪。学过排列组合的都知道，在原料很多时会造成组合指数爆炸，几十种算法，加百种数学模型，而且新的算法模型不断涌现，够高校科研几百年的原料了，写满个图书馆没问题。古来圣贤皆寂寞 惟有算法留其名纯数学经历几百年的发展，理论体系都比较成熟稳定，纯理论创新比较难，这些理论比较抽象很难运用到现实当中，在有了计算机算法后，数学家发现算法是数学的伊甸园,发展空间很大，实际用处也大，所各种算法只会层出不穷，因为研究数学的圣贤太寂寞了。很多软件或硬件产品，还只是采集信息作用，让人来决策，市面上真正做到半人工智能程度的产品都是凤毛麟角，多数是大公司的云计算包装过的智能算法，科技成果转化率特别低，因为要懂这些算法和原理，又要懂产品编程的人非常少。随着程序员的技术素质和工作年限的不断提高，不满足于原有if-else,crud的码农模式，很多开始学习人工智能算法转型，加强产品核心竞争力，市场需要比较大。gov军事为了应用无人机，各类飞行器，同美国竞争，必然有智能算法技术实力加强武器的不足，经济上为了提高国际上产品竞争力进而收税，所以对大数据，工业化和信息化交叉，各类软件，电子产品都希望有智能算法支撑。不要忘了螳螂捕蝉黄雀在后的税费。多方作用结果，人工智能算法热是必然的，人工智能+云计算+大数据+移动互联网，这几项技术是未来很长一段时间发展趋势。k近邻算法支持向量机PCA算法决策树随机森林叶贝斯算法模糊数学算法近似度分类遗传算法人工鱼群算法蛙跳算法蝙蝠算法萤火虫算法布谷鸟搜索算法禁忌搜索算法蚁群算法量子模拟退火算法粒子群算法杂草算法细菌觅食算法人工神经网络人工蜂群算法深度学习", "answer_votes": "16", "answer_comment": "​6 条评论"}
{"answer_author": "匿名用户", "answer_id": 105737468, "answer_text": "ML本身并不俗。俗就俗在，有些人连ML的书都没啃过几本就开始腆着脸说自己是搞ML的。", "answer_votes": "8", "answer_comment": "​25 条评论"}
{"answer_author": "知乎用户", "answer_id": 105884908, "answer_text": "按照这个理论，“俗不俗”的定义，是由人数和火热程度来决定的？？？既然这样，搞计算机的人这么多，计算机领域太俗了，别搞了吧", "answer_votes": "6", "answer_comment": "​添加评论"}
{"answer_author": "元峰", "answer_id": 105568794, "answer_text": "前几年很火的是各种专业的转CS,现在是各个专业的有事没事转ML了。       有一次去听南京大学周志华老师的报告，他说他前几年给别人说自己是搞机器学习的，结果对方问他是不是研究收庄稼用的收割机的，因为江苏大学研究联合收割机很牛，对方把江苏大学当成南京大学了。周老师还说，现在好像大街上到处都有人说机器学习，大数据。周志华老师的《机器学习》几个月印刷了好几次，说明现在研究机器学习的人的确多。      不过，大部分人也就是知道个大概，买来机器学习的书也就翻一下完事了。机器学习不俗，俗的是不能沉下心来搞研究的人。还是掌握好理论，把机器学习算法应用到各行各业，让社会因它而更美好，你我共勉！", "answer_votes": "12", "answer_comment": "​1 条评论"}
{"answer_author": "匿名用户", "answer_id": 105762924, "answer_text": "更新：机器学习严格上并不属于CS所有-----------------------------------------------------------------------------------------------------------------------搞机器学习的很多是半路出家CS的，搞程序语言研究的，大部分一开始就是CS的。很多非CS的学生看见CS很火，就想转来CS，此时机器学习是他们最容易转入的方向。不是CS的也能搞机器学习，但很难搞程序语言。而且存在一些读研选择机器学习的学生，是因为机器学习相比程序语言、操作系统等好发论文，容易毕业。匿名了，这回答估计有些人看了会不爽。", "answer_votes": "23", "answer_comment": "​22 条评论"}
{"answer_author": "知乎用户", "answer_id": 105945150, "answer_text": "计算机视觉、机器学习、大数据、云平台，工业4.0、物联网……搞这些的都是很promising的行业，但是连计算机原理都没完全搞清楚，甚至连写的C代码都不考虑溢出的骚年们，开始标榜自己做这些研究的时候，我就静静地看他们装逼。然而并不能说搞这些就俗气了，只是稀烂的人太多了之后容易给外界一种错觉， 就像很多人以为学习C#就是拖控件一样，觉得搞这个的人都是阿猫阿狗，而真正的大牛都被路人甲给淹没了。", "answer_votes": "8", "answer_comment": "​1 条评论"}
{"answer_author": "vector", "answer_id": 248100715, "answer_text": "跟python一样 被低端的只会调包的和吹上天的人毁了。附一个视觉方向的等级对照，大家对号入座Lv0: 概念都不知道只知道吹的Lv0.5: 知道视觉的概念是什么，看过mnist就觉得入门的Lv1: 只会调包用现成算法跟着别人给好的网络瞎调参的Lv2: 开始看西瓜书花书统计学习方法等底层的Lv3: 开始看信号与系统，数字信号处理，知道每一层为什么设计有什么作用的Lv4: 懂得分辨相关论文质量高低，API无法提供功能必须自己动手写底层（工程）知道如何设计loss如何针对性的修改成型网络的Lv5: 熟练掌握诸如cuda之类的底层算法，掌握各大框架底层运行/计算逻辑与步骤，了解每层网络的设计，知道如何针对性的添加新网络使得训练更准确更快，读完数字图像处理的Lv1（及一下）还整天嚷嚷自己掌握了人工智能的就是败坏名声的那一波Lv2算入门，Lv3算正式进入行业Lv4以上可以叫做行业领先的那一拨人了Lv5……………大概是科研中的佼佼者吧", "answer_votes": "120", "answer_comment": "​56 条评论"}
{"answer_author": "铁褥", "answer_id": 248345333, "answer_text": "像我一样既做科研，又懂机器学习，还坚持没把机器学习往科研上套的，应该不多了吧。", "answer_votes": "2", "answer_comment": "​1 条评论"}
{"answer_author": "薛定谔的猫", "answer_id": 105802285, "answer_text": "感觉机器学习更偏向数学专业或者统计学专业..", "answer_votes": "5", "answer_comment": "​添加评论"}
{"answer_author": "李欣", "answer_id": 105951923, "answer_text": "只是门槛降低知识普及了，有些运营岗危险了。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "杉杉来了", "answer_id": 105852235, "answer_text": "我每天喝水吃饭睡觉还要上厕所，我好俗。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "Kani", "answer_id": 240873895, "answer_text": "确实有的人故意把简单的东西说复杂。或者干脆不懂装懂。但机器学习本身是很有用的工具，学这个没毛病。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "曹艺凡", "answer_id": 105858584, "answer_text": "实话实说，我不认为那些微博啊，电视啊，包括知乎上某些人，能搞清楚机器学习到底在干什么。别说什么深度学习神经网络，手推一下SVM的原理我估计这些人都怂了。拉格朗日对偶都不一定讲得清楚。我认识一个EE的哥们天天拿这个朋友圈装逼，问起来原理他却支支吾吾，我一看放心啦，不会和我抢饭碗的。所以啊，做人啊，还是不能图样图森破，上台拿衣服。云计算，大数据，机器学习，讲道理，应该还没彻底发展起来，只是名字先被用烂了而已。外人喊俗俗俗，我们闷声发大财就行了。", "answer_votes": "8", "answer_comment": "​11 条评论"}
{"answer_author": "我是谁我在哪", "answer_id": 105553107, "answer_text": "什么时候技术也分俗不俗了，一种技术或者方法只要它能很好的解决问题，那它就不能算俗，如果一种东西，大家都追着赶着，你也因为受他人的影响去追捧它，但它并不能很好的解决你的问题，那它就是俗的。", "answer_votes": "9", "answer_comment": "​2 条评论"}
{"answer_author": "匿名用户", "answer_id": 105572733, "answer_text": "只是对题目进行补充，我听过的四大俗源自ftiasch，分别是数据挖掘，自然语言处理，云计算和机器学习。可以移步评论区看叉姐本人的解释。", "answer_votes": "6", "answer_comment": "​8 条评论"}
{"answer_author": "云中客", "answer_id": 105803249, "answer_text": "云计算大数据俗是真的，至于你说的编程语言x大浪漫，各种热门编程语言连俗都搭不上，早已烂大街了。机器学习，或者广义的说，数据科学，不论从烂大街程度还是从有用程度来说都绝不会俗，现在不会，将来更不会。烂街程度来说，现在数据科学类研究学习基本集中在各大高校和实验室，远未达到推广至社会各行业的水平，甚至是最先锋的挨踢it领域也只有特大型公司才有数据科学类部门(非传统的数据分析和统计部门)例如bat 360 滴滴之类。数据科学的未来发展是不可限量的。从有用程度来说，学会大数据云计算，能找份好工作，然后每天折磨服务器或者被服务器折磨。学会x大编程语言，能找份好工作，然后每天码代码搬砖折腾那破网站或者app。学会数据科学呢，退一步，在最差的情况下，你也可以用捎带学的python干上面码农的活，除了最差的码农工种，还可以进金融行业做量化分析和交易。这算一般的。最好的情况是什么，你可以用自己学会的数据科学知识分析所有已知和未知领域数据，所有领域！是的，未来数据科学就是会渗透到所有领域。语文数学历史物理政治社会经济，哪个行业不需要分析数据！然后你会得到什么呢，你获得了体察万物运转的能力，搞不好能大彻大悟，成王成圣。这还不够有用吗？那些云计算大数据javaphpiosandroid开发能行吗?这些渣渣有什么资格和数据科学相比呢?", "answer_votes": "8", "answer_comment": "​3 条评论"}
{"answer_author": "岂安科技", "answer_id": 221682315, "answer_text": "在回答这个问题前我想说一句：No matter how far a jackass travels，it won't come back a horse一头驴子无论走多远，回来时都不会变成一匹马。以下，我将从机器学习的正途、机器学习的吸引力、机器学习之踵等几个方面来回答这个问题，GO~-------机器学习1959 年，美国塞缪尔 (Samuel) 设计了一个下棋程序，这个程序具有学习能力，它可以在不断的对弈中改善自己的棋艺。4年后，这个程序战胜了设计者本人。又过了 3 年，这个程序战胜了美国一个保持8年之久的常胜不败的冠军。这个程序向人们展示了机器学习的能力，提出了许多令人深思的社会问题与哲学问题。野望登高而望，满眼皆是机器学习的颠覆 IT 行业的燎原之火，但是事实是否真的如此？至少目前看来，在安全、风控领域，机器学习的势能还远达不到颠覆的效果。机器学习的正途如果我们从机器学习取得不错效果的领域去窥见的话，也许能找到一些思路：无论是语音识别、图片识别、还是 AlphaGO 的应用都有现成的大量的音频、图片、棋谱的样本去训练，而商品推荐、音乐推荐系统这些相对低频的累计用户的正反馈的方式无疑例外的都指出了机器学习的正途无疑是积累样本。<img src=\"https://pic3.zhimg.com/50/v2-cff19202aff6d83b63de81ef0e650aaa_hd.jpg\" data-rawwidth=\"580\" data-rawheight=\"330\" class=\"origin_image zh-lightbox-thumb\" width=\"580\" data-original=\"https://pic3.zhimg.com/v2-cff19202aff6d83b63de81ef0e650aaa_r.jpg\">AlphaGO虽然近年来又有类似 GAN 对抗网络这种非监督式机器学习的兴起，但是也鲜闻有特别成功的商业应用。我们这时总结到: 机器学习重要的东西有三样：样本, 样本, 还是样本(也许我们能在本文中找到第四样)。机器学习的吸引力机器学习为什么如此之火呢？本文不试图管中窥豹，只是简单举个例子，大家可以自行感受。项目来源https://github.com/faizann24/Machine-Learning-based-Password-Strength-Classification/blob/master/script.py训练样本csv 格式:：strength 代表密码强度；0 代表弱；1 代表一般；2 代表强。password,strength\n   kzde5577,1\n   kino3434,1\n   visi7k1yr,1\n   megzy123,1\n   lamborghin1,1\n   AVYq1lDE4MgAZfNt,2\n   u6c8vhow,1\n   v1118714,1\n   universe2908,1\n   as326159,1\n   asv5o9yu,1\n   612035180tok,1\n   jytifok873,1\n   WUt9IZzE0OQ7PkNE,2\n   jerusalem393,1\n   g067057895,1\n   52558000aaa,1\n   idofo673,1\n   6975038lp,1\n   sbl571017,1\n   elyass15@ajilent-ci,2\n   intel1,0\n   klara-tershina3H,2\n   czuodhj972,1\n   faranumar91,1\n   cigicigi123,1\n   0169395484a,1\n   schalke04,1\n   prisonbreak1,1\n   asgaliu11,1\n   gaymaids1,1\n   trabajonet9,1\n   go7kew7a2po,1\n   fk9qi21m,1\n   memjan123,1\n   lsdlsd1,0\n   exitos2009,1\n   fahad123,1\n   kswa2mrv,1\n   yitbos77,1\n   juliel009,1\n   pHyqueDIyNQ8vmhb,2\n这里只是 TF-IDF 算法找到低词频的密码字符段，然后做个简单的逻辑回归，就在样本量不大的情况下获得了 81% 准确率的密码强度检测模型。然后我们找到了这么一篇介绍如何检测恶意 URL[1] 的机器学习文章, 相同的算法，只是不同的样本, 现在就连一个程序员都不差了。机器学习之踵《Outside the Closed World:On Using Machine Learning For Network Intrusion Detection》[2] 该论文比较详细的分析了机器学习为什么没有在安全监测方面取得广泛应用的原因, 有兴趣的童鞋可以移步到文末‘引用’处去细读，如果你放弃了，那么我们就直接看看下面的总结吧。机器学习是寻找相似性，没有足够多的恶意访问、攻击的样本，无从训练。分类错误的成本很高，且一般实际应用的良好准确率的模型都是 *黑盒* ， *无法解释* 、*无法人工干预* 。网络监控到实际的检测对象之间的抽象成本，即比如说一个撞库活动与底层网络信息通讯之间的对应关系有一个抽象、翻译的难度。(虽然这篇不是广告，但是有一句话我还是要讲一下，笔者参与的 Warden 业务风控系统，自己搞了一套通过配置的流量、日志解析成业务事件的组件，虽然不甚完美，但是我们还是做到了)所以坊间甚嚣尘上的机器学习的传闻是多么美好，我们凑近一看，其实还是镜花水月，所以大部分愿意使用机器学习的公司基本都是拿机器学习的结果当做参考，最终还是要靠人的判断。但是上文似乎给机器学习在安全、风控领域应用的前景扣上了不容乐观的帽子，但是故事肯定不会就这么结束，因为十年前当我们断言人工智能是遥不可及、围棋是人类最后且唯一的堡垒的时候也是这么言之凿凿的。<img src=\"https://pic2.zhimg.com/50/v2-afd36f7dbd11b53b048444bccf1a5e08_hd.jpg\" data-rawwidth=\"600\" data-rawheight=\"337\" class=\"origin_image zh-lightbox-thumb\" width=\"600\" data-original=\"https://pic2.zhimg.com/v2-afd36f7dbd11b53b048444bccf1a5e08_r.jpg\">双刃剑已然出鞘McAfee 的 2017 威胁预测报告中[3] 就提到了一起利用机器学习来进行诈骗引起 FBI 调查的案例，如前所说机器学习是学习样本中的相似性，这个案例中就利用推荐系统类似的原理，通过收集到的大量基于人的社交媒体的行为数据，去筛选出容易诈骗的对象。举个几个实际的例子: 如果你经常在微博、脸书上上传你开箱亚马逊的包裹、你就会被标记为一个亚马逊的忠实会员、然后偶尔发一个伪造亚马逊推广的邮件给你。如果你的 Instagram 上发布了一张你去亚马逊的照片，这时候你很有可能处于经常联系不上的情况，这时候发一个诈骗的邮件或者消息给你的家人。上述的例子可以套用到生活中的任何场景去，是不是有点细思极恐呢？当我们使用机器学习这个新工具还不利索的时候，实际上攻方已经用的很欢了。实践中匍匐前进一、基于提取文本的源数据和结构去检测恶意文件原文出自《Malicious PDF Detection Using Metadata and Structural Features》[4] ，所述的恶意文件样本来自于 http://contagiodump.blogspot.com/2010/08/malicious-documents-archive-for.html 提取特征之后使用随机森林得到了一个 99% 准确率，0.01% 的假误报率的分类模型。结论：还是传统的靠积累恶意样本的正途。二、检测基于 DGA 算法的恶意软件的趋势原文出自 《Detecting the Rise of DGA-Based Malware》[5] ，关于 DGA 算法的简要说明是：DGA 就是恶意程序去动态生成域名去与控制端通讯的域名生成算法。数据来源于北美的网络供应商的真实 DNS 请求。首先用聚类的算法尝试将这些编造的域名和请求这些编造的域名的机器分组，再用将生成的模式跟已知的 DGA 算法对比，去发现新的 DGA 变种，成功找到了已知算法之外另一半的未知实现。结论：传统路数之外的思路。三、Tensorflow样本谁都想要，但是你们都得给我，这也许就是 Google 为什么开源 Tensorflow 的最重要的原因吧。结论：思路的正确使用方式。---------说到思路, Google 是不缺的，之前 Google 的图片验证码服务 reCAPCHA 经常使用街景里面识别不出来的门牌号来作为验证码，可爱的用户不自觉的情况下已经不知道无偿的做了多少次分析师了。也许有一句话叫天道有轮回比较适合接下来的剧情：街景团队升级了机器学习的算法，世人称之为深度学习， 然后自家的图片识别完了，感觉不错，顺手测了一下之前帮忙识别的 reCAPCHA 组的验证码，结果准确率很不错: 99.8%。于是，现在 Google 的 reCAPCHA 服务已经停了。引用[1] http://www.kdnuggets.com/2016/10/machine-learning-detect-malicious-urls.html[2] http://www.icir.org/robin/papers/oakland10-ml.pdf[3] https://www.mcafee.com/us/resources/reports/rp-threats-predictions-2017.pdf?clickid=UPuyCF3l6QMNyNnWCy3kw0xtUkhwZeSmTWRaVY0&lqmcat=Affiliate:IR:null:74047:10078:10078:null&sharedid=[4] http://cs.gmu.edu/~tr-admin/papers/GMU-CS-TR-2012-5.pdf[5] http://www.covert.io/research-papers/security/From%20throw-away%20traffic%20to%20bots%20-%20detecting%20the%20rise%20of%20dga-based%20malware.pdf", "answer_votes": "7", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 105715850, "answer_text": "这是Machine Learning在知乎被黑的最惨的一次…", "answer_votes": "7", "answer_comment": "​添加评论"}
{"answer_author": "断线人偶", "answer_id": 105788154, "answer_text": "逼乎装逼果然名不虚传，学个东西还要看看俗不俗，在做各位有几个能把web前端弄好的？", "answer_votes": "8", "answer_comment": "​3 条评论"}
{"answer_author": "知乎用户", "answer_id": 105771662, "answer_text": "其实，ML在最近比较火，火的东西当然有人想从里面获得自己的利益，所以各大高校理所应当的认为自己的计算机学院可以开这么一个专业，殊不知自己的学院老师有没有这方面的经验，只是按照正常的计算机的学院专业的科目去教，ML只涉及基本面，所以很多学生出来说自己是ML专业的，但懂的很皮毛的时候，大家就很怀疑这个学科，这个专业。其实这个专业是多个学科的交叉科学，学好并不容易。在这方面，南京大学计算机科学与技术学院的周志华教授应该是这个行业的领军与权威人物。推荐周教授今年出的一本书介绍机器学习的《机器学习》，里面适合初学者与有经验者都可。", "answer_votes": "4", "answer_comment": "​3 条评论"}
{"answer_author": "知乎用户", "answer_id": 248488631, "answer_text": "AI这东西，那我一个金融从业人员的角度看：假AI骗钱真AI要命", "answer_votes": "3", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 106163537, "answer_text": "MDZZ，这些亘古不变，基本性的东西你不学，学个几年就过期的应用技术，简直舍本求末，所以机器学习技术本身是不俗的。至于云计算，大数据不就是分布式，统计学，数据挖掘等基础性学科换了个名字吗？从这个层面讲，那些歪曲事实的人真的俗！", "answer_votes": "3", "answer_comment": "​添加评论"}
{"answer_author": "强黄", "answer_id": 105831867, "answer_text": "俗，我不能准确地描述这个字，但是我知道它有个条件，凡事可以称得上俗的，门槛都很低。那么用这个准则来评估机器学习是否俗，答案显然是否定的。机器学习是计算机科学中门槛最高的一类技术，一方面要求智力，一方面要求时间，所以注定是少数人的专利。少数人是相对于总人口或者所有从事计算机技术的工程师或科研人员来说的；但是相对于其门槛，这人数又是相当多的，为什么？因为它创造了非常大的价值，因为它巨大的潜力，因为它融合了数学，计算机科学以及生物学的美（逼格高）。那么为何让人有俗的感觉？因为媒体热炒，因为他们并不清楚现在离人工智能还有多遥远，以为马上要到了，集体高潮。一些理工男用来忽悠小妹。还有一些程序员知道点皮毛，会用别人的工具，就在外面大肆吹牛，例如回答中就有个人简单地把“机器学习”等同于“凸函数优化”，还去嘲笑别人。。。所以：学习/研究/深层次使用 机器学习 并不俗。鼓吹夸大机器学习很俗。半吊子技术就在外面轻浮机器学习也很俗。", "answer_votes": "3", "answer_comment": "​1 条评论"}
{"answer_author": "匿名用户", "answer_id": 105802488, "answer_text": "你们这些人除了整体在知乎装逼还会干嘛，这个俗，那个俗，没看出来你们有多高大上，", "answer_votes": "3", "answer_comment": "​1 条评论"}
{"answer_author": "handlesoul", "answer_id": 105600649, "answer_text": "机器学习严格意义上讲是个交叉学科吧，而且大数据时代的到来给机器学习的发展起到了促进作用，但我一直觉得机器学习入门门槛还是挺高的，比如我已经在入门的门槛那里磨蹭了很久了（逃", "answer_votes": "3", "answer_comment": "​1 条评论"}
{"answer_author": "Chen Qian", "answer_id": 222184368, "answer_text": "机器学习，云计算，大数据，四大俗还少一个，要不就物联网？我心中的四大浪漫是数理逻辑，操作系统，编译原理，计算几何[呲牙]", "answer_votes": "2", "answer_comment": "​2 条评论"}
{"answer_author": "复制粘贴工程师", "answer_id": 241131153, "answer_text": "     2015年大一的时候很无聊，想找个方向学点东西，然后下学期末看了本书，叫奇点临近。那个时候只是对人工智能稍微感点兴趣，心里又觉得这是个很难很复杂的领域，对于其它没有更多的了解了，都不知道机器学习，深度学习这个概念，也不知道这个东西现在会这么火。然后，大二的时候，买了本书，机器学习实战，说实话那个时候对机器学习没有太多的了解，更不知道会火，就稀里糊涂开始学起来。然后，大二下学期，虽然那个时候已经知道机器学习里面有深度学习那么一个概念，也就是大二上学期的时候，有尝试过学习，无奈，理论基本看不懂，而且框架的门槛高。但是突然一下大二下学期，tf开始火起来，keras开始流行，资料越来越多，就学了一下，还别说，学的有点懂了。那个时候只是想了解一下，也不晓得说深度学习这玩意现在也这么火……或许这就是缘分，老天指引我跟随潮流？呵呵，话说回来，或许我就是让机器学习变俗的那么多人中的一个吧。个人觉得，学机器学习，任何人都可以学，但是不要太虚了。见过挺多人的，py都没学，直接用tf跑栗子，说实话我挺看不起这种人，凑热度凑到这种程度。虽然我学历水平低，但我好歹从py,基础数学，机器学习，深度学习，一步一步搞起来的啊，即使这样，我也不敢说我水平多行啊（实际上真的不行(▼皿▼#)），我也不会去说人工智能怎么怎么样，要改变世界了，呵呵。最后认下错，我就是那种让机器学习变俗的人。&lt;img src=\"https://pic4.zhimg.com/50/v2-d17f70bffa0d21c4c16f028cbef3f2e1_hd.jpg\" data-rawwidth=\"480\" data-rawheight=\"676\" class=\"origin_image zh-lightbox-thumb\" width=\"480\" data-original=\"https://pic4.zhimg.com/v2-d17f70bffa0d21c4c16f028cbef3f2e1_r.jpg\"&gt;", "answer_votes": "1", "answer_comment": "​1 条评论"}
{"answer_author": "刘小胖LF", "answer_id": 201530203, "answer_text": "看到这个问题忽然想起一句广告词，“不是每一瓶牛奶都叫特仑苏”现实生活中有这么样的几个情景1.某日一个在一个ML交流讨论群，有一个人说自己做了5年的程序员（不知道在哪里工作，他自己说是用java的），觉得自己对机器学习十分感兴趣，然后就开始说起了支持向量机等（只是说这些词语，没有深入的去聊），当时正想问其他小伙伴某公式推导的问题，然后就被这个程序员伙伴说了一句“这些推导没什么用，会用公式就好了”。当时看到这句话，差点气的吐血。（后来因为群里变成了各种闲聊，就退了）现在无论是什么行业的人只要了解了一些内容或者利用模板做了一些东西，就敢说自己是机器学习方面了的，还说自己感兴趣，但是一谈到其中的原理就什么都不懂。就像好多连《经济学原理》的人说：“我没去经济专业太遗憾了，我真的是特别喜欢经济专业”。2.现在打开浏览器，各种培训班，在线教育都是“零基础学习机器学习”“人工智能30天特训”“XX速成班”，我对那种“几个月就能成为人工智能工程师”的这种培训也真的是佩服。3.国家鼓励创业，本来是件很好的事，随之，各种创业比赛，互联网+比赛开始兴起。然后经常就有那种关于“基于XXXX人脸识别系统XX”“XXXX云计算...”“XXXX人工智能XXXX”的创业计划，写的真是没有实现不了的事。这种比赛初衷还是很好的，大学生参加比赛也能得到一定的锻炼，可是这种现象从校园到社会真的是越来越多.总的来说，就机器学习本身来说并不俗，那些研究机器学习的学者们真的很令我崇拜！而且机器学习也不仅仅是计算机专业的，应该是多个专业交叉形成的学科。之所以让人觉得俗，就是因为自从火起来之后，各行各业的人就想往里进，然而知其然并不知其所以然。日前机器学习还是在发展中，很多领域的问题也都还没有解决，看到知乎上各种大神的帖子以及一些论文，感觉这个方向是很有难度的，自己也是这个方向的准研究生，仍然处于入门阶段，时常来知乎上看看各位大神的帖子，也是很有收获。“不是每一瓶牛奶都叫特仑苏”", "answer_votes": "1", "answer_comment": "​1 条评论"}
{"answer_author": "王haha", "answer_id": 106016662, "answer_text": "个人认为 机器学习不属于计算机专业 把它分类到统计学更合适. 计算机在机器学习里的角色仅仅是一个工具而已. ", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "闹闹向前冲", "answer_id": 105882728, "answer_text": "如果只想借助机器学习做跳板，只为大发文章，这个时候就是俗的。但是要真的想研究明白，弄透彻，这时应该是不俗的，毕竟ML没有那么简单，单单分类算法就有好多，更不用说聚类关联分析神马的了。。。", "answer_votes": "1", "answer_comment": "​添加评论"}
