{"question_id": "48597252", "question_text": "看到复旦大学版本的 在复旦大学搅基是怎样一番体验？ - 男同性恋 , 想起自己在武大这四年面基的经历和对武大基圈的了解, 想要看看武大的大家有没有什么经历可以分享一下", "question_title": "在武汉大学搅基是怎样一番体验?", "question_commet": "​3 条评论", "answer_number": "57 个回答", "question_followers": "336", "brower_number": "213,465"}
{"answer_author": "小苏打Lucien", "answer_id": 136942615, "answer_text": "已毕业的本直男讲几个流传在武大坊间的故事，有的是道听途说，有的是自己经历。故事一：在学校寝室还没有装热水的时候，冬天洗澡是一件非常麻烦的事情。校园本部只有桂园、湖滨、枫园三个澡堂，所以大部分人洗澡还是要去澡堂洗。于是，有人曾经看到过在枫园澡堂洗澡的时候，有两个男生边洗澡边玩亲亲。这件事情后来被人人网疯狂转载。我也曾听好基友说到过在桂园澡堂发生的事情。有天A君傍晚去桂园澡堂，那时候已经临近澡堂关门，所以澡堂的人并不是很多，A君去洗澡洗到一半的时候，发现有一对男生在角落里做一些不可描述的事情，A君正在懵逼之际，澡堂的大爷开始催人出澡堂，当澡堂大爷发现那对男生的时候，大爷说了一句话：”这位同学，你莫要欺负那位同学撒“听完这句话的A君几乎是用尽自己浑身的力气不让自己当场笑出来。故事二：数统院曾经有一个gay，是一只美丽的花蝴蝶（以下简称”花蝴蝶“），就是不论我淋的《舞娘》在哪响起来都能旋转跳跃闭着眼的那种。花蝴蝶有一个男朋友是生科的，这个生科的小哥平时也是挺优秀且低调的一个人，当时武大gay圈的很多可人儿们都不是特别明白凭什么花蝴蝶能吸到这么优质的乌干达而自己只能独自在双人床solo哭泣。花蝴蝶特别粘人，粘人的程度已经到了基本上男朋友在哪，他就跟到哪。花蝴蝶没课的时候总会一大早就回跑到男朋友在的寝室，跟着男朋友一起上课吃饭什么的。。后来，花蝴蝶去男朋友寝室次数太多，寝室楼管问他”你哪个寝室的？怎么天天来？”花蝴蝶义正言辞的跟楼管说：“我来找我老公！”画面简直不要太美。有一次，花蝴蝶的男朋友代表生科院打排球赛，花蝴蝶必然也在现场，然而就是这样一个公共场合，花蝴蝶涂上了最美的卡姿兰，戴上了美羊羊发卡旋转跳跃地边加油，边大声喊“老公加油！\"很多人问过生科男：为什么不跟他分手。生科男答曰：”甩不掉好嘛！！！“终于他们毕业的时候，生科男读研去了外校，花蝴蝶保研留在了本校，两人的感情才最终结束。也不知道生科小哥此后会有怎样的阴影。故事三：本直男还在学校的时候，有次从校医院那边往梅园方向走，走到通往梅5后面那条路和梅2分岔路口的时候，刚好看到俩男生牵着手从珞珈山上下来，其中一个男生看到我要立马把手松开，但例外一个死活不肯松手，仍然淡定自若的往前走，于是就有这样一个画面：一男生牵着另外一男生的手走在学校的路上，走在前面的男生走得大气豪迈，被牵着的那个男生频频回头作惊恐状。不知道是故事还是吐槽的“故事四”：本直男所在的文学院，几乎每一级都至少有一个gay。而且武大校风自由，学子对性取向的态度都比较开明，使得武大乃至文院的男生gay比例越来越高。但凡在武大，只要穿着看起来比较潮的男生十有八九都会姐妹相认。更不要提那种涂上了卡姿兰的花蝴蝶了。反正我知道15级文艺学研究生的男生里，只有一个男的是直男。（比心）———————————————————————————没想到收获了这么多的反响，大家对文艺学15级研究生唯一直男表示了强烈的关注，唯一的研究生直男表示受宠若惊，并发表声明：还有一个从某东南亚国家来的也是直男。感谢这位东南亚友邦，让15级文艺学研究生直男的比例从1/3提高到了50% ！", "answer_votes": "247", "answer_comment": "​169 条评论"}
{"answer_author": "陆离", "answer_id": 137102918, "answer_text": "我是某院曾经三大基佬之首/doge然而我是个直男/doge/doge/doge------------------------------------------------------------------------------今天知道一个新词：弯仔码头。没错就是我不如来讲讲三大基佬的故事作为资深非癌变直男，许多年前我曾经有三位非常铁的大学好友，还在烧烤夜市上许下了十年之约。然后，某一天其中两只告诉我他们脱单了。我穷举了敝院莺莺燕燕竟然连其中一个人的对象都没猜中…那个时候，我还以为同性恋只存在于高中看过的断背山。然后，发现不过是左手右手边各有一个基佬。深厚的革命友谊并没有因为最好的两个朋友在一起了而终止。那几年，我们依然一起上课占最好的座位然后睡觉、一起庆祝生日、在放寒假的最后一天跑到一个宿舍里啃鸭脖子喝啤酒……要说体验，和基佬在一起的生活并没有什么不同。最大的困扰是经常会有好事者煞有介事的跑来问我，他俩真的是那个吗？一开始，我会很认真的替这两位解释，然后这些人兴奋的跑开。眼神告诉我，他们难以想象自己身边居然会有两个基佬，这是一件多么不可思议的事情。不仅仅在几年前，即使放在今天，基佬都会是身边人的谈资，sometimes还可以拿来嘲笑。后来，我拒绝理会这些好事的看客。这两位，以及另一位普通话都嗦不利索的同学，陪我走过了整个大学青春。我们一起走过江滩，啃过鸭脖，登过老图。这一对突然出现的情侣，除了让我知道什么原来还有这么多基佬外，也让我对同性恋以及其他亚文化圈有了更多的理解和认同。如果以后，我的孩子告诉我他是LGBT，我也会理解。谁让你爹当年是三大基佬呢…", "answer_votes": "39", "answer_comment": "​11 条评论"}
{"answer_author": "匿名用户", "answer_id": 137121831, "answer_text": "谢……谢邀……        讲道理，作为gay在武大其实脱单的几率海事比较高的，也不知道是什么原因（大概是缘分吧），我一个大一的萌新怎么进到大学就脱单了呢（虽然之前单身十七年(:3_ヽ)_），而且还是学长……诶呀好羞羞。最开始见面是在计院，然而我们两个人的院都离计院很远，所以也不知道是怎么一回事就在那里面基了(*´▽｀*)        之后就是一起吃个必胜客，然后就慢慢都没有那么拘谨了，然后都觉得喜欢对方，然后就在一起啦。        其实两个人相处也就是那样，也没有什么过于疯狂的事情，就相当于是简简单单地过个小日子什么的吧。一起吃个饭，一起看个电影，再看个书什么的。       哦多了说到自习，男朋友很幸运是个学霸，然后几个月以来真的试了很多武大里面的自习场所：教一，教三，教四，教五，总图，信图，青楼，计院，然后梅园Costa，校门星巴克，然后有一次在万林珞珈咖啡一口气自习了七个小时，然后期末之前我和他，一个肝思修一个肝毛概肝了十二个小时……要是我成了学霸真的要感谢我的男朋友(┌・ω・)┌✧谢谢惹        一起看的电影也是很有特点，什么《从你的全世界路过》，什么《你的名字。》，每次看出来都哭得稀里哗啦的（两个人，嗯，两个人），结果真的就成为了爱情的催化剂啦。所以网上宣传说《你的名字。》增进情侣感情，诚不欺我（虽然是异性恋www）。          跟男票一起去旅游也是很大的。有一天一下午暴走了江汉路武汉美术馆武汉科技馆汉口江滩一路到黎黄陂路再沿着中山大道走回到江汉路。整个下来人都要虚脱了。(╯' - ')╯(┻━┻         两个人平时也会送一点小礼物什么的，十月的时候走那个什么模特，男朋友都经常照顾着我。之后我们俩的生日都是年末，都吃了蛋糕，结果他给我选的蛋糕和我给他选的蛋糕是一毛一样的！！！默契啊！！！        所以其实这种爱情就是这样啦。男票貌似不是很喜欢交到（或者其实想交也交不到）基友什么的。我认得的倒比较多，但也还没到进入武大gay圈的地步。所以掌故了解也不是很多。但是感觉一个协会里面大佬很多的样子。嗯。        然后感觉其实幸福的情侣都是相似的，想脱单的其实机会也蛮大的，嗯。*☼*―――――*☼*―――――        之后说一点题外话。        其实工学部貌似1是蛮多的，但是据说，注意是据说！！！质量并不是特别高（如果不是也不要打我www）所以如果能找到一个文理的攻那简直是捡到宝一样的事情。然后好像经管，哲院gay率比较高，我也不知道为什么。特别是哲院。。。。。至于文院……其实文院大直男貌似真的很多……但是gay倒也有。        呃，信部的貌似质量就还高些。嗯，但是医学部真的不知道，不要说我歧视医学部哈……        最后感谢那位写了很多地点的大佬，我当时和我男票真的就按图索骥O(-人-)O1、情人坡（真的很老套了……）2、樱顶（尤其是樱顶原来的樱园餐厅后面那条路上面，晚上去是坠吼的）3、宋卿南边的小林子（但是通透性比较好，感觉挺刺激的）4、珞珈山5、人文馆后面6、蝶宫旁边（那里氛围有点恐怖hhh）7、弘毅大道南边的居民区8、信图旁边有三个雕像的小花园9、信操（这个是最刺激的啦）嗯，一百天了，但还要继续努力。就酱。", "answer_votes": "22", "answer_comment": "​19 条评论"}
{"answer_author": "潘安仁", "answer_id": 140074735, "answer_text": "被异性恋虐完又被同性恋虐！", "answer_votes": "11", "answer_comment": "​5 条评论"}
{"answer_author": "匿名用户", "answer_id": 137203229, "answer_text": "谢邀。这个问题回答起来就有点久远了，我现在已经毕业了，为了隐私隐去入学年份。主要讲一下故事的梗概好了，现在已经分开了，但是两个人是和平分手，现在也是好朋友。细节什么的最后补充吧。————————————————————————————————————————高考之后的那个暑假。我们院大一的新生群里。我当时用得手机是诺基亚N85，他也是（下面叫他P君）。我也就对他多了一份关注。他也是个活跃分子，群里一喊爆照，我就隔空喊他。最后干脆加好友私聊要。那时逛他的qq空间，有很多和漂亮女孩子的合影，心里翻了个白眼：“直男吧”。不过也就算是认识了。入学了之后，我早早就到了武汉。他是武汉人，所以来的晚一点。他到学校就在群里面喊了一嗓子。那时候还在刚入学的兴奋感中，想都没想地直接给他发消息：“你在哪个宿舍，我来看你”很快他就回复了我，我就按照宿舍号找了过去。那个画面我记得很清楚：他坐在宿舍的椅背上，一只脚搭在椅子上，一只脚搭在地上，边晃着椅子，一边在跟别人聊天。记不太清是跟他室友还是跟他的班主任，总之大概是有些局促的。我直接跟他讲，“嗨，你是***吧，我是群里的那谁。”他见了我更局促了，大概也是因为有生人，他很冷漠地回了一句“哦，你就是呀，你好”。之后就没有再理我了，而是继续跟别人聊天，我也就讪讪地回去了。因为也是十分单纯地见个面，更何况我以为他是直男，所以我也就没太在意这件事。（不过后来一起回忆的时候，他还告诉我他记得那天我穿了一件红色的短袖格子衬衫，他也一直说，怎么会有人就这么直接冲过来见他，太不可思议了）一转眼就到了十一，一个学姐叫了几个朋友一起去江汉路逛街，他也去。集合地点是Happy站台，那时还没有地铁，他是本地人，他就在电话里给我指路。他是个空间感很强的人，仿佛他脑子里有地图一样，我一说身边的环境，他就立马知道我在什么位置。在哪里下，哪里有标志物，怎么拐怎么走。我顺着他的远程遥控就跟大部队汇合了。沿着江汉路一直逛到了中山大道天桥那里。他就像个小孩子一样跳来跳去地试一家店里面的卡通的帽子，我那时候才觉得这个可爱的他才是他本来的样子。那之后就熟悉起来了，经常一起玩。不过也难免会有摩擦。这里要介绍另外两个人，Y君和L君，都是直男。有一天我和他还有Y在就某个事情争论，而他和Y明显是站在一边的。我就很傲娇地跑掉了。晚上他给我发短信，大致道了个歉，然后说要不要出来走走。我们从德仁广场走到星湖小树林。走心地聊了很多东西，我也表达了那段时间对他和Y走的比较近的些许不满，当然还是以直男的口吻。既然有了嫉妒之情，大概他也是可以感受到些什么的。熟悉星湖小树林的同学应该知道那里有个小亭子。我们最后就躺在亭子下面的坡上聊天。那时候也很冷了，躺了一会两个人就把腿叠到了一起。那时候脑子突然闪了一个疯狂的念头，也没有考虑，就突然一个翻身，翻到了他身上，说：“亲一下吧，就一下”他没做声，我就也没管三七二十一，直接就亲了一口他的嘴，他也没有躲开。然后就是陷入了一片沉默……但是也能感觉到他心跳的很快。不过也是有点尴尬，没多一会两个人就拍拍土回了宿舍。在之后两个人的关系就彻底从纯爱转向了奇怪的定位。经常做一些不可描述的事。至于感情，仿佛就停滞不前了。不过这之后我才慢慢觉察到，他好像是喜欢上了Y君。暑假之后的那个五一。他和Y君还有几个朋友一起去某小镇旅游去了，在路上Y君和同行的一个妹子有了好感，于是秀了他一路的恩爱。他们打车回武大的时候那天下雨，他下车伞都没打好直接扑过来给我一个超级大的拥抱，好像受了天大的委屈一样，一路上也不停给我讲Ｙ君的事情。这件事之后不超过一周，Y君就和一起旅游的妹子确立了关系。确立关系那天他心情down到不行。就约我出来聊天。虽然我已经懒得在他喜欢Y这件事上再给他什么安慰，但是还是答应了他。坐在青楼背面操场的台阶上面，听着他的心事，但是我也听得越来越闹心。最后我跟他讲：“我不想再参与到你们的事情里了，只是还是会关心你，但是我也想过好自己的生活”然后他就突然回过头来，看着我，好像一下子就懂了什么然后就一下子抱着我，就开始带着哭腔说“不要离开我…不要离开我…”当时我也是一时间有点没缓过来，就没说话，不一会来了一个朋友正好找他有事，就把他叫走了。那天我心情也是五味杂陈的。当天晚上他就又把我叫到走廊里，说有问题要问我。我满心狐疑的过去了，没想到是这样的问题等着我：“你到底对我什么感觉”。“……我很想关心你、照顾你，有时候会嫉妒，有时候又会吃醋，我也不知道这算什么感觉”。“那就是喜欢我咯”“我也不知道这算不算喜欢，反正可能是有感觉吧”“那这些不就是喜欢吗”我这时候已经被他问的面红耳赤了，只想尽快结束对话：“好好，那就是喜欢你了”仿佛终于听到了他想听到的答案，他用一种似笑非笑地眼神看着我“那明天见咯，晚安”我回宿舍之后还是久久处在一个懵逼的状态。。但是我以为他是为了满足他的虚荣心才来向我问这个答案，所以也就没有想太多。", "answer_votes": "25", "answer_comment": "​24 条评论"}
{"answer_author": "试试能不能改名", "answer_id": 115919100, "answer_text": "年轻人的世界，我们不懂了……", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 115577195, "answer_text": "谢邀这种问题我怎么能不回答呢？来自一个工学部文理学部混血的boy。。。毕业狗，来自工学部和文理学部的混血，可是最好的好基友一半以上都是信部的也是蜜汁神奇。（遥感和测绘  ）初中知道自己是基佬到现在也有快十年了，在武大只谈过一个男朋友。大三下的时候，小蓝勾搭上加了好友，后来隔了半年才发现原来对方是单身啊，慢慢勾搭上在一起，不过最后也就两个月吧分开了。 我认识的基友可以分为两类认识的朋友有一天知道是gay了变成基友因为对方是gay认识的基友自己有时拎不清，又是一个泰迪，大部分真正的好基友都是第一类的，在大一大二认识的。作为目前最大的同性社交app，艾滋蓝给了同学们快速结识好基友的平台，然而你在宿舍呆久了会发现刷来刷去还是老面孔，只有每年开学、樱花季、周末上双学位的时候才能看到新的姐妹。工学部特别多那种健身身材特别好的汉子，工学部的男人有种独特的荷尔蒙，让你欲罢不能，工学部的1的比例估计也是全校最高。城设、电气出富帅，水院出学霸，动机和土建？？？黑人问号脸。湖滨重灾区，基窝，认识一半的基佬都是湖滨出身，湖滨出骚受，打开软件如果不筛选的话100米之内够你翻好几页了，好基友亲自示范证明湖9 11 13是重灾区，他去湖滨宿舍不知道去了多少次，每次都吃饱心满意足的回去。新图附近永远是那些人，天天在新图自习我自己都看烦了，不过神奇的是所有在图书馆聊过的人无论最后怎么样都没有见过面。医学部不了解，不过我认识的每个基佬都有一个医学部的好姐妹。信部感觉蛮乱的，我信部基友自己说的，谈过唯一一个男朋友是测绘的小学弟。总体来说：个人认为文院、外院；新传、城设；动机、测绘、计院挺多的前者在于比例高、后者在于数量大、中间属于比例高数量大，哈哈哈哈哈。其实武大是蛮自由的比如校某传被称为“基窝”，都不是我自己说的，他们CEO都这么说，我认识了新的gay第一句话问他你是某传的么，不能说百发百中，至少说是的人也有两位数。比如以前有过一个XX协会，正常的校内招新然后过了一年多才发现里面的男生60%都是基佬（数据不准确但是真的是这样啊，我就是那个社团里的）。又比如和不同的人出去吃饭聊到最后的八卦又是某男某男在一起过，某女某女在一起过，还有某男和某女在一起过。当年在教四204开同性恋讲座的时候那人山人海（照片被我删了）身边一个全出柜的男生发票圈说：辅导员问他为什么要自己洗衣服而不去找个对象替他洗。在武大真的才发现很多优秀的人都是gay，人们对少数群体总会有更高的评价标准，不论是个人能力还是道德水平。很多gay真的各方面都是很优秀，我认识了很多人他们有的会做学生工作，有的是学霸精英科研大牛，有的是文艺天才声动武大，我不会因为他是gay认识他，但会因为他是gay而更喜欢他。好了，为学弟学妹们推荐点地方：晚上宋卿南边树林那里的石凳变形金刚18楼西侧卫生间（绝佳夕阳位置，炸了炸了已经）世纪广场（我同学说的我没亲测过）晚上珞珈山环山路和山上樱顶信息学部网球场北边花园人文馆的阴暗角落（这是我同学碰到的，被吓一跳，没有亲测过）晚上工操南边家属楼一楼夹层（这个超刺激）", "answer_votes": "21", "answer_comment": "​36 条评论"}
{"answer_author": "匿名用户", "answer_id": 171674233, "answer_text": "据说自强是同性恋交由社团？", "answer_votes": "1", "answer_comment": "​2 条评论"}
{"answer_author": "UIUC", "answer_id": 117381658, "answer_text": "&lt;img src=\"https://pic4.zhimg.com/50/c48c7035618aefe4bdf9cff281a52807_hd.jpg\" data-rawwidth=\"900\" data-rawheight=\"940\" class=\"origin_image zh-lightbox-thumb\" width=\"900\" data-original=\"https://pic4.zhimg.com/c48c7035618aefe4bdf9cff281a52807_r.jpg\"&gt;讲道理，没上大学前，一直听说上了大学会有很多基佬。然而在武大读了那么久，却没有看到哪怕是一对基佬，可能我来错学校了，估计隔壁华科会比较多基佬。", "answer_votes": "6", "answer_comment": "​15 条评论"}
{"answer_author": "匿名用户", "answer_id": 138121571, "answer_text": "离开武大十年了那还是个用着诺基亚，发彩信很贵，小贩大妈在桂圆食堂门口卖着充话费卡的年代还是武昌火车站一团糟，谨记着做564去火车站的时代寝室里都是农村来的，有的连电脑开机都不会，而我那时连qq是什么都不知道，然后大家一起约着去网吧注册126邮箱。。。现在想想真是前世今生，那真是个魔幻现实主义的时代第一次，在门口的“天一网吧”知道了“百度”，从百度知道了何为同性恋，第一次看到了男人俊美的身体。。。那时候还有“教堂路西街”。。。那时候很纯，也因为深知自己的理想抱负，所以只能努力学习。。后来到了快毕业，终于想着要不见见在武大的gay吧唯二的办法，一是武大gay的qq群，一是百度武大贴吧，还记得武大贴吧里一个严肃讨论同性恋的学术帖子。。于是见了一些人，月黑风高之夜，在鲲鹏广场的樱花小石桌前，在教5旁的羽毛球场地上，在国立武汉大学的牌坊下，在图书馆一楼的石凳上。。。真真是谈理想，聊人生，太清纯了当时后悔没一上大学就找个bf，可以在桂圆操场的石台阶上一起浪漫的牵着手看月亮。。后来毕业了，出国了，记得最后一天离开武汉的时候，忍不住在地堡酒吧门口站了很久，最后还是没有进去，因为那里不属于自己。所以地堡里啥样至今是我这十几年来的迷。。到了海外其实自己才真正踏进同志的圈子，几经波折，欢笑与泪水，现在居然也结婚了。曾经做梦有今天的日子，而我今天又怀念过去的清纯。。武大时期让我明确了自己的性取向，却遗憾从未有半点朦胧的小爱情，或许有一点点吧。至今想起来，曾经的同志们，大家如那些花儿飘散，今在何方呢？", "answer_votes": "11", "answer_comment": "​11 条评论"}
{"answer_author": "匿名用户", "answer_id": 116377676, "answer_text": "好久没关注这个答案了。今天莫名多出了好几个赞，晚上下自习回来顺便更一下吧。今天是12月22日。分享一下最近遇到的一些奇怪的事情。一周前大概，在小蓝上面碰到一个人要互换照片，因为聊了一段了，也是校友，我想了想就答应了。然后就把照片给人发过去了，结果我等了一会儿发现没有回，我就发了一条过去。发现已经被对方拉黑。好吧，不好意思长得太丑恶心到别人了hhhhh，但是麻烦说好的互换呢，日了狗了。哎，很难过。此处答主需要一波安慰这两天，和同栋宿舍楼的一个经管院的同学聊天，也是小蓝上面认识的。但是，该同学我非常反感的一点是这个人不讲真话。前后矛盾的话讲过几次了。而且，既然是聊天，就是互相讲一些东西，但是这个同学对我以前的事情非常感兴趣，但是每次我想问问同样的问题他怎么怎么样的时候，他就莫名其妙岔开话题或者干脆不回。有一次也是这样，他问我，我答完，我再问他的时候，他就又莫名其妙消失了，然后一个小时以后该名同学发了一条空间。我蛮生气，不晓得你们碰到这种事情会不会生气，其实如果你觉得不合适或者怎么样你大可以说出来，或者你觉得你不想提你过去的事情麻烦也说一下，但是话题既然是你提出来的，你就应该考虑到跟你互动的人是一个什么样的心态，我觉得就这样丢着别人让别人等回复是一件非常没有礼貌的事情，一句“有事回聊”耽误不了多少时间。我之前一直觉得找本校的学生至少不至于碰到一些因为素质问题而导致的不愉快，现在两个事情经历下来，我觉得还是不要认为是自己学校的人就可能素质特别高或者怎么样，其实丢到人堆里素质差不多。该恶心到自己的还是恶心到自己了。本来答主心态挺好的一个人，那天就被这个事情搞得有点不舒服。已经大三了，感觉答主大学是没什么戏了，有没有勇士想拯救一波答主的。答主生活自理喜欢旅游有主见可卖萌可捏脸捏肚子肉阿喂买不了吃亏买不了上当阿！！！===============以下原答案，略有修改=========（就是不一样长，强迫症来打我呀~）小透明强答一发。由于知乎上有熟人互相关注，匿了。胡乱写写，没有逻辑。目前还是处于深柜状态，周围同学虽然开玩笑说XXX（我）个死基佬，但是也不会真的认为我是个基佬。大概是活得太糙了，“基佬没个基佬样”hhhhhhh由于不混圈，上面说贵武基圈比较乱看得也不是太懂。之前一直是属于一两周把小蓝软件下下来看看有没有人戳（大部分情况下没有），然后顺便看看有没有熟人之类的就删掉。大一的时候曾经发现隔壁班学委是基佬，震惊了许久。在学校目前面过三个基佬，第一个面的人是测绘的。聊天的时候觉得奇奇怪怪的，就是那种你抛出一些正常聊天的梗，然后他听不懂，听不懂，听不懂。。然后正好有一天正好在图书馆自习，他也在，图个新鲜，就约一下一起走回来。走回来的时候发现这个人除了聊天的时候诡异，见面的时候也很诡异啊，我自己认为自己平常也是个挺逗比的人啊，但是跟他回来这一路真是全身尴尬病啊。之后线上聊不来的就基本上拒绝见面了，科科。第二个面了一个国软的，见面之前聊得挺开心，见面之后就冷漠脸了，大概是我长太丑了，丑拒（此时应心疼答主，丑逼不配拥有基友hhhh）。第三个是一个理工的，还挺聊得来的，不过也一段时间不联系了。原来一直是很抗拒不撸帝或者Aloha这类软件的，后来想想作为一个深柜单身二十多年的基佬，好像除此之外也没有别的什么途径寻觅到同道中人，认识一些人，聊得来就做个朋友，聊不来就放那。兴许哪天还能钓到一个男票，想想还有点小激动（星星眼）现在还在放暑假，打开小蓝软件，还是能发现周围基佬的密度真的是很高。开学以后简直难以想象。所以不要再黑基科了，你武也很基。健身去了。", "answer_votes": "9", "answer_comment": "​7 条评论"}
{"answer_author": "匿名用户", "answer_id": 116328210, "answer_text": "毕业党不邀自来。先报情况，答主脸3分，身高最多1分，身材大概0.5分，平均分就给个1.5分好了。刚来武大的时候特别天真，想着不能辜负青春，一定要在樱花树下谈一场刻苦铭心的恋爱。然而第一次面基就让我怀疑人生。对方是信部的研究生，在小蓝上聊了一周后觉得三观很合于是约在门口豪客来见面。学长脸最多1分（脸很大，一脸痘还有点秃），身高比我高小半个头就4分吧，身材很瘦 最多2分，总分2.333分。。然而2333学长一见到我就说，我觉得你长的至少会还不错的！！！至少会还不错！！！当时觉得长的丑特别对不起学长，所以没有再出来吓过人。", "answer_votes": "8", "answer_comment": "​7 条评论"}
{"answer_author": "匿名用户", "answer_id": 137097719, "answer_text": "无边落樱潇潇下, 不尽菊花朵朵来.武大慕龙阳,金莲守空房.如问西门君,他在盼二郎.", "answer_votes": "6", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 122327523, "answer_text": "呃。。在变形金刚的某一层厕所打过炮，嗯，就是教师节炸掉的那栋楼  然后，在老斋舍的某棵樱花树下接过吻，就昨天晚上，在樱顶的某个小角落里完成了肉体的交流。不行，得匿", "answer_votes": "6", "answer_comment": "​7 条评论"}
{"answer_author": "匿名用户", "answer_id": 115588986, "answer_text": "目测将会出现在华科搅基是一种什么体验在同济搅基是一种什么体验在交大搅基是一种什么体验在清华搅基是一种什么体验在北大搅基是一种什么体验等一系列问题…对此，我只能说：无可奉告！！！&lt;img data-rawwidth=\"839\" data-rawheight=\"534\" src=\"https://pic4.zhimg.com/50/e5a6b915a18274a69e0273f28fb9e829_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"839\" data-original=\"https://pic4.zhimg.com/e5a6b915a18274a69e0273f28fb9e829_r.jpg\"&gt;", "answer_votes": "5", "answer_comment": "​4 条评论"}
{"answer_author": "匿名用户", "answer_id": 137200674, "answer_text": "我不知道搅基是怎样的体验，只知道有次看完模特大赛，在梅操和同学兴奋讨论哪个男生帅，哪个身材好，最后选出了四个最好的回宿舍后跟室友说，室友作为武大艺术圈的，掌握个中内幕，不屑的对我说，你可真会挑哟，他们四个个个都是gay，其中✘✘和✘✘还是一对呢我: ⊙▽⊙ (ฅ>ω<*ฅ) (ಥ_ಥ)", "answer_votes": "5", "answer_comment": "​3 条评论"}
{"answer_author": "Sheeran Lee", "answer_id": 137369318, "answer_text": "不匿（也说不定）咦。这样不就相当于变相出柜了么。好了，我曾是上面某传某两届的副主席（后来被离职嘤嘤嘤，舍不得小鲜肉们）我只是想说某传其实真的蛮多的。某传几个老人家都亲切的称之为基传，so，可想而知。。。我有几个好哥们（姐妹？）都是在某传认识的，觉得能在这里认识辣么多有趣的好基友真的是三生有幸（算不算变相为某传打广告？）其实好像涉及到传媒什么的，基佬就会比较多了。和对面某师的基友聊天，他说他们的某传也是一样的泛滥好吗～原来我很不情愿来读武大，但现在我很庆幸我在这个自由的地方，遇见了那么多好朋友，也遇见了到现在为止我唯一喜欢的人（捂脸跑开）。", "answer_votes": "4", "answer_comment": "​18 条评论"}
{"answer_author": "小猴子", "answer_id": 117231492, "answer_text": "还期待开学能遇见爱情，看了此问题，感觉希望减少了。", "answer_votes": "4", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 112742833, "answer_text": "贵圈真刺激，暗中观察&lt;img src=\"https://pic2.zhimg.com/50/v2-961a35f5b6cc4986a677d092393b13f7_hd.jpg\" data-rawwidth=\"1080\" data-rawheight=\"1734\" class=\"origin_image zh-lightbox-thumb\" width=\"1080\" data-original=\"https://pic2.zhimg.com/v2-961a35f5b6cc4986a677d092393b13f7_r.jpg\"&gt;", "answer_votes": "4", "answer_comment": "​4 条评论"}
{"answer_author": "匿名用户", "answer_id": 245472842, "answer_text": "被本科班上的同学掰弯，也有可能以前就是弯的，觉醒太晚。本科和研究生都在武大，都在号称女男比例1:7的工学部。然而，这并没有对我处对象有什么帮助，只不过跟顺眼的直男很好勾搭(可能工学部屌丝气息浓厚，大家闹一闹很正常)。开始的时候是大二，记得是一天下午四五点，我去他宿舍找他一起去上本部的建筑与音乐选修课，他正在玩电脑，我就凑到电脑屏幕前面看他玩，结果......猝不及防的被他亲了一下脸颊，我一脸懵B的看着他，他就笑着看着我。那时候竟然什么感觉也没有，立马问他去不去上选修课，他说不去，我就自己去上选修课了！！！！然后回来他说他也不知道当时怎么了，就亲上去了。我当时当作什么也没发生，因为本身心里不反感，当然也没有心动的感觉。之后我们之间的关系越来越好，一起上课，一起吃饭，一起在图书馆占位子自习；一起到本部医学院那里去排队买包子；一起去珞珈山上散步；其中，很多时候其实是三个或四个人（这当时在工学部是常态）。到大二寒假我回家晚了几天，室友把他女朋友带到宿舍，直到宿舍关门，他女朋友还在，我就知道他们晚上可能要在宿舍过夜了。现在想想我真是模范好室友，为了不打扰我室友的春宵一刻，我就去他宿舍找他玩，结果他宿舍也只有他一个人，他正在看电影，我就搬了个凳子在旁边看，到晚上实在困得不行，他说就在他床上一起睡吧！我就......答应了。宿舍的床很小，我就直挺挺的躺着，一点也不动，但是也睡不着。他躺在我旁边，也不动，但是我也感觉的到，他也没睡着。正打算熬到熬不下去自然睡着的，他突然侧身抱住我，然后手开始下滑（后面是黄文，不多说....）,其实也就摸了一下，然后累不过就相拥睡着了。后面关系就升温了，一起上课时坐在一起，我一只手做笔记，一只手插在他外套口袋里取暖；会在上完选修课回来的路上共一把伞，在工部大道的雨夜中接吻；会在宿舍大家都在的时候，共坐一张椅子看电影；会在各自回家后每天都发短信。但也就止于此，并没有涉及到那一步。一直到大三，我记得我们在东湖边散步的时候，他说，到以后，我们想起来这段关系，不知道怎么去看现在的自己。我当时并没有给我们的关系下一个定义，也并没有意识到我们之间是伴侣的关系，只不过在情感上，其实已经依附于另一个人了。再后来，也许是认识到这条路并不会长久，他逐渐的变得冷淡，大三下学期谈了一个外地的女朋友，比他小几岁。当时虽然心里非常难过，但是我并不认为他有什么错，毕竟我们之间也并没有确定的关系，只不过是“玩得好的朋友”。加上那时候要准备考研，每天去自习，他准备直接工作，每天在宿舍，也并没有很多的共同话题。直到大四下学期快毕业，我做完毕业设计，在导师的实验室看论文，他突然打我电话，约我出去逛街吃饭，当时导师要求紧，加上心里也没有很想去，就拒绝了。他毕业之后，在我读研期间，他回校，请我们在校的同学吃饭，他变得成熟了很多，只是依然不喝酒，吃完饭，他笑着和我道别，那次之后就再也没见过了。后来，听说他换了工作，听说他又辞职自己出来单干，今年，听说他结婚了，是大学谈的那个女朋友。他的方向很明确，这未尝不是一件好事。正如他所说，不知道以后回想起那一段的经历，我们应当如何看待，或者就像现在这样，当作从未发生过。", "answer_votes": "3", "answer_comment": "​添加评论"}
{"answer_author": "江楼月", "answer_id": 143149808, "answer_text": "心疼外院妹子&lt;img src=\"https://pic4.zhimg.com/50/v2-2a70784098b990d147c093a12377292c_hd.jpg\" data-rawwidth=\"819\" data-rawheight=\"1015\" class=\"origin_image zh-lightbox-thumb\" width=\"819\" data-original=\"https://pic4.zhimg.com/v2-2a70784098b990d147c093a12377292c_r.jpg\"&gt;", "answer_votes": "3", "answer_comment": "​添加评论"}
{"answer_author": "听小神瞳讲故事", "answer_id": 137229394, "answer_text": "我是直女啊！但是自从高中莫名奇妙和一个gay成情敌后，我接下来的人生总是有各种各样的明确gay和潜在gay出现啊！why me!! maybe之前一直在时尚圈实习摸爬滚打，参加个品牌活动就有好几个疑似gay的小伙伴加我微信找我聊天，so……～见怪不怪了……但是回到题目本身，我武的确定gay我这七年我只认识一个，但是大三后就没有联系……至于潜在gay属性的，宝宝我总不能直接张口问吧！所以我心里有一长串这样的名单……&lt;img src=\"https://pic4.zhimg.com/50/v2-7f2dad3b14a3adc74e1b799c8b2cec7b_hd.jpg\" data-rawwidth=\"191\" data-rawheight=\"198\" class=\"content_image\" width=\"191\"&gt;你说说你们！！干嘛要跟我抢男人！！忘记当年跟我喝过的酒打过的麻将炸过的金花飙过的车逛过的街吃过的肉啦！&lt;img src=\"https://pic3.zhimg.com/50/v2-1c94a37389cbedeb9bc8c37758c6a870_hd.jpg\" data-rawwidth=\"198\" data-rawheight=\"198\" class=\"content_image\" width=\"198\"&gt;宝宝我就是不匿名，哼ヽ(≧Д≦)ノ刚入知乎，万一有看到这篇回答后微信私我的宝宝们，乃们就是不打自招，嗯哼→_→姐姐我会好好疼你们的", "answer_votes": "3", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 118095888, "answer_text": "我是题主, 我觉得武大真是小, 这个回答下面提到的某传是我待了四年的社团, 还有某兰是我大学里面关系非常好的一个学妹, 在我毕业两年后依然有很多联络. 国软是我本科就读的学院(已在帝都读研).我觉得我真的很不努力惹, 真心没想到呆了四年的社团竟然是个基窝, 而我一个都没发现, 可能是我所在的部门(现在应该是新媒体部了吧)大家都是直男吧. 我认识的基佬中, 最多的是经管, 测绘, 遥感这些学院的. 新来的学弟们, 你们要好好努力, 不要最后像我一样什么都没谈就结束了", "answer_votes": "3", "answer_comment": "​4 条评论"}
{"answer_author": "匿名用户", "answer_id": 144180624, "answer_text": "看完各位骚鸡们的回答，我也坐不住了，答一发。去年双十一的时候，某校媒统计我武的比例在13%，然而个人觉得可能更多。很多人谈到的校级组织某传我没呆过，我在的是校内几大学生组织之一的某组织（具体哪个就不说了反正校内大的组织各位慢慢猜吧）。就我的了解来看，该组织某一届部长团六位男部长中，除开两位铁直以外，另外四位.....都是。并且还出现过某三位部长之间a喜欢过b，b和c在一起过的神奇三角恋？至于那一届的主席团，我一直觉得也不是很直，摊手。另外呆过的社团就是我武非常出名的辩论队了。辩圈有多少姐妹大家看一下他们的比赛应该能迅速发现。骚的贱的温文尔雅的会撒娇的有肌肉的，站起来高呼女性权利大清已亡的，应该就是了。至于什么新闻政管信管院之类的，哈哈哈哈微笑。在辩论队认识了多少姐妹我就不详谈了反正挺多的。不过我所在的人数超多的某院，虽然传闻很多，然而我真的是没发现多少，除了我院人尽皆知的名媛们，说实话我在上课什么的时候发现的挺少的，也可能是答主上课比较认真？希望我院同好联系一下我蟹蟹。感觉上文理学部比较容易发现，毕竟受比较多，软的美的潮的爱发自拍的一眼可以看出来。反而工学部的传闻的一很多，表示真的看不出来。可能正是因为这样，答主脱不了单（也可能是丑，嗯）。我所在的湖滨，由于常年聚集着文史哲新闻外院啥的，感觉的确是重灾区。去年某天晚上突发奇想从凌波门出去散步，东湖旁简直是一对又一对骚鸡在黑暗中缠绵。至于是怎样的体验嘛，反正环境很开放就是了。感觉校内包容度的确是很高，之前谈到的某校媒双十一还统计校内同性情侣状况可见一斑。我个人属于半出柜状态，身边有一些看破不说破的同学什么的，有时候和他们谈起这些，感觉也没啥。之前有一个男票，看见有一个某传副主席小哥哥答这个题，我还一直自己以前拔得他们专业的独苗哈哈哈哈哈。（希望你们班毕业的时候互相探探口风，结果可能让你大吃一惊）。反正谈恋爱的时候，校内的那些曲径回廊差不多都去过。后来反正不是很喜欢，就散了。现在处于空窗期，准备下个学期开始健身，到时候去骚波大的。先这样吧，想到再答，匿了～", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 141538882, "answer_text": "又用了一个学期的手哭哭", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "Gavin", "answer_id": 139434636, "answer_text": "信部大二狗。今天是我和男票在一起一年零三个月的日子。不算长。但这是异地一年零三个月的纪念日。武汉——上海，生活着两个浙江人。想回杭州，那里有我们太多的故事。一座生长着森林，又发达进步的城市。从高三寒假认识，我们一起走过高考。因为当时没有打算在一起，异地了，追悔莫及。感谢一年多来他对我的包容和理解，作为一个脾气不好的1。我会用接下来的岁月陪伴、保护他。两个人很用心很坚持地经营一份感情，只要肯多忍多做一点点，天下有情人都会成眷属。也可以说我是站着说话不嫌腰疼。毕竟我们也经过了很多很多的磨合，到现在我们坚定了一生在一起的信念。虽然我们还得异地两年，然而，一生都是对方的，我们不在乎了。我们都很拼命学习，计划是毕业后一起去英国读书，以后还要有我们的家。没有强大的经济基础，何来摆脱父母的生活。这些所有的规划最来之不易的基础就是信任和忠诚，也确定了我们一生的羁绊。异地的好处也许就是：每一次见面爱情还是那么新鲜，但同时我们还发展了责任感家庭感忠诚度——我猜就是那份不是说断就能断的亲情吧。福利小黄文：出于对爱人的忠贞和感情的坚持，我们在干羞羞的事情的时候从来没有用过保护措施（物理性损伤会小心的嘻嘻），身体安全很重要，但我们想要真正的交合。PS：虽然我不是颜狗，但我男票颜值很高", "answer_votes": "2", "answer_comment": "​26 条评论"}
{"answer_author": "匿名用户", "answer_id": 137119736, "answer_text": "半夜睡不着跑过来更新其实我只想默默说一句，我武貌似挺多直男也喜欢跟基佬玩暧昧啊，具体最后有没有发生什么 那我就不知道了，反正据说挺刺激的——————分割线——————表示在医学部生活了四年的基佬好像错过了脱单的最好时机_(:з)∠)_...对，沉迷实习实验所以默默单身了四年。虽然据说医村的基友很多，但每天上完课实习完横跨整个东湖上完选修课回来，谁特么还有力气勾汉纸啊(╯‵□′)╯︵┻━┻然后看到楼上一个个秀恩爱好生羡慕默默举起火把准备天亮后上街烧人儿玩   ---更新---常常感叹世界就是这么小hhhhhhh 还有为啥男神都是弯的，这让妹纸们怎么过hhhhhh", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "张天爱", "answer_id": 122200816, "answer_text": "可以认识经管系同学吗，直男", "answer_votes": "2", "answer_comment": "​3 条评论"}
{"answer_author": "攻心", "answer_id": 157720031, "answer_text": "在武汉大学怎么搅基？明明都是姐妹吧。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 144871844, "answer_text": "我只想说，夏天不要在珞珈山上干什么，那蚊子多的能把你抬走。不要问我怎么知道的。", "answer_votes": "1", "answer_comment": "​1 条评论"}
{"answer_author": "杨逸忺", "answer_id": 140135635, "answer_text": "八月长安夜正长何人对镜贴花黄九舍亲友如想问莫道锋哥是女郎", "answer_votes": "1", "answer_comment": "​1 条评论"}
{"answer_author": "匿名用户", "answer_id": 139087876, "answer_text": "那天和朋友去工学部，看到一对男的手牵手从诺大的篮球场走过，球场上还有非常多的男生在打篮球，勇气可嘉，这真的是我第一次在武大看到gay这么正大光明地秀恩爱，虽然其中一个男生实在太娘了，但……祝福啊……是我朋友跟我说知乎的这条帖子的，他也许会看到，匿了吧。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "藤子", "answer_id": 137725842, "answer_text": "哈哈哈哈在空间看到这个问题跑过来把回答看完了Ծ ̮ Ծ怎么说呢来武大一年半了没约过炮谈过一次恋爱算不算及格呢(´･ᆺ･`)开始煮饭( ˙-˙ )大概是在大一上的时候单身十八年的我脱单了，对象是化院的Ծ ̮ Ծ过程就不详述了反正最后因为他太忙或者是信部文理异地恋？？？（医村哭了）然后就break up了，因为是初恋所以总是很伤感啊〒_〒但由于加了好多校会的人老是能看到他的动态以及在表白墙上看到(╯‵□′)╯︵┻━┻导致我那段时间极其抑郁感觉自己过得没他好？？(´･ᆺ･`)所以生平第一次注册了小蓝，然而……我从不和人打招呼_(:з」∠)_信部的基大概研究生占一大半但我本人不是很能接受这么大的(ˉ▽￣～)所以基本都是草草应付，真正聊过的就一两个，因为基友在湖滨，所以偶然聊起发现湖滨真的是基窝啊~~~（信村人羡慕捂脸(*/ω＼*)）因为自己不怎么混圈所以什么什么名基花花蝴蝶也只是大致了解（毕竟酒吧都没去过(*/ω＼*)）之前加了武大的基群也没怎么发过言_(:з」∠)_大概这就是注孤生的原因吧Ծ‸ Ծ 另外，信部戴眼镜的帅哥好多啊(*/ω＼*)差不多写完了~~待续~毕竟还有两年半的故事啊´∀`", "answer_votes": "1", "answer_comment": "​19 条评论"}
{"answer_author": "匿名用户", "answer_id": 137202922, "answer_text": "华中渴基大学的每次都要去武大约气哭…", "answer_votes": "1", "answer_comment": "​5 条评论"}
{"answer_author": "匿名用户", "answer_id": 137158262, "answer_text": "那时候湖滨楠竹苑还没有填水泥，晚上11点多的时候从凌波门那个小门儿钻进来，走到楠竹苑，听到了丛竹深处某种悦耳的呻吟，。。。哇哦(*´∀｀)ノ。。", "answer_votes": "1", "answer_comment": "​1 条评论"}
{"answer_author": "Isabella", "answer_id": 117267296, "answer_text": "信部如果有想搅姬的妹子，请联系我工学部太远了，不约，文理学部勉强可以，医村也可以顶锅盖逃~", "answer_votes": "1", "answer_comment": "​20 条评论"}
{"answer_author": "范海杰杰杰", "answer_id": 137776435, "answer_text": "咦 以前竟然没发现有这个问题 其实上面有人说武大没几个基佬的 我表示非常不赞同 在宿舍打开软件100米内的就有20-30个 不过大多数是丑B或约炮的或者无头尸本人本科时在武大谈过2个校内的男票哎那个时候的爱情真的好单纯另外楼上说的那些秘密的小场所我大概只去过两三个吧有机会去其他地方看看（羞羞脸）好了我只是随便看看顺便找个男朋友的（比心）", "answer_votes": "1", "answer_comment": "​2 条评论"}
{"answer_author": "匿名用户", "answer_id": 286357576, "answer_text": "武大本科大一新生，不请自来。在高考成绩出来的时候，看了和我成绩差不多适应的大学，便开始收集各个学校的“信息”，当然，暑假的时候也看到了知乎的这个问题，更加坚定了我来武大的决心。然后呢，武大的确也没有让我失望哈，国庆期间，一方面是我自身努力，另一方面也是由于机缘巧合啦，竟然加入了武大的一个LGBT社团，哈哈哈哈，从此打开了新世界的大门。打住，其实加入这个社团并没有想象中那么美好啦。你们能想象社团第一次面基突然看到同班级直女的尴尬吗？而且突然发现社团里这样的直女真不少orz，当时我的内心→_→不过后来也渐渐和社团里面的人熟了，尴尬也消除了不少，不过有女生在场的话还是不敢放飞自我#^_^总之加入这个社团有三个月了吧，还是没有完成校内脱单，却不知道为什么变得没有开学之初那么急切了。每次都喜欢用在社团学到的话去教育身边的小gay们，更喜欢他们的那一副“你才大一啊”的表情。", "answer_votes": "0", "answer_comment": "​添加评论"}
