{"question_id": "49096941", "question_text": "我比较喜欢描写人的还有景物的。带文学典故是最好的。------题主目前在美国上学，所以你们说的考试范围内的，题主是不会知道是什么的。", "question_title": "有哪些古诗词是值得背下来的？", "question_commet": "​27 条评论", "answer_number": "1,059 个回答", "question_followers": "27,749", "brower_number": "2,135,993"}
{"answer_author": "楚云卿", "answer_id": 115572930, "answer_text": "我就推荐一下我自己背过的吧，宋词我背下来207首，唐诗大概也是两百多首左右，但我今天不推荐唐诗宋词之类的。我推荐诗经乐府歌辞：------------------------------------------------------------《诗经•郑风•野有蔓草》野有蔓草，零露漙兮。有美一人，清扬婉兮。邂逅相遇，适我愿兮。野有蔓草，零露瀼瀼。有美一人，婉如清扬。邂逅相遇，与子偕臧。后世的朱熹说它是淫奔之诗，我一万个不服。明明思无邪。也许他有他的评判标准，不过，作为一名后继儒者，是在打先圣孔子的脸，因为孔子说过：“诗三百，一言以蔽之，思无邪！”孔子编撰诗三百时，就是剔除了各种所谓“有伤风俗”的诗歌的，不然不会说“思无邪”，什么是思无邪？那就是在客观上是色而不淫，哀而不伤，是诗人真性情的表达。孔子是儒家的鼻祖，朱熹的思想可以说一直是饱受诟病的，我也是不认同他的学说的。而且他是站在他的理论上去看。而且别忘了，野有蔓草这首诗的年代是周朝，在周朝，当然是行周礼。《周礼》规定：“仲春之月，令会男女。于是时也，奔者不禁。若无故而不用令者，罚之。司男女之无夫家者而会之。”在那个年代，你要是超龄还没结婚，就是可以自由私会，自由同居。你要是年龄到了，还一直不结婚，不生子女，你还要受到处罚。传统节日踏青也是由此而来。----------------------------------------------------------------------《诗经•小雅·采薇》采薇采薇，薇亦作止。曰归曰归，岁亦莫止。靡室靡家，猃狁之故。不遑启居，猃狁之故。采薇采薇，薇亦柔止。曰归曰归，心亦忧止。 忧心烈烈，载饥载渴。我戍未定，靡使归聘。采薇采薇，薇亦刚止。曰归曰归，岁亦阳止。 王事靡盬，不遑启处。忧心孔疚，我行不来！彼尔维何？维常之华。彼路斯何？君子之车。 戎车既驾，四牡业业。岂敢定居？一月三捷。驾彼四牡，四牡骙骙。君子所依，小人所腓。 四牡翼翼，象弭鱼服。岂不日戒？猃狁孔棘！昔我往矣，杨柳依依。今我来思，雨雪霏霏。 行道迟迟，载渴载饥。我心伤悲，莫知我哀！诗三百里，最爱之一便是采薇。HITA根据“采薇”改编的歌曲当初也是极喜欢听的：雪欲来的时候，又烫一壶酒，将寂寞，绵长入口。大寒夜，山那头，彤云出岫，小炉边，那首歌谣不经意被写就。白露前，麦未熟，恰是初秋，约临走，将柴扉轻叩。岭上霜红也浸透了眼眸，那首歌，哽在喉，沉默不忍回头。“卿尚小，共采薇，风欲暖，初成蕊，问离人，山中四季流转又几岁？卿初嫁，独采薇，露尚稀，叶已翠，问征人，何处望乡一枯一葳蕤？”雨未停的时节，煎茶试新叶，让光阴，杯中交叠。茅檐下，水如泻，沾衣未觉，研开墨，芒种刚过，歌写至下半阙。春分后，花未谢，尚可采撷，却低首，问是耶非耶？枝上残香也覆盖了眼睫，谁和着那首歌，刚吟罢的第一节。“卿尚小，共采薇，风欲暖，初成蕊，问离人，山中四季流转又几岁？卿初嫁，独采薇，露尚稀，叶已翠，问征人，何处望乡一枯一葳蕤？卿已老，忆采薇，草未凋，又抽穗，问斯人，等到野火燃尽胡不归？昔我往，杨柳垂，今我来，雪霏霏----------------------------------------------------------------------《诗经·国风·邶风•绿衣》绿兮衣兮，绿衣黄里。心之忧矣，曷维其已！绿兮衣兮，绿衣黄裳。心之忧矣，曷维其亡！绿兮丝兮，女所治兮。我思古人，俾无訧兮！絺兮绤兮，凄其以风。我思古人，实获我心！都说诗经是古典现实主义文学的源头，悼亡词当如是。后世的元稹、苏轼等人，也有借鉴，绿衣更为真切动人。有人说，这样的诗有什么需要背的？语言这么通俗易懂，我想说的是，诗经不是用来读的，是用来品的，用来感悟和思考。当你真正品悟懂的时候，自然会为诗中潜藏的那些真挚而哀伤的感情所触动。----------------------------------------------------------------------《诗经·国风·卫风•硕人》硕人其颀，衣锦褧衣。齐侯之子，卫侯之妻。东宫之妹，邢侯之姨，谭公维私。手如柔荑，肤如凝脂，领如蝤蛴，齿如瓠犀，螓首蛾眉，巧笑倩兮，美目盼兮。硕人敖敖，说于农郊。四牡有骄，朱幩镳镳。翟茀以朝，大夫夙退，无使君劳。河水洋洋，北流活活。施罛濊濊，鳣鲔发发。葭菼揭揭，庶姜孽孽，庶士有朅。耳熟能详却不可逾越。有人说，别傻了，你诗经背下来有什么用啊。我想说的是，相信我，当你背下来，你不仅可以认识很多生僻字，阅读能力也会提高的。当你无障碍看诗经时，其他古文也没什么问题了。------------------------------------------------------------《诗经•郑风•有女同车》有女同车，颜如舜华。将翱将翔，佩玉琼琚。彼美孟姜，洵美且都。有女同行，颜如舜英，将翱将翔，佩玉将将。彼美孟姜，德音不忘。这是我藏私的一首，尤为喜欢。“有美一人，颜如舜华。”现在的人表白啊，说情话动不动就是你真美，你好漂亮，古人不知高出多少，而且听起来又是如此音韵婉转。当然，朱熹又说这首也是淫奔之诗，我都懒得反驳了。事实上，在儒家眼里，郑国就是风气淫靡的国家，放在今天，我倒希望这样的“淫奔之诗”流传下来越多越好！------------------------------------------------------------《诗经•国风•蒹葭》蒹葭苍苍，白露为霜。所谓伊人，在水一方，溯洄从之，道阻且长。溯游从之，宛在水中央。蒹葭萋萋，白露未晞。所谓伊人，在水之湄。溯洄从之，道阻且跻。溯游从之，宛在水中坻。蒹葭采采，白露未已。所谓伊人，在水之涘。溯洄从之，道阻且右。溯游从之，宛在水中沚。永远的经典，也是最广为人知的诗歌。但如果你所知只是前面那四句的话，不妨全部背下来。----------------------------------------------------------------------《诗经•国风•子衿》青青子衿，悠悠我心。纵我不往，子宁不嗣音？青青子佩，悠悠我思。纵我不往，子宁不来？挑兮达兮，在城阙兮。一日不见，如三月兮。谁会说司马长卿没有借鉴子衿呢？“一日不见，思之如狂。”？后世曹操所作短歌行，也借用了“子衿”的诗句，相对的，两首都值得一背。对酒当歌，人生几何！譬如朝露，去日苦多。慨当以慷，忧思难忘。何以解忧？唯有杜康。青青子衿，悠悠我心。但为君故，沉吟至今。呦呦鹿鸣，食野之苹。我有嘉宾，鼓瑟吹笙。明明如月，何时可掇？忧从中来，不可断绝。越陌度阡，枉用相存。契阔谈讌，心念旧恩。月明星稀，乌鹊南飞。绕树三匝，何枝可依？山不厌高，海不厌深。周公吐哺，天下归心。我一直在想，为什么这些两千年前的祖先们，能够作出如此语言纯朴简洁、音韵动听又涵蕴深刻的诗歌？----------------------------------------------------------------------《诗经·国风·郑风·风雨》风雨凄凄，鸡鸣喈喈。既见君子，云胡不夷。 　　风雨潇潇，鸡鸣胶胶。既见君子，云胡不瘳。 　　风雨如晦，鸡鸣不已。既见君子，云胡不喜。这首也是大爱，去他的什么淫奔之诗！比之小雅和国风，郑风的诗歌是有着人情温度的，是接近我们的生活，我们能从中很容易感受到这些感情，或真挚、或质朴、或哀婉、或率真、或奔放、或含蓄……------------------------------------------------------------《诗经•国风•桃夭》桃之夭夭，灼灼其华。之子于归，宜其室家。桃之夭夭，有蕡其实。之子于归，宜其家室。桃之夭夭，其叶蓁蓁。之子于归，宜其家人。永不落幕的经典。------------------------------------------------------------《乐府•杂曲歌辞•悲歌》悲歌可以当泣，远望可以当归。思念故乡，郁郁累累。欲归家无人，欲渡河无船。心思不能言，肠中车轮转。------------------------------------------------------------《乐府•杂曲歌辞•冉冉孤生竹》冉冉孤生竹，结根泰山阿。与君为新婚，菟丝附女萝。菟丝生有时，夫妇会有宜。千里远结婚，悠悠隔山陂。思君令人老，轩车来何迟！伤彼蕙兰花，含英扬光辉。过时而不采，将随秋草萎。君亮执高节，贱妾亦何为！------------------------------------------------------------《乐府•杂曲歌辞•青青陵上柏》青青陵上柏，磊磊涧中石。人生天地间，忽如远行客。斗酒相娱乐，聊厚不为薄。驱车策驽马，游戏宛与洛。洛中何郁郁，冠带自相索。长衢罗夹巷，王侯多第宅。两宫遥相望，双阙百馀尺。极宴娱心意，戚戚何所迫？------------------------------------------------------------《乐府•杂曲歌辞•迢迢牵牛星》迢迢牵牛星，皎皎河汉女。纤纤擢素手，札札弄机杼。终日不成章，泣涕零如雨；河汉清且浅，相去复几许！盈盈一水间，脉脉不得语。------------------------------------------------------------以下推荐曹植的几篇乐府辞作：《名都篇》—曹植名都多妖女，京洛出少年。宝剑值千金，被服丽且鲜。斗鸡东郊道，走马长楸间。驰骋未能半，双兔过我前。揽弓捷鸣镝，长驱上南山。左挽因右发，一纵两禽连。余巧未及展，仰手接飞鸢。观者咸称善，众工归我妍。归来宴平乐，美酒斗十千。脍鲤臇胎鰕，炮鳖炙熊蹯。鸣俦啸匹侣，列坐竟长筵。连翩击鞠壤，巧捷惟万端。白日西南驰，光景不可攀。云散还城邑，清晨复来还。------------------------------------------------------------《美女篇》—曹植美女妖且闲，采桑歧路间。柔条纷冉冉，叶落何翩翩。攘袖见素手，皓腕约金环。头上金爵钗，腰佩翠琅玕。明珠交玉体，珊瑚间木难。罗衣何飘飘，轻裾随风还。顾盼遗光彩，长啸气若兰。行徒用息驾，休者以忘餐。借问女安居，乃在城南端。青楼临大路，高门结重关。容华耀朝日，谁不希令颜？媒氏何所营？玉帛不时安。佳人慕高义，求贤良独难。众人徒嗷嗷，安知彼所观？盛年处房室，中夜起长叹。------------------------------------------------------------《白马篇》—曹植白马饰金羁， 连翩西北驰。借问谁家子， 幽并游侠儿。少小去乡邑， 扬声沙漠垂。宿昔秉良弓， 楛矢何参差。控弦破左的，右发摧月支。仰手接飞猱，俯身散马蹄。狡捷过猴猿， 勇剽若豹螭。边城多警急， 胡虏数迁移。羽檄从北来，厉马登高堤。长驱蹈匈奴，左顾陵鲜卑。弃身锋刃端，性命安可怀？父母且不顾，何言子与妻？名编壮士籍，不得中顾私。捐躯赴国难，视死忽如归。古都风情、美人心事、白马少年，背下这三篇，应该写个类似的不难了。------------------------------------------------------------好吧，到了文章了，看到有人推荐我喜欢的“滕王阁序”，那我推荐曹植的洛神赋吧：　黄初三年，余朝京师，还济洛川。古人有言，斯水之神，名曰宓妃。感宋玉对楚王神女之事，遂作斯赋，其词曰：　　余从京域，言归东藩，背伊阙 ，越轘辕，经通谷，陵景山。日既西倾，车殆马烦。尔乃税驾乎蘅皋，秣驷乎芝田，容与乎阳林，流眄乎洛川。于是精移神骇，忽焉思散。俯则未察，仰以殊观。睹一丽人，于岩之畔。乃援御者而告之曰：“尔有觌于彼者乎？彼何人斯，若此之艳也！”御者对曰：“臣闻河洛之神，名曰宓妃。然则君王所见，无乃是乎？其状若何，臣愿闻之。”　　余告之曰：其形也，翩若惊鸿，婉若游龙，荣曜秋菊，华茂春松。髣髴兮若轻云之蔽月，飘飖兮若流风之回雪。远而望之，皎若太阳升朝霞。迫而察之，灼若芙蕖出渌波。秾纤得衷，修短合度。肩若削成，腰如约素。延颈秀项，皓质呈露，芳泽无加，铅华弗御。云髻峨峨，修眉联娟，丹唇外朗，皓齿内鲜。明眸善睐，靥辅承权，瓌姿艳逸，仪静体闲。柔情绰态，媚于语言。奇服旷世，骨像应图。披罗衣之璀粲兮，珥瑶碧之华琚。戴金翠之首饰，缀明珠以耀躯。践远游之文履，曳雾绡之轻裾。微幽兰之芳蔼兮，步踟蹰于山隅。于是忽焉纵体，以遨以嬉。左倚采旄，右荫桂旗。攘皓腕于神浒兮，采湍濑之玄芝。　　余情悦其淑美兮，心振荡而不怡。无良媒以接欢兮，托微波而通辞。愿诚素之先达兮，解玉佩以要之。嗟佳人之信修，羌习礼而明诗。抗琼珶以和予兮，指潜渊而为期。执眷眷之款实兮，惧斯灵之我欺。感交甫之弃言兮，怅犹豫而狐疑。收和颜而静志兮，申礼防以自持。　　于是洛灵感焉，徙倚彷徨。神光离合，乍阴乍阳。竦轻躯以鹤立，若将飞而未翔。践椒涂之郁烈，步蘅薄而流芳。超长吟以永慕兮，声哀厉而弥长。 尔乃众灵杂遝，命俦啸侣。或戏清流，或翔神渚。或采明珠，或拾翠羽。从南湘之二妃，携汉滨之游女。叹匏瓜之无匹兮，咏牵牛之独处。扬轻袿之猗靡兮，翳修袖以延伫。体迅飞凫，飘忽若神。凌波微步，罗袜生尘。动无常则，若危若安。进止难期，若往若还。转眄流精，光润玉颜。含辞未吐，气若幽兰。华容婀娜，令我忘餐。　　于是屏翳收风，川后静波。冯夷鸣鼓，女娲清歌。腾文鱼以警乘，鸣玉鸾以偕逝。六龙俨其齐首，载云车之容裔。鲸鲵踊而夹毂，水禽翔而为卫。于是越北沚，过南冈，纡素领，回清阳，动朱唇以徐言，陈交接之大纲。恨人神之道殊兮，怨盛年之莫当。抗罗袂以掩涕兮，泪流襟之浪浪。悼良会之永绝兮，哀一逝而异乡。无微情以效爱兮，献江南之明珰。虽潜处于太阴，长寄心于君王。忽不悟其所舍，怅神宵而蔽光。　　于是背下陵高，足往神留。遗情想像，顾望怀愁。冀灵体之复形，御轻舟而上溯。浮长川而忘返，思绵绵而增慕。夜耿耿而不寐，沾繁霜而至曙。命仆夫而就驾，吾将归乎东路。揽騑辔以抗策，怅盘桓而不能去。------------------------------------------------------------最后还是要推荐李太白的《大鹏赋》，滕王阁序好背，但大鹏赋不那么容易，我一个星期才背下来。余昔于江陵，见天台司马子微，谓余有仙风道骨，可与神游八极之表。因着大鹏遇希有鸟赋以自广。此赋已传于世，往往人间见之。悔其少作，未穷宏达之旨，中年弃之。及读晋书，睹阮宣子大鹏赞，鄙心陋之。遂更记忆，多将旧本不同。今复存手集，岂敢传诸作者？庶可示之子弟而已。其辞曰：南华老仙，发天机于漆园。吐峥嵘之高论，开浩荡之奇言。征至怪于齐谐，谈北溟之有鱼。吾不知其几千里，其名曰鲲。化成大鹏，质凝胚浑。脱鬐鬣于海岛，张羽毛于天门。刷渤澥之春流，晞扶桑之朝暾。燀赫乎宇宙，凭陵乎昆仑。一鼓一舞，烟朦沙昏。五岳为之震荡，百川为之崩奔。乃蹶厚地，揭太清。亘层霄，突重溟。激三千以崛起，向九万而迅征。背嶪太山之崔嵬，翼举长云之纵横。左回右旋，倏阴忽明。历汗漫以夭矫，羾阊阖之峥嵘。簸鸿蒙，扇雷霆。斗转而天动，山摇而海倾。怒无所搏，雄无所争。固可想象其势，仿佛其形。若乃足萦虹蜺，目耀日月。连轩沓拖，挥霍翕忽。喷气则六合生云，洒毛则千里飞雪。邈彼北荒，将穷南图。运逸翰以傍击，鼓奔飙而长驱。烛龙衔光以照物，列缺施鞭而启途。块视三山，杯观五湖。其动也神应，其行也道俱。任公见之而罢钓，有穷不敢以弯弧。莫不投竿失镞，仰之长吁。尔其雄姿壮观，坱轧河汉。上摩苍苍，下复漫漫。盘古开天而直视，羲和倚日以旁叹。缤纷乎八荒之间，掩映乎四海之半。当胸臆之掩昼，若混茫之未判。忽腾复以回转，则霞廓而雾散。然后六月一息，至于海湄。欻翳景以横翥，逆高天而下垂。憩乎泱漭之野，入乎汪湟之池。猛势所射，馀风所吹。溟涨沸渭，岩峦纷披。天吴为之怵栗，海若为之躨跜。巨鳌冠山而却走，长鲸腾海而下驰。缩壳挫鬣，莫之敢窥。吾亦不测其神怪之若此，盖乃造化之所为。岂比夫蓬莱之黄鹄，夸金衣与菊裳？耻苍梧之玄凤，耀彩质与锦章。既服御于灵仙，久驯扰于池隍。精卫殷勤于衔木，鶢鶋悲愁乎荐觞。天鸡警晓于蟠桃，踆乌晰耀于太阳。不旷荡而纵适，何拘挛而守常？未若兹鹏之逍遥，无厥类乎比方。不矜大而暴猛，每顺时而行藏。参玄根以比寿，饮元气以充肠。戏旸谷而徘徊，冯炎洲而抑扬。俄而希有鸟见谓之曰：伟哉鹏乎，此之乐也。吾右翼掩乎西极，左翼蔽乎东荒。跨蹑地络，周旋天纲。以恍惚为巢，以虚无为场。我呼尔游，尔同我翔。于是乎大鹏许之，欣然相随。此二禽已登于寥廓，而斥鷃之辈，空见笑于藩篱。也许曹植的洛神赋和太白的大鹏赋有点难背，但是我觉得是可以背的。为什么？我提倡的背诵，绝不是死记硬背，就我个人而言，我会先弄懂全文意思，然后脑补出画面，再去背，这样事倍功半。这两篇背下来，然后你可以默写出来，用白话文翻译出来之后。这个时候，古文对你来说，就可自由出入了。------------------------------------------------------------《爱莲说》—周敦颐水陆草木之花，可爱者甚蕃。晋陶渊明独爱菊。自李唐来，世人盛爱牡丹。予独爱莲之出淤泥而不染，濯清涟而不妖，中通外直，不蔓不枝，香远益清，亭亭净植，可远观而不可亵玩焉。　　予谓菊，花之隐逸者也；牡丹，花之富贵者也；莲，花之君子者也。噫！菊之爱，陶后鲜有闻。莲之爱，同予者何人?牡丹之爱，宜乎众矣！这个语文课本上就有，读书时就背下来了。或因吾与周敦颐同属濂溪故里人士，或因也爱莲，总之，这首背下来了就再也没忘过。中国人对莲有独特而深厚的感情，也许并不是每个人都懂“出淤泥而不染”的品性，但文人骚客和普通百姓也同样爱之。乐府《江南》诗云：“江南可采莲，莲叶何田田。”《涉江采芙蓉》诗云：“涉江采芙蓉，兰泽多芳草。采之欲遗谁，所思在远道。”单举例这两首，就能够让我们明白，中国之所以对莲感情如此复杂深厚，是因为跟古人的生活息息相关，古代南方人，尤其是女子，一生中要经常采莲。跟生活很大的相关性，才会有很多人去写。比如采薇、采蘩、采芣苢、采卷耳、采桑等等……------------------------------------------------------------背一篇文章或几首诗有什么用？如果你想要背诵诗词文章来给自己带来什么变化（无论是内在的还是外在的）或提高涵养，那么几首几篇文章都是不行的，大量的背诵才有立竿见影的效果。而且，很多人不知道的是，背诵的内容偏向于什么，最终呈现的效果和影响也不尽相同。我推荐诗经和乐府，是想给人带来一种洗尽浮华的返璞归真。（未完•待更•点赞感谢关注•有更多惊喜·公众号：青云汉文化社）", "answer_votes": "2.4K", "answer_comment": "​175 条评论"}
{"answer_author": "朱夜", "answer_id": 126576255, "answer_text": "《滕王阁序》不知道别人是什么样的，我的大脑很多时候待机画面都是这篇，走路上莫名其妙就燃起来了，加粗部分是我大脑偏爱的句子，它有时候能循环几十遍，烦死我了。豫章故郡，洪都新府。星分翼轸，地接衡庐。襟三江而带五湖，控蛮荆而引瓯越。物华天宝，龙光射牛斗之墟；人杰地灵，徐孺下陈蕃之榻。雄州雾列，俊采星驰。台隍枕夷夏之交，宾主尽东南之美。都督阎公之雅望，棨戟遥临；宇文新州之懿范，襜帷暂驻。十旬休假，胜友如云；千里逢迎，高朋满座。腾蛟起凤，孟学士之词宗；紫电青霜，王将军之武库。家君作宰，路出名区；童子何知，躬逢胜饯。时维九月，序属三秋。潦水尽而寒潭清，烟光凝而暮山紫。俨骖騑于上路，访风景于崇阿。临帝子之长洲，得仙人之旧馆。层台耸翠，上出重霄；飞阁流丹，下临无地。鹤汀凫渚，穷岛屿之萦回；桂殿兰宫，列冈峦之体势。披绣闼，俯雕甍，山原旷其盈视，川泽纡其骇瞩。闾阎扑地，钟鸣鼎食之家；舸舰迷津，青雀黄龙之舳。云销雨霁，彩彻区明。落霞与孤鹜齐飞，秋水共长天一色。渔舟唱晚，响穷彭蠡之滨，雁阵惊寒，声断衡阳之浦。（尤其是这一句）遥吟俯畅，逸兴遄飞。爽籁发而清风生，纤歌凝而白云遏。睢园绿竹，气凌彭泽之樽；邺水朱华，光照临川之笔。四美具，二难并。穷睇眄于中天，极娱游于暇日。天高地迥，觉宇宙之无穷；兴尽悲来，识盈虚之有数。望长安于日下，目吴会于云间。地势极而南溟深，天柱高而北辰远。关山难越，谁悲失路之人；萍水相逢，尽是他乡之客。怀帝阍而不见，奉宣室以何年？嗟乎！时运不齐，命途多舛。冯唐易老，李广难封。屈贾谊于长沙，非无圣主；窜梁鸿于海曲，岂乏明时？所赖君子安贫，达人知命。老当益壮，宁移白首之心？穷且益坚，不坠青云之志。酌贪泉而觉爽，处涸辙以犹欢。北海虽赊，扶摇可接；东隅已逝，桑榆非晚。孟尝高洁，空余报国之情；阮籍猖狂，岂效穷途之哭！勃，三尺微命，一介书生。无路请缨，等终军之弱冠；有怀投笔，慕宗悫之长风。舍簪笏于百龄，奉晨昏于万里。非谢家之宝树，接孟氏之芳邻。他日趋庭，叨陪鲤对；今兹捧袂，喜托龙门。杨意不逢，抚凌云而自惜；钟期既遇，奏流水以何惭？呜乎！胜地不常，盛筵难再；兰亭已矣，梓泽丘墟。临别赠言，幸承恩于伟饯；登高作赋，是所望于群公。敢竭鄙怀，恭疏短引；一言均赋，四韵俱成。请洒潘江，各倾陆海云尔：滕王高阁临江渚，佩玉鸣鸾罢歌舞。画栋朝飞南浦云，珠帘暮卷西山雨。闲云潭影日悠悠，物换星移几度秋。阁中帝子今何在？槛外长江空自流。另外再分享一篇李白的《峨眉山月歌》，这一个多月以来我的大脑似乎比较迷恋这一篇，还老是私自动用图片生成装置偷偷构想画面，我已经快忍不下去了，准备强制性换诗。峨眉山月半轮秋，影入平羌江水流。夜发清溪向三峡，思君不见下渝州。你们是没看到，我大脑里坐着的那个小人每次摇头晃脑背诗的那贱样。", "answer_votes": "1.6K", "answer_comment": "​449 条评论"}
{"answer_author": "楚青箬", "answer_id": 116801809, "answer_text": "鉴于题主在美国，可能以前对诗词接触不多，推荐一下我认为值得背又比较容易背的：诗经和乐府@楚云卿已经详细推荐过，个人认为读诗必不能错过。一：首先是入门级，大家耳熟能详的、名家名篇。除诗经乐府之外，五绝读王维孟浩然，七绝读王昌龄，杜甫七律第一，李白五七言乐府歌行都有仙品。江南.汉乐府江南可采莲，莲叶何田田，鱼戏莲叶间。鱼戏莲叶东，鱼戏莲叶西，鱼戏莲叶南，鱼戏莲叶北。我私心喜欢乐府多于诗经，同有直白淳朴之美，乐府生僻字少，更适合初读者。此首乃幼时大爱，忍不住特别推荐。山中杂诗.吴均山际见来烟，竹中窥落日。鸟向檐上飞，云从窗里出。此山中仙境，神向往否？推荐原因和上一首原因一样，这首诗流传不广，答主幼时诵之，今私爱尤甚。饮酒·其五.陶渊明结庐在人境，而无车马喧。问君何能尔？心远地自偏。采菊东篱下，悠然见南山。山气日夕佳，飞鸟相与还。此中有真意，欲辨已忘言。陶渊明被称为“古今隐逸诗人之宗”，第一位山水田园派诗人，对后世影响颇大。他人骑大马.王梵志他人骑大马，我独跨驴子。回顾担柴汉，心下较些子。唐初白话诗僧，唐代诗人中，寒山、拾得、丰干一路的诗作，直接秉承王梵志衣，而王维、顾况、白居易、皎然等，也或多或少受到他的影响。静夜思.李白床前明月光，疑是地上霜。举头望明月，低头思故乡。把这首诗送给远在美国的题主！月下独酌四首·其一.李白花间一壶酒，独酌无相亲。举杯邀明月，对影成三人。月既不解饮，影徒随我身。暂伴月将影，行乐须及春。我歌月徘徊，我舞影零乱。醒时同交欢，醉后各分散。永结无情游，相期邈云汉。诗才天纵，作为李白脑残粉，其诗之美，我是不敢也说不出来了。望月怀远.张九龄海上生明月，天涯共此时。情人怨遥夜，竟夕起相思。灭烛怜光满，披衣觉露滋。不堪盈手赠，还寝梦佳期。此诗无华美之语无渲染之色，却自带高华浑融的气象，一洗六朝铅华，委婉曲折，情致盎然，浑成自然。江雪 .柳宗元千山鸟飞绝，万径人踪灭。孤舟蓑笠翁，独钓寒江雪。孤独如画，清峭已绝！鸟鸣涧.王维人闲桂花落，夜静春山空。月出惊山鸟，时鸣春涧中。因为“闲”故能欣赏桂花自枝头落下之静美，因为“静”，春山显得更为空寂，所以月亮出来这么无声无息，居然能惊动山鸟。山居秋暝.王维空山新雨后，天气晚来秋。明月松间照，清泉石上流。竹喧归浣女，莲动下渔舟。随意春芳歇，王孙自可留。 “空”一字，渲染出山村的天高云淡，万物空灵，“明月”是静，所以“照”，“清泉”是动，所以“流”。宿建德江 孟浩然移舟泊烟渚，日暮客愁新。野旷天低树，江清月近人。王孟的山水诗都以恬淡著称，如果说王维的淡是运斤成风，绚烂至极归于平淡，孟浩然就是见山是山，见水是水词淡意远，质朴天然。望岳.杜甫岱宗夫如何？齐鲁青未了。造化钟神秀，阴阳割昏晓。荡胸生层云，决眦入归鸟。会当凌绝顶，一览众山小。忧国忧民的杜甫，也是有过一览众山小的激情蓬勃的。登高.杜甫风急天高猿啸哀，渚清沙白鸟飞回。无边落木萧萧下，不尽长江衮衮来。万里悲秋常作客，百年多病独登台。艰难苦恨繁霜鬓，潦倒新停浊酒杯。这首诗历来被认为是杜诗之经典，基本完美体现了诗圣之力。商山早行.温庭筠晨起动征铎，客行悲故乡。鸡声茅店月，人迹板桥霜。槲叶落山路，枳花明驿墙。因思杜陵梦，凫雁满回塘。“鸡声茅店月，人迹板桥霜”一句，“意象叠加”，无一闲字，直接叠加6个名词，鸡声写听觉，人迹写视觉，不见鸡、人，却含于其中，朦胧月色，满地霜华。新添声杨柳枝词二首.其一.温庭筠井底点灯深烛伊，共郎长行莫围棋。玲珑骰子安红豆，入骨相思知不知？“深嘱”、“违期”均用谐音，“入骨”句用骨制的骰子上的红点深入骨内，来隐喻入骨的相思。“入骨”是双关隐语。二、也是比较经典的名家名篇，由于字数较多，不太容易背的。正常如《春江花月夜》、《将进酒》、《长恨歌》、《琵琶行》、三吏三别、《桃花庵歌》，变态如《离骚》、《九歌》、《天问》。短歌行.曹操对酒当歌，人生几何！譬如朝露，去日苦多。慨当以慷，忧思难忘。何以解忧？唯有杜康。青青子衿，悠悠我心。但为君故，沉吟至今。呦呦鹿鸣，食野之苹。我有嘉宾，鼓瑟吹笙。明明如月，何时可掇？忧从中来，不可断绝。越陌度阡，枉用相存。契阔谈讌，心念旧恩。月明星稀，乌鹊南飞。绕树三匝，何枝可依？山不厌高，海不厌深。周公吐哺，天下归心。曹操流传下来的诗大都是乐府诗体，慷慨悲凉的建安风格，在曹操诗里表现得尤为突出。薛道衡.昔昔盐垂柳覆金堤，蘼芜叶复齐。水溢芙蓉沼，花飞桃李蹊。采桑秦氏女，织锦窦家妻。关山别荡子，风月守空闺。恒敛千金笑，长垂双玉啼。盘龙随镜隐，彩凤逐帷低。飞魂同夜鹊，倦寝忆晨鸡。暗牖悬蛛网，空梁落燕泥。前年过代北，今岁往辽西。一去无消息，那能惜马蹄。“空梁”一句，王国维说：妙处在不隔。传说在大业五年（609），薛道衡将要被处死时，隋炀帝问他：“你还能写‘空梁落燕泥’这样的诗句吗？”梦游天姥吟留别 .李白海客谈瀛洲，烟涛微茫信难求；越人语天姥，云霞明灭或可睹。天姥连天向天横，势拔五岳掩赤城。天台四万八千丈，对此欲倒东南倾。我欲因之梦吴越，一夜飞度镜湖月。湖月照我影，送我至剡溪。谢公宿处今尚在，渌水荡漾清猿啼。脚著谢公屐，身登青云梯。半壁见海日，空中闻天鸡。千岩万转路不定，迷花倚石忽已暝。熊咆龙吟殷岩泉，栗深林兮惊层巅。云青青兮欲雨，水澹澹兮生烟。列缺霹雳，丘峦崩摧。洞天石扉，訇然中开。青冥浩荡不见底，日月照耀金银台。霓为衣兮风为马，云之君兮纷纷而来下。虎鼓瑟兮鸾回车，仙之人兮列如麻。忽魂悸以魄动，恍惊起而长嗟。惟觉时之枕席，失向来之烟霞。世间行乐亦如此，古来万事东流水。别君去兮何时还？且放白鹿青崖间。须行即骑访名山。安能摧眉折腰事权贵，使我不得开心颜!这首诗比长恨琵琶之类稍微难一点，但一读就让人不忍释手，这样的诗也只有谪仙人写得出来啊。饮中八仙歌.杜甫知章骑马似乘船，眼花落井水底眠。汝阳三斗始朝天，道逢麹车口流涎，恨不移封向酒泉。左相日兴费万钱，饮如长鲸吸百川，衔杯乐圣称避贤。宗之潇洒美少年，举觞白眼望青天，皎如玉树临风前。苏晋长斋绣佛前，醉中往往爱逃禅。李白一斗诗百篇，长安市上酒家眠。天子呼来不上船，自称臣是酒中仙。张旭三杯草圣传，脱帽露顶王公前，挥毫落纸如云烟。焦遂五斗方卓然，高谈雄辨惊四筵。写八仙，其实就是为了写偶像李白嘛。元好问.颖亭留别故人重分携，临流驻归驾。乾坤展清眺，万景若相借。北风三日雪，太素秉元化。九山郁峥嵘，了不受陵跨。寒波澹澹起，白鸟悠悠下。怀归人自急，物态本闲暇。壶觞负吟啸，尘土足悲咤。回首亭中人，平林淡如画。“寒波”一句，王国维引为“无我之境”代表。答主以为最后一句有严沧浪“起结”之妙。桃花庵歌 .唐寅桃花坞里桃花庵，桃花庵下桃花仙。桃花仙人种桃树，又折花枝当酒钱。酒醒只在花前坐，酒醉还须花下眠。花前花后日复日，酒醉酒醒年复年。不愿鞠躬车马前，但愿老死花酒间。车尘马足贵者趣，酒盏花枝贫者缘。若将富贵比贫贱，一在平地一在天。若将贫贱比车马，他得驱驰我得闲。世人笑我忒疯癫，我笑世人看不穿。记得五陵豪杰墓，无酒无花锄作田。此诗版本较多，但差别不大。三、词。建议从《宋词三百首》入手，然后《花间》、《南唐二主词》、《纳兰》。流传度太广的就不推荐了皇甫松 .梦江南兰烬落，屏上暗红蕉。闲梦江南梅熟日，夜船吹笛雨萧萧。人语驿边桥。温庭筠 .菩萨蛮水精帘里玻璃枕，暖香惹梦鸳鸯锦。江上柳如烟，雁飞残月天。藕丝秋色浅，人胜参差剪。双鬓隔香红，玉钗头上风。飞卿诗词双绝，诗清丽而词华美，为花间派鼻祖。更漏子.温庭筠玉炉香，红蜡泪，偏照画堂秋思。眉翠薄，鬓云残，夜长衾枕寒。梧桐树，三更雨，不道离情正苦。一叶叶，一声声，空阶滴到明。韦庄.菩萨蛮人人尽说江南好，游人只合江南老。春水碧于天，画船听雨眠。垆边人似月，皓腕凝霜雪。未老莫还乡，还乡须断肠。韦庄.菩萨蛮红楼别夜堪惆怅，香灯半卷流苏帐。残月出门时，美人和泪辞。琵琶金翠羽，弦上黄莺语。劝我早还家，绿窗人似花。牛希济.生查子春山烟欲收，天淡星稀小。残月脸边明，别泪临清晓。语已多，情未了，回首犹重道：记得绿罗裙，处处怜芳草。木兰花.孟昶冰肌玉骨清无汗，水殿风来暗香满。绣帘一点月窥人， 欹枕钗横云鬓乱。起来琼户启无声，时见疏星渡河汉。屈指西风几时来， 只恐流年暗中换。后苏轼曾改编成《洞仙歌》，写蜀主孟昶宠妃花蕊夫人。南乡子.欧阳炯画舸停桡，槿花篱外竹横桥。 水上游人沙上女，回顾，笑指芭蕉林里住。写蛮乡新异之景，用研雅之笔出。南乡子.冯延巳细雨湿流光，芳草年年与恨长。烟锁凤楼无限事，茫茫。鸾镜鸳衾两断肠。魂梦任悠扬，睡起杨花满绣床。薄幸不来门半掩，斜阳。负你残春泪几行。起二句情景并美，下阕“杨花”一句美极，读此句可想起湘云眠芍？蝶恋花.李煜遥夜亭皋闲信步。乍过清明，渐觉伤春暮。数点雨声风约住，朦胧淡月云来去。桃李依依香暗度谁在秋千，笑里轻轻语。一片芳心千万绪，人间没个安排处。寸心之愁，人间之大，竟无容处！长相思.李煜一重山，两重山，山远天高烟水寒，相思枫叶丹。菊花开，菊花残。塞雁高飞人未还，一帘风月闲。轻淡之笔写风物，节短而格高，五代词本色。鱼游春水.无名氏秦楼东风里，燕子还来寻旧垒。馀寒犹峭，红日薄侵罗绮。嫩草方抽碧玉茵，媚柳轻窣黄金蕊。莺啭上林，鱼游春水。几曲阑干遍倚，又是一番新桃李。佳人应怪归迟，梅妆泪洗。凤箫声绝沉孤雁，望断清波无双鲤。云山万重，寸心千里。宋吴曾《能改斋漫录》记载：“政和中，一中贵使越州回，得词于古碑阴，无名无谱，不知何人作也。录以进御，命大晟府撰腔，因词中语，赐《鱼游春水》。”陈亚.生查子相思意已深，白纸书难足。字字若参商，顾要檀郎读。分明记得约当归，远至樱桃熟。何事菊花时，犹未回乡曲。这首词用了10个中药名。近代知名学者、诗人俞陛云在《宋词选释》评论：写闺情有乐府遗意。宋人吴处厚在《青箱杂记》卷一中评论：虽一时俳谐之词，然所寄兴，亦有深意。菩萨蛮.咏筝 张先哀筝一弄湘江曲，声声写尽湘波绿。纤指十三弦，细将幽恨传。当筵秋水慢，玉柱斜飞雁。弹到断肠时，春山眉黛低。十三弦：汉史游《急就篇》之三颜师古注：“筝，亦小瑟类也，本十二弦，今则十三。”这首词也录在晏几道《小山词》。晏殊.浣溪沙一向年光有限身，等闲离别易消魂，酒筵歌席莫辞频。满目河山空念远，落花风雨更伤春，不如怜取眼前人。上片笔意曲回，一瀑三折，下片“念远”承上片“离别”，“伤春”承下片“年光”，欲开仍合，小令有长调章法。晏殊.清平乐红笺小字。说尽平生意。鸿雁在云鱼在水。惆怅此情难寄。斜阳独倚西楼。遥山恰对帘钩。人面不知何处。绿波依旧东流。红笺小字，为点睛之笔，之后写情，全在紅箋。晏殊，太平宰相，词风富贵娴雅。浪淘沙·欧阳修把酒祝东风。且共从容。垂杨紫陌洛城东。总是当时携手处，游遍芳丛。聚散苦匆匆。此恨无穷。今年花胜去年红。可惜明年花更好，知与谁同。首句化自司空图《酒泉子》“黄昏把酒祝东风，且从容”。苏轼进京应试，欧阳修为主考官，惊叹于苏轼的才学，和梅尧臣说“吾当避此人出人头地。”，即“出人头地”。鹧鸪天.晏几道小令尊前见玉箫，银灯一曲太妖娆。 歌中醉倒谁能恨？唱罢归来酒未消。春悄悄，夜迢迢。碧云天共楚宫遥。 梦魂惯得无拘检，又踏杨花过谢桥。谢娘桥，诗词中每以此桥代指冶游之地, 或指与情人欢会之地。张泌《寄人》诗：“别梦依依到谢家”晏词暗用诗意。水调歌头·黄州快哉亭赠张偓佺.苏轼落日绣帘卷，亭下水连空。知君为我新作，窗户湿青红。长记平山堂上，欹枕江南烟雨，杳杳没孤鸿。认得醉翁语，山色有无中。一千顷，都镜净，倒碧峰。忽然浪起，掀舞一叶白头翁。堪笑兰台公子，未解庄生天籁，刚道有雌雄。一点浩然气，千里快哉风。浩然气，快哉风，山水壮阔，不敌东坡豪迈。江神子.江景.苏轼凤凰山下雨初晴，水风清，晚霞明。一朵芙蕖，开过尚盈盈。何处飞来双白鹭，如有意，慕娉婷。忽闻江上弄哀筝，苦含情，遣谁听！烟敛云收，依约是湘灵。欲待曲终寻问取，人不见，数峰青。湘灵，用娥皇、女英之典故，“人不见，数峰青”两句，用唐代诗人钱起《省试湘灵鼓瑟》诗“曲终人不见，江上数峰青”。眼儿媚.王雱杨柳丝丝弄轻柔，烟缕织成愁。海棠未雨，梨花先雪，一半春休。而今往事难重省，归梦绕秦楼。相思只在，丁香枝上，豆蔻梢头。王雱是王安石的儿子，他身体虚弱缠绵病榻，于是与妻子分居，王安石做主把他的妻子重新嫁给了别人，王雱因怀念妻子而为她写了这首词。满庭芳.秦观晓色云开，春随人意，骤雨才过还晴。古台芳榭，飞燕蹴红英。舞困榆钱自落，秋千外、绿水桥平。东风里，朱门映柳，低按小秦筝。多情，行乐处，珠钿翠盖，玉辔红缨。渐酒空金榼，花困蓬瀛。豆蔻梢头旧恨，十年梦、屈指堪惊。凭阑久，疏烟淡日，寂寞下芜城。秦观为苏门学士，但词风多婉约情致，受柳永影响写了不少长调。冯煦在《蒿庵词论》中说道：“淮海(秦观)、小山(晏几道),古之伤心人也.其淡语皆有味,淡语皆有致.”秋千，从来就是少女心事，词家机杼。朱门深闺，如若不是秋千，怎能眺得见绿水桥平？而秋千之后，依然只是“低按小秦筝”。点绛唇.李清照蹴罢秋千，起来慵整纤纤手。露浓花瘦，薄汗轻衣透。见客入来，袜刬金钗溜。和羞走，倚门回首，却把青梅嗅。我特别喜欢易安南渡之前的词，这首词着少女之态，生动如画。浣溪沙.闺情.李清照绣面芙蓉一笑开。斜飞宝鸭衬香腮。眼波才动被人猜。一面风情深有韵，半笺娇恨寄幽怀。月移花影约重来。“眼波”一句，在易安是娇憨，换了朱淑真就是淫奔了。清平乐.夏日游湖.朱淑真恼烟撩露，留我须臾住。携手藕花湖上路，一霎黄梅细雨。娇痴不怕人猜，和衣睡倒人怀。最是分携时候，归来懒傍妆台。同为我国古代才女双壁，朱淑真显然没有李清照那么幸运（至少前半生），有父亲和丈夫的欣赏支持。朱淑真嫁给一个庸俗小吏，婚姻苦闷，诗作死后被家人焚毁大半。西江月.遣兴.辛弃疾醉里且贪欢笑，要愁那得工夫。近来始觉古人书。信著全无是处。昨夜松边醉倒，问松我醉何如。只疑松动要来扶。以手推松曰去。“以手推松曰去”，这是散文的句法。《孟子》中有“‘燕可伐欤？’曰：‘可’”的句子；《汉书·二疏传》有疏广“以手推常曰：‘去’！”的句子。用散文句法入词，用经史典故入词，这都是辛弃疾豪放词风格。稼轩豪迈且倔强。西江月.示儿曹以家事付之.辛弃疾万事云烟忽过，百年蒲柳先衰。而今何事最相宜？宜醉宜游宜睡。早趁催科了纳，更量出入收支。乃翁依旧管些儿，管竹管山管水。此诗是稼轩晚年之作，写家事，以俗为雅，已是超然之态。哈，辛弃疾还是个会计师呢。宴山亭·北行见杏花.宋徽宗裁剪冰绡，轻叠数重，淡着燕脂匀注。新样靓妆，艳溢香融，羞杀蕊珠宫女。易得凋零，更多少无情风雨。愁苦!问院落凄凉，几番春暮？凭寄离恨重重，这双燕何曾，会人言语？天遥地远，万水千山，知他故宫何处？怎不思量，除梦里有时曾去。无据，和梦也新来不做。 宋词三百首第一首。第二个李后主，后主徽宗，真是符合尼采的以血书之了！苏幕遮.周邦彦燎沉香，消溽暑。鸟雀呼晴，侵晓窥檐语。叶上初阳干宿雨，水面清圆，一一风荷举。故乡遥，何日去？家住吴门，久作长安旅。五月渔郎相忆否？小楫轻舟，梦入芙蓉浦。“叶上”三句，尽得荷韵，千古写荷之妙语。周邦彦被尊为婉约派的集大成者和格律派创始人。点绛唇.过吴淞.姜夔燕雁无心，太湖西畔随云去。数峰清苦。商略黄昏雨。 第四桥边，拟共天随住。今何许。凭阑怀古。残柳参差舞。欲雨而待商略，而在清苦之数峰。北宋气象，到了南宋，几绝。但白石之语，依然可以细细品读。一剪梅·余赴广东实之夜饯于风亭.刘克庄束缊宵行十里强。挑得诗囊，抛了衣囊。天寒路滑马蹄僵，元是王郎，来送刘郎。酒酣耳热说文章。惊倒邻墙，推倒胡床。旁观拍手笑疏狂。疏又何妨，狂又何妨？宵行：由《诗经·召南·小星》“肃肃宵征，夙夜在公”转化而来，暗示远行劳苦之意。刘郎：指作者自己。唐代刘禹锡多次被贬，自称“刘郎”，此暗用其意。风入松.吴文英听风听雨过清明。愁草瘗花铭。楼前绿暗分携路，一丝柳、一寸柔情。料峭春寒中酒，交加晓梦啼莺。 西园日日扫林亭。依旧赏新晴。黄蜂频扑秋千索，有当时、纤手香凝。惆怅双鸳不到，幽阶一夜苔生。瘐信有《瘗花铭》，此借用之，“丝柳”七字，古代有送别时折柳相送的风俗，是希望柳丝能够系住将要远行的人。伤春兼写离别，以闲雅之笔写离愁。长相思.纳兰性德山一程，水一程，身向榆关那畔行，夜深千帐灯。风一更，雪一更，聒碎乡心梦不成，故园无此声。纳兰除了写情，也写过不少边塞诗词。这首词是纳兰随康熙去盛京告祭祖陵途中所写，“夜深千帐灯”有唐人风格。蝶恋花.纳兰性德辛苦最怜天上月，一昔如环，昔昔都成玦。若似月轮终皎洁，不辞冰雪为卿热。无那尘缘容易绝，燕子依然，软踏帘钩说。唱罢秋坟愁未歇，春丛认取双栖蝶。此首为悼亡之作。“不辞”一句：荀粲之妻冬天高烧病重，全身发热不退，荀粲脱光衣服站在大雪中，等身体冰后给妻子降温，《甄嬛传》里十七爷也是用这一招拿下甄嬛的。凤凰台上忆中吹箫（送韩西） .贺双卿寸寸微云，丝丝残照，有无明灭难消。正断魂魂断，闪闪摇摇。望望山山水水，人去去，隐隐迢迢。从今后，酸酸楚楚，只似今宵。 青遥，问天不应，看小小双卿，袅袅无聊。更见谁谁见，谁痛花娇？谁望欢欢喜喜，偷素粉，写写描描？谁还管，生生死死，暮暮朝朝？丁绍仪在《听秋馆词话》中写道：“双卿生有夙慧，嫁给金坛周姓樵子，家无纸笔，所为诗词悉芦叶写之。”浣溪沙.晚晴.王国维路转峰回出画堂，一山枫叶被残阳，看来浑未似秋光。隔座听歌人似玉，六街归骑月如霜，客中行乐只寻常。“隔座听歌人似玉”，美则美矣，王国维紧接着冷冷地说：“客中行乐只寻常”。", "answer_votes": "496", "answer_comment": "​71 条评论"}
{"answer_author": "熏巳", "answer_id": 126666830, "answer_text": "一别都门三改火，天涯踏尽红尘。依然一笑作春温。无波真古井，有节是秋筠。惆怅孤帆连夜发，送行淡月微云。樽前不用翠眉颦。人生如逆旅，我亦是行人。——苏轼《临江仙：送钱穆父》西风吹老洞庭波，一夜湘君白发多。醉后不知天在水，满船清梦压星河。——元代唐珙《题龙阳县青草湖》", "answer_votes": "372", "answer_comment": "​31 条评论"}
{"answer_author": "葛瑶", "answer_id": 126291510, "answer_text": "人生不相见，动如参与商。今夕复何夕，共此灯烛光。少壮能几时，鬓发各已苍。访旧遍为鬼，惊呼热中肠。焉知二十载，重登君子堂。昔别君未婚，儿女忽成行。怡然敬父执，问我来何方。问答乃未已，呼儿罗酒浆。夜雨剪春韭，新炊间黄粱。主称会面难，一举累十觞。十觞亦不醉，感子故意长。明日隔山岳，世事两茫茫。午夜凌晨，一字一句写完，已是泪流满面。——————————————————回评论区朋友:之所以流泪是因为有感于最近的一些经历，尤其结尾那句“明日隔山岳，世事两茫茫。”柴静所谓半夜痛哭大概为此。PS:我早已经过了悲秋伤春的年龄了", "answer_votes": "915", "answer_comment": "​115 条评论"}
{"answer_author": "戈玄白今天要做题", "answer_id": 224545631, "answer_text": "不知道为什么，这首是我背得最全最熟的。刚开始背的时候感觉又长又难记，只能磕磕绊绊一遍一遍地读。因为老师要检查，才不得不坚持下去，所以一定要全部背出来为止。但读着读着就发现越读越顺，像嘴里放了一颗弹珠，不停且顺畅地滚动，又像泉水汩汩地化开。时过境迁，当我背诵它的时候，我不需要去回忆，去想，只要起个头，它就会从我的嘴巴边上滑落，源源不绝地涌出来。我独处的时候觉得太安静了有些不自在，就会或悄声或大声地朗诵它，就像回到了那个旧日黄昏下的课堂。我在家里，有一次洗澡的时候，忍不住就着淋浴喷头的水声背起全文，铮铮有声，坠地而鸣。我爸爸问，你又在唱什么歌了，我大声说，这不是歌，这是琵琶行，是一首诗。有天中午阳光特别浓烈，晃的人眼睛疼，我在外面骑车，行至无人而阴凉处，忽然对着虚空读起了那首跨越千年而被我常常记起的长诗：浔阳江头夜送客，枫叶荻花秋瑟瑟……唐 · 白居易浔阳江头夜送客，枫叶荻花秋瑟瑟。主人下马客在船，举酒欲饮无管弦。醉不成欢惨将别，别时茫茫江浸月。忽闻水上琵琶声，主人忘归客不发。寻声暗问弹者谁？琵琶声停欲语迟。移船相近邀相见，添酒回灯重开宴。千呼万唤始出来，犹抱琵琶半遮面。转轴拨弦三两声，未成曲调先有情。弦弦掩抑声声思，似诉平生不得志。低眉信手续续弹，说尽心中无限事。轻拢慢捻抹复挑，初为霓裳后六幺。大弦嘈嘈如急雨，小弦切切如私语。嘈嘈切切错杂弹，大珠小珠落玉盘。间关莺语花底滑，幽咽泉流冰下难。冰泉冷涩弦凝绝，凝绝不通声暂歇。别有幽愁暗恨生，此时无声胜有声。银瓶乍破水浆迸，铁骑突出刀枪鸣。曲终收拨当心画，四弦一声如裂帛。东船西舫悄无言，唯见江心秋月白。沉吟放拨插弦中，整顿衣裳起敛容。自言本是京城女，家在虾蟆陵下住。十三学得琵琶成，名属教坊第一部。曲罢曾教善才服，妆成每被秋娘妒。五陵年少争缠头，一曲红绡不知数。钿头银篦击节碎，血色罗裙翻酒污。今年欢笑复明年，秋月春风等闲度。弟走从军阿姨死，暮去朝来颜色故。门前冷落鞍马稀，老大嫁作商人妇。商人重利轻别离，前月浮梁买茶去。去来江口守空船，绕船月明江水寒。夜深忽梦少年事，梦啼妆泪红阑干。我闻琵琶已叹息，又闻此语重唧唧。同是天涯沦落人，相逢何必曾相识！我从去年辞帝京，谪居卧病浔阳城。浔阳地僻无音乐，终岁不闻丝竹声。住近湓江地低湿，黄芦苦竹绕宅生。其间旦暮闻何物？杜鹃啼血猿哀鸣。春江花朝秋月夜，往往取酒还独倾。岂无山歌与村笛？呕哑嘲哳难为听。今夜闻君琵琶语，如听仙乐耳暂明。莫辞更坐弹一曲，为君翻作琵琶行。感我此言良久立，却坐促弦弦转急。凄凄不似向前声，满座重闻皆掩泣。座中泣下谁最多？江州司马青衫湿。", "answer_votes": "2.4K", "answer_comment": "​507 条评论"}
{"answer_author": "掌阅读书", "answer_id": 171099631, "answer_text": "背古诗有三种人，第一种是为了装个[消音]，第二种是真心喜欢中国古诗词文化，第三种是中小学生。其他答主推荐的诗确实都是好诗！中国诗歌宝库太多好诗了好吧！读诗词之前我们都太乱，学校老师大乱炖，体会不到诗歌的美，也没办法系统的了解。其实要有自己的方法，比如按朝代，按个人全集，按派别，这样就大不同了这里，既然是想背古诗，我给大家提供另一种思路，背五绝！一是比较短，不过20字，想背的话简直不要太轻松好吧；二是五绝短小灵活，擅长写景写趣，读起来也很有意思。通过五绝可以一窥中国古诗的奥妙。五绝的话肯定首推王维孟浩然啦（常识）下面推一些我觉得比较不错的，入个门，感兴趣的可以去找他们的诗集去看王维杂诗 君自故乡来，应知故乡事。来日绮窗前，寒梅着花未？相思红豆生南国，春来发几枝。愿君多采撷，此物最相思。送别山中相送罢，日暮掩柴扉。春草年年绿，王孙归不归。鹿柴空山不见人，但闻人语响。返景入深林，复照青苔上。竹里馆独坐幽篁里，弹琴复长啸。深林人不知，明月来相照。鸟鸣涧人闲桂花落，夜静春山空。月出惊山鸟，时鸣春涧中。山中荆溪白石出，天寒红叶稀。山路元无雨，空翠湿人衣。哭孟浩然故人不可见，江水日东流。借问襄阳老，江山空蔡州。木兰柴秋山敛余照，飞鸟逐前侣。彩翠时分明，夕岚无处所。孟城坳新家孟城口，古木余衰柳。来者复为谁？空悲昔人有。漆园古人非傲吏，自阙经世务。偶寄一微官，婆娑数枝树。栾家濑飒飒秋雨中，浅浅石榴泻。跳波自相溅，白鹭惊复下。文杏馆文杏裁为梁，香茅结为宇。不知栋里云，去作人间雨。欹湖吹箫凌极浦，日暮送夫君。湖上一回首，山青卷白云。息夫人莫以今时宠，能忘旧日恩。看花满眼泪，不共楚王言。红牡丹绿艳闲且静，红衣浅复深。花心愁欲断，春色岂知心。王维的风格就是酱啦，他本身信佛，王居士，爱讲禅，所以他的诗读起来都特别有禅意，深山老林，花香鸟语，捧一杯香茗，45度角亲吻阳光；或是一个人撑着一把油纸伞，独自彷徨在深山老林……（咦，莫名戴望舒是怎么回事）孟浩然洛中访袁拾遗 洛阳访才子，江岭作流人。闻说梅花早，何如北地春。宿建德江 移舟泊烟渚，日暮客愁新。野旷天低树，江清月近人。送朱大入秦 游人五陵去，宝剑值千金。分手相脱赠，平生一片心。扬子津望京口北固临京口，夷山近海滨。江风白浪起，愁杀渡头人。初下浙江舟中口号八月观潮罢，三江越海浔。回瞻魏阙路，无复子牟心。檀溪寻故人花伴成龙竹，池分跃马溪。田园人不见，疑向洞中栖。初下浙江舟中口号八月观潮罢，三江越海浔。回瞻魏阙路，无复子牟心。醉后赠马四四海重然诺，吾尝闻白眉。秦城游侠客，相得半酣时。赠王九日暮田家远，山中勿久淹。归人须早去，稚子望陶潜。登岘山亭寄晋陵张少府岘首风湍急，云帆若鸟飞。凭轩试一问，张翰欲来归？孟浩然虽然也写山水，但明显就和王维不同好吧。孟浩然的诗里除了歌颂山水外，还爱跟大官表忠心，还会说自己怀才不遇。因为王维是大官啊，身居朝廷要职，上面有人，所以人家游山玩水，有钱！孟浩然不行，心疼他自己。虽然也爱玩，但是能像王维那样当个官，出远门还有地方官员接待谁不羡慕？不过后来孟浩然也接受这种设定了，当不了官就当不了吧，爱谁谁！孟哥可以的，给你个大拇指除此之外再推荐点其他的，大家随意感受一下吧李白独坐敬亭山众鸟高飞尽，孤云独去闲。相看两不厌，只有敬亭山。玉阶怨玉阶生白露，夜久侵罗袜。却下水晶帘，玲珑望秋月。对雪献从兄虞城宰 昨夜梁园里，弟寒兄不知。庭前看玉树，肠断忆连枝。 别东林寺僧 东林送客处，月出白猿啼。笑别庐山远，何烦过虎溪。 劳劳亭 天下伤心处，劳劳送客亭。春风知别苦，不遣柳条青。李白：就没有我写不好的诗~你打我啊杜甫绝句\n\n迟日江山丽，春风花草香。泥融飞燕子，沙暖睡鸳鸯。绝句\n 江边踏青罢，回首见旌旗。风起春城暮，高楼鼓角悲。绝句江碧鸟逾白，山青花欲燃。今春看又过，何日是归年？杜甫的诗我是真心推荐大家读一读的，中国诗歌最高峰，没有之一。之后有机会跟大家讲讲杜甫白居易夜宿山寺早蛩啼复歇，残灯灭又明。隔窗知夜雨，芭蕉先有声。问刘十九 绿蚁新醅酒，红泥小火炉。晚来天欲雪，能饮一杯无。这句红泥小火锅真的是，朋友圈金句有木有，小资啊！腐败！警惕啊朋友们好了，就酱。想看书，就来掌阅吧戳这里：掌阅书城", "answer_votes": "403", "answer_comment": "​64 条评论"}
{"answer_author": "茶几", "answer_id": 115185884, "answer_text": "钦点一首南朝乐府民歌《西洲曲》全文如下：忆梅下西洲，折梅寄江北。单衫杏子红，双鬓鸦雏色。西洲在何处？两桨桥头渡。日暮伯劳飞，风吹乌桕树。树下即门前，门中露翠钿。开门郎不至，出门采红莲。采莲南塘秋，莲花过人头。低头弄莲子，莲子青如水。置莲怀袖中，莲心彻底红。忆郎郎不至，仰首望飞鸿。鸿飞满西洲，望郎上青楼。楼高望不见，尽日栏杆头。栏杆十二曲，垂手明如玉。卷帘天自高，海水摇空绿。海水梦悠悠，君愁我亦愁。南风知我意，吹梦到西洲。很多人只是知道曲子里广为流传的「低头弄莲子，莲子清如水」，还有「南风知我意，吹梦到西洲」这四句而已。其实这一整首乐府都很美，而且四句一换韵，在脑海里构筑一个故事情节，顺着思绪去背，毫不费力就可以背下来。期末考试时老师划的重点里有这首乐府，然后我下午背诗时读了两遍基本就能背下了。比起后面背的陶渊明的《停云》和《时运》（虽然不长但读起来真拗口啊QAQ），这首曲子简直良心！！P.S.如果题主觉得难背的话，不妨去搜一下《西洲曲》这首歌，辣妹子倾情演绎，这是坠吼不过的了！ (๑•̀ㅂ•́) ✧", "answer_votes": "130", "answer_comment": "​27 条评论"}
{"answer_author": "墨风华", "answer_id": 114694561, "answer_text": "没想到有这么多臭味相投，啊不，趣味相投的胖友们，好开心啊~\\(≧▽≦)/~～～～～～～～～～～～～～～建议：背你喜欢的诗词。我喜欢背那些有佳句的诗词，或是有感触的诗词。以下是我喜欢的（个人爱好）：开场诗（单田芳评书）道德三皇五帝，功名夏后商周；英雄五霸闹春秋，顷刻兴亡过手！青史几行名姓，北邙无数荒丘；前人撒种后人收，说甚龙争虎斗。临江仙明·杨慎滚滚长江东逝水，浪花淘尽英雄。是非成败转头空。青山依旧在，几度夕阳红。白发渔樵江渚上，惯看秋月春风。一壶浊酒喜相逢。古今多少事，都付笑谈中。满江红·写怀宋·岳飞怒发冲冠，凭栏处、潇潇雨歇。抬望眼，仰天长啸，壮怀激烈。三十功名尘与土，八千里路云和月。莫等闲、白了少年头，空悲切！(栏 通：阑)靖康耻，犹未雪。臣子恨，何时灭！驾长车，踏破贺兰山缺。壮志饥餐胡虏肉，笑谈渴饮匈奴血。待从头、收拾旧山河，朝天阙。(壮志 一作：壮士；兰山缺 一作：兰山阙)雨霖铃宋·柳永寒蝉凄切，对长亭晚，骤雨初歇。都门帐饮无绪，留恋处、兰舟催发。执手相看泪眼，竟无语凝噎。念去去、千里烟波，暮霭沉沉楚天阔。多情自古伤离别，更那堪，冷落清秋节。今宵酒醒何处？杨柳岸，晓风残月。此去经年，应是良辰好景虚设。便纵有千种风情，更与何人说？观书有感二首·其一宋·朱熹半亩方塘一鉴开，天光云影共徘徊。问渠哪得清如许？为有源头活水来。江城子秦观西城杨柳弄轻柔。动离忧，泪难收。犹记多情曾为系归舟。碧野朱桥当日事，人不见，水空流。韶华不为少年留。恨悠悠，几时休？飞絮落花时候一登楼。便做春江都是泪，流不尽，许多愁。长相思清 ·纳兰性德山一程，水一程，身向榆关那畔行，夜深千帐灯。风一更，雪一更，聒碎乡心梦不成，故园无此声。蝶恋花·伫倚危楼风细细宋·柳永伫倚危楼风细细，望极春愁，黯黯生天际。草色烟光残照里，无言谁会凭阑意。拟把疏狂图一醉，对酒当歌，强乐还无味。衣带渐宽终不悔，为伊消得人憔悴。赠去婢 唐·崔郊 公子王孙逐后尘，绿珠垂泪滴罗巾。侯门一入深如海，从此萧郎是路人。 一剪梅·舟过吴江宋·蒋捷一片春愁待酒浇。江上舟摇，楼上帘招。秋娘渡与泰娘桥，风又飘飘，雨又萧萧。何日归家洗客袍？银字笙调，心字香烧。流光容易把人抛，红了樱桃，绿了芭蕉。（诗名没查到，全诗很长，我节选了两句）仓央嘉措曾虑多情损梵行， 入山又恐别倾城，世间安得双全法， 不负如来不负卿。一剪梅明·唐寅（唐伯虎）雨打梨花深闭门，忘了青春，误了青春。赏心乐事共谁论？花下销魂，月下销魂。愁聚眉峰尽日颦，千点啼痕，万点啼痕。晓看天色暮看云，行也思君，坐也思君。苏幕遮·怀旧宋·范仲淹碧云天，黄叶地。秋色连波，波上寒烟翠。山映斜阳天接水。芳草无情，更在斜阳外。黯乡魂，追旅思。夜夜除非，好梦留人睡。明月楼高休独倚。酒入愁肠，化作相思泪。(留人睡 一作：留人醉)浪淘沙·帘外雨潺潺李煜帘外雨潺潺，春意阑珊。罗衾不耐五更寒。梦里不知身是客，一晌贪欢。独自莫凭栏，无限江山，别时容易见时难。流水落花春去也，天上人间。声声慢·寻寻觅觅宋·李清照寻寻觅觅，冷冷清清，凄凄惨惨戚戚。乍暖还寒时候，最难将息。三杯两盏淡酒，怎敌他、晚来风急？雁过也，正伤心，却是旧时相识。满地黄花堆积。憔悴损，如今有谁堪摘？守着窗儿，独自怎生得黑？梧桐更兼细雨，到黄昏、点点滴滴。这次第，怎一个愁字了得！（守着窗儿 一作：守著窗儿）题都城南庄唐（五代）崔护去年今日此门中，人面桃花相映红。人面不知何处去，桃花依旧笑春风。八声甘州宋·柳永对潇潇暮雨洒江天，一番洗清秋。渐霜风凄紧，关河冷落，残照当楼。是处红衰翠减，苒苒物华休。惟有长江水，无语东流。不忍登高临远，望故乡渺邈，归思难收。叹年来踪迹，何事苦淹留。想佳人、妆楼颙望，误几回、天际识归舟。争知我、倚阑干处，正恁凝愁（亦作“凝眸”）青玉案宋·贺铸凌波不过横塘路，但目送、芳尘去。锦瑟华年谁与度？月桥花院，琐窗朱户，只有春知处。     飞云冉冉蘅皋暮，彩笔新题断肠句。试问闲愁都几许？一川烟草，满城风絮，梅子黄时雨。临江仙宋·侯蒙未遇行藏谁肯信，如今方表名踪。无端良匠画形容。当风轻借力，一举入高空。才得吹嘘身渐稳，只疑远赴蟾宫。雨馀时候夕阳红。几人平地上，看我碧霄中。次北固山下唐·王湾客路青山外， 行舟绿水前。潮平两岸阔， 风正一帆悬。海日生残夜， 江春入旧年。乡书何处达？ 归雁洛阳边。青玉案·元夕宋·辛弃疾东风夜放花千树，更吹落，星如雨。宝马雕车香满路。凤箫声动，玉壶光转，一夜鱼龙舞。 蛾儿雪柳黄金缕，笑语盈盈暗香去。众里寻他千百度，蓦然回首，那人却在灯火阑珊处。江城子·乙卯正月二十日夜记梦宋·苏轼十年生死两茫茫，不思量，自难忘。千里孤坟，无处话凄凉。纵使相逢应不识，尘满面，鬓如霜。夜来幽梦忽还乡，小轩窗，正梳妆。相顾无言，惟有泪千行。料得年年肠断处，明月夜，短松冈。蝶恋花宋·晏殊槛菊愁烟兰泣露， 罗幕轻寒， 燕子双飞去。 明月不谙离恨苦， 斜光到晓穿朱户。昨夜西风凋碧树， 独上高楼， 望尽天涯路。 欲寄彩笺兼尺素， 山长水阔知何处。苏幕遮(怀旧)宋·范仲淹 碧云天，黄叶地。秋色连波，波上寒烟翠。山映斜阳天接水。芳草无情，更在斜阳外。 黯乡魂，追旅思。夜夜除非，好梦留人睡。明月楼高休独倚。酒入愁肠，化作相思泪。临江仙·梦后楼台高锁宋·晏几道梦后楼台高锁，酒醒帘幕低垂。去年春恨却来时，落花人独立，微雨燕双飞。记得小苹初见，两重心字罗衣。琵琶弦上说相思，当时明月在，曾照彩云归。秋思唐·张籍洛阳城里见秋风，欲作家书意万重。复恐匆匆说不尽，行人临发又开封。丑奴儿·书博山道中壁宋 辛弃疾少年不识愁滋味，爱上层楼。爱上层楼，为赋新词强说愁。而今识尽愁滋味，欲说还休。欲说还休，却道天凉好个秋虞美人·听雨宋·蒋捷少年听雨歌楼上，红烛昏罗帐。壮年听雨客舟中，江阔云低，断雁叫西风。而今听雨僧庐下，鬓已星星也。悲欢离合总无情，一任阶前点滴到天明。不第后赋菊唐·黄巢待到秋来九月八，我花开后百花杀。冲天香阵透长安，满城尽带黄金甲。卜算子·咏梅宋·陆游驿外断桥边，寂寞开无主。已是黄昏独自愁，更著风和雨。无意苦争春，一任群芳妒。零落成泥碾作尘，只有香如故。鹊桥仙·纤云弄巧宋·秦观纤云弄巧，飞星传恨，银汉迢迢暗度。金风玉露一相逢，便胜却人间无数。柔情似水，佳期如梦，忍顾鹊桥归路。两情若是久长时，又岂在朝朝暮暮。离 思唐·元稹曾经沧海难为水，除却巫山不是云。取次花丛懒回顾，半缘修道半缘君。浣溪沙宋·秦观漠漠轻寒上小楼，晓阴无赖似穷秋。淡烟流水画屏幽。自在飞花轻似梦，无边丝雨细如愁。宝帘闲挂小银钩。", "answer_votes": "304", "answer_comment": "​53 条评论"}
{"answer_author": "任昊", "answer_id": 226483956, "answer_text": "这里排一些我比较喜欢的诗词，文赋的话因为篇幅原因只排题目。至于那些熟的不行的诗词曲赋，全凭我个人喜好qvvvvq不喜欢来打我啊23333------------------------------------------------【先秦·两汉】《诗经·豳风·七月》七月流火，九月授衣。一之日觱发，二之日栗烈。无衣无褐，何以卒岁。三之日于耜，四之日举趾。同我妇子，馌彼南亩，田畯至喜。七月流火，九月授衣。春日载阳，有鸣仓庚。女执懿筐，遵彼微行，爰求柔桑。春日迟迟，采蘩祁祁。女心伤悲，殆及公子同归。七月流火，八月萑苇。蚕月条桑，取彼斧斨，以伐远扬，猗彼女桑。七月鸣鵙，八月载绩。载玄载黄，我朱孔阳，为公子裳。四月秀葽，五月鸣蜩。八月其获，十月陨箨。一之日于貉，取彼狐狸，为公子裘。二之日其同，载缵武功，言私其豵，献豜于公。五月斯螽动股，六月莎鸡振羽，七月在野，八月在宇，九月在户，十月蟋蟀入我床下。穹窒熏鼠，塞向墐户。嗟我妇子，曰为改岁，入此室处。六月食郁及薁，七月亨葵及菽，八月剥枣，十月获稻，为此春酒，以介眉寿。七月食瓜，八月断壶，九月叔苴，采荼薪樗，食我农夫。九月筑场圃，十月纳禾稼。黍稷重穋，禾麻菽麦。嗟我农夫，我稼既同，上入执宫功。昼尔于茅，宵尔索綯。亟其乘屋，其始播百谷。二之日凿冰冲冲，三之日纳于凌阴。四之日其蚤，献羔祭韭。九月肃霜，十月涤场。朋酒斯飨，曰杀羔羊。跻彼公堂，称彼兕觥，万寿无疆。《风雨》---- 先秦风雨凄凄，鸡鸣喈喈。既见君子，云胡不夷。风雨潇潇，鸡鸣胶胶。既见君子，云胡不瘳。风雨如晦，鸡鸣不已。既见君子，云胡不喜。《九歌·山鬼》---- 先秦 · 屈原若有人兮山之阿，被薜荔兮带女萝；既含睇兮又宜笑，子慕予兮善窈窕；乘赤豹兮从文狸，辛夷车兮结桂旗；被石兰兮带杜衡，折芬馨兮遗所思；余处幽篁兮终不见天，路险难兮独后来；表独立兮山之上，云容容兮而在下；杳冥冥兮羌昼晦，东风飘兮神灵雨；留灵修兮憺忘归，岁既晏兮孰华予；采三秀兮于山间，石磊磊兮葛蔓蔓；怨公子兮怅忘归，君思我兮不得闲；山中人兮芳杜若，饮石泉兮荫松柏；君思我兮然疑作；雷填填兮雨冥冥，猿啾啾兮狖夜鸣；风飒飒兮木萧萧，思公子兮徒离忧。《九歌·国殇》---- 先秦 · 屈原操吴戈兮被犀甲，车错毂兮短兵接。旌蔽日兮敌若云，矢交坠兮士争先。凌余阵兮躐余行，左骖殪兮右刃伤。霾两轮兮絷四马，援玉枹兮击鸣鼓。天时坠兮威灵怒，严杀尽兮弃原野。出不入兮往不反，平原忽兮路超远。带长剑兮挟秦弓，首身离兮心不惩。诚既勇兮又以武，终刚强兮不可凌。身既死兮神以灵，魂魄毅兮为鬼雄。《悲歌》---- 两汉悲歌可以当泣，远望可以当归。思念故乡，郁郁累累。欲归家无人，欲渡河无船。心思不能言，肠中车轮转。《平陵东》---- 两汉平陵东，松柏桐，不知何人劫义公。劫义公，在高堂下，交钱百万两走马。两走马，亦诚难，顾见追吏心中恻。心中恻，血出漉，归告我家卖黄犊。《梁甫吟》---- 两汉步出齐城门，遥望荡阴里。里中有三坟，累累正相似。问是谁家墓，田疆古冶氏。力能排南山，又能绝地纪。一朝被谗言，二桃杀三士。谁能为此谋，相国齐晏子。《战城南》---- 两汉战城南，死郭北，野死不葬乌可食。为我谓乌：且为客豪！野死谅不葬，腐肉安能去子逃？水深激激，蒲苇冥冥；枭骑战斗死，驽马徘徊鸣。梁筑室，何以南？何以北？禾黍不获君何食？愿为忠臣安可得？思子良臣，良臣诚可思：朝行出攻，暮不夜归！《行行重行行》---- 两汉行行重行行，与君生别离。相去万余里，各在天一涯。道路阻且长，会面安可知？胡马依北风，越鸟巢南枝。相去日已远，衣带日已缓。浮云蔽白日，游子不顾返。思君令人老，岁月忽已晚。弃捐勿复道，努力加餐饭。《杂诗二首》---- 两汉 · 孔融岩岩钟山首，赫赫炎天路。高明曜云门，远景灼寒素。昂昂累世士，结根在所固。吕望老匹夫，苟为因世故。管仲小囚臣，独能建功祚。人生有何常，但患年岁暮。幸托不肖躯，且当猛虎步。安能苦一身，与世同举厝。由不慎小节，庸夫笑我度。吕望尚不希，夷齐何足慕。 远送新行客，岁暮乃来归。入门望爱子，妻妾向人悲。闻子不可见，日已潜光辉。孤坟在西北，常念君来迟。褰裳上墟丘，但见蒿与薇。白骨归黄泉，肌体乘尘飞。生时不识父，死后知我谁。孤魂游穷暮，飘摇安所依。人生图嗣息，尔死我念追。俯仰内伤心，不觉泪沾衣。人生自有命，但恨生日希。《蒿里行》---- 两汉 · 曹操关东有义士，兴兵讨群凶。初期会盟津，乃心在咸阳。军合力不齐，踌躇而雁行。势利使人争，嗣还自相戕。淮南弟称号，刻玺于北方。铠甲生虮虱，万姓以死亡。白骨露於野，千里无鸡鸣。生民百遗一，念之断人肠。------------------------------------------------【魏晋·南北朝】《美女篇》---- 魏晋 · 曹植美女妖且闲，采桑歧路间。柔条纷冉冉，叶落何翩翩。攘袖见素手，皓腕约金环。头上金爵钗，腰佩翠琅玕。明珠交玉体，珊瑚间木难。罗衣何飘飘，轻裾随风还。顾盼遗光彩，长啸气若兰。行徒用息驾，休者以忘餐。借问女安居，乃在城南端。青楼临大路，高门结重关。容华耀朝日，谁不希令颜？媒氏何所营？玉帛不时安。佳人慕高义，求贤良独难。众人徒嗷嗷，安知彼所观？盛年处房室，中夜起长叹。《野田黄雀行》---- 魏晋 · 曹植高树多悲风，海水扬其波。利剑不在掌，结友何须多？不见篱间雀，见鹞自投罗。罗家得雀喜，少年见雀悲。拔剑捎罗网，黄雀得飞飞。飞飞摩苍天，来下谢少年。《咏荆轲》---- 魏晋 · 陶渊明燕丹善养士，志在报强嬴。招集百夫良，岁暮得荆卿。君子死知己，提剑出燕京；素骥鸣广陌，慷慨送我行。雄发指危冠，猛气冲长缨。饮饯易水上，四座列群英。渐离击悲筑，宋意唱高声。萧萧哀风逝，淡淡寒波生。商音更流涕，羽奏壮士惊。心知去不归，且有后世名。登车何时顾，飞盖入秦庭。凌厉越万里，逶迤过千城。图穷事自至，豪主正怔营。惜哉剑术疏，奇功遂不成。其人虽已没，千载有馀情。《西洲曲》---- 南北朝忆梅下西洲，折梅寄江北。单衫杏子红，双鬓鸦雏色。西洲在何处？两桨桥头渡。日暮伯劳飞，风吹乌臼树。树下即门前，门中露翠钿。开门郎不至，出门采红莲。采莲南塘秋，莲花过人头。低头弄莲子，莲子清如水。置莲怀袖中，莲心彻底红。忆郎郎不至，仰首望飞鸿。鸿飞满西洲，望郎上青楼。楼高望不见，尽日栏杆头。栏杆十二曲，垂手明如玉。卷帘天自高，海水摇空绿。海水梦悠悠，君愁我亦愁。南风知我意，吹梦到西洲。------------------------------------------------【唐】《春江花月夜》---- 唐代 · 张若虚春江潮水连海平，海上明月共潮生。滟滟随波千万里，何处春江无月明！江流宛转绕芳甸，月照花林皆似霰；空里流霜不觉飞，汀上白沙看不见。江天一色无纤尘，皎皎空中孤月轮。江畔何人初见月？江月何年初照人？人生代代无穷已，江月年年只相似。不知江月待何人，但见长江送流水。白云一片去悠悠，青枫浦上不胜愁。谁家今夜扁舟子？何处相思明月楼？可怜楼上月徘徊，应照离人妆镜台。玉户帘中卷不去，捣衣砧上拂还来。此时相望不相闻，愿逐月华流照君。鸿雁长飞光不度，鱼龙潜跃水成文。昨夜闲潭梦落花，可怜春半不还家。江水流春去欲尽，江潭落月复西斜。斜月沉沉藏海雾，碣石潇湘无限路。不知乘月几人归，落月摇情满江树。《丽人行》---- 唐代 · 杜甫三月三日天气新，长安水边多丽人。态浓意远淑且真，肌理细腻骨肉匀。绣罗衣裳照暮春，蹙金孔雀银麒麟。头上何所有？翠微盍叶垂鬓唇。背后何所见？珠压腰衱稳称身。就中云幕椒房亲，赐名大国虢与秦。紫驼之峰出翠釜，水精之盘行素鳞。犀箸厌饫久未下，鸾刀缕切空纷纶。黄门飞鞚不动尘，御厨络绎送八珍。箫鼓哀吟感鬼神，宾从杂遝实要津。后来鞍马何逡巡，当轩下马入锦茵。杨花雪落覆白苹，青鸟飞去衔红巾。炙手可热势绝伦，慎莫近前丞相嗔！《兵车行》 ---- 唐代 · 杜甫车辚辚，马萧萧，行人弓箭各在腰。耶娘妻子走相送，尘埃不见咸阳桥。牵衣顿足拦道哭，哭声直上干云霄。道旁过者问行人，行人但云点行频。或从十五北防河，便至四十西营田。去时里正与裹头，归来头白还戍边。边庭流血成海水，武皇开边意未已。君不闻汉家山东二百州，千村万落生荆杞。纵有健妇把锄犁，禾生陇亩无东西。况复秦兵耐苦战，被驱不异犬与鸡。长者虽有问，役夫敢申恨？且如今年冬，未休关西卒。县官急索租，租税从何出？信知生男恶，反是生女好。生女犹得嫁比邻，生男埋没随百草。君不见，青海头，古来白骨无人收。新鬼烦冤旧鬼哭，天阴雨湿声啾啾！《旅夜书怀》---- 唐代 · 杜甫细草微风岸，危樯独夜舟。星垂平野阔，月涌大江流。名岂文章著，官应老病休。飘飘何所似，天地一沙鸥。《塞上听吹笛》---- 唐代 · 高适雪净胡天牧马还，月明羌笛戍楼间。借问梅花何处落，风吹一夜满关山。《汉江临泛 / 汉江临眺》---- 唐代 · 王维楚塞三湘接，荆门九派通。江流天地外，山色有无中。郡邑浮前浦，波澜动远空。襄阳好风日，留醉与山翁。《送陈章甫》---- 唐代 · 李颀四月南风大麦黄，枣花未落桐叶长。青山朝别暮还见，嘶马出门思旧乡。陈侯立身何坦荡，虬须虎眉仍大颡。腹中贮书一万卷，不肯低头在草莽。东门酤酒饮我曹，心轻万事如鸿毛。醉卧不知白日暮，有时空望孤云高。长河浪头连天黑，津口停舟渡不得。郑国游人未及家，洛阳行子空叹息。闻道故林相识多，罢官昨日今如何。 《客至》---- 唐代 · 杜甫舍南舍北皆春水，但见群鸥日日来。花径不曾缘客扫，蓬门今始为君开。盘飧市远无兼味，樽酒家贫只旧醅。肯与邻翁相对饮，隔篱呼取尽馀杯。《茅屋为秋风所破歌》---- 唐代 · 杜甫八月秋高风怒号，卷我屋上三重茅。茅飞渡江洒江郊，高者挂罥长林梢，下者飘转沉塘坳。南村群童欺我老无力，忍能对面为盗贼，公然抱茅入竹去。唇焦口燥呼不得，归来倚杖自叹息。俄顷风定云墨色，秋天漠漠向昏黑。布衾多年冷似铁，娇儿恶卧踏里裂。床头屋漏无干处，雨脚如麻未断绝。自经丧乱少睡眠，长夜沾湿何由彻?安得广厦千万间，大庇天下寒士俱欢颜，风雨不动安如山。呜呼！何时眼前突兀见此屋，吾庐独破受冻死亦足！《代悲白头翁 / 白头吟 / 有所思》---- 唐代 · 刘希夷洛阳城东桃李花，飞来飞去落谁家？洛阳女儿惜颜色，坐见落花长叹息。今年花落颜色改，明年花开复谁在？已见松柏摧为薪，更闻桑田变成海。古人无复洛城东，今人还对落花风。年年岁岁花相似，岁岁年年人不同。寄言全盛红颜子，应怜半死白头翁。此翁白头真可怜，伊昔红颜美少年。公子王孙芳树下，清歌妙舞落花前。光禄池台文锦绣，将军楼阁画神仙。一朝卧病无相识，三春行乐在谁边？宛转蛾眉能几时？须臾鹤发乱如丝。但看古来歌舞地，唯有黄昏鸟雀悲。《侠客行》---- 唐代 · 李白赵客缦胡缨，吴钩霜雪明。银鞍照白马，飒沓如流星。十步杀一人，千里不留行。事了拂衣去，深藏身与名。闲过信陵饮，脱剑膝前横。将炙啖朱亥，持觞劝侯嬴。三杯吐然诺，五岳倒为轻。眼花耳热后，意气素霓生。救赵挥金槌，邯郸先震惊。千秋二壮士，烜赫大梁城。纵死侠骨香，不惭世上英。谁能书阁下，白首太玄经。《庐山谣寄卢侍御虚舟》---- 唐代 · 李白我本楚狂人，凤歌笑孔丘。手持绿玉杖，朝别黄鹤楼。五岳寻仙不辞远，一生好入名山游。庐山秀出南斗傍，屏风九叠云锦张。影落明湖青黛光，金阙前开二峰长，银河倒挂三石梁。香炉瀑布遥相望，回崖沓嶂凌苍苍。翠影红霞映朝日，鸟飞不到吴天长。登高壮观天地间，大江茫茫去不还。黄云万里动风色，白波九道流雪山。好为庐山谣，兴因庐山发。闲窥石镜清我心，谢公行处苍苔没。早服还丹无世情，琴心三叠道初成。遥见仙人彩云里，手把芙蓉朝玉京。先期汗漫九垓上，愿接卢敖游太清。《代赠二首·其一》---- 唐代 · 李商隐楼上黄昏欲望休，玉梯横绝月中钩。芭蕉不展丁香结，同向春风各自愁。《宿骆氏亭寄怀崔雍崔衮》---- 唐代 · 李商隐竹坞无尘水槛清，相思迢递隔重城。 秋阴不散霜飞晚，留得枯荷听雨声。《苦昼短》---- 唐代 · 李贺飞光飞光，劝尔一杯酒。吾不识青天高，黄地厚。唯见月寒日暖，来煎人寿。食熊则肥，食蛙则瘦。神君何在？太一安有？天东有若木，下置衔烛龙。吾将斩龙足，嚼龙肉，使之朝不得回，夜不得伏。自然老者不死，少者不哭。何为服黄金、吞白玉？谁似任公子，云中骑碧驴？刘彻茂陵多滞骨，嬴政梓棺费鲍鱼。《金铜仙人辞汉歌》---- 唐代 · 李贺魏明帝青龙元年八月，诏宫官牵车西取汉孝武捧露盘仙人，欲立置前殿。宫官既拆盘，仙人临载，乃潸然泪下。唐诸王孙李长吉遂作《金铜仙人辞汉歌》。茂陵刘郎秋风客，夜闻马嘶晓无迹。画栏桂树悬秋香，三十六宫土花碧。魏官牵车指千里，东关酸风射眸子。空将汉月出宫门，忆君清泪如铅水。衰兰送客咸阳道，天若有情天亦老。携盘独出月荒凉，渭城已远波声小。《李凭箜篌引》---- 唐代 · 李贺吴丝蜀桐张高秋，空山凝云颓不流。江娥啼竹素女愁，李凭中国弹箜篌。昆山玉碎凤凰叫，芙蓉泣露香兰笑。十二门前融冷光，二十三丝动紫皇。女娲炼石补天处，石破天惊逗秋雨。梦入神山教神妪，老鱼跳波瘦蛟舞。吴质不眠倚桂树，露脚斜飞湿寒兔。 《三月过行宫》---- 唐代 · 李贺渠水红繁拥御墙，风娇小叶学娥妆。垂帘几度青春老，堪锁千年白日长。《陇西行四首·其二》---- 唐代 · 陈陶誓扫匈奴不顾身，五千貂锦丧胡尘。可怜无定河边骨，犹是春闺梦里人。《菩萨蛮·人人尽说江南好》---- 唐代 · 韦庄人人尽说江南好，游人只合江南老。春水碧于天，画船听雨眠。垆边人似月，皓腕凝霜雪。未老莫还乡，还乡须断肠。《台城》---- 唐代 · 韦庄江雨霏霏江草齐，六朝如梦鸟空啼。无情最是台城柳，依旧烟笼十里堤。《菩萨蛮·小山重叠金明灭》---- 唐代 · 温庭筠小山重叠金明灭，鬓云欲度香腮雪。懒起画蛾眉，弄妆梳洗迟。照花前后镜，花面交相映。新帖绣罗襦，双双金鹧鸪。《遣悲怀三首》---- 唐代 · 元稹谢公最小偏怜女，自嫁黔娄百事乖。顾我无衣搜荩箧，泥他沽酒拔金钗。野蔬充膳甘长藿，落叶添薪仰古槐。今日俸钱过十万，与君营奠复营斋。昔日戏言身后意，今朝都到眼前来。衣裳已施行看尽，针线犹存未忍开。尚想旧情怜婢仆，也曾因梦送钱财。诚知此恨人人有，贫贱夫妻百事哀。闲坐悲君亦自悲，百年都是几多时。邓攸无子寻知命，潘岳悼亡犹费词。同穴窅冥何所望，他生缘会更难期。惟将终夜常开眼，报答平生未展眉。《秦中吟·轻肥》---- 唐代 · 白居易意气骄满路，鞍马光照尘。借问何为者，人称是内臣。朱绂皆大夫，紫绶或将军。夸赴军中宴，走马去如云。尊罍溢九酝，水陆罗八珍。果擘洞庭橘，脍切天池鳞。食饱心自若，酒酣气益振。是岁江南旱，衢州人食人。------------------------------------------------【宋】《八声甘州·对潇潇暮雨洒江天》---- 宋代 · 柳永对潇潇暮雨洒江天，一番洗清秋。渐霜风凄紧，关河冷落，残照当楼。是处红衰翠减，苒苒物华休。唯有长江水，无语东流。 不忍登高临远，望故乡渺邈，归思难收。叹年来踪迹，何事苦淹留？想佳人妆楼颙望，误几回、天际识归舟。争知我，倚阑杆处，正恁凝愁！《浣溪沙·一向年光有限身》---- 宋代 · 晏殊一向年光有限身，等闲离别易销魂，酒筵歌席莫辞频。满目山河空念远，落花风雨更伤春，不如怜取眼前人。《采桑子·时光只解催人老》---- 宋代 · 晏殊时光只解催人老，不信多情，长恨离亭，泪滴春衫酒易醒。梧桐昨夜西风急，淡月胧明，好梦频惊，何处高楼雁一声？《玉楼春·别后不知君远近》---- 宋代 · 欧阳修别后不知君远近。触目凄凉多少闷。渐行渐远渐无书，水阔鱼沉何处问。夜深风竹敲秋韵。万叶千声皆是恨。故欹单枕梦中寻，梦又不成灯又烬。《生查子·元夕》---- 宋代 · 欧阳修去年元夜时，花市灯如昼。月上柳梢头，人约黄昏后。今年元夜时，月与灯依旧。不见去年人，泪湿春衫袖。《玉楼春·尊前拟把归期说》---- 宋代 · 欧阳修尊前拟把归期说，欲语春容先惨咽。人生自是有情痴，此恨不关风与月。离歌且莫翻新阕，一曲能教肠寸结。直须看尽洛城花，始共春风容易别。《蝶恋花·庭院深深深几许》---- 宋代 · 欧阳修庭院深深深几许，杨柳堆烟，帘幕无重数。玉勒雕鞍游冶处，楼高不见章台路。雨横风狂三月暮，门掩黄昏，无计留春住。泪眼问花花不语，乱红飞过秋千去。《临江仙·梦后楼台高锁》---- 宋代 · 晏几道梦后楼台高锁，酒醒帘幕低垂。去年春恨却来时。落花人独立，微雨燕双飞。 记得小蘋初见，两重心字罗衣。琵琶弦上说相思。当时明月在，曾照彩云归。《鹧鸪天·彩袖殷勤捧玉钟》---- 宋代 · 晏几道彩袖殷勤捧玉钟，当年拚却醉颜红。舞低杨柳楼心月，歌尽桃花扇底风。从别后，忆相逢，几回魂梦与君同。今宵剩把银釭照，犹恐相逢是梦中。《定风波·南海归赠王定国侍人寓娘》---- 宋代 · 苏轼常羡人间琢玉郎，天应乞与点酥娘。尽道清歌传皓齿，风起，雪飞炎海变清凉。万里归来颜愈少，微笑，笑时犹带岭梅香。试问岭南应不好，却道：此心安处是吾乡。《蝶恋花·春景》---- 宋代 · 苏轼花褪残红青杏小。燕子飞时，绿水人家绕。枝上柳绵吹又少。天涯何处无芳草！墙里秋千墙外道。墙外行人，墙里佳人笑。笑渐不闻声渐悄。多情却被无情恼。《浣溪沙·山色横侵蘸晕霞》---- 宋代 · 苏轼山色横侵蘸晕霞，湘川风静吐寒花。远林屋散尚啼鸦。梦到故园多少路，酒醒南望隔天涯。月明千里照平沙。《临江仙·夜饮东坡醒复醉》---- 宋代 · 苏轼夜饮东坡醒复醉，归来仿佛三更。家童鼻息已雷鸣。敲门都不应，倚杖听江声。 长恨此身非我有，何时忘却营营。夜阑风静縠纹平。小舟从此逝，江海寄余生。《卜算子·黄州定慧院寓居作》---- 宋代 · 苏轼缺月挂疏桐，漏断人初静。时见幽人独往来，缥缈孤鸿影。惊起却回头，有恨无人省。拣尽寒枝不肯栖，寂寞沙洲冷。《千秋岁·水边沙外》---- 宋代 · 秦观水边沙外。城郭春寒退。花影乱，莺声碎。飘零疏酒盏，离别宽衣带。人不见，碧云暮合空相对。忆昔西池会。鹓鹭同飞盖。携手处，今谁在。日边清梦断，镜里朱颜改。春去也，飞红万点愁如海。《江城子·西城杨柳弄春柔》---- 宋代 · 秦观西城杨柳弄春柔，动离忧，泪难收。犹记多情、曾为系归舟。碧野朱桥当日事，人不见，水空流。韶华不为少年留，恨悠悠，几时休？飞絮落花时候、一登楼。便作春江都是泪，流不尽，许多愁。《清平乐（再次前韵）》---- 宋代 · 周密晚莺桥噎。庭户溶溶月。一树湘桃飞茜雪。红豆相思渐结。看看芳草平沙。游鞯犹未归家。自是萧郎飘荡，错教人恨杨花。《采桑子·恨君不似江楼月》---- 宋代 · 吕本中恨君不似江楼月，南北东西，南北东西，只有相随无别离。恨君却似江楼月，暂满还亏，暂满还亏，待得团圆是几时？《贺新郎·别茂嘉十二弟》---- 宋代 · 辛弃疾别茂嘉十二弟。鹈鴂、杜鹃实两种，见《离骚补注》。绿树听鹈鴂。更那堪、鹧鸪声住，杜鹃声切。啼到春归无寻处，苦恨芳菲都歇。算未抵、人间离别。马上琵琶关塞黑，更长门、翠辇辞金阙。看燕燕，送归妾。 将军百战身名裂。向河梁、回头万里，故人长绝。易水萧萧西风冷，满座衣冠似雪。正壮士、悲歌未彻。啼鸟还知如许恨，料不啼清泪长啼血。谁共我，醉明月。《永遇乐·戏赋辛字送茂嘉十二弟赴调》---- 宋代 · 辛弃疾烈日秋霜，忠肝义胆，千载家谱。得姓何年，细参辛字，一笑君听取。艰辛做就，悲辛滋味，总是辛酸辛苦。更十分，向人辛辣，椒桂捣残堪吐。 世间应有，芳甘浓美，不到吾家门户。比著儿曹，累累却有，金印光垂组。付君此事，从今直上，休忆对床风雨。但赢得，靴纹绉面，记余戏语。《一剪梅·中秋元月》---- 宋代 · 辛弃疾忆对中秋丹桂丛，花也杯中，月也杯中。今宵楼上一尊同，云湿纱窗，雨湿纱窗。浑欲乘风问化工，路也难通，信也难通。满堂唯有烛花红，歌且从容，杯且从容。《鹧鸪天·送欧阳国瑞入吴中》---- 宋代 · 辛弃疾莫避春阴上马迟。春来未有不阴时。人情展转闲中看，客路崎岖倦后知。 梅似雪，柳如丝。试听别语慰相思。短篷炊饮鲈鱼熟，除却松江枉费诗。《虞美人·听雨》---- 宋代 · 蒋捷少年听雨歌楼上。红烛昏罗帐。壮年听雨客舟中。江阔云低、断雁叫西风。 而今听雨僧庐下。鬓已星星也。悲欢离合总无情。一任阶前、点滴到天明。《一剪梅·舟过吴江》---- 宋代 · 蒋捷一片春愁待酒浇。江上舟摇，楼上帘招。秋娘渡与泰娘桥，风又飘飘，雨又萧萧。何日归家洗客袍？银字笙调，心字香烧。流光容易把人抛，红了樱桃，绿了芭蕉。《忆秦娥·烧灯节》---- 宋代 · 刘辰翁中斋上元客散感旧，赋《忆秦娥》见属，一读凄然。随韵寄情，不觉悲甚。 烧灯节，朝京道上风和雪。风和雪，江山如旧，朝京人绝。百年短短兴亡别，与君犹对当时月。当时月，照人烛泪，照人梅发。《临江仙·夜登小阁忆洛中旧游》---- 宋代 · 陈与义忆昔午桥桥上饮，坐中多是豪英。长沟流月去无声。杏花疏影里，吹笛到天明。 二十余年如一梦，此身虽在堪惊。闲登小阁看新晴。古今多少事，渔唱起三更。------------------------------------------------【元·清】【正宫】《端正好》---- 元代 · 王实甫碧云天，黄花地，西风紧，北雁南飞。晓来谁染霜林醉？总是离人泪。《题龙阳县青草湖》---- 元代 · 唐珙西风吹老洞庭波，一夜湘君白发多。醉后不知天在水，满船清梦压星河。《凤凰台上忆吹箫·寸寸微云》---- 清代 · 贺双卿寸寸微云，丝丝残照，有无明灭难消。正断魂魂断，闪闪摇摇。望望山山水水，人去去，隐隐迢迢。从今后，酸酸楚楚，只似今宵。青遥。问天不应，看小小双卿，袅袅无聊。更见谁谁见，谁痛花娇？谁望欢欢喜喜，偷素粉，写写描描？谁还管，生生世世，夜夜朝朝。《蝶恋花·阅尽天涯离别苦》---- 清代 · 王国维阅尽天涯离别苦，不道归来，零落花如许。花底相看无一语，绿窗春与天俱莫。待把相思灯下诉，一缕新欢，旧恨千千缕。最是人间留不住，朱颜辞镜花辞树。《终身误》---- 清代 · 曹雪芹都道是金玉良姻，俺只念木石前盟。空对着，山中高士晶莹雪；终不忘，世外仙姝寂寞林。叹人间，美中不足今方信：纵然是齐眉举案，到底意难平。------------------------------------------------篇幅原因只列题目：《涉江》《高唐赋》《洛神赋》《报任安书》《答苏武书》《孔雀东南飞》《归去来兮辞》《长恨歌》《滕王阁序》《醉翁亭记》《岳阳楼记》《桃花源记》&lt;img data-rawheight=\"318\" src=\"https://pic1.zhimg.com/50/v2-ae70c5a40cadaa02ddee1f20a3c8762c_hd.jpg\" data-rawwidth=\"328\" class=\"content_image\" width=\"328\"&gt;", "answer_votes": "399", "answer_comment": "​45 条评论"}
{"answer_author": "夏天的绿豆豆", "answer_id": 224616121, "answer_text": "有一首诗，字字珠玑，又缠绵悱恻，小时候十岁左右被父母逼着花了一上午的时间背诵下来，后来全家的孩子都被逼着背诵...“逼”这个词并非你们想得那样苦逼，只是阿玛额娘临时起意，想着让我背诵一下这首惊人的美丽的诗歌，毕竟小孩记得快。一上午背完之后就快快乐乐地玩耍了，答主从小到大没有熬过夜，高考之前睡的最晚的都是十一点半。之后的时间，总会有一句两句飘进心里。美人如花隔云端，可惜皇帝只能在梦里相见了。--------------------------------------------------长恨歌汉皇重色思倾国，御宇多年求不得。杨家有女初长成，养在深闺人未识。天生丽质难自弃，一朝选在君王侧。回眸一笑百媚生，六宫粉黛无颜色。春寒赐浴华清池，温泉水滑洗凝脂。侍儿扶起娇无力，始是新承恩泽时。云鬓花颜金步摇，芙蓉帐暖度春宵。春宵苦短日高起，从此君王不早朝。承欢侍宴无闲暇，春从春游夜专夜。后宫佳丽三千人，三千宠爱在一身。金屋妆成娇侍夜，玉楼宴罢醉和春。姊妹弟兄皆列土，可怜光彩生门户。遂令天下父母心，不重生男重生女。骊宫高处入青云，仙乐风飘处处闻。缓歌慢舞凝丝竹，尽日君王看不足。渔阳鼙鼓动地来，惊破霓裳羽衣曲。九重城阙烟尘生，千乘万骑西南行。翠华摇摇行复止，西出都门百余里。六军不发无奈何，宛转蛾眉马前死。花钿委地无人收，翠翘金雀玉搔头。君王掩面救不得，回看血泪相和流。黄埃散漫风萧索，云栈萦纡登剑阁。峨嵋山下少人行，旌旗无光日色薄。蜀江水碧蜀山青，圣主朝朝暮暮情。行宫见月伤心色，夜雨闻铃肠断声。天旋地转回龙驭，到此踌躇不能去。马嵬坡下泥土中，不见玉颜空死处。君臣相顾尽沾衣，东望都门信马归。归来池苑皆依旧，太液芙蓉未央柳。芙蓉如面柳如眉，对此如何不泪垂。春风桃李花开日，秋雨梧桐叶落时。西宫南内多秋草，落叶满阶红不扫。梨园弟子白发新，椒房阿监青娥老。夕殿萤飞思悄然，孤灯挑尽未成眠。迟迟钟鼓初长夜，耿耿星河欲曙天。鸳鸯瓦冷霜华重，翡翠衾寒谁与共。悠悠生死别经年，魂魄不曾来入梦。临邛道士鸿都客，能以精诚致魂魄。为感君王辗转思，遂教方士殷勤觅。排空驭气奔如电，升天入地求之遍。上穷碧落下黄泉，两处茫茫皆不见。忽闻海上有仙山，山在虚无缥渺间。楼阁玲珑五云起，其中绰约多仙子。中有一人字太真，雪肤花貌参差是。金阙西厢叩玉扃，转教小玉报双成。闻道汉家天子使，九华帐里梦魂惊。揽衣推枕起徘徊，珠箔银屏迤逦开。云鬓半偏新睡觉，花冠不整下堂来。风吹仙袂飘飘举，犹似霓裳羽衣舞。玉容寂寞泪阑干，梨花一枝春带雨。含情凝睇谢君王，一别音容两渺茫。昭阳殿里恩爱绝，蓬莱宫中日月长。回头下望人寰处，不见长安见尘雾。惟将旧物表深情，钿合金钗寄将去。钗留一股合一扇，钗擘黄金合分钿。但教心似金钿坚，天上人间会相见。临别殷勤重寄词，词中有誓两心知。七月七日长生殿，夜半无人私语时。在天愿作比翼鸟，在地愿为连理枝。天长地久有时尽，此恨绵绵无绝期。&lt;img data-rawheight=\"834\" src=\"https://pic1.zhimg.com/50/v2-d1914198fbd229099354d19d97d28e63_hd.jpg\" data-rawwidth=\"500\" class=\"origin_image zh-lightbox-thumb\" width=\"500\" data-original=\"https://pic1.zhimg.com/v2-d1914198fbd229099354d19d97d28e63_r.jpg\"&gt;", "answer_votes": "1.4K", "answer_comment": "​323 条评论"}
{"answer_author": "王思为", "answer_id": 115292810, "answer_text": "提名兵车行!兵车行唐.杜甫车辚辚，马萧萧，行人弓箭各在腰。耶娘妻子走相送，尘埃不见咸阳桥。牵衣顿足拦道哭，哭声直上干云霄。道旁过者问行人，行人但云点行频。或从十五北防河，便至四十西营田。去时里正与裹头，归来头白还戍边。边庭流血成海水，武皇开边意未已。君不闻汉家山东二百州，千村万落生荆杞。纵有健妇把锄犁，禾生陇亩无东西。况复秦兵耐苦战，被驱不异犬与鸡。长者虽有问，役夫敢申恨？且如今年冬，未休关西卒。县官急索租，租税从何出？信知生男恶，反是生女好。生女犹得嫁比邻，生男埋没随百草。君不见，青海头，古来白骨无人收。新鬼烦冤旧鬼哭，天阴雨湿声啾啾！", "answer_votes": "82", "answer_comment": "​21 条评论"}
{"answer_author": "翎春君", "answer_id": 225457791, "answer_text": "满足四个个标准吧1.并非初高中必背篇目因为大家都会背，你再拿出来举例子，答题，就有点没有意思了课本上出现的，微博上提烂的同理（是的说的就是你枇杷树←_←）2.你喜欢因为好背拿我个人来说，我喜欢的诗大多都是比较温柔的，这跟婉约派没关系，只是一种感觉。比如秦观的西城子：西城杨柳弄春柔，动离忧，泪难收。犹记多情、曾为系归舟。碧野朱桥当日事，人不见，水空流。感觉这感情就太外露了，太激越了。喜欢我微之，寥寥几笔写尽落寞的这种温柔寥落古行宫，宫花寂寞红。白头宫女在，闲坐说玄宗。元稹、白居易、李白小哥哥……等等等等的唐诗，我虽然没有刻意去背，但会背一些，但是柳三变啦，李后主啦，我就只能记住名句了，为什么呢？主要就是不喜欢呗，你喜欢一首诗，说明你喜欢的它的用词、韵律，它所表达的感情你能懂，它的文字技巧你很欣赏，这样就算不刻意也背的下来。3.并非堆砌辞藻这个啊，就是共情的角度来答的我觉得背诗有个很大的作用，就是你说不出某种心情的时候，诗人替你说了啊！还说的这么漂亮婉约，你跟别人讨论的时候，显得很准确又很有文化，所以如果不从喜欢的角度来考虑，你背的诗尽量要简单明确。比如，你不能和你家姑娘分手了，但你还很喜欢她，就说：倚危亭。恨如芳草，萋萋刬尽还生。念柳外青骢别后，水边红袂分时，怆然暗惊。无端天与娉婷。夜月一帘幽梦，春风十里柔情。怎奈向、欢娱渐随流水，素弦声断，翠绡香减，那堪片片飞花弄晚，蒙蒙残雨笼晴。正销凝。黄鹂又啼数声。无论选哪句表达感情，都有点隔靴搔痒的意思，要是吟出来，人家会觉得你是掉书袋的神经病几乎是同样的手法，唐诗就比较明确了，李义山哥哥棒棒哒荷叶生时春恨生，荷叶枯时秋恨成。深知身在情长在， 怅望江头江水声如果你嫌这个调子太悲，不吉利，来一首温庭筠是最好的选择一尺深红胜曲尘，天生旧物不如新。合欢桃核终堪恨，里许元来别有人。井底点灯深烛伊，共郎长行莫围棋。玲珑骰子安红豆，入骨相思知不知。 我珍视的那些回忆，已经成了永远的过去你不要我了但我仍然爱着你不过因为唐七用过最后一句，可能逼格略有逊色，但是又简单又温柔，挽回女友，你值得拥有4.有！逼！格！虽然我强调不要背那些提烂了的诗而是那些最好的诗人，最棒的诗，想背诗的人，一定要背下来如果我只推荐一个诗人，那一定是李白那是大半个盛唐的盛世风华无论他的诗有多么脍炙人口，都值全篇背诵你要知道：“长风破浪会有时，直挂云帆济沧海”也要知道“浮云游子意，落日故人情。”写喜， 写怒，写怨，无论是柔软的忧思，还是浩荡的胸怀，你会发现他每一个句子都值得人去琢磨，研究，思考。俗一点说，对于我们这些外行人而言，你背了再多冷门的诗，如果提起李白你哑口无言，也没人会觉得你厉害。所以，如果只能背一个人的诗背小白我背诗坦白讲不太灵光，觉得反复读才是将这首诗据为己有的手段，推荐几首我很喜欢的诗给大家，可以不背，但值得一读陆游的：风卷江湖雨闇村，四山声作海涛翻。溪柴火软蛮毡暖，我与狸奴不出门<img src=\"https://pic4.zhimg.com/50/v2-b8f70e45772702ded12f8adfd3988c8b_hd.jpg\" data-rawwidth=\"700\" data-rawheight=\"700\" class=\"origin_image zh-lightbox-thumb\" width=\"700\" data-original=\"https://pic4.zhimg.com/v2-b8f70e45772702ded12f8adfd3988c8b_r.jpg\">可爱不可爱？悠哉不悠哉？小白的秋风清，秋月明，落叶聚还散，寒鸦栖复惊。相思相见知何日？此时此夜难为情！入我相思门，知我相思苦。长相思兮长相忆，短相思兮无穷极。早知如此绊人心，何如当初莫相识。<img src=\"https://pic2.zhimg.com/50/v2-e10036eb703d12f6a3a0e215df695391_hd.jpg\" data-rawwidth=\"700\" data-rawheight=\"979\" class=\"origin_image zh-lightbox-thumb\" width=\"700\" data-original=\"https://pic2.zhimg.com/v2-e10036eb703d12f6a3a0e215df695391_r.jpg\">要断网啦，明天继续更新刚才看评论大家说，欸？为什么大家都背的诗就不背了？呃，还能为什么啊，大家心照不宣不就行了……有碍装逼啊！可能有些人背诗，就是为了丰富自身素质，我觉得真的特别好，但我不是这种人啊，我超俗气的，怎么办，我也很绝望啊其实我个人觉得，陶冶情操，增长见识，读诗就够了啊，所以背诗对我来说，最大的作用就是能够在与人交往的时候，提升自己的谈吐修养，所以就从这个方面回答了……（好吧就是装逼）就比如说，你说一个姑娘美，你说：清水出芙蓉，天然去雕饰大家就：哦你要说：莲花乱脸色,荷叶杂衣香大家：欸？你要说：皎若太阳升朝霞,灼若芙渠出鸿波大家说：逼王666比起自己跟自己抑扬顿挫的背来背去，我更希望和人谈话的时候，我能不经意的说出很多漂亮的句子，让大家觉得，哦，这姑娘谈吐不错啊好吧，我继续推荐了哦………………………………………………吴文英的：三千年事残鸦外，无言倦凭秋树。逝水移川，高陵变谷，那识当时神禹。幽云怪雨。翠萍湿空梁，夜深飞去。雁起青天，数行书似旧藏处。寂寥西窗久坐，故人慳会遇，同翦灯语。积藓残碑，零圭断璧，重拂人间尘土。霜红罢舞。漫山色青青，雾朝烟暮。岸锁春船，画旗喧赛鼓<img src=\"https://pic3.zhimg.com/50/v2-2eb38732ed1bc02353deb43cb642c6b0_hd.jpg\" data-rawwidth=\"700\" data-rawheight=\"1298\" class=\"origin_image zh-lightbox-thumb\" width=\"700\" data-original=\"https://pic3.zhimg.com/v2-2eb38732ed1bc02353deb43cb642c6b0_r.jpg\">逝水移川，高陵变谷重拂人间尘土。物是人非的落寞和孤独（他的诗有点难懂，像涩口的茶，不过意境很好，用词也是我喜欢的温柔）我也不知道是谁的垂杨袅袅映回汀，作态为谁青。可怜弱絮，随风来去，似我飘零。蒙蒙乱点罗衣袂，相送过长亭。叮咛嘱汝：沾泥也好，莫化浮萍。<img src=\"https://pic3.zhimg.com/50/v2-01deacf91bcba219d1f2904fd23c8964_hd.jpg\" data-rawwidth=\"700\" data-rawheight=\"1017\" class=\"origin_image zh-lightbox-thumb\" width=\"700\" data-original=\"https://pic3.zhimg.com/v2-01deacf91bcba219d1f2904fd23c8964_r.jpg\">当时读完之后，觉得特别惊艳，据说是妓女的诗，当时还写了一篇小说：翎春：如何以『男子赖在__里不肯离开』为开头写作？然后就是我们微之了啥？渣男？不听不停，王八念经~他写雨后倦寝数残更，孤灯暗又明。竹梢馀雨重，时复拂帘惊。寄给情人别后相思隔烟水，菖蒲花发五云高。全诗没啥意思，就这两句很有味道然后他的悼亡诗都挺好的，这里就不推荐了，在知乎写过关于他的赏析：翎春：你读过的最让人心酸的句子有哪些？还有挺多推荐的，不知道你们喜欢不我超级喜欢读诗，不过也是外行啦，大家也不要对我要求太严格，如果喜欢我的推荐我就继续写，嫌我俗我就默默地遁了……我，秦始皇，打钱，哦不，要赞顺便，我的微博是：翎春君", "answer_votes": "161", "answer_comment": "​30 条评论"}
{"answer_author": "苏妙喵", "answer_id": 234086702, "answer_text": "古诗词这个东西，讲究的是眼缘，心缘。不要去问哪首，而是遇到有感觉的，就顺手背下来呗。大脑这个东西和硬盘差不多，你多存几首古诗词根本不占什么空间的。但是背下来之后的乐趣可是加倍的。最高峰的时候，我差不多脑袋里有500首诗词吧。诗就不说了，李白岑参李贺孟浩然刘禹锡王维等等。我不是很喜欢白居易但是他的好多诗也背的出，曹操和曹植的很喜欢，屈原的九歌曾经也背过，但是后来竟然忘记大部分了。洛神赋很棒啊。词呢，李煜苏轼晏殊晏几道辛弃疾柳永欧阳修等，喜欢就背啊。李白的词比如秦楼月我高中之后才读到，喜欢的不行，也背。醉里挑灯看剑，独上高楼望尽天涯路，却道天凉好个秋。二十四桥明月夜，稻花香里说丰年；花褪残红青杏小落红飞过秋千去。忽如一夜春风来，落花人独立；不求画堂朱户，春在溪头荠菜花…文字就像音符，就像霞光，就像透过芭蕉叶的雨滴-。在你的脑中和唇齿间绽开。红了樱桃雨打芭蕉点点愁。当你见到草木星月雨雪，这些都涌上心头，也下眉头……你就能像神游一样，和古人共同体味某些气息某些气氛某些月色某些微醺。此外还有元散曲有很多也非常值得背的哦。松花酿酒春水煎茶；三月景宜醉不宜醒；风吹荼靡架，在某时某刻的场景里都会很美。与古人有同等刚开的时候信手拈来，会觉得与李白苏轼对饮小酌的感觉。三言二拍、红楼梦甚至金瓶梅里有不少诗词，也别有意趣，也可以背的。比如我本将心向明月句是从三言二拍里看到的。寒塘孤鹤，冷月葬花…都很有意境。还有日本的俳句中有一些不错的比如寂寞古池塘那篇，充满禅意。现代诗也有一些不错的，可以顺手背下来，忘记谁的句子中有日子像一个禅味的钵，盛着轻轻的雪水淡淡的月光。你喜欢的诗词背下来，其实间接经历了别人的人生。比如李煜吧，衩袜步香阶，手提金缕鞋的甜美的情爱岁月，对应着芦花深处泊孤舟，笛在月明楼；就会是无尽的感慨了。比如苏轼吧，墙内秋千墙外道，笑渐不闻声渐悄——到左牵黄右擎苍；一蓑烟雨任平生到十年生死两茫茫。这些诗词带你进入了他的情感世界。比如辛弃疾吧，气吞万里如虎到稻花香里说丰年；比如陆游吧…红酥手黄藤酒到家祭无忘告乃翁。古人以生命以才华以我们未曾经历也不可能经历的时代，给我们留下他们的人生。我们借着岁月尘沙掩埋下的吉光片羽……得以感受体验他们到思想才华情趣爱恨和遗憾。夜深很困没睡着，敲字到这里，忽然很想带着爱人回到小时候生活的那个大院子，院子里有桃花杏花樱桃，春天陪他看竹外桃花三两枝；海棠依旧夏天有半亩方塘一鉴开；秋天有梧桐树，缺月挂疏桐，感受三杯尔盏淡酒，月满西楼；冬天则在晚来天欲雪的时候守着红泥小火炉，在雪夜乱琼碎玉踏雪寻梅……", "answer_votes": "109", "answer_comment": "​12 条评论"}
{"answer_author": "Three诗睿", "answer_id": 225177595, "answer_text": "不拘束地说，就背诵古诗词而言，没有值不值得，实则看你喜不喜欢。子曰：“知之者不如好之者,好之者不如乐之者。”如若将背诵古诗词作为一种任务，目的着眼于值得，那不仅仅是流于“知之”，而且总会遗忘；然而如果乐之诵之，则会融融于心，久不相忘，恰逢即景，又于无声处浮现。就拿四时之景来说，景催生情，情赋于诗。春日若雨，随风潜入春草碧，绝胜烟柳满皇都；春日曦和，离离原上风不尽，草色枯荣今又生；春夜若雨，时节当春乃发生，随风入夜潜无形；春夜正好，虫声新透绿窗纱，满江吟娥不绝声。夏日如火，农夫内心如汤煮，公子王孙把扇摇；夏有清塘，小荷早有蜻蜓立，江南田田看采莲；夏夜有雨，闲敲棋子落灯花，满心盼望声不发；夜中消夏，对影酌饮观云汉，与客狼藉乎舟中。秋日寥寥，何处秋风送雁群，朝来庭树孤客闻；逢秋出游，三秋桂子十里花，千骑相拥归来夸；秋夜多雨，巴山夜雨涨秋池，冰心一片在玉壶；秋夜送别，枫叶荻花客不发，隔江听闻琵琶声。冬日如雪，山舞银蛇观蜡象，燕山雪花大如席；冬日垂钓，千山不闻啾啾声，孤舟蓑笠对江雪；冬夜访友，乘兴而来夜访戴，尽兴而去命酌酒；冬日相约，晚来欲雪携一斗，对坐小炉醅香茗。如若不喜欢的诗句可能会遗忘在记忆的河流里，而令人生发喜爱的诗句则触景生怀，不自觉地吟诵出声。所以对古诗词的态度，实则是因为喜欢所以背诵，然后偶遇引发共鸣，并追逐美的过程。", "answer_votes": "109", "answer_comment": "​6 条评论"}
{"answer_author": "复姓钟离吾名琮玓", "answer_id": 224747505, "answer_text": "张若虚的<<春江花月夜>>这首诗的地位在文学史上的地位很高。这首诗的创造性是前所未有。为唐代诗风的重大转变打下了良好的基础，它预示着在一个新的高度上融合了南北朝诗风，而同时有鲜明的唐代特征的诗歌发展的高潮，即将到来。-------------补充说明-------------我确定是[只相似]，而不是[望相似]。这是中华书局出版的<<全唐诗>>一百十七卷的记载，并且，川大中文系撰写的古代文学教材，精挑细选，收录的是[只相似]版本。-------------补充结束-------------春江潮水连海平，海上明月共潮生。滟滟随波千万里，何处春江无月明！江流宛转绕芳甸，月照花林皆似霰；空里流霜不觉飞，汀上白沙看不见。江天一色无纤尘，皎皎空中孤月轮。江畔何人初见月？江月何年初照人？人生代代无穷已，江月年年只相似。不知江月待何人，但见长江送流水。白云一片去悠悠，青枫浦上不胜愁。谁家今夜扁舟子？何处相思明月楼？可怜楼上月徘徊，应照离人妆镜台。玉户帘中卷不去，捣衣砧上拂还来。此时相望不相闻，愿逐月华流照君。鸿雁长飞光不度，鱼龙潜跃水成文。昨夜闲潭梦落花，可怜春半不还家。江水流春去欲尽，江潭落月复西斜。斜月沉沉藏海雾，碣石潇湘无限路。不知乘月几人归，落月摇情满江树。", "answer_votes": "377", "answer_comment": "​105 条评论"}
{"answer_author": "秋大司徒", "answer_id": 115242976, "answer_text": "春江花月夜张若虚春江潮水连海平，海上明月共潮生。 滟滟随波千万里，何处春江无月明！ 江流宛转绕芳甸，月照花林皆似霰;空里流霜不觉飞，汀上白沙看不见。 江天一色无纤尘，皎皎空中孤月轮。 江畔何人初见月？江月何年初照人？ 人生代代无穷已，江月年年望相似。 不知江月待何人，但见长江送流水。 白云一片去悠悠，青枫浦上不胜愁。 谁家今夜扁舟子？何处相思明月楼？ 可怜楼上月徘徊，应照离人妆镜台。 玉户帘中卷不去，捣衣砧上拂还来。 此时相望不相闻，愿逐月华流照君。 鸿雁长飞光不度，鱼龙潜跃水成文。 昨夜闲潭梦落花，可怜春半不还家。 江水流春去欲尽，江潭落月复西斜。 斜月沉沉藏海雾，碣石潇湘无限路。 不知乘月几人归，落月摇情满江树。“孤篇盖全唐”", "answer_votes": "707", "answer_comment": "​128 条评论"}
{"answer_author": "梁非凡", "answer_id": 234259766, "answer_text": "&lt;img data-rawheight=\"342\" src=\"https://pic2.zhimg.com/50/v2-f02b85bc09d89417cd264c39ab284d2b_hd.jpg\" data-rawwidth=\"600\" class=\"origin_image zh-lightbox-thumb\" width=\"600\" data-original=\"https://pic2.zhimg.com/v2-f02b85bc09d89417cd264c39ab284d2b_r.jpg\"&gt;", "answer_votes": "50", "answer_comment": "​15 条评论"}
{"answer_author": "孤桐", "answer_id": 115413563, "answer_text": "我也不想背的。&lt;img src=\"https://pic2.zhimg.com/50/070b3cdc86cca58d6e8659511532c5f0_hd.jpg\" data-rawwidth=\"640\" data-rawheight=\"503\" class=\"origin_image zh-lightbox-thumb\" width=\"640\" data-original=\"https://pic2.zhimg.com/070b3cdc86cca58d6e8659511532c5f0_r.jpg\"&gt;罷絮光陰萍滿池，春風吹鬢白成絲。明知生累翻悲死，難遣中年況近衰。花竹每思初種日，江山重見獨來時。人間萬事成追悔，地老天荒卻怨誰。", "answer_votes": "49", "answer_comment": "​19 条评论"}
{"answer_author": "知乎用户", "answer_id": 235094993, "answer_text": "此诗为《东周列国志》“秦王灭周迁九鼎，廉颇败燕杀二将”中的一首诗，无文学内涵美感，但是背会以后可以把周朝天子传承体系理清楚，结合周边可以了解周朝历史，算是对历史学习有所增益吧周武成康昭穆共，懿孝夷厉宣幽终， 以上盛周十二主，二百五十二年逢。 东迁平桓庄厘惠，襄顷匡定简灵继，景悼敬元贞定哀，思考威烈安烈序，显子慎靓赧王亡，东周廿六凑成双。系出喾子后稷弃，太王王季文王昌。首尾三十有八主，八百七十年零四。卜年卜世数过之，宗社灵长古无二。《三国演义》开篇词是杨慎的，但结尾诗是罗贯中的，对三国故事人物有一定的概括，也还好啦 高祖提剑入咸阳，炎炎红日升扶桑；光武龙兴成大统，金乌飞上天中央；  哀哉献帝绍海宇，红轮西坠咸池傍！何进无谋中贵乱，凉州董卓居朝堂；  王允定计诛逆党，李傕郭汜兴刀枪；四方盗贼如蚁聚，六合奸雄皆鹰扬；  孙坚孙策起江左，袁绍袁术兴河梁，刘焉父子据巴蜀，刘表军旅屯荆襄；  张燕张鲁霸南郑，马腾韩遂守西凉；陶谦张绣公孙瓒，各逞雄才占一方。  曹操专权居相府，牢笼英俊用文武；威挟天子令诸侯，总领貌貅镇中土。  楼桑玄德本皇孙，义结关张愿扶主；东西奔走恨无家，将寡兵微作羁旅；  南阳三顾情何深，卧龙一见分寰宇；先取荆州后取川，霸业图王在天府；  呜呼三载逝升遐，白帝托孤堪痛楚！孔明六出祁山前，愿以只手将天补；  何期历数到此终，长星半夜落山坞！姜维独凭气力高，九伐中原空劬劳；  钟会邓艾分兵进，汉室江山尽属曹。丕睿芳髦才及奂，司马又将天下交；  受禅台前云雾起，石头城下无波涛；陈留归命与安乐，王侯公爵从根苗。  纷纷世事无穷尽，天数茫茫不可逃。鼎足三分已成梦，后人凭吊空牢骚。", "answer_votes": "47", "answer_comment": "​8 条评论"}
{"answer_author": "乌托帆", "answer_id": 115282410, "answer_text": "春江花月夜张若虚春江潮水连海平，海上明月共潮生。滟滟 随波千万里，何处春江无月明！江流宛转绕芳甸 ，月照花林皆似霰 。空里流霜 不觉飞，汀 上白沙看不见。江天一色无纤尘 ，皎皎空中孤月轮 。江畔何人初见月？江月何年初照人？人生代代无穷已 ，江月年年望相似 。不知江月待何人，但见 长江送流水。白云一片去悠悠 ，青枫浦上不胜愁。谁家今夜扁舟子 ？何处相思明月楼 ？可怜楼上月徘徊 ，应照离人 妆镜台 。玉户 帘中卷不去，捣衣砧上拂还来。此时相望不相闻 ，愿逐 月华 流照君。鸿雁长飞光不度，鱼龙潜跃水成文 。昨夜闲潭 梦落花，可怜春半不还家。江水流春去欲尽，江潭落月复西斜 。斜月沉沉藏海雾，碣石 潇湘 无限路 。不知乘月 几人归，落月摇情满江树。整篇诗由景、情、理依次展开，第一部分写了春江的美景。第二部分写了面对江月由此产生的感慨。第三部分写了人间思妇游子的离愁别绪。诗人入手擒题，勾勒出一幅春江月夜的壮丽画面：江潮连海，月共潮生。这里的“海”是虚指。江潮浩瀚无垠，仿佛和大海连在一起，气势宏伟。这时一轮明月随潮涌生，景象壮观，一个“生”字，就赋予了明月与潮水以活泼的生命。月光闪耀千万里之遥，哪一处春江不在明月朗照之中。江水曲曲弯弯地绕过花草遍生的春之原野，月色泻在花树上，像撒上了一层洁白的雪。同时，又巧妙地缴足了“春江花月夜”的题面。诗人对月光的观察极其精微，月光荡涤了世间万物的五光十色，将大千世界浸染成梦幻一样的银辉色。因而“空里流霜不觉飞，汀上白沙看不见”，浑然只有皎洁明亮的月光存在。细腻的笔触，创造了一个神话般美妙的境界，使春江花月夜显得格外幽美恬静。这八句，由大到小，由远及近，笔墨逐渐凝聚在一轮孤月上了。清明澄澈的天地宇宙，仿佛使人进入了一个纯净世界，这就自然地引起了诗人的遐思冥想：“江畔何人初见月？江月何年初照人？”诗人神思飞跃，但又紧紧联系着人生，探索着人生的哲理与宇宙的奥秘。 在此处却别开生面，思想没有陷入前人窠臼，而是翻出了新意：“人生代代无穷已，江月年年望相似。”个人的生命是短暂即逝的，而人类的存在则是绵延久长的，因之“代代无穷已”的人生就和“年年望相似”的明月得以共存。诗人虽有对人生短暂的感伤，但并不是颓废与绝望，而是缘于对人生的追求与热爱。“不知江月待何人，但见长江送流水”，这是紧承上一句的“望相似”而来的。人生代代相继，江月年年如此。一轮孤月徘徊中天，像是等待着什么人似的，却又永远不能如愿。月光下，只有大江急流，奔腾远去。随着江水的流动，诗篇遂生波澜，将诗情推向更深远的境界。江月有恨，流水无情，诗人自然地把笔触由上半篇的大自然景色转到了人生图象，引出下半篇男女相思的离愁别恨。“白云”四句总写在月夜中思妇与游子的两地思念之情。“白云”、“青枫浦”托物寓情。白云飘忽，象征“扁舟子”的行踪不定。“青枫浦”为地名，但“枫”“浦”在诗中又常用为感别的景物、处所。“谁家”“何处”二句互文见义，因不止一家、一处有离愁别恨，诗人才提出这样的设问，一种相思，牵出两地离愁，一往一复，诗情荡漾，曲折有致。接下“可怜”八句承“何处”句，写思妇对离人的怀念。然而诗人不直说思妇的悲和泪，而是用“月”来烘托她的怀念之情，悲泪自出。诗篇把“月”拟人化，“徘徊”二字极其传神：一是浮云游动，故光影明灭不定；二是月光怀着对思妇的怜悯之情，在楼上徘徊不忍去。它要和思妇作伴，为她解愁，因而把柔和的清辉洒在妆镜台上、玉户帘上、捣衣砧上。岂料思妇触景生情，反而思念尤甚。她想赶走这恼人的月色，可是月色“卷不去”，“拂还来”，真诚地依恋着她。这里“卷”和“拂”两个痴情的动作，生动地表现出思妇内心的愁怅和迷惘。共望月光而无法相知，只好依托明月遥寄相思之情。“鸿雁长飞光不度”，也暗含鱼雁不能传信之意。最后八句写游子，诗人用落花、流水、残月来烘托他的思归之情。“扁舟子”连做梦也念念归家——花落幽潭，春光将老，人还远隔天涯，江水流春，流去的不仅是自然的春天，也是游子的青春、幸福和憧憬。江潭落月，更衬托出他凄苦的寞寞之情。沉沉的海雾隐遮了落月；碣石、潇湘，天各一方，道路是多么遥远。“沉沉”二字加重地渲染了他的孤寂；“无限路”也就无限地加深了他的乡思。他思忖：在这美好的春江花月之夜，不知有几人能乘月归回自己的家乡。他那无着无落的离情，伴着残月之光，洒满在江边的树林之上。", "answer_votes": "31", "answer_comment": "​4 条评论"}
{"answer_author": "潇湘客", "answer_id": 115075714, "answer_text": "窦娥冤中的句子,作者关汉卿 【滚绣球】有日月朝暮悬，有鬼神掌着生死权。天地也只合把清浊分辨，可怎生糊突了盗跖颜渊：为善的受贫穷更命短，造恶的享富贵又寿延。天地也，做得个怕硬欺软，却元来也这般顺水推船。地也，你不分好歹何为地。天也，你错勘贤愚枉做天！唉，只落得两泪涟涟。&lt;img src=\"https://pic4.zhimg.com/50/b084e3132bed174c92d061386c4aff82_hd.jpg\" data-rawwidth=\"150\" data-rawheight=\"220\" class=\"content_image\" width=\"150\"&gt;还有《红楼梦·飞鸟各投林》为官的，家业凋零；富贵的，金银散尽；有恩的，死里逃生；无情的，分明报应；欠命的，命已还；欠泪的，泪已尽。冤冤相报实非轻，分离聚合皆前定。欲知命短问前生，老来富贵也真侥幸。看破的，遁入空门；痴迷的，枉送了性命。好一似食尽鸟投林，落了片白茫茫大地真干净！红楼梦中的《飞鸟各投林》，作为总结性的判词，蕴含了很多道理，个人最喜欢那句“有恩的，死里逃生，无情的，分明报应”", "answer_votes": "52", "answer_comment": "​8 条评论"}
{"answer_author": "执剑的吟游诗人", "answer_id": 225311313, "answer_text": "这是我很喜欢的一首诗绿蚁新醅酒，红泥小火炉。晚来天欲雪，能饮一杯无。——唐  白居易《问刘十九》你看这样的晚上能否留下来与我共饮一杯酒，多么美好的场景啊！还有一首并没有这么出名的也有异曲同工之妙小榼二升酒，新簟六尺床。能来夜话否，池畔欲秋凉。——白居易《招东邻》", "answer_votes": "70", "answer_comment": "​27 条评论"}
{"answer_author": "穆护砂", "answer_id": 115298501, "answer_text": "（下附十阙王鹏运）看了一下好多高票答主的答案，有一种感觉，太熟悉了，这都是背过读过的老句子。当然我的意思不是贬低这些诗词的价值。举个不恰当的例子雪莱有句著名的诗：冬天来了，春天还会远吗？这句诗被用在各大中小学的作文纸上，以至于如今再来看这句诗已经没有时新的价值和味道，倒是觉得有些单幼和稚嫩。好言归正传！王国维在人间词话未刊稿第二十八则中如是说道：《半塘丁稿》中和冯正中《鹊踏枝》十阙，乃《鹜翁词》之最精者。“望远愁多休纵目”等阙，郁伊惝恍，令人不能为怀。《定稿》只存六阙，殊为未允也。这十阙无论从修辞还是从格局上看，都堪称绝妙。冯正中鹊踏枝十四阙，郁伊悄恍。义兼比兴，蒙…………录十。其一落蕊残阳红片片，懊恨比邻，尽日流莺转。似雪杨花吹又散，东风无力将春限。慵把香罗裁便面，换到轻衫，欢意垂垂浅。襟上泪痕犹隐见，笛声催按梁州遍。其二漫说目成心便许，无据杨花，风里频来去。怅望朱楼难寄语，伤春谁念司勋误？  枉把游丝牵弱缕，几片闲云，迷却相思路。锦帐珠帘歌舞处，旧欢新恨思量否？其三望远愁多休纵目，步绕珍丛，看笋将成竹。晓露暗垂珠簏簌，芳林一带如新浴。  檐外春山森碧玉，梦里骖鸾，记过清湘曲。自定新弦移雁足，弦声未抵归心促。其四斜日危阑凝伫久，问讯花枝，可是年时旧？浓睡朝朝如中酒，谁怜梦里人消瘦。  香阁帘栊烟阁柳，片霎氤氲，不信寻常有。休遣歌筵回舞袖，好怀珍重春三后。其五昼日恹恹惊夜短，片霎欢娱，那惜千金换。燕睨莺颦春不管，敢辞弦索为君断。隐隐轻雷闻隔岸，暮雨朝霞，咫尺迷云汉。独对舞衣思旧伴，龙山极目烟尘满。其六风荡春云罗样薄，难得轻阴，芳事休闲却。几日啼鹃花又落，绿笺莫忘深深约。老去吟情浑寂寞，细雨檐花，空忆灯前酌。隔院玉箫声乍作，眼前何物供哀乐。其七谁遣春韶随水去？醉倒芳尊，望却朝和暮。换尽大堤芳草路，倡条都是相思树。  蜡烛有心灯解语，泪尽唇焦，此恨消沈否？坐对东风怜弱絮，萍飘后日知何处。其八对酒肯教欢意尽？醉醒恹恹，无那忺春困。锦字双行笺别恨，泪珠界破残妆粉。  轻燕受风飞远近，消息谁传，盼断乌衣信。曲几无憀闲自隐，镜奁心事孤鸾鬓。其九几见花飞能上树，难系流光，枉费垂杨缕。筝雁斜飞排锦柱，只伊不解将春去。  漫诩心情黏地絮，容易飘飏，那不惊风雨。倚遍阑干谁与语？思量有恨无人处。其十谱到阳关声欲裂，亭短亭长，杨柳那堪折。挑菜湔裙春事歇，带罗羞指同心结。  千里孤光同皓月，画角吹残，风外还呜咽。有限坠欢争忍说，伤生第一生离别。", "answer_votes": "21", "answer_comment": "​18 条评论"}
{"answer_author": "君子淮然", "answer_id": 115638008, "answer_text": "离骚 屈原帝高阳之苗裔兮，朕皇考曰伯庸； 摄提贞于孟陬兮，惟庚寅吾以降； 皇览揆余于初度兮，肇锡余以嘉名； 名余曰正则兮，字余曰灵均； 纷吾既有此内美兮，又重之以修能； 扈江离与辟芷兮，纫秋兰以为佩； 汩余若将不及兮，恐年岁之不吾与； 朝搴阰之木兰兮，夕揽洲之宿莽； 日月忽其不淹兮，春与秋其代序； 惟草木之零落兮，恐美人之迟暮； 不抚壮而弃秽兮，何不改乎此度？ 乘骐骥以驰骋兮，来吾导夫先路。 昔三后之纯粹兮，固众芳之所在； 杂申椒与菌桂兮，岂维纫夫蕙芷； 彼尧舜之耿介兮，既遵道而得路； 何桀纣之猖披兮，夫唯捷径以窘； 惟夫党人之偷乐兮，路幽昧以险隘； 岂余身之惮殃兮，恐皇舆之败绩； 忽奔走以先后兮，及前王之踵武； 荃不察余之中情兮，反信馋而齌怒； 余固知謇謇之为患兮，忍而不能舍也； 指九天以为正兮，夫唯灵修之故也； 初既与余成言兮，后悔遁而有他； 余既不难夫离别兮，伤灵修之数化。 余既兹兰之九畹兮，又树蕙之百亩； 畦留夷与揭车兮，杂度蘅与方芷； 冀枝叶之峻茂兮，愿竢时乎吾将刈； 虽萎绝其亦何伤兮，哀众芳之芜秽； 众皆竞进以贪婪兮，凭不厌乎求索； 羌内恕己以量人兮，各兴心而嫉妒； 忽驰骛以追逐兮，非余心之所急； 老冉冉其将至兮，恐修名之不立； 朝饮木兰之坠露兮，夕餐秋菊之落英； 苟余情其信姱以练要兮，长顑颔亦何伤； 揽木根以结芷兮，贯薜荔之落蕊； 矫菌桂以纫蕙兮，索胡绳之纚纚； 謇吾法夫前修兮，非世俗之所服； 虽不周于今之人兮，愿依彭咸之遗则！ 长太息以掩涕兮，哀民生之多艰； 余虽好修姱以鞿羁兮，謇朝谇而夕替； 既替余以蕙纕兮，又申之以揽芷； 亦余心之所善兮，虽九死其尤未悔； 众女疾余之蛾眉兮，谣诼谓余以善淫； 固时俗之工巧兮，偭规矩而改错； 背绳墨以追曲兮，竞周容以为度； 忳郁邑余挓傺兮，吾独穷困乎此时也； 宁溘死以流亡兮，余不忍为此态； 鸷鸟之不群兮，自前世而固然； 何方圜之能周兮，夫孰异道而相安； 屈心而抑志兮，忍尤而攘诟； 伏清白以死直兮，固前圣之所厚。 悔相道之不察兮，延伫乎吾将反； 回朕车以复路兮，及行迷之未远； 步余马于兰皋兮，驰椒丘且焉止息； 进不入以离尤兮，退将复修吾初服； 制芰荷以为衣兮，集芙蓉以为裳； 不吾知其亦已兮，苟余情其信芳； 高余冠之岌岌兮，长余佩之陆离； 芳与泽其杂糅兮，唯昭质其犹未亏； 忽反顾以游目兮，将往观乎四荒； 佩缤纷其繁饰兮，芳菲菲其弥章； 民生各有所乐兮，余独好修以为常； 虽体解吾犹未变兮，岂余心之可惩。 女媭之婵媛兮，申申其詈予。 曰：“鮌婞直以亡身兮，终然夭乎羽之野； 汝何博謇而好修兮，纷独有此姱节； 薋菉葹以盈室兮，判独离而不服； 众不可户说兮，孰云察余之中情； 世并举而好朋兮，夫何茕独而不予听。” 依前圣以节中兮，喟凭心而历兹； 济沅湘以南征兮，就重华而陈词： “启《九辩》与《九歌》兮，夏康娱以自纵； 不顾难以图后兮，五子用乎家巷； 羿淫游以佚畋兮，又好射夫封狐； 固乱流其鲜终兮，浞又贪夫厥家； 浇身被服强圉兮，纵欲而不忍； 日康娱而自忘兮，厥首用夫颠陨； 夏桀之常违兮，乃遂焉而逢殃； 后辛之菹醢兮，殷宗用之不长； 汤禹俨而祗敬兮，周论道而莫差； 举贤才而授能兮，循绳墨而不颇； 皇天无私阿兮，揽民德焉错辅； 夫维圣哲以茂行兮，苟得用此下土； 瞻前而顾后兮，相观民之计极； 夫孰非义而可用兮，孰非善而可服； 阽余身而危死兮，揽余初其犹未悔； 不量凿而正枘兮，固前修以菹醢。” 曾歔欷余郁邑兮，哀朕时之不当； 揽茹蕙以掩涕兮，沾余襟之浪浪。 跪敷衽以陈词兮，耿吾既得中正； 驷玉虬以乘鹥兮，溘埃风余上征； 朝发轫于苍梧兮，夕余至乎县圃； 欲少留此灵琐兮，日忽忽其将暮； 吾令羲和弭节兮，望崦嵫而匆迫； 路曼曼其修远兮，吾将上下而求索； 饮余马于咸池兮，总余辔乎扶桑； 折若木以拂日兮，聊逍遥以相羊； 前望舒使先驱兮，后飞廉使奔属； 鸾皇为余先戒兮，雷师告余以未具； 吾令凤鸟飞腾夕，继之以日夜； 飘风屯其相离兮，帅云霓而来御； 纷总总其离合兮，斑陆离其上下； 吾令帝阍开关兮，倚阊阖而望予； 时暧暧其将罢兮，结幽兰而延伫； 世溷浊而不分兮，好蔽美而嫉妒。 朝吾将济于白水兮，登阆风而緤马； 忽反顾以流涕兮，哀高丘之无女； 溘吾游此春宫兮，折琼枝以继佩； 及荣华之未落兮，相下女之可诒； 吾令丰隆乘云兮，求宓妃之所在； 解佩纕以结言兮，吾令蹇修以为理； 纷总总其离合兮，忽纬繣其难迁； 夕归次于穷石兮，朝濯发乎洧盘； 保厥美以骄傲兮，日康娱以淫游； 虽信美而无礼兮，来违弃而改求； 览相观于四极兮，周流乎天余乃下； 望瑶台之偃蹇兮，见有娀之佚女； 吾令鸩为媒兮，鸩告余以不好； 雄鸠之鸣逝兮，余犹恶其佻巧； 心犹豫而狐疑兮，欲自适而不可； 凤皇既受诒兮，恐高辛之先我； 欲远集而无所适兮，聊浮游以逍遥； 及少康之未家兮，留有虞之二姚； 理弱而媒拙兮，恐导言之不固； 世溷浊而嫉贤兮，好蔽美而称恶； 闺中既已邃远兮，哲王又不寤； 怀朕情而不发兮，余焉能忍此终古。 索藑茅以筳篿兮，命灵氛为余占之； 曰：两美其必合兮，孰信修而慕之； 思九州之博大兮，岂惟是其有女？ 曰：勉远逝而无狐疑兮，孰求美而释女？ 何所独无芳草兮，尔何怀乎故宇； 世幽昧以昡曜兮，孰云察余之善恶； 民好恶其不同兮，惟此党人其独异； 户服艾以盈要兮，谓幽兰其不可佩； 览察草木其犹未得兮，岂珵美之能当？ 苏粪壤以充帏兮，谓申椒其不芳。 欲从灵氛之吉占兮，心犹豫而狐疑； 巫咸将夕降兮，怀椒糈而要之； 百神翳其备降兮，九疑缤其并迎； 皇剡剡其扬灵兮，告余以吉故； 曰：勉升降以上下兮，求榘镬之所同； 汤禹严而求合兮，挚咎繇而能调； 苟中情其好修兮，又何必用夫行媒； 说操筑于傅岩兮，武丁用而不疑； 吕望之鼓刀兮，遭周文而得举； 宁戚之讴歌兮，齐桓闻以该辅； 及年岁之未晏兮，时亦犹其未央； 恐鹈鴂之先鸣兮，使夫百草为之不芳； 何琼佩之偃蹇兮，众薆然而蔽之； 惟此党人之不谅兮，恐嫉妒而折之； 时缤纷其变易兮，又何可以淹留； 兰芷变而不芳兮，荃蕙化而为茅； 何昔日之芳草兮，今直为此萧艾也； 岂其有他故兮，莫好修之害也； 余既以兰为可侍兮，羌无实而容长； 委厥美以从俗兮，苟得列乎众芳； 椒专佞以慢韬兮，樧又欲充夫佩帏； 既干进而务入兮，又何芳之能祗； 固时俗之流从兮，又孰能无变化； 览椒兰其若兹兮，又况揭车与江离； 惟兹佩之可贵兮，委厥美而历兹； 芳菲菲而难亏兮，芬至今犹未沫； 和调度以自娱兮，聊浮游而求女； 及余饰之方壮兮，周流观乎上下。 灵芬既告余以吉占兮，历吉日乎吾将行； 折琼枝以为羞兮，精琼爢以为粻；为余驾飞龙兮，杂瑶象以为车； 何离心之可同兮，吾将远逝以自疏； 邅吾道夫昆仑兮，路修远以周流； 扬云霓之晻蔼兮，鸣玉鸾之啾啾； 朝发轫于天津兮，夕余至乎西极； 凤皇翼其承旗兮，高翱翔之翼翼； 乎吾行此流沙兮，遵赤水而容与； 麾蛟龙使梁津兮，诏西皇使涉予； 路修远以多艰兮，腾众车使径待； 路不周以左转兮，指西海以为期； 屯余车其千乘兮，齐玉轪而并驰； 驾八龙之蜿蜿兮，载云旗之委蛇； 抑志而弭节兮，神高驰之邈邈； 奏《九歌》而舞《韶》兮，聊假日以偷乐； 陟升皇之赫戏兮，忽临睨夫旧乡； 仆夫悲余马怀兮，蜷局顾而不行。 乱曰：已矣哉， 国无人莫我知兮，又何怀乎故都； 既莫足为美政兮，吾将从彭咸之所居。离骚节奏和音律很美描写得景象纷呈叙述得酣畅淋漓争辩得入情入理比喻得奇幻诡谲更重要的是离骚背下来之后背别的都不难。 ", "answer_votes": "42", "answer_comment": "​21 条评论"}
{"answer_author": "李湖居士", "answer_id": 239122799, "answer_text": "宋词读罢，最喜两首。一为放翁《卜算子•咏梅》，一为坡老《定风波•莫听穿林打叶声》，境界颇高，都是我苦苦追求而不得的。《卜算子•咏梅》驿外断桥边，寂寞开无主。已是黄昏独自愁，更著风和雨。无意苦争春，一任群芳妒。零落成泥碾作尘，只有香如故。——————————————————————《定风波•莫听穿林打叶声》三月七日，沙湖道中遇雨。雨具先去，同行皆狼狈，余独不觉，已而遂晴，故作此词。莫听穿林打叶声，何妨吟啸且徐行。竹杖芒鞋轻胜马，谁怕？一蓑烟雨任平生。料峭春风吹酒醒，微冷，山头斜照却相迎。回首向来萧瑟处，归去，也无风雨也无晴。——————————————————————《卜算子·咏梅》上阕集中写了梅花的困难处境，下阕写梅花的灵魂及生死观。放翁以物喻人，托物言志，以清新的情调写出了傲然不屈的梅花，暗喻了自己虽终生坎坷却坚贞不屈，达到了物我融一的境界，笔致细腻，意味深隽，是咏梅词中的绝唱。《定风波·莫听穿林打叶声》深得道家旷达豪放的精神。坡老通过野外途中偶遇风雨这一生活中的小事，于简朴中见深意，于寻常处生奇景，表现出旷达超脱的胸襟，寄寓着超凡脱俗的人生理想。上阕着眼于雨中，下阕着眼于雨后，体现出一个正直文人在坎坷人生中力求解脱之道，篇幅虽短，但意境深邃，内蕴丰富，诠释和展现着作者的人生信念和精神追求。推荐几首唐诗。渡荆门送别唐·李白渡远荆门外，来从楚国游。山随平野尽，江入大荒流。月下飞天镜，云生结海楼。仍怜故乡水，万里送行舟。闻官军收河南河北唐·杜甫剑外忽传收蓟北，初闻涕泪满衣裳。却看妻子愁何在，漫卷诗书喜欲狂。白日放歌须纵酒，青春作伴好还乡。即从巴峡穿巫峡，便下襄阳向洛阳。早寒江上有怀唐·孟浩然木落雁南度，北风江上寒。我家襄水曲，遥隔楚云端。乡泪客中尽，孤帆天际看。迷津欲有问，平海夕漫漫。汉江临泛唐·王维楚塞三湘接，荆门九派通。江流天地外，山色有无中。郡邑浮前浦，波澜动远空。襄阳好风日，留醉与山翁。", "answer_votes": "49", "answer_comment": "​16 条评论"}
{"answer_author": "江旅", "answer_id": 171864287, "answer_text": "武汉大学，文学院我们院有一个经典诵读的活动，然后老师给我们开了个单子。我觉得这个单子基本上可以算是比较有参考意义的背诵名单了。如果题主比较有追求的话，可以试着全背下来：<img src=\"https://pic4.zhimg.com/50/v2-2aad8f6502713ab30b443fc2659cc620_hd.jpg\" data-rawwidth=\"561\" data-rawheight=\"495\" class=\"origin_image zh-lightbox-thumb\" width=\"561\" data-original=\"https://pic4.zhimg.com/v2-2aad8f6502713ab30b443fc2659cc620_r.jpg\"><img src=\"https://pic3.zhimg.com/50/v2-61263e710fa6e8d76e087aab2f1485f7_hd.jpg\" data-rawwidth=\"554\" data-rawheight=\"365\" class=\"origin_image zh-lightbox-thumb\" width=\"554\" data-original=\"https://pic3.zhimg.com/v2-61263e710fa6e8d76e087aab2f1485f7_r.jpg\"><img src=\"https://pic1.zhimg.com/50/v2-fd69ad22e1dc09e0cbc020b5b607908c_hd.jpg\" data-rawwidth=\"556\" data-rawheight=\"368\" class=\"origin_image zh-lightbox-thumb\" width=\"556\" data-original=\"https://pic1.zhimg.com/v2-fd69ad22e1dc09e0cbc020b5b607908c_r.jpg\"><img src=\"https://pic2.zhimg.com/50/v2-3fce2f828912947fe9824b837f1eb4f5_hd.jpg\" data-rawwidth=\"554\" data-rawheight=\"344\" class=\"origin_image zh-lightbox-thumb\" width=\"554\" data-original=\"https://pic2.zhimg.com/v2-3fce2f828912947fe9824b837f1eb4f5_r.jpg\"><img src=\"https://pic4.zhimg.com/50/v2-db2f41bff8be0b92a9ed24bd957e4559_hd.jpg\" data-rawwidth=\"556\" data-rawheight=\"496\" class=\"origin_image zh-lightbox-thumb\" width=\"556\" data-original=\"https://pic4.zhimg.com/v2-db2f41bff8be0b92a9ed24bd957e4559_r.jpg\"><img src=\"https://pic1.zhimg.com/50/v2-88336fec293db569e1622ced9b5513ee_hd.jpg\" data-rawwidth=\"552\" data-rawheight=\"153\" class=\"origin_image zh-lightbox-thumb\" width=\"552\" data-original=\"https://pic1.zhimg.com/v2-88336fec293db569e1622ced9b5513ee_r.jpg\"><img src=\"https://pic4.zhimg.com/50/v2-02bd252519e6abcf0dcac37964a2b0ea_hd.jpg\" data-rawwidth=\"555\" data-rawheight=\"303\" class=\"origin_image zh-lightbox-thumb\" width=\"555\" data-original=\"https://pic4.zhimg.com/v2-02bd252519e6abcf0dcac37964a2b0ea_r.jpg\"><img src=\"https://pic4.zhimg.com/50/v2-d9098ca10e5208320e67a5039a04b74f_hd.jpg\" data-rawwidth=\"555\" data-rawheight=\"345\" class=\"origin_image zh-lightbox-thumb\" width=\"555\" data-original=\"https://pic4.zhimg.com/v2-d9098ca10e5208320e67a5039a04b74f_r.jpg\">古今中外都有涉及，可以按兴趣来。", "answer_votes": "49", "answer_comment": "​4 条评论"}
{"answer_author": "卖房雇保姆", "answer_id": 224923838, "answer_text": "我本人大约能背下6000多首诗词，其中绝大多数都是和爱情有关或者偏婉约的。推荐一些相对冷门的或比较有趣有故事性的诗词曲。手打，就当是复习，可能会有所错漏。既然是手打，会选择一些篇幅相对短小的。————夏之中《古离别》郎上孤舟妾上楼，栏杆未倚泪先流。片帆渐远郎回首，一种相思两处愁。朱淑真《元夜》火烛银花触目红，揭天鼓吹闹春风。新欢入手愁忙里，旧事惊心忆梦中。但愿暂成人缱绻，不妨常任月朦胧。赏灯哪得功夫醉，未必明年此会同。她写的另一首关于元宵节的诗词更有名。就是那首“月上柳梢头，人约黄昏后”。但也有人认为那首是欧阳修所做。我太喜欢她的诗了。再推荐一首。朱淑真《恨春》一瞬芬菲尔许时，苦无佳句寄相思。春光虽好多风雨，恩爱方深奈别离。泪眼谢它花缴抱，愁怀惟赖酒扶持。莺莺燕燕休相笑，试与单栖各自知。怕字句有所疏漏，专门去百度了一下。网上果然没有这首诗。倒也挺好。吴梅村《琴河感旧》休将消息恨层城，犹有罗敷未嫁情。车过卷帘徒怅望，梦来褍袖费逢迎。青山憔悴卿怜我，红粉飘零我忆卿。记得横塘秋夜好，玉钗恩重是前生。吴梅村就是吴伟业，也就是写《圆圆曲》那个。“冲冠一怒为红颜”。这首诗对我的影响很大，很喜欢他的这种风格。我自己写过的诗里，有一句“青衫浪子天涯远，红粉佳人照片中。”后来一想，潜意识里就是受到他的影响。李商隐《暮秋独游曲江》荷叶生时春恨生，荷叶枯时秋恨成。深知身在情长在，怅望江头江水声。（搜狗拼音就是好。）这首诗堪称装逼神器。关于我和这首诗的故事，可以看下我关于装逼的那个答案。当然，这首诗不算太冷门。李商隐《锦瑟》锦瑟无端五十弦，一弦一柱思华年。庄生晓梦迷蝴蝶，望帝春心托杜鹃。沧海月明珠有泪，蓝田日暖玉生烟。此情可待成追忆，只是当时已惘然。不冷门就不冷门吧。《还珠格格》里，尔康紫薇小燕子他们将含香放跑了，然后骗乾隆皇帝说，香妃娘娘变成蝴蝶飞走了。尔康在劝慰乾隆的时候，就说到这句“庄生晓梦迷蝴蝶，望帝春心托杜鹃”。晏殊《浣溪沙》一向年光有限身。等闲离别易销魂。酒筵歌席莫辞频。满目山河空念远，落花风雨更伤春。不如怜取眼前人。我为什么会想到这首词呢？因为，“香妃娘娘变成蝴蝶飞走了”之后，不仅尔康要劝慰乾隆，令妃娘娘也要劝他。“满目山河空念远，不如怜取眼前人”，出自令妃娘娘之口再合适不过了。琼瑶果然人才。我生平最最喜欢的诗人词人就三个:秦观，晏几道，黄景仁。这晏殊就是晏几道的父亲。晏殊最有名的句子，应该就是那句“无可奈何花落去，似曾相识燕归来”了。辛弃疾《青玉案.元夕》东风夜放花千树，更吹落，星如雨。宝马雕车香满路，凤箫声动，玉壶光转，一夜鱼龙舞。蛾儿雪柳黄金缕，笑语盈盈暗香去。众里寻他千百度，蓦然回首，那人却在，灯火阑珊处。《还珠格格》中，箫剑第一次见到晴儿的时候，就感叹了这句“众里寻他千百度，蓦然回首，那人却在灯火阑珊处。”每次过年除夕夜，我望着满天的烟花，都忍不住装逼，感叹一句:“东风夜放花千树，更吹落、星如雨”。李煜《浪淘沙》帘外雨潺潺，春意阑珊。罗衾不耐五更寒。梦里不知身是客，一晌贪欢。独自莫凭栏，无限江山，别时容易见时难。流水落花春去也，天上人间。现在，你们知道，为什么《还珠格格》的第三部叫《天上人间》了吧……好了，我保证后面再也不提《还珠格格》了……这李后主虽是昏君，作词却是第一流的。在我看来，堪称词中第一人。哪怕苏东坡柳三变也难以望其项背。（虽然我也很喜欢苏轼柳永，但我确定没有用错成语。）元稹《离思》曾经沧海难为水，除却巫山不是云。取次花丛懒回顾，半缘修道半缘君。终于轮到这个人渣出场了。元稹，唐诗界的伊藤诚。他先是将崔莺莺搞上床，最后却始乱终弃。抛弃了崔莺莺后，娶了当朝尚书的女儿韦丛。在韦丛死后，写下深情款款的悼亡诗。“诚知此恨人人有，贫贱夫妻百事哀”。然后马上续娶了河东才女裴柔之续弦。和他上过床的，还有女校书薛涛和歌女刘采春。当然，他心中的最爱，始终是那个叫白居易的男人……夜深忽梦少年事，唯梦闲人不梦君。柳永《蝶恋花》伫倚危楼风细细，望极春愁，黯黯生天际。草色烟光残照里，无言谁会凭阑意。拟把疏狂图一醉，对酒当歌，强乐还无味。衣带渐宽终不悔，为伊消得人憔悴。柳永，又名柳七，柳耆卿，柳景庄，柳屯田，奉旨填词柳三变。著名词人、嫖客，达到了“白玩不给钱”的嫖客最高境界。据说死了没钱埋葬，还是妓女们凑钱把他埋了。每到祭日，这些三陪小姐们就会来给他上坟，所谓“众名妓春风吊柳七”。人们捧金庸的时候总爱说“凡有井水处皆歌柳词，凡有华人的地方就有金庸的小说”。拿金庸和柳永类比。其实挺不伦不类的……李煜《相见欢》林花谢了春红，太匆匆，无奈朝来寒雨晚来风。胭脂泪，相留醉，几时重，自是人生长恨水长东。这个还需要理由吗？这么好的词怎么能不背下来。突然想起琼瑶的那本《匆匆，太匆匆》……说个有趣的。匆匆太匆匆，几度夕阳红。情有千千结，窗外翦翦风。                  ——琼瑶小说集句。《匆匆，太匆匆》出自李后主《相见欢》，《几度夕阳红》自然是出自《三国演义》，这首词真正的作者是杨慎。《情有千千结》自然是出自张先的那句“心似双丝网，中有千千结”。《窗外》按照琼瑶书中原意，出自聂胜琼“枕前泪共阶前雨，隔个窗儿滴到明。”《翦翦风》大概是出自韩偓那句“恻恻轻寒翦翦风”吧。太晚了，老婆催我睡觉了，改天再继续写。寒夜读书忘却眠，锦衾香尽炉无烟。美人含怒夺灯去，问郎知是几更天？未完待续。————彭伉妻《寄夫》驿使今朝过五湖，殷勤为我报狂夫。从来夸有龙泉剑，试割相思得断无？我家里就有一把龙泉剑。每当别人看到我这把剑，念出上面“龙泉剑”三个字的时候。我就不动声色的把这首诗的后两句念出来。那种装逼的感觉……就是爽。孩子醒了，有空再聊。未完待续————姜夔《过垂虹》自作新词韵最娇，小红低唱我吹箫。曲终过尽松陵路，回首烟波十四桥。姜夔这人一辈子不得志，苦逼的一生。这个叫小红的丫头，是范成大送给他的。对姜夔来说，这个女孩很重要，对范成大而言，这个女孩无足轻重，因为他还有许多许多……同样是男人，气运却是如此的不同。这个叫小红的女孩子后来也和姜夔分开了。甚至据说是被穷困潦倒的姜夔给卖了……只能说，不求天长地久，但求曾经拥有。至少，写这首诗的那一刻，姜夔心底是快乐的。苏轼《蝶恋花》花褪残红青杏小，燕子飞时，绿水人家绕。枝上柳绵吹又少，天涯何处无芳草。墙里秋千墙外道，墙外行人，墙里佳人笑。笑渐不闻声渐悄，多情却被无情恼。（感谢搜狗拼音。）苏东坡是我的偶像，当初看陆毅主演的电视剧版《苏东坡》，简直要把我看哭了。至于认为李煜是词中魁首，只是我个人的看法。每个人的欣赏品味不同、眼界不同。天涯何处无芳草，对象别在班里找。本来数量就不多，何况质量还不好。推荐一部三级片，《足本玉蒲团》。剧中有一段情节，是主角未央生和他的老婆在秋千上做爱。是从空中俯视拍摄的视角。他俩在院子里面的秋千上做爱，院子外面的街道上行人匆匆走过。那一刻，让我联想到这首词的下半阙，“墙里秋千墙外道，墙外行人，墙里佳人笑……”晏几道《临江仙》斗草阶前初见，穿针楼上曾逢。罗裙香露玉钗风。靓妆眉沁绿，羞艳粉生红。流水渐随春远，行云终与谁同。酒醒长恨锦屏空。相寻梦里路，飞雨落花中。终于轮到我偶像出场了。很多年前，我在图书馆看书。翻看婉约词，看到晏几道的这首《临江仙》。“流水渐随春远，行云终与谁同。酒醒长恨锦屏空，相寻梦里路，飞雨落花中。”我为词中意境所感，突然心潮涌动，热泪盈眶。我将书本慢慢合上，闭上眼睛，在心里对自己说了一句话:“哪怕只是为了这阙词，我也要爱我的祖国。”这是我自己对自己说的真心话。从小到大，我在学校里受了无数爱国主义教育，然而似乎并没有太大的作用。而看了这首词却突然使我心生爱国之念。这是一种很奇怪很微妙的感觉。我后来想想，这也许就是文化的力量吧。白居易《花非花》花非花，雾非雾。夜半来，天明去。来如春梦不多时，去似朝云无觅处。你说你约个炮至于嘛……不过确实是很唯美。这首诗是描写妓女的神秘与浪漫。现在用这首诗来描写一夜情再合适不过了。这白居易可是个风流人物。身边美女无数，最有名的两个美女自然是樊素和小蛮。所谓“樱桃樊素口，杨柳小蛮腰”。《红楼梦》贾宝玉《春夜即事》霞绡云幄任铺陈，隔巷蟆更听未真。枕上轻寒窗外雨，眼前春色梦中人。盈盈烛泪因谁泣，点点花愁为我嗔。自是小嬛娇懒惯，拥衾不耐笑言频。我微信上的签名就是“枕上轻寒窗外雨，眼前春色梦中人。”我写诗的时候也借用过那句“盈盈烛泪因谁泣”。只不过我是用来描写SM的。《上邪》上邪！我欲与君相知，长命无绝衰。山无陵，江水为竭，冬雷震震，夏雨雪，天地合，乃敢与君绝。《还珠格格》里面紫薇最爱说的就是那句“山无棱，天地合，乃敢与君绝。”我前面好像保证了什么事情……范成大《车遥遥篇》车遥遥，马憧憧。君游东山东复东，安得奋飞逐西风。愿我如星君如月，夜夜流光相皎洁。月暂晦，星常明。留明待月复，三五共盈盈。范成大，就是把小红送给姜夔的那个人。我关注的某个知乎大V的签名，就是那句“愿我如星君如月，夜夜流光相皎洁”。秦观《八六子》倚危亭。恨如芳草，萋萋刬尽还生。念柳外青骢别后，水边红袂分时，怆然暗惊。无端天与娉婷。夜月一帘幽梦，春风十里柔情。怎奈向、欢娱渐随流水，素弦声断，翠绡香减，那堪片片飞花弄晚，蒙蒙残雨笼晴。正销凝，黄鹂又啼数声。很显然，琼瑶阿姨特别喜欢这首词。“你只是失去了一条腿，可紫菱呢，她失去的可是她的爱情啊！”不要以为这首词有多么难背。当你真的背了下来，朗朗上口的念出来，你知道有多爽吗！秦观，秦少游，苏轼手下苏门四学士之一。婉约词的代表人物，柳永之后第一人。传说中他娶了苏东坡的妹妹苏小妹，但也只是传说中而已。鱼玄机《赠邻女》羞日遮罗袖，愁春懒起妆。易求无价宝，难得有心郎。枕上潜垂泪，花间暗断肠。自能窥宋玉，何必恨王昌。那句“易求无价宝，难得有情郎”就是从这首诗来的。关于鱼玄机这个人。推荐一部三级片《唐朝豪放女》，可以通过那部片子了解一下她的生平故事。今晚就先写到这里吧。未完待续。————黄景仁《绮怀诗》几回花下坐吹箫，银汉红墙入望遥。 似此星辰非昨夜，为谁风露立中宵。 缠绵思尽抽残茧，宛转心伤剥后蕉。 三五年时三五月，可怜杯酒不曾消。前尘如梦，千古伤心。……好爱好爱他。如果非要强迫我和某个男人搞基的话，我就选他。风寒露重，黄公子，回去吧……王国维在《人间词话》中说人生有三重境界，又被三毛称之为爱情的三重境界。所谓:“昨夜西风凋碧树，独上高楼，望断天涯路”。“衣带渐宽终不悔，为伊消得人憔悴。”“众里寻他千百度，蓦然回首，那人却在，灯火阑珊处。”很多年前，曾和朋友开玩笑说:其实，失恋被人甩也是有三重境界的。第一重:此情可待成追忆，只是当时已惘然。（李商隐《锦瑟》）这是你刚刚失恋，刚刚被人家抛弃。还处在一片迷茫之中。第二重:珊瑚百尺珠千斛，难换罗敷未嫁身。（黄景仁《感旧》）这是前女友终于嫁给了别人。可惜不是你。第三重:狂风落尽深红色，绿叶成荫子满枝。（杜牧《叹花》）这是人家连孩子都有了。你是彻底没指望了。很悲凉吧……我眼中最悲凉的诗，是黄景仁的那首《除夕偶成》:千家笑语漏迟迟，忧患潜从物外知。悄立市桥人不识，一星如月看多时。如果不是和他一样孤独孤单，是无法体会到诗中的意味的。以别人的欢笑衬托着他的孤单，以喧哗热闹的场景衬托诗人内心的萧索凄凉。茕茕独立于桥上，却无一人相识，仿佛已经被全天下抛弃一般。百无聊赖的望着天上的那颗星星。这种孤独的描写，言有尽而意无穷，只有经历过的人才能体会这诗的妙处，只有同是伤心人才能与作者产生心灵的共鸣。同是天涯沦落人。说是要推荐冷门的，结果找了一大堆代表作。推荐一些百度不到的诗词吧。杨慎《驻马听》离别曾经，不似今番最惨情。想着她水边袅袅、月底娟娟、花下盈盈，到如今守窗无语恨长更，灯前不见徘徊影，万里飘零，那堪对此凄凉境。杨慎。《三国演义》的开篇词，那首“青山依旧在，几度夕阳红”就是他的作品。其实杨慎比罗贯中要晚出生许多年。在最早的《三国演义》版本里是不可能有这首词的。要等到许多年后，毛宗岗批点《三国演义》的时候，才将杨慎的那首词加进书里的。另外，郭德纲经常用来做定场诗的那首《西江月》“道德三皇五帝，功名夏后商周”也是杨慎的作品。至于上面那首《驻马听》的创作背景。我猜和他被发配云南有关。因为“大礼议事件”，杨慎得罪了嘉靖皇帝，被发配到云南。不得不和自己的妻子黄娥分别。黄娥为此也专门写过一首诗。雁飞曾不到衡阳，锦字何由寄永昌。三春花柳妾薄命，六诏风烟君断肠。曰归曰归愁岁暮，其雨其雨怨朝阳。相闻空有刀环约，何日金鸡下夜郎。（这首当然百度的到。）王娇红《寄申生》咫尺天涯一望间，重帘十二拥朱栏。断肠芳草连天碧，作恶东风特地寒。笼里飞禽堪再复，盆中覆水恐收难。落花舞絮春如水，下却朱帘不忍看。屈指光阴又隔春，朱颜枉负一生身。情牵相唤莺声细，肠断无端草色新。露帐银床初破睡，舞衫歌扇总生尘。几回惆怅空悲叹，只为无情薄幸人。史凤《神鸡枕》枕绘鸳鸯久与栖，新裁雾縠斗神鸡。与郎酣梦浑忘晓，鸡亦留连不肯啼。史凤是一个三陪小姐。而且特别的势利眼，把客人分成三六九等。上等客人可以进她的迷香洞，下等客人连她的面也见不到，只能吃到一碗闭门羹。这也是闭门羹这个词的来历。冷门的先到这里。《孔雀东南飞》节选君当作磐石，妾当作蒲苇。蒲苇纫如丝，磐石无转移。《还珠格格》中，紫薇对乾隆说:“皇上，我娘临死前让我问你。蒲苇韧如丝，磐石是不是无转移！？”（有没有一种“自挂东南枝”的冲动？）叶梦得《虞美人》落花已作风前舞，又送黄昏雨。晓来庭院半残红。惟有游丝千丈、袅晴空。殷勤花下同携手，更尽杯中酒。美人不用敛蛾眉。我亦多情，无奈酒阑时。就羡慕你们这些住花园别墅的有钱人……家里有个庭院，是多么幸福的一件事情。我此生最大的理想，就是能过上这首词里所描述的生活。吴文英《唐多令》何处合成愁，离人心上秋。纵芭蕉、不雨也飕飕。都道晚凉天气好，有明月、怕登楼。 年事梦中休，花空烟水流。燕辞归、客尚淹留。垂柳不萦裙带住，漫长是、系行舟。朗朗上口。没事的时候背上一遍，会觉得心情畅快。仿佛自己也成了才子一般。那种感觉实在是舒爽。看到这首《唐多令》，难免让人联想到《红楼梦》中林妹妹的那首。林黛玉《唐多令》粉堕百花洲，香残燕子楼。一团团逐队成毬。飘泊亦如人命薄，空缱绻，说风流。草木也知愁，韶华竟白头。叹今生谁舍谁收?嫁与东风春不管，凭尔去，忍淹留。唐伯虎《皂罗袍》堪叹薄情难料，把佳期做了流水萍飘。柳丝暗约玉肌消，落红惹得朱颜恼。心牵意挂，山长水遥，月明古驿，东风画桥，俏冤家何事还不到。李益《写情》水纹珍簟思悠悠，千里佳期一夕休。从此无心爱良夜，任他明月下西楼。未完待续————吴融《情》依依脉脉两如何，细似轻丝渺似波。月不长圆花易落，一生惆怅为伊多。温庭筠《望江南》梳洗罢，独倚望江楼。过尽千帆皆不是，斜晖脉脉水悠悠，肠断白苹洲。（再次感谢搜狗拼音。）现在温庭筠最有名的词，是那首“新帖绣罗襦，双双金鹧鸪”。感谢《甄嬛传》。刘禹锡《怀妓》玉钗重合两无缘，鱼在深潭鹤在天。得意紫鸾休舞镜，能言青鸟罢衔笺。金盆已覆难收水，玉轸长抛不续弦。若向蘼芜山下过，遥将红泪洒穷泉。看到这首诗里蘼芜两字，突然就联想到“蘼芜君”柳如是和“蘅芜君”薛宝钗。刘禹锡，最有名的作品自然是课本里的那篇《陋室铭》。除此之外，自然是那句“东边日出西边雨，道是无晴却有晴”。宋之问《和赵员外桂阳桥遇佳人》江雨朝飞浥细尘，阳桥花柳不胜春。金鞍白马来从赵，玉面红妆本姓秦。妒女犹怜镜中发，侍儿堪感路傍人。荡舟为乐非吾事，自叹空闺梦寐频。宋之问，著名人渣。据说他为了抢夺那句“年年岁岁花相似，岁岁年年人不同”的著作权，把自己外甥给杀死了。非法转载也就罢了，还非要冒充原创作者，甚至不惜杀人。所谓的“玉面红妆本姓秦”。指的是《陌上桑》里面的秦罗敷。《孔雀东南飞》中也提到过她的名字。前面介绍的黄景仁的诗里，也提到“难换罗敷未嫁身”。“妒女忧怜镜中发”指的是东晋大司马桓温的故事。桓温娶了公主。后来又纳了一房小妾。公主因为嫉妒，提着宝剑要杀那个小妾。进屋后看到那个小妾正对着镜子梳头，风姿绰约，长发光可鉴人。公主扔下宝剑，一把抱住小妾，说到:“我见犹怜，何况老奴”。这也是我见犹怜这个词的来历。秦观《江城子》西城杨柳弄春柔。动离忧，泪难收。犹记多情，曾为系归舟。碧野朱桥当日事，人不见，水空流。韶华不为少年留。恨悠悠，几时休。飞絮落花时候、一登楼。便做春江都是泪，流不尽，许多愁。这首《江城子》自然没有苏东坡那首有名，但就冲着最后一句，也是值得背诵全文的。况且整首词都非常优秀非常的有意境。未完待续————写到今晚，估计也没有多少人关注了。我就当一个人自娱自乐吧。小时候看金庸的《连城诀》，里面有一种武功叫“唐诗剑法”。那时候我就想，要是我写武侠小说，里面一定要有一种武功叫“宋词剑法”。主角手持双剑，左手“大江东去”，右手“晓风残月”。这套剑法的最后一招叫做“飞红万点愁如海”，笼罩对方全身穴位，令对方无从躲避……纳兰容若《木兰花》人生若只如初见，何事秋风悲画扇。等闲变却故人心，却道故人心易变。骊山语罢清宵半，泪雨霖铃终不怨。何如薄幸锦衣郎，比翼连枝当日愿。这世上，哪种女人最容易被哄上床？女文青，女大学生。哪一类女文青最容易被哄上床？喜欢纳兰容若和仓央嘉措的……这世上，哪有那么多的“人生若只如初见”，哪有那么多的“赌书消得泼茶香”……贾宝玉《红豆曲》滴不尽相思血泪抛红豆，开不完春柳春花满画楼，睡不稳纱窗风雨黄昏后，忘不了新愁与旧愁。咽不下玉粒金莼噎满喉，照不见菱花镜里形容瘦，展不开的眉头，捱不明的更漏。呀！恰便似遮不住的青山隐隐，流不断的绿水悠悠。什么是矫情？这就是矫情。等你将来风雪狱神庙的时候，就知道能睡在怡红院的床上是多么幸福的事情了。等你将来“寒冬噎酸虀，雪夜围破毡”的时候，就知道现在的生活是多么幸福了。身在福中不知福。前面那个叫纳兰容若的，更是如此。————朱淑真《恨春》迟迟花日上帘钩,，尽日无人独倚楼。蝶使蜂媒传客恨，莺丝柳线织春愁。碧云信断惟芳梦，红叶成诗想到秋。几许别离多少泪，不堪重省不堪流。论才华，朱淑真未必比李清照差。但远没有李清照有名，可以说不可同日而语。这女子生性风流浪漫，视封建礼教为无物，大胆追求自己的爱情。不容于当时的社会。死后，她的尸骨没有下葬，而是被她父母烧掉了。同时被烧掉的还有她的诗集。因此，存世的诗词较少。朱淑真《江城子.赏春》斜风细雨作春寒，对尊前，忆前欢。曾把梨花，寂寞泪阑干。芳草断烟南浦路，和别泪，看青山。昨宵结得梦夤缘，水云间，悄无言。争奈醒来，愁恨又依然。展转衾裯空懊恼，天易见，见伊难。鱼玄机《江陵愁望寄子安》枫叶千枝复万枝，江桥掩映暮帆迟。忆君心似西江水，日夜东流无歇时。秦观《鹊桥仙》纤云弄巧，飞星传恨，银汉迢迢暗度。金风玉露一相逢，便胜却人间无数。柔情似水，佳期如梦，忍顾鹊桥归路。两情若是久长时，又岂在朝朝暮暮。在秦观的所有词句中，显然这首《鹊桥仙》是最出名的，脍炙人口。毛泽东《虞美人·枕上》堆来枕上愁何状，江海翻波浪。夜长天色总难明，寂寞披衣起坐薄寒中。晓来百念皆灰烬，剩有离人影。一钩残月向西流，对此不抛眼泪也无由。主席的这首词一般认为是怀念杨开慧的，但也有人考证是怀念罗一秀的。究竟如何，不得而知。", "answer_votes": "1.1K", "answer_comment": "​215 条评论"}
{"answer_author": "稚梦", "answer_id": 114889484, "answer_text": "滕王阁序作者：王勃（唐代）豫章故郡，洪都新府。星分翼轸，地接衡庐。襟三江而带五湖，控蛮荆而引瓯越。物华天宝，龙光射牛斗之墟；人杰地灵，徐孺下陈蕃之榻。雄州雾列，俊采星驰。台隍枕夷夏之交，宾主尽东南之美。都督阎公之雅望，棨戟遥临；宇文新州之懿范，襜帷暂驻。十旬休假，胜友如云；千里逢迎，高朋满座。腾蛟起凤，孟学士之词宗；紫电青霜，王将军之武库。家君作宰，路出名区；童子何知，躬逢胜饯。时维九月，序属三秋。潦水尽而寒潭清，烟光凝而暮山紫。俨骖騑于上路，访风景于崇阿。临帝子之长洲，得仙人之旧馆。层峦耸翠，上出重霄；飞阁流丹，下临无地。鹤汀凫渚，穷岛屿之萦回；桂殿兰宫，列冈峦之体势。披绣闼，俯雕甍，山原旷其盈视，川泽纡其骇瞩。闾阎扑地，钟鸣鼎食之家；舸舰迷津，青雀黄龙之舳。云销雨霁，彩彻区明。落霞与孤鹜齐飞，秋水共长天一色。渔舟唱晚，响穷彭蠡之滨，雁阵惊寒，声断衡阳之浦。遥吟俯畅，逸兴遄飞。爽籁发而清风生，纤歌凝而白云遏。睢园绿竹，气凌彭泽之樽；邺水朱华，光照临川之笔。四美具，二难并。穷睇眄于中天，极娱游于暇日。天高地迥，觉宇宙之无穷；兴尽悲来，识盈虚之有数。望长安于日下，目吴会于云间。地势极而南溟深，天柱高而北辰远。关山难越，谁悲失路之人；萍水相逢，尽是他乡之客。怀帝阍而不见，奉宣室以何年？嗟乎！时运不齐，命途多舛。冯唐易老，李广难封。屈贾谊于长沙，非无圣主；窜梁鸿于海曲，岂乏明时？所赖君子安贫，达人知命。老当益壮，宁移白首之心？穷且益坚，不坠青云之志。酌贪泉而觉爽，处涸辙以犹欢。北海虽赊，扶摇可接；东隅已逝，桑榆非晚。孟尝高洁，空余报国之情；阮籍猖狂，岂效穷途之哭！勃，三尺微命，一介书生。无路请缨，等终军之弱冠；有怀投笔，慕宗悫之长风。舍簪笏于百龄，奉晨昏于万里。非谢家之宝树，接孟氏之芳邻。他日趋庭，叨陪鲤对；今兹捧袂，喜托龙门。杨意不逢，抚凌云而自惜；钟期既遇，奏流水以何惭？呜乎！胜地不常，盛筵难再；兰亭已矣，梓泽丘墟。临别赠言，幸承恩于伟饯；登高作赋，是所望于群公。敢竭鄙怀，恭疏短引；一言均赋，四韵俱成。请洒潘江，各倾陆海云尔：滕王高阁临江渚，佩玉鸣鸾罢歌舞。画栋朝飞南浦云，珠帘暮卷西山雨。闲云潭影日悠悠，物换星移几度秋。阁中帝子今何在？槛外长江空自流", "answer_votes": "875", "answer_comment": "​249 条评论"}
{"answer_author": "大梦Power", "answer_id": 114752554, "answer_text": "岁月本长而忙者自促； 天地本宽而卑者自隘。——《菜根谭》", "answer_votes": "106", "answer_comment": "​8 条评论"}
{"answer_author": "谢明弦", "answer_id": 114254720, "answer_text": "你喜欢的。这玩意不是任务。", "answer_votes": "26", "answer_comment": "​3 条评论"}
{"answer_author": "墨疙瘩", "answer_id": 115648263, "answer_text": "值得背诵的诗词太多了，挑几篇我最喜爱的贴出来吧，不按时间顺序了：《满江红》岳飞怒发冲冠，凭栏处、潇潇雨歇。抬望眼、仰天长啸，壮怀激烈。三十功名尘与土，八千里路云和月。莫等闲、白了少年头，空悲切。靖康耻，犹未雪。臣子恨，何时灭。驾长车踏破，贺兰山缺。壮志饥餐胡虏肉，笑谈渴饮匈奴血。待从头、收拾旧山河，朝天阙。《枫桥夜泊》张继月落乌啼霜满天，江枫渔火对愁眠。姑苏城外寒山寺，夜半钟声到客船。《江城子 乙卯正月二十日夜记梦》苏轼十年生死两茫茫，不思量，自难忘。千里孤坟，无处话凄凉。纵使相逢应不识，尘满面，鬓如霜。夜来幽梦忽还乡，小轩窗，正梳妆。相顾无言，惟有泪千行。料得年年肠断处，明月夜，短松冈。《水调歌头》苏轼明月几时有？把酒问青天。不知天上宫阙，今夕是何年。我欲乘风归去，又恐琼楼玉宇，高处不胜寒。起舞弄清影，何似在人间？转朱阁，低绮户，照无眠。不应有恨，何事长向别时圆？人有悲欢离合，月有阴晴圆缺，此事古难全。但愿人长久，千里共婵娟。《杂诗》陶渊明人生无根蒂，飘如陌上尘。分散逐风转，此已非常身。落地为兄弟，何必骨肉亲！得欢当作乐，斗酒聚比邻。盛年不重来，一日难再晨。及时当勉励，岁月不待人。《将进酒》李白君不见，黄河之水天上来，奔流到海不复回。君不见，高堂明镜悲白发，朝如青丝暮成雪。人生得意须尽欢，莫使金樽空对月。天生我材必有用，千金散尽还复来。烹羊宰牛且为乐，会须一饮三百杯。岑夫子，丹丘生，将进酒，杯莫停。与君歌一曲，请君为我倾耳听。钟鼓馔玉不足贵，但愿长醉不复醒。古来圣贤皆寂寞，惟有饮者留其名。陈王昔时宴平乐，斗酒十千恣欢谑。主人何为言少钱，径须沽取对君酌。五花马，千金裘，呼儿将出换美酒，与尔同销万古愁。《临安春雨初霁》陆游世味年来薄似纱，谁令骑马客京华。小楼一夜听春雨，深巷明朝卖杏花。矮纸斜行闲作草，晴窗细乳戏分茶。素衣莫起风尘叹，犹及清明可到家。《蜀相》杜甫丞相祠堂何处寻，锦官城外柏森森。映阶碧草自春色，隔叶黄鹂空好音。三顾频烦天下计，两朝开济老臣心。出师未捷身先死，长使英雄泪满襟。《锦瑟》李商隐锦瑟无端五十弦，一弦一柱思华年。庄生晓梦迷蝴蝶，望帝春心托杜鹃。沧海月明珠有泪，蓝田日暖玉生烟。此情可待成追忆？只是当时已惘然。", "answer_votes": "47", "answer_comment": "​10 条评论"}
{"answer_author": "M3小蘑菇", "answer_id": 234207420, "answer_text": "前出塞九首·其六杜甫挽弓当挽强，用箭当用长。射人先射马，擒贼先擒王。杀人亦有限，列国自有疆。……唐朝的哲理诗，形象地说明了解决问题要抓住重点，不要造成无谓的损耗", "answer_votes": "11", "answer_comment": "​4 条评论"}
{"answer_author": "李云鹏", "answer_id": 225215937, "answer_text": "忆江南·温庭筠\n梳洗罢，独倚望江楼。\n过尽千帆皆不是，斜晖脉脉水悠悠，\n肠断白频洲。\n看起来很简单的字，勾勒出的心境却一点也不简单。江城子·苏轼\n十年生死两茫茫，不思量，自难忘。\n千里孤坟，无处话凄凉。\n纵使相逢应不识，尘满面，鬓如霜。\n夜来幽梦忽还乡，小轩窗，正梳妆。\n相顾无言，惟有泪千行。\n料得年年肠断处，明月夜，短松冈。\n以前只觉得东坡的心里有大江东去，殊不知还有清泪千行。临江仙·晏畿道\n梦后楼台高锁，酒醒帘幕低垂。去年春恨却来时。落花人独立，微雨燕双飞。\n记得小苹初见，两重心字罗衣。琵琶弦上说相思。当时明月在，曾照彩云归。\n这首词的每一句都让人心生美好，却又有淡淡的苦涩。鹤冲天·黄金榜上\n黄金榜上，偶失龙头望。明代暂遗贤，如何向。\n未遂风云便，争不恣狂荡。何须论得丧？才子词人，自是白衣卿相。\n烟花巷陌，依约丹青屏障。幸有意中人，堪寻访。\n且恁偎红倚翠，风流事，平生畅。青春都一饷。忍把浮名，换了浅斟低唱！\n也许只有柳三变懂得，比功名重要的是什么。八声甘州·柳永\n对潇潇暮雨洒江天，一番洗清秋。\n渐霜风凄紧，关河冷落，残照当楼。\n是处红衰翠减，苒苒物华休。\n惟有长江水，无语东流。\n不忍登高临远，望故乡渺邈，归思难收。\n叹年来踪迹，何事苦淹留。\n想佳人、妆楼颙望，误几回、天际识归舟。\n争知我、倚阑干处，正恁凝愁。\n白衣卿相的惆怅和风流一样令人神往。浪淘沙·李煜\n帘外雨潺潺，春意阑珊。罗衾不耐五更寒。梦里不知身是客，一晌贪欢。\n独自莫凭栏，无限江山，别时容易见时难。流水落花春去也，天上人间。\n好一个梦里不知身是客的南唐后主，问君能有几多愁，恰似一江春水向东流。", "answer_votes": "28", "answer_comment": "​12 条评论"}
{"answer_author": "苏节末", "answer_id": 115648624, "answer_text": "推荐辛弃疾的《贺新郎·别茂嘉十二弟》绿树听鹈鴂。更那堪、鹧鸪声住，杜鹃声切。啼到春归无寻处，苦恨芳菲都歇。算未抵、人间离别。马上琵琶关塞黑，更长门、翠辇辞金阙。看燕燕，送归妾。 将军百战身名裂。向河梁、回头万里，故人长绝。易水萧萧西风冷，满座衣冠似雪。正壮士、悲歌未彻。啼鸟还知如许恨，料不啼清泪长啼血。谁共我，醉明月。 最爱这句“将军百战身名裂”，纵然道一声毕竟东流去，却总还留着凭谁问廉颇老矣的豪气，每一次吟诵抄写都觉荡气回肠，哀而不伤。严蕊的《卜算子》不是爱风尘，似被前缘误。花落花开自有时，总赖东君主。去也终须去，住也如何住！若得山花插满头，莫问奴归处。不管过去与未来如何，在活着的每一刻，都要自己尊重自己。很爱李清照的这首《摊破浣溪沙·病起萧萧两鬓华》：病起萧萧两鬓华，卧看残月上窗纱。豆蔻连梢煎熟水，莫分茶。枕上诗书闲处好，门前风景雨来佳。终日向人多酝藉，木犀花。 过去的美好往往会在人的心里留下一段伏笔，当美好破碎掉的时候，这伏笔就会将美好的记忆引出，在破碎的渣滓上碾出回忆的血痕，很残忍很痛苦，走不出，有时候也不愿意走出。人总是往前走的，我会想念，却也不会因为痛苦而辜负人世间的风景，尽管这样的怡然背后满是血痕。冯延巳的《谒金门·风乍起》风乍起，吹皱一池春水。闲引鸳鸯香径里，手挼红杏蕊。斗鸭阑干独倚，碧玉搔头斜坠。终日望君君不至，举头闻鹊喜。没有什么特殊原因，就是因为写的太美了，一直觉得这首词和温庭筠的《菩萨蛮·小山重叠金明灭》可以拼出一幅古代贵族女子起居生活的画面。宋徽宗赵佶的《燕山亭·北行见杏花》裁剪冰绡，轻叠数重，淡著胭脂匀注。新样靓妆，艳溢香融，羞杀蕊珠宫女。易得凋零，更多少、无情风雨。愁苦。问院落凄凉，几番春暮。凭寄离恨重重，者双燕，何曾会人言语。天遥地远，万水千山，知他故宫何处。怎不思量，除梦里、有时曾去。无据，和梦也新来不做。说起来亡国哀音，世人皆知《虞美人》，李重光在一片光怪陆离中，用血和泪唱出了宋词的第一声。很多年以后，赵光义的后人也以一曲《燕山亭》了结了一个王朝……这似乎是艺术对政治最具讽刺意义的隐喻。姜夔的《鬲溪梅令·丙辰冬自无锡归作此寓意\n        》好花不与殢香人。浪粼粼。又恐春风归去绿成阴。玉钿何处寻。木兰双桨梦中云。小横陈。漫向孤山山下觅盈盈。翠禽啼一春。喜欢《鬲溪梅令》也没什么理由，就是早期学古琴的时候，这首是有琴谱的，于是我这个小琴童一边弹一边唱，就这样记住了很多年，咿咿呀呀的低声吟唱里，竟生怅然，哎，绿叶成阴，好花却已无迹可寻。苏轼的词作喜欢的很多，这里只挑一首《临江仙·夜饮东坡醒复醉》夜饮东坡醒复醉，归来仿佛三更。家童鼻息已雷鸣。敲门都不应，倚杖听江声。 长恨此身非我有，何时忘却营营。夜阑风静縠纹平。小舟从此逝，江海寄余生。我不喜欢条框，曾经幻想可以每天都做自己喜欢的事情，姊妹联床听夜雨，得尽欢时且尽欢，睡到自然醒，醒时买杏花……这样的自由怕是只能是一生中的某时某刻，现实总是要告诉你调好闹钟，这也没有什么关系，至少还有这首词里的江声可听。先更到这里吧，有空再更。", "answer_votes": "31", "answer_comment": "​4 条评论"}
{"answer_author": "红眼睛", "answer_id": 115075912, "answer_text": "《岳阳楼记》背下来免门票。。。庆历四年春，滕子京谪守巴陵郡。越明年，政通人和，百废具兴，乃重修岳阳楼，增其旧制，刻唐贤今人诗赋于其上。属予作文以记之。　　予观夫巴陵胜状，在洞庭一湖。衔远山，吞长江，浩浩汤汤，横无际涯；朝晖夕阴，气象万千。此则岳阳楼之大观也，前人之述备矣。然则北通巫峡，南极潇湘，迁客骚人，多会于此，览物之情，得无异乎?　　若夫淫雨霏霏，连月不开，阴风怒号，浊浪排空；日星隐曜，山岳潜形；商旅不行，樯倾楫摧；薄暮冥冥，虎啸猿啼。登斯楼也，则有去国怀乡，忧谗畏讥，满目萧然，感极而悲者矣。　　至若春和景明，波澜不惊，上下天光，一碧万顷；沙鸥翔集，锦鳞游泳；岸芷汀兰，郁郁青青。而或长烟一空，皓月千里，浮光跃金，静影沉璧，渔歌互答，此乐何极！登斯楼也，则有心旷神怡，宠辱偕忘，把酒临风，其喜洋洋者矣。　　嗟夫！予尝求古仁人之心，或异二者之为，何哉？不以物喜，不以己悲；居庙堂之高则忧其民；处江湖之远则忧其君。是进亦忧，退亦忧。然则何时而乐耶？其必曰“先天下之忧而忧，后天下之乐而乐”乎？噫！微斯人，吾谁与归？　　时六年九月十五日。", "answer_votes": "62", "answer_comment": "​23 条评论"}
{"answer_author": "Jewel Staite", "answer_id": 225085763, "answer_text": "《满江红 西南联大校歌》万里长征，辞却了五朝宫阙，暂驻足衡山湘水，又成离别。绝徼移栽桢干质，九州遍洒黎元血。尽笳吹，弦诵在山城，情弥切。 千秋耻，终当雪。中兴业，须人杰。便一成三户，壮怀难折。多难殷忧新国运，动心忍性希前哲。待驱除仇寇，复神京，还燕碣。1938年，山河破碎，故土沦陷，国家危亡已如风中飘萍。冯友兰和一众学者创立校歌，激励学子奋发图强再造河山，杨振宁先生对此词尤为钟爱。抗战胜利，回迁北京后，冯老再做短词一首直抒胸臆千秋耻，终已雪。见雠寇，如烟灭。大统一，无倾折。中兴业，继往烈。维三校，如胶结。同艰难，共欢悦。神京复，还燕碣。此时距离抗战胜利已过去72年，愿少年辈不忘旧日磨难，勤举正道，使人才蔚起，四海安平。", "answer_votes": "50", "answer_comment": "​5 条评论"}
{"answer_author": "恍如隔世", "answer_id": 225307374, "answer_text": "春江花月夜春江潮水连海平，海上明月共潮生。 滟滟随波千万里，何处春江无月明？ 江流宛转绕芳甸，月照花林皆似霰。 空里流霜不觉飞，汀上白沙看不见。 江天一色无纤尘，皎皎空中孤月轮。 江畔何人初见月？江月何年初照人？ 人生代代无穷已，江月年年只相似。 不知江月待何人，但见长江送流水。 白云一片去悠悠，青枫浦上不胜愁。 谁家今夜扁舟子？何处相思明月楼？ 可怜楼上月徘徊，应照离人妆镜台。 玉户帘中卷不去，捣衣砧上拂还来。 此时相望不相闻，愿逐月华流照君。鸿雁长飞光不度，鱼龙潜跃水成文。 昨夜闲潭梦落花，可怜春半不还家。 江水流春去欲尽，江潭落月复西斜。斜月沉沉藏海雾，碣石潇湘无限路。 不知乘月几人归？落月摇情满江树。诗中的诗，顶峰上的顶峰", "answer_votes": "108", "answer_comment": "​29 条评论"}
{"answer_author": "韩梅梅", "answer_id": 115085614, "answer_text": "江城子·乙卯正月二十日夜记梦朝代：宋代作者：苏轼原文：十年生死两茫茫，不思量，自难忘。千里孤坟，无处话凄凉。纵使相逢应不识，尘满面，鬓如霜。夜来幽梦忽还乡，小轩窗，正梳妆。相顾无言，惟有泪千行。料得年年肠断处，明月夜，短松冈", "answer_votes": "40", "answer_comment": "​9 条评论"}
{"answer_author": "凤早君", "answer_id": 115552718, "answer_text": "《长恨歌》汉皇重色思倾国，御宇多年求不得。杨家有女初长成，养在深闺人未识。天生丽质难自弃，一朝选在君王侧。回眸一笑百媚生，六宫粉黛无颜色。春寒赐浴华清池，温泉水滑洗凝脂。侍儿扶起娇无力，始是新承恩泽时。云鬓花颜金步摇，芙蓉帐暖度春宵。春宵苦短日高起，从此君王不早朝。承欢侍宴无闲暇，春从春游夜专夜。后宫佳丽三千人，三千宠爱在一身。金屋妆成娇侍夜，玉楼宴罢醉和春。姊妹弟兄皆列土，可怜光彩生门户。遂令天下父母心，不重生男重生女。骊宫高处入青云，仙乐风飘处处闻。缓歌谩舞凝丝竹，尽日君王看不足。渔阳鼙鼓动地来，惊破霓裳羽衣曲。九重城阙烟尘生，千乘万骑西南行。翠华摇摇行复止，西出都门百余里。六军不发无奈何，宛转蛾眉马前死。花钿委地无人收，翠翘金雀玉搔头。君王掩面救不得，回看血泪相和流。黄埃散漫风萧索，云栈萦纡登剑阁。峨嵋山下少人行，旌旗无光日色薄。蜀江水碧蜀山青，圣主朝朝暮暮情。行宫见月伤心色，夜雨闻铃肠断声。天旋地转回龙驭，到此踌躇不能去。马嵬坡下泥土中，不见玉颜空死处。君臣相顾尽沾衣，东望都门信马归。归来池苑皆依旧，太液芙蓉未央柳。芙蓉如面柳如眉，对此如何不泪垂。春风桃李花开日，秋雨梧桐叶落时。西宫南内多秋草，落叶满阶红不扫。梨园弟子白发新，椒房阿监青娥老。夕殿萤飞思悄然，孤灯挑尽未成眠。迟迟钟鼓初长夜，耿耿星河欲曙天。鸳鸯瓦冷霜华重，翡翠衾寒谁与共。悠悠生死别经年，魂魄不曾来入梦。临邛道士鸿都客，能以精诚致魂魄。为感君王辗转思，遂教方士殷勤觅。排空驭气奔如电，升天入地求之遍。上穷碧落下黄泉，两处茫茫皆不见。忽闻海上有仙山，山在虚无缥渺间。楼阁玲珑五云起，其中绰约多仙子。中有一人字太真，雪肤花貌参差是。金阙西厢叩玉扃，转教小玉报双成。闻道汉家天子使，九华帐里梦魂惊。揽衣推枕起徘徊，珠箔银屏迤逦开。云鬓半偏新睡觉，花冠不整下堂来。风吹仙袂飘飘举，犹似霓裳羽衣舞。玉容寂寞泪阑干，梨花一枝春带雨。含情凝睇谢君王，一别音容两渺茫。昭阳殿里恩爱绝，蓬莱宫中日月长。回头下望人寰处，不见长安见尘雾。惟将旧物表深情，钿合金钗寄将去。钗留一股合一扇，钗擘黄金合分钿。但教心似金钿坚，天上人间会相见。临别殷勤重寄词，词中有誓两心知。七月七日长生殿，夜半无人私语时。在天愿作比翼鸟，在地愿为连理枝。天长地久有时尽，此恨绵绵无绝期。《孔雀东南飞》孔雀东南飞，五里一徘徊。“十三能织素，十四学裁衣。十五弹箜篌，十六诵诗书。十七为君妇，心中常苦悲。君既为府吏，守节情不移。贱妾留空房，相见常日稀。鸡鸣入机织，夜夜不得息。三日断五匹，大人故嫌迟。非为织作迟，君家妇难为！妾不堪驱使，徒留无所施。便可白公姥，及时相遣归。”府吏得闻之，堂上启阿母：“儿已薄禄相，幸复得此妇。结发同枕席，黄泉共为友。共事二三年，始尔未为久。女行无偏斜，何意致不厚。”阿母谓府吏：“何乃太区区！此妇无礼节，举动自专由。吾意久怀忿，汝岂得自由！东家有贤女，自名秦罗敷。可怜体无比，阿母为汝求。便可速遣之，遣去慎莫留！”府吏长跪告：“伏惟启阿母。今若遣此妇，终老不复取！”阿母得闻之，槌床便大怒：“小子无所畏，何敢助妇语！吾已失恩义，会不相从许！”府吏默无声，再拜还入户。举言谓新妇，哽咽不能语：“我自不驱卿，逼迫有阿母。卿但暂还家，吾今且报府。不久当归还，还必相迎取。以此下心意，慎勿违吾语。”新妇谓府吏：“勿复重纷纭。往昔初阳岁，谢家来贵门。奉事循公姥，进止敢自专？昼夜勤作息，伶俜萦苦辛。谓言无罪过，供养卒大恩；仍更被驱遣，何言复来还！妾有绣腰襦，葳蕤自生光；红罗复斗帐，四角垂香囊；箱帘六七十，绿碧青丝绳，物物各自异，种种在其中。人贱物亦鄙，不足迎后人，留待作遗施，于今无会因。时时为安慰，久久莫相忘！”鸡鸣外欲曙，新妇起严妆。著我绣夹裙，事事四五通。足下蹑丝履，头上玳瑁光。腰若流纨素，耳著明月珰。指如削葱根，口如含朱丹。纤纤作细步，精妙世无双。上堂拜阿母，阿母怒不止。“昔作女儿时，生小出野里。本自无教训，兼愧贵家子。受母钱帛多，不堪母驱使。今日还家去，念母劳家里。”却与小姑别，泪落连珠子。“新妇初来时，小姑始扶床；今日被驱遣，小姑如我长。勤心养公姥，好自相扶将。初七及下九，嬉戏莫相忘。”出门登车去，涕落百余行。府吏马在前，新妇车在后。隐隐何甸甸，俱会大道口。下马入车中，低头共耳语：“誓不相隔卿，且暂还家去。吾今且赴府，不久当还归。誓天不相负！”新妇谓府吏：“感君区区怀！君既若见录，不久望君来。君当作磐石，妾当作蒲苇。蒲苇纫如丝，磐石无转移。我有亲父兄，性行暴如雷，恐不任我意，逆以煎我怀。”举手长劳劳，二情同依依。入门上家堂，进退无颜仪。阿母大拊掌，不图子自归：“十三教汝织，十四能裁衣，十五弹箜篌，十六知礼仪，十七遣汝嫁，谓言无誓违。汝今何罪过，不迎而自归？”兰芝惭阿母：“儿实无罪过。”阿母大悲摧。还家十余日，县令遣媒来。云有第三郎，窈窕世无双。年始十八九，便言多令才。阿母谓阿女：“汝可去应之。”阿女含泪答：“兰芝初还时，府吏见丁宁，结誓不别离。今日违情义，恐此事非奇。自可断来信，徐徐更谓之。”阿母白媒人：“贫贱有此女，始适还家门。不堪吏人妇，岂合令郎君？幸可广问讯，不得便相许。”媒人去数日，寻遣丞请还，说有兰家女，承籍有宦官。云有第五郎，娇逸未有婚。遣丞为媒人，主簿通语言。直说太守家，有此令郎君，既欲结大义，故遣来贵门。阿母谢媒人：“女子先有誓，老姥岂敢言！”阿兄得闻之，怅然心中烦。举言谓阿妹：“作计何不量！先嫁得府吏，后嫁得郎君。否泰如天地，足以荣汝身。不嫁义郎体，其往欲何云？”兰芝仰头答：“理实如兄言。谢家事夫婿，中道还兄门。处分适兄意，那得自任专！虽与府吏要，渠会永无缘。登即相许和，便可作婚姻。”媒人下床去。诺诺复尔尔。还部白府君：“下官奉使命，言谈大有缘。”府君得闻之，心中大欢喜。视历复开书，便利此月内，六合正相应。良吉三十日，今已二十七，卿可去成婚。交语速装束，络绎如浮云。青雀白鹄舫，四角龙子幡。婀娜随风转，金车玉作轮。踯躅青骢马，流苏金镂鞍。赍钱三百万，皆用青丝穿。杂彩三百匹，交广市鲑珍。从人四五百，郁郁登郡门。阿母谓阿女：“适得府君书，明日来迎汝。何不作衣裳？莫令事不举！”阿女默无声，手巾掩口啼，泪落便如泻。移我琉璃榻，出置前窗下。左手持刀尺，右手执绫罗。朝成绣夹裙，晚成单罗衫。晻晻日欲暝，愁思出门啼。府吏闻此变，因求假暂归。未至二三里，摧藏马悲哀。新妇识马声，蹑履相逢迎。怅然遥相望，知是故人来。举手拍马鞍，嗟叹使心伤：“自君别我后，人事不可量。果不如先愿，又非君所详。我有亲父母，逼迫兼弟兄。以我应他人，君还何所望！”府吏谓新妇：“贺卿得高迁！磐石方且厚，可以卒千年；蒲苇一时纫，便作旦夕间。卿当日胜贵，吾独向黄泉！”新妇谓府吏：“何意出此言！同是被逼迫，君尔妾亦然。黄泉下相见，勿违今日言！”执手分道去，各各还家门。生人作死别，恨恨那可论？念与世间辞，千万不复全！府吏还家去，上堂拜阿母：“今日大风寒，寒风摧树木，严霜结庭兰。儿今日冥冥，令母在后单。故作不良计，勿复怨鬼神！命如南山石，四体康且直！”阿母得闻之，零泪应声落：“汝是大家子，仕宦于台阁。慎勿为妇死，贵贱情何薄！东家有贤女，窈窕艳城郭，阿母为汝求，便复在旦夕。”府吏再拜还，长叹空房中，作计乃尔立。转头向户里，渐见愁煎迫。其日牛马嘶，新妇入青庐。奄奄黄昏后，寂寂人定初。我命绝今日，魂去尸长留！揽裙脱丝履，举身赴清池。府吏闻此事，心知长别离。徘徊庭树下，自挂东南枝。两家求合葬，合葬华山傍。东西植松柏，左右种梧桐。枝枝相覆盖，叶叶相交通。中有双飞鸟，自名为鸳鸯。仰头相向鸣，夜夜达五更。行人驻足听，寡妇起彷徨。多谢后世人，戒之慎勿忘。《琵琶行》浔阳江头夜送客，枫叶荻花秋瑟瑟 。主人下马客在船，举酒欲饮无管弦。醉不成欢惨将别，别时茫茫江浸月。忽闻水上琵琶声，主人忘归客不发。寻声暗问弹者谁？琵琶声停欲语迟。移船相近邀相见，添酒回灯 重开宴。千呼万唤始出来，犹抱琵琶半遮面。转轴拨弦三两声，未成曲调先有情。弦弦掩抑声声思 ，似诉平生不得志。低眉信手续续弹 ，说尽心中无限事。轻拢慢捻抹复挑 ，初为霓裳后六幺。大弦嘈嘈如急雨，小弦切切如私语。嘈嘈切切错杂弹，大珠小珠落玉盘。间关莺语花底滑，幽咽泉流冰下难 。冰泉冷涩弦凝绝 ，凝绝不通声暂歇。别有幽愁暗恨生，此时无声胜有声。银瓶乍破水浆迸 ，铁骑突出刀枪鸣。曲终收拨当心画 ，四弦一声如裂帛 。东船西舫悄无言，唯见江心秋月白。沉吟放拨插弦中，整顿衣裳起敛容 。自言本是京城女，家在虾蟆陵下住。十三学得琵琶成，名属教坊第一部。曲罢曾教善才服，妆成每被秋娘妒。五陵年少争缠头，一曲红绡不知数。钿头银篦击节碎，血色罗裙翻酒污。今年欢笑复明年，秋月春风等闲度。弟走从军阿姨死，暮去朝来颜色故 。门前冷落鞍马稀，老大嫁作商人妇。商人重利轻别离，前月浮梁买茶去。去来江口守空船，绕船月明江水寒。夜深忽梦少年事，梦啼妆泪红阑干 。我闻琵琶已叹息，又闻此语重 唧唧 。同是天涯沦落人，相逢何必曾相识！我从去年辞帝京，谪居卧病浔阳城。浔阳地僻无音乐，终岁不闻丝竹声。住近湓江地低湿，黄芦苦竹绕宅生。其间旦暮闻何物？杜鹃啼血猿哀鸣。春江花朝秋月夜，往往取酒还独倾。岂无山歌与村笛？呕哑嘲哳难为听。今夜闻君琵琶语 ，如听仙乐耳暂明。莫辞更坐弹一曲，为君翻作琵琶行。感我此言良久立，却坐促弦弦转急。凄凄不似向前声 ，满座重闻皆掩泣 。座中泣下谁最多？江州司马青衫湿。", "answer_votes": "30", "answer_comment": "​14 条评论"}
{"answer_author": "陈香芋", "answer_id": 115089272, "answer_text": "《金缕曲》 顾贞观季子平安否？便归来、平生万事，那堪回首！行路悠悠谁慰藉，母老家贫子幼。记不起、从前杯酒。魑魅搏人应见惯，总输他、覆雨翻云手。冰与雪，周旋久。泪痕莫滴牛衣透。数天涯、依然骨肉，几家能彀？比似红颜多命薄，更不如今还有。只绝塞、苦寒难受。廿载包胥承一诺，盼乌头、马角终相救。置此札，君怀袖。我亦飘零久，十年来，深恩负尽，死生师友。宿昔齐名非忝窃，试看杜陵消瘦。曾不减，夜郎僝僽。薄命长辞知己别，问人生，到此凄凉否？千万恨，为君剖。兄生辛未我丁丑，共些时，冰霜摧折，早衰蒲柳。词赋从今须少作，留取心魂相守。但愿得，河清人寿。归日急翻行戍稿，把空名料理传身后。言不尽，观顿首。受评论中小伙伴九块冰糖的启发补充两首。金缕曲 赠梁汾德也狂生耳！偶然间、淄尘京国，乌衣门第。有酒惟浇赵州土，谁会成生此意？不信道、遂成知己。青眼高歌俱未老，向尊前、拭尽英雄泪。君不见，月如水。共君此夜须沉醉。且由他、娥眉谣诼，古今同忌。身世悠悠何足问，冷笑置之而已！寻思起、从头翻悔。一日心期千劫在，后身缘、恐结他生里。然诺重，君须记。金缕曲 简梁汾洒尽无端泪，莫因他、琼楼寂寞，误来人世。信道痴儿多厚福，谁遣偏生明慧。莫更著、浮名相累。仕宦何妨如断梗，只那将、声影供群吠。天欲问，且休矣。情深我自判憔悴。转丁宁、香怜易爇，玉怜轻碎。羡杀软红尘里客，一味醉生梦死。歌与哭、任猜何意。绝塞生还吴季子，算眼前、此外皆闲事。知我者，梁汾耳。 情深意重。", "answer_votes": "154", "answer_comment": "​20 条评论"}
{"answer_author": "杨蛋蛋", "answer_id": 115216825, "answer_text": "春有百花秋有月，夏有凉风冬有雪，若无闲事挂心头，便是人间好时节。饥来食，困则眠，热取凉，寒向火。平常心即是自自然然，一无造作，了无是非取舍，只管行住坐卧，应机接物。                                ——黄龙慧开禅师", "answer_votes": "37", "answer_comment": "​3 条评论"}
{"answer_author": "我的朋友是个呆B", "answer_id": 115589265, "answer_text": "床前明月光， 疑是地上霜。举头望明月， 低头思故乡。美国很好，但家里更好。不要忘了家。", "answer_votes": "25", "answer_comment": "​9 条评论"}
{"answer_author": "阿皮", "answer_id": 115013932, "answer_text": "必然有他！！琵琶行浔阳江头夜送客，枫叶荻花秋瑟瑟。主人下马客在船，举酒欲饮无管弦。醉不成欢惨将别，别时茫茫江浸月。忽闻水上琵琶声，主人忘归客不发。寻声暗问弹者谁？琵琶声停欲语迟。移船相近邀相见，添酒回灯重开宴。千呼万唤始出来，犹抱琵琶半遮面。转轴拨弦三两声，未成曲调先有情。弦弦掩抑声声思，似诉平生不得志。低眉信手续续弹，说尽心中无限事。轻拢慢捻抹复挑，初为《霓裳》后《六幺》。大弦嘈嘈如急雨，小弦切切如私语。嘈嘈切切错杂弹，大珠小珠落玉盘。间关莺语花底滑，幽咽泉流冰下难。冰泉冷涩弦凝绝，凝绝不通声暂歇。别有幽愁暗恨生，此时无声胜有声。银瓶乍破水浆迸，铁骑突出刀枪鸣。曲终收拨当心画，四弦一声如裂帛。东船西舫悄无言，唯见江心秋月白。沉吟放拨插弦中，整顿衣裳起敛容。自言本是京城女，家在虾蟆陵下住。十三学得琵琶成，名属教坊第一部。曲罢曾教善才服，妆成每被秋娘妒。五陵年少争缠头，一曲红绡不知数。钿头银篦击节碎，血色罗裙翻酒污。今年欢笑复明年，秋月春风等闲度。弟走从军阿姨死，暮去朝来颜色故。门前冷落鞍马稀，老大嫁作商人妇。商人重利轻别离，前月浮梁买茶去。去来江口守空船，绕船月明江水寒。夜深忽梦少年事，梦啼妆泪红阑干。我闻琵琶已叹息，又闻此语重唧唧。同是天涯沦落人，相逢何必曾相识！我从去年辞帝京，谪居卧病浔阳城。浔阳地僻无音乐，终岁不闻丝竹声。住近湓江地低湿，黄芦苦竹绕宅生。其间旦暮闻何物？杜鹃啼血猿哀鸣。春江花朝秋月夜，往往取酒还独倾。岂无山歌与村笛？呕哑嘲哳难为听。今夜闻君琵琶语，如听仙乐耳暂明。莫辞更坐弹一曲，为君翻作《琵琶行》。感我此言良久立，却坐促弦弦转急。凄凄不似向前声，满座重闻皆掩泣。座中泣下谁最多？江州司马青衫湿。", "answer_votes": "36", "answer_comment": "​5 条评论"}
{"answer_author": "知乎用户", "answer_id": 234448151, "answer_text": "锄禾日当午汗滴禾下土谁知盘中餐粒粒皆辛苦这是每一个粤吹都应当背诵的一首古诗", "answer_votes": "28", "answer_comment": "​4 条评论"}
{"answer_author": "lazzy", "answer_id": 224893443, "answer_text": "特别喜欢 春江花月夜 ，我记得当时课文不要求背诵，但是自己特别喜欢就背了下来。春江花月夜。张若虚春江潮水连海平，海上明月共潮生。滟滟随波千万里，何处春江无月明？江流宛转绕芳甸，月照花林皆似霰。空里流霜不觉飞，汀上白沙看不见。江天一色无纤尘，皎皎空中孤月轮。江畔何人初见月？江月何年初照人？人生代代无穷已，江月年年只相似。不知江月待何人，但见长江送流水。白云一片去悠悠，青枫浦上不胜愁。谁家今夜扁舟子？何处相思明月楼？可怜楼上月徘徊，应照离人妆镜台。玉户帘中卷不去，捣衣砧上拂还来。此时相望不相闻，愿逐月华流照君。鸿雁长飞光不度，鱼龙潜跃水成文。昨夜闲潭梦落花，可怜春半不还家。江水流春去欲尽，江潭落月复西斜。斜月沉沉藏海雾，碣石潇湘无限路。不知乘月几人归？落花摇情满江树。我看书特别的囫囵吞枣，很多书看过就忘，极少刻意去记，对于要求之外唯一记得的诗词就是这篇了。学的时候觉得特别美，就花了点心思记了下来，当时还开脑洞在想万一高考考了这篇考纲之外的文章呢，结果事实证明想多了  。。。后来，时隔多年晚上在海边，面对春，江，月，夜，这样波澜壮阔的画面，不知怎么的就想起了“春江潮水连海平，海上明月共潮生”这句词，久久的不能平静。许多东西记下来，就是在心里生根。日后触景生情，总会懂的。", "answer_votes": "64", "answer_comment": "​26 条评论"}
{"answer_author": "我寄愁心与恋恋", "answer_id": 224588141, "answer_text": "圆圆曲\n清 · 吴梅村鼎湖当日弃人间，破敌收京下玉关。\n恸哭六军俱缟素，冲冠一怒为红颜。\n红颜流落非吾恋，逆贼天亡自荒宴。\n电扫黄巾定黑山，哭罢君亲再相见。\n相见初经田窦家，侯门歌舞出如花。\n许将戚里空侯伎，等取将军油壁车。\n家本姑苏浣花里，圆圆小字妖罗绮。\n梦向夫差苑里游，宫娥拥入君王起。\n前身合是采莲人，门前一片横塘水。\n横塘双桨去如飞，何处豪家强载归？\n此际岂知非薄命，此时只有泪沾衣。\n熏天意气连宫掖，明眸皓齿无人惜。\n夺归永巷闭良家，教就新声倾座客。\n座客飞觞红日莫，一曲哀弦向谁诉？\n白皙通侯最少年，拣取花枝屡回顾。\n早携娇鸟出樊笼，待得银河几时渡？\n恨杀军书抵死催，苦留后约将人误。\n相约恩深相见难，一朝蚁贼满长安。\n可怜思妇楼头柳，认作天边粉絮看。\n便索绿珠围内第，强呼绛树出雕栏。\n若非将士全师胜，争得蛾眉匹马还。\n蛾眉马上传呼进，云鬟不整惊魂定。\n蜡烛迎来在战场，啼妆满面残红印。\n专征萧鼓向秦川，金牛道上车千乘。\n斜谷云深起画楼，散关月落开妆镜。\n传来消息满红乡，乌桕红经十度霜。\n都曲妓师怜尚在，浣沙女伴忆同行。\n旧巢共是衔泥燕，飞上枝头变凤凰。\n长向尊前悲老大，有人夫婿擅侯王。\n当时只受声名累，贵戚名豪尽延致。\n一斛珠连万斛愁，关山漂泊腰支细。\n错怨狂风扬落花，无边春色来天地。\n尝闻倾国与倾城，翻使周郎受重名。\n妻子岂应关大计，英雄无奈是多情。\n全家白骨成灰土，一代红妆照汗青。\n君不见馆娃初起鸳鸯宿，越女如花看不足。\n香径尘生鸟自啼，渫廊人去苔空绿。\n换羽移宫万里愁，珠歌翠舞古梁州。\n为君别唱吴宫曲，汉水东南日夜流。背下来，每次回忆咀嚼的时候都有新的体会。也有人说这首诗很一般，也许是我太矫情了，只是个人感觉，不值一哂。", "answer_votes": "9", "answer_comment": "​7 条评论"}
{"answer_author": "陈四次", "answer_id": 114928750, "answer_text": "苦昼短 李贺飞光飞光，劝尔一杯酒。吾不识青天高，黄地厚。唯见月寒日暖，来煎人寿。食熊则肥，食蛙则瘦。神君何在？太一安有？天东有若木，下置衔烛龙。吾将斩龙足，嚼龙肉，使之朝不得回，夜不得伏。自然老者不死，少者不哭。何为服黄金、吞白玉？谁似任公子，云中骑碧驴？刘彻茂陵多滞骨，嬴政梓棺费鲍鱼。", "answer_votes": "187", "answer_comment": "​42 条评论"}
{"answer_author": "大脚不爱笑", "answer_id": 115863430, "answer_text": "必须是庄子的《逍遥游》：北冥有鱼，其名为鲲，鲲之大，不知其几千里也。化而为鸟，其名而鹏，鹏之背，不知其几千里也；怒而飞，其翼若垂天之云。是鸟也，海运则将徙於南冥；南冥者，天池也。齐谐者，志怪者也。谐之言曰：『鹏之徙於南冥也，水击三千里，搏扶摇而上者九万里，去以六月息者也。』野马也，尘埃也，生物之以息相吹也。天之苍苍，其正色邪？其远而无所至极邪？其视下也，亦若是则已矣。 \n　　 \n　且夫水之积也 不厚，则其负大舟也无力；覆杯水於坳堂之上，则芥为之舟，置杯焉则胶，水浅而舟 大也。风之积也不厚，则其负大翼也无力；故九万里，则风斯在下矣，而後乃今培风。背负青天，而莫之夭阏者，而後乃今将图南。蜩与学鸠笑之曰：我决起而飞，枪榆枋，时则不至而控於地而已矣。奚以之九万里而南为？』适莽苍者三餐而反，腹犹果然，适百里者宿舂粮，适千里者三月聚粮；之二虫，又何知？ \n　　 小知不及大知，小年不及大年，奚以知其然也？朝菌不知晦朔，惠姑不知春秋，此小年也。楚之南有冥灵者，以五百岁为春，五百岁为秋；上古有大椿者，以八千岁为春，八千岁为秋。此大年也。而彭祖乃今以久特闻，众人匹之，不亦悲乎？ \n　　 \n　汤之问棘也是已。『穷发之北，有冥海者，天池也。有鱼焉，其广数千里，未有知其修者，其名为鲲。有鸟焉，其名为鹏，背若泰山，翼若垂天之云，搏扶摇羊角而上者九万里，绝云气，负青天，然後图南，且适南冥也。』斥笑之曰：『彼且奚适也？我腾跃而上不过数仞而下，翱翔蓬蒿之间，此亦飞之至也。而彼且奚适也？』此小大之辩也。 \n　　 \n　　故夫知效一官，行比一乡，德合一君，而徵一国者，其自视也亦若此矣，而宋荣子犹然笑之。且世而誉之而不加劝，世而非之而不加沮，定乎内外之分，辩乎荣辱之境，斯已矣。彼其於世，未数数然也；虽然，犹有未树也。夫列子御风而行，泠然善也，旬有五日而後反，彼於致福者，未数数然也；此虽免乎行，犹有所待者也。若夫乘天地之正，而御六气之辩，以游无穷者，彼且恶乎待哉？故曰：『至人无己，神人无功，圣人无名。』", "answer_votes": "20", "answer_comment": "​8 条评论"}
{"answer_author": "五花肉", "answer_id": 115779048, "answer_text": "推荐一些【高逼格】古诗吧……也不是说值得背就是句子很装逼。因为奶奶是语文老师的原因从小到大真是背了挺多首的，但我还是觉得背古诗是个系统功夫。重点是一定要背诗题！或者词牌……我经常背完整首诗都想不起来这首诗叫啥。  Top 1 鹧鸪天·西都作朱敦儒我是清都山水郎。天教分付与疏狂。曾批给雨支风券，累上留云借月章。诗万首，酒千觞。几曾著眼看侯王。玉楼金阙慵归去，且插梅花醉洛阳。推荐理由：这首绝对的装逼神器- -多少小说写过啊，而且确实很大气…Top 2寄黄几复黄庭坚我居北海君南海，寄雁传书谢不能。桃李春风一杯酒，江湖夜雨十年灯。持家但有四立壁，治病不蕲三折肱。想见读书头已白，隔溪猿哭瘴溪藤。推荐理由：其实这首诗我觉得只有一句桃李春风算是传诵佳句，但是意境我觉得其他很难比拟所以也是长推荐的。Top 3安定城楼李商隐迢递高城百尺楼，绿杨枝外尽汀洲。贾生年少虚垂泪，王粲春来更远游。永忆江湖归白发，欲回天地入扁舟。不知腐鼠成滋味，猜意鹓雏竟未休。推荐理由：这首诗我比较欣赏永忆江湖句，战网也用了这个做昵称。开朗疏阔吧觉得。Top 4献钱尚父贯休贵逼人来不自由，龙骧凤翥势难收。满堂花醉三千客，一剑霜寒十四州。鼓角揭天嘉气冷，风涛动地海山秋。东南永作金天柱，谢公篇咏绮霞羞。他年名上凌烟阁，谁羡当时万户侯。还有个版本贵逼身来不自由，几年勤苦踏林丘。满堂花醉三千客，一剑霜寒十四州。鼓角揭天嘉气冷，风涛动地海山秋。莱子衣裳宫锦窄，谢公篇咏绮霞羞。他年名上凌烟阁，岂羡当时万户侯。推荐理由：霸气没的说，快意江湖纵情恩仇吧。Top 5虞美人·听雨蒋捷 少年听雨歌楼上。红烛昏罗帐。壮年听雨客舟中。江阔云低、断雁叫西风。 而今听雨僧庐下。鬓已星星也。悲欢离合总无情。一任阶前、点滴到天明其实我觉得如果不是为了写诗，值得背的是诗词里的句子和通篇的文章。长恨歌琵琶行侠客行长篇诗歌多得去。自京赴奉先县咏怀五百字我倒是能背下来= =然而觉得并没有什么卵用，平常提起来，不还是多提朱门酒肉臭路有冻死骨一句么。背诗其实背的是心情，伤春悲秋时候看看玉溪，纵情恩仇的时候多看太白，吟游山水想想王维，吟诵爱情的时候多看看纳兰词小山词反而不错。最近最喜欢这首其实德也狂生耳！偶然间、淄尘京国，乌衣门第。有酒惟浇赵州土，谁会成生此意？不信道、遂成知己。青眼高歌俱未老，向尊前、拭尽英雄泪。君不见，月如水。共君此夜须沉醉。且由他、娥眉谣诼，古今同忌。身世悠悠何足问，冷笑置之而已！寻思起、从头翻悔。一日心期千劫在，后身缘恐结他生里。然诺重，君须记！那就祝题主背诗背的开心吧w", "answer_votes": "35", "answer_comment": "​6 条评论"}
{"answer_author": "佐佑围男", "answer_id": 114741747, "answer_text": "陋室空堂，当年笏满床；衰草枯杨，曾为歌舞场。蛛丝儿结满雕梁，绿纱今又糊在蓬窗上。说什么脂正浓、粉正香，如何两鬓又成霜？昨日黄土垅头送白骨，今宵红绡帐底卧鸳鸯。金满箱，银满箱，转眼乞丐人皆谤。正叹他人命不长，哪知自己归来丧！训有方，保不定日后做强梁；择膏粱，谁承望流落在烟花巷！因嫌纱帽小，致使锁枷扛；昨怜破袄寒，今嫌紫蟒长。乱烘烘你方唱罢我登场，反认他乡是故乡。甚荒唐，到头来都是为他人做嫁衣裳。 ", "answer_votes": "369", "answer_comment": "​71 条评论"}
{"answer_author": "始欲而伤", "answer_id": 115225970, "answer_text": "陌上桑         日出东南隅，照我秦氏楼。秦氏有好女，自名为罗敷。罗敷喜蚕桑，采桑城南隅。青丝为笼系，桂枝为笼钩。头上倭堕髻，耳中明月珠。缃绮为下裙，紫绮为上襦。行者见罗敷，下担捋髭须。少年见罗敷，脱帽著帩头。耕者忘其犁，锄者忘其锄。来归相怨怒，但坐观罗敷。         使君从南来，五马立踟蹰。使君遣吏往，问是谁家姝？“秦氏有好女，自名为罗敷。”“罗敷年几何？”“二十尚不足，十五颇有余”。使君谢罗敷：“宁可共载不？罗敷前致辞：“使君一何愚！使君自有妇，罗敷自有夫！”“东方千余骑，夫婿居上头。何用识夫婿？白马从骊驹，青丝系马尾，黄金络马头；腰中鹿卢剑，可值千万余。十五府小吏，二十朝大夫，三十侍中郎，四十专城居。为人洁白晰，鬑鬑颇有须。盈盈公府步，冉冉府中趋。坐中数千人，皆言夫婿殊。”        个人超级喜欢的一首诗，韵味也很足，描写方法主要是对罗敷女美貌的侧面描写。", "answer_votes": "7", "answer_comment": "​2 条评论"}
{"answer_author": "山眠", "answer_id": 226291414, "answer_text": "红豆生南国，春来发几枝。愿君多采撷，此物最相思。", "answer_votes": "4", "answer_comment": "​4 条评论"}
{"answer_author": "穆航", "answer_id": 225432556, "answer_text": "张宗昌的诗词就该好好记住。&lt;img src=\"https://pic1.zhimg.com/50/v2-b104bcb1b31c9a0def57168e44cc23a7_hd.jpg\" data-rawwidth=\"699\" data-rawheight=\"526\" class=\"origin_image zh-lightbox-thumb\" width=\"699\" data-original=\"https://pic1.zhimg.com/v2-b104bcb1b31c9a0def57168e44cc23a7_r.jpg\"&gt;他为什么学刘邦做了这《大风歌》呢？有个故事。那年山东大旱，然后有人悄悄告诉张宗昌，可能是你哪里做错事情，老天爷生气了，所以去庙里拜拜神，认个错就行。军阀多迷信，张宗昌便去了，磕头了也认错了，但等了几天，还是不见下雨。大老张怒了，决定反其道而行之：“老子要用大炮轰他娘的！”说干就干，命令手下用大炮对天猛轰。数日后，天降甘霖。大老张一开心，作出了上面这首诗。难得的是，最后一句还把整首诗的格局提高了，也是最受赞誉的一句。2.《游趵突泉》趵突泉，泉趵突，三个眼子一般粗，三股水，光咕嘟，咕嘟咕嘟光咕嘟3.《游泰山》远看泰山黑糊糊，上头细来下头粗。如把泰山倒过来，下头细来上头粗。4.《咏闪电》忽见天上一火镰，疑是玉皇要抽烟。如果玉皇不抽烟，为何又是一火镰?5.《游蓬莱阁》好个蓬莱阁，他妈真不错。神仙能到的，俺也坐一坐。靠窗摆下酒，对海唱高歌。来来猜几拳，舅子怕喝多!6.《下雪》什么东西天上飞东一堆来西一堆莫非玉皇盖金殿筛石灰啊筛石灰7.《无题无题》要问女人有几何，俺也不知多少个。昨天一孩喊俺爹，不知他娘是哪个?8.《混蛋诗》你叫我去这样干，他叫我去那样干。真是一群大混蛋，全都混你妈的蛋。9.《求雨》玉皇爷爷也姓张，为啥为难俺张宗昌?三天之内不下雨，先扒龙皇庙，再用大炮轰你娘。10.《破冰歌》看见地上一条缝，灌上凉水就上冻。如果不是冻化了，谁知这里有条缝。背他的诗会让你明白文化有多重要。", "answer_votes": "349", "answer_comment": "​120 条评论"}
{"answer_author": "Kitty澂", "answer_id": 126737021, "answer_text": "往古之时，四极废，九州裂，天不兼复，地不周载。火爁焱而不灭，水浩洋而不息。猛兽食颛民，鸷鸟攫老弱。 于是女娲炼五色石以补苍天，断鳌足以立四极，杀黑龙以济冀州，积芦灰以止淫水。苍天补，四极正，淫水涸，冀州平，狡虫死，颛民生。 《山海经》也好有意思的说：P", "answer_votes": "8", "answer_comment": "​1 条评论"}
{"answer_author": "知乎用户", "answer_id": 115111837, "answer_text": "估计这篇是所有人的共同回忆！蜀道难作者：李白原文：噫吁嚱，危乎高哉！蜀道之难，难于上青天！蚕丛及鱼凫，开国何茫然！尔来四万八千岁，不与秦塞通人烟。西当太白有鸟道，可以横绝峨眉巅。地崩山摧壮士死，然后天梯石栈相钩连。上有六龙回日之高标，下有冲波逆折之回川。黄鹤之飞尚不得过，猿猱欲度愁攀援。(攀援 一作：攀缘)青泥何盘盘，百步九折萦岩峦。扪参历井仰胁息，以手抚膺坐长叹。问君西游何时还？畏途巉岩不可攀。但见悲鸟号古木，雄飞雌从绕林间。又闻子规啼夜月，愁空山。蜀道之难,难于上青天，使人听此凋朱颜！连峰去天不盈尺，枯松倒挂倚绝壁。飞湍瀑流争喧豗，砯崖转石万壑雷。其险也如此，嗟尔远道之人胡为乎来哉！(也若此 一作：也如此)剑阁峥嵘而崔嵬，一夫当关，万夫莫开。所守或匪亲，化为狼与豺。朝避猛虎，夕避长蛇；磨牙吮血，杀人如麻。锦城虽云乐，不如早还家。蜀道之难,难于上青天，侧身西望长咨嗟！", "answer_votes": "6", "answer_comment": "​4 条评论"}
{"answer_author": "HectorLee", "answer_id": 115048245, "answer_text": "苟利国家生死以，岂因祸福趋避之。----林则徐《赴戍登程口占示家人》", "answer_votes": "115", "answer_comment": "​37 条评论"}
{"answer_author": "储成勋", "answer_id": 126763244, "answer_text": "有两首词，是顾贞观为求纳兰性德搭救好友吴兆骞写的，词牌是《金缕曲》。此两阙词用词诚恳，感人肺腑，又节奏鲜明，读起来让人扼腕浩叹，又让人平添酒意，身世、友情、命运、遭逢，都在其中了，令人唏嘘，如下：    《金缕曲词二首》  清· 顾贞观 寄吴汉槎宁古塔，以词代书，丙辰冬寓京师千佛寺，冰雪中作  其一    季子平安否？便归来，平生万事，那堪回首！行路悠悠谁慰藉，母老家贫子幼。记不起，从前杯酒。魑魅搏人应见惯，总输他，覆雨翻云手，冰与雪，周旋久。    泪痕莫滴牛衣透，数天涯，依然骨肉，几家能够？比似红颜多命薄，更不如今还有。只绝塞，苦寒难受。廿载包胥承一诺，盼乌头马角终相救。置此札，君怀袖。    其二    我亦飘零久。十年来，深恩负尽，死生师友。宿昔齐名非忝窃，只看杜陵消瘦，曾不减，夜郎僝僽，薄命长辞知已别，问人生到此凄凉否？千万恨，为君剖。    兄生辛未吾丁丑，共此时，冰霜摧折，早衰蒲柳。诗赋从今须少作，留取心魄相守。但愿得，河清人寿！归日急翻行戍稿，把空名料理传身后。言不尽，观顿首。“我亦飘零久。十年来，深恩负尽，死生师友。”这样的词，实在是看一遍就忘不了。", "answer_votes": "17", "answer_comment": "​2 条评论"}
