{"question_id": "51238321", "question_text": "金庸非常会撩妹啊！情话技能MAX啊！比如我就对冲哥那句 “我梦见带了一大块生牛肉，摸到黑木崖上，去喂你家的狗”念念不忘冲哥你好会撩！", "question_title": "金庸小说里你印象最深的调情/情话？", "question_commet": "​4 条评论", "answer_number": "159 个回答", "question_followers": "1,599", "brower_number": "562,550"}
{"answer_author": "邱明昊", "answer_id": 143984283, "answer_text": "很多都提到了张教主和郡主之间的各种撩，不过我心中最难以忘怀的情话却是下面这两句：第三十四回《新妇素手裂红裳》       赵敏道：“为了你义父，你肯抛下你如花似玉的新娘子，何况是我？”说着慢慢斜倚在他身上，说道：“今日耽误了你的洞房花烛，你怪我不怪？”       不知如何，张无忌此刻心中甚感喜乐，除了挂念谢逊安危之外，反觉比之将要与周芷若拜堂成亲那时更加平安舒畅，到底是甚么原因，却也说不上来，然而要他承认欢喜赵敏搅翻了喜事，可又说不出口，只得道：“我自然怪你。日后你与那一位英雄潇洒的郡马爷拜堂之时，我也来大大捣乱一场，决不让你太太平平的做新娘子。”      赵敏苍白的脸上一红，笑道：“你来捣乱，我一剑杀了你。”张无忌忽然叹了口气，黯然不语。赵敏道：“你叹甚么气？”张无忌道：“不知道那位郡马爷生前做了甚么大善事，修来这样的好福气。”赵敏笑道：“你现下再修，也还来得及。”张无忌心中怦然一动，问道：“甚么？”赵敏脸一红，不再接口了。这两句情话在脑海里一直挥之不去。张教主忽然叹气后的“不知道那位郡马爷生前做了甚么大善事，修来这样的好福气”和郡主“你现下再修，也还来得及”这两句话，私以为实是倚天屠龙记中最情致殷殷的表白之语。比之灵蛇岛上赵敏的表白和张公子最后一回对周芷若剖明心意，委婉的多，也更具蕴意。此时两人之间的隔阂尚未完全化解，张无忌的怀疑也还没完全散去，但是两人之间的情意已经不断发展，慢慢的已难自已。两人不敢明说，却于一句一语中传达了彼此的情意。", "answer_votes": "253", "answer_comment": "​21 条评论"}
{"answer_author": "但行好事不二", "answer_id": 125506533, "answer_text": " 那婆婆道：“令狐少君，临别之际，我有一言相劝。”令狐冲道：“是，前辈教诲，令狐冲不敢或忘。”但那婆婆始终不说话，过了良久良久，才轻声说道：“江湖风波险恶，多多保重。”", "answer_votes": "77", "answer_comment": "​9 条评论"}
{"answer_author": "张方", "answer_id": 141793380, "answer_text": "《天龙八部》一书中，浓情之语甚多。比如虚竹的那句：“你是我梦中的仙姑，我就叫你梦姑吧。”乔峰的那句：“四海列国，千秋万载，就只这么一个阿朱。”虚竹之语，缠绵悱恻，如庄周物化，不知周梦为蝶，蝶梦为周？乔峰之语，豪迈潇洒，如孟夫子浩然之气，虽千万人吾往矣。然而，最让我心有所触的话，却是段誉的那句：“王姑娘，这一生一世，我是永远也不会对你生气的。”——梦中仙姑，虚实莫测。千秋万载，空存许约。倒不如只追求眼前的“一生一世”，只在乎现实的“爱恨瘨痴”。段誉此语，可谓平凡之中见珍爱，朴实之中睹真情，痴愚之中有精巧，杀伤力999+，堪称撩妹奇语。如果说乔峰的爱是豪情，虚竹的爱是迷情，那么段誉的爱就是痴情，金庸也无时无刻不在书中刻画段誉对爱情的“痴”。王语嫣只说了一句““你跟我来”，段誉的反应就是：“当真是喜从天降，一生之中，从未听见过有四个字是这般好听的。 ”王语嫣只对段誉随意的一笑， 段誉的内心独白就是：“我若能一辈子逗你喜笑颜开，此生复有何求。”每个坠入爱情中的人，都是痴人。所以这些话看似痴愚，却往往最能让人产生共鸣。遇到喜欢的人，喜欢还来不及，哪还舍得惹你生气？世间最动听的话语，不就是爱人召唤自己的声音吗？和喜欢的人，做开心的事，的确是多少人奢望的一件事情呀。在原著中，段誉的小名叫做“痴儿”，在中国古典文学作品中，还有一位痴儿。贾宝玉在游太虚幻境时，警幻仙子才对贾宝玉说：“痴儿，竟尚未悟。”对比段誉和贾宝玉对爱情的表达方式，真有异曲同工之妙。 宝黛阅《西厢》时，贾宝玉对林黛玉说：“好妹妹，千万饶我这一遭，原是我说错了。若有心欺负你，明儿我掉在池子里，教个癞头鼋吞了去，变个大忘八，等你明儿做了一品夫人，病老归西的时候，我往你坟上替你驮一辈子的碑去。”爱到深处时，哪里还会有心思去想华丽的语言去表达爱。一举一动，一颦一笑，皆是最动人的情话。这些有意无意间的朴质表白，胜过多少矫揉造作，无病呻吟的爱情诗篇矣。向来痴，从此醉……<img src=\"https://pic3.zhimg.com/50/5c0bbac5ddbf2bcacb88d749a722995f_hd.jpg\" class=\"content_image\">", "answer_votes": "222", "answer_comment": "​26 条评论"}
{"answer_author": "飞入芒花", "answer_id": 133355035, "answer_text": "《天龙八部》里的：堪堪又打了四十余杖，玄慈支持不住，撑在地下的双手一软，脸孔触到尘土。叶二娘哭叫：“此事须怪不得方丈，都是我不好！是我受人之欺，故意去引诱方丈。这……这……余下的棍子，由我来受罢！”一面哭叫，一面奔将前去，要伏在玄慈身上，代他受杖。玄慈左手一指点出，嗤的一声轻响，已封住了她穴道，微笑道：“痴人，你又非佛门女尼，勘不破爱欲，何罪之有？”叶二娘呆在当地，动弹不得，只是泪水簌簌而下。～～啊～这一声“痴人”。。。", "answer_votes": "81", "answer_comment": "​21 条评论"}
{"answer_author": "江灿", "answer_id": 125938217, "answer_text": "阿朱就是阿朱，四海列国，千秋万载，就只一个阿朱。岂是一千个、一万个汉人美女所能代替得了的？", "answer_votes": "60", "answer_comment": "​3 条评论"}
{"answer_author": "知乎用户", "answer_id": 125597658, "answer_text": "    盈盈道：“你别打岔，成不成？我跳进墙去，一只狗叫了起来，我便将狗子拍晕了。哪知这么一叫，便将那老公公和老婆婆吵醒了。老婆婆说：‘阿毛爹，别是黄鼠狼来偷鸡。’老公公说：‘老黑又不叫了，不会有黄鼠狼的。’老婆婆忽然笑了起来，说道：‘只怕那黄鼠狼学你从前的死样，半夜三更摸到我家里来时，总带一块牛肉、骡肉来喂狗。’”令狐冲微笑道：“这老婆婆真坏，她绕着弯儿骂你是黄鼠狼。”他知盈盈是最腼腆，她说到那老农夫妇当年的私情，自己只有假装不懂，她或许还会说下去，否则自己言语中只须带上一点儿情意，她立时便住口了。（省略几百字）  盈盈轻声问道：“冲哥，你睡着了吗？”令狐冲道：“我睡着了，我正在做梦。”盈盈道：“你在做甚么梦？”令狐冲道：“我梦见带了一大块牛肉，摸到黑木崖上，去喂你家的狗。”盈盈笑道：“你人不正经，做的梦也不正经。”论虐狗，我只服冲哥", "answer_votes": "74", "answer_comment": "​9 条评论"}
{"answer_author": "妍娘", "answer_id": 140862325, "answer_text": "“无忌哥哥，我小时候甚么事都跟你说，我要吃个烧饼，便跟你说；在路上见到个糖人儿好玩，也跟你说。那时候咱们没钱买不起，你半夜里去偷了来给我，你还记得吗？”“你给了我那个糖人儿，我舍不得吃，可是拿在手里走路，太阳晒着晒着，糖人儿融啦，我伤心得甚么似的，哭着不肯停。你说再给我找一个，可是从此再也找不到那样的糖人儿了。你虽然后来买了更大更好的糖人儿给我，我也不要了，反而惹得我又大哭了一场。那时你很着恼，骂我不听话，是不是？”“我的脾气很执拗，殷六叔是我第一个喜欢的糖人儿，我再也不喜欢第二个了。无忌哥哥，有时我自己一个儿想想，你待我这么好，几次救了我的性命，我… 我该当侍奉你一辈子才是。然而我总当你是我的亲哥哥一样，我心底里亲你敬你，可是对他啊，我是说不出的可怜，说不出的喜欢。他年纪大了我一倍还多，又是我的长辈，多半人家会笑话我，爹爹又是他的死对头，我… 我知道不成的… 可是不管怎样，我总是跟你说了。”-- 杨不悔 《倚天屠龙记》", "answer_votes": "72", "answer_comment": "​18 条评论"}
{"answer_author": "知乎用户", "answer_id": 142001106, "answer_text": "论（耍）调（流）情（氓），我只服，张无忌。绿柳山庄挠赵敏脚心，这事儿真的挺严重的。在旧时，脚是一个女人最隐晦最矜持最不能碰的地方，有多金贵呢？旧时春宫图可以漏三点，但极少漏脚。传统曲艺，卖油郎独占花魁，妓女花魁被恶少光天化日之下搂搂抱抱扒衣衫都没怎么样，但被扒了鞋袜，就想寻死。而张！无！忌！竟然挠陌生女性的脚心！在旧时和强奸无异……而金庸作为从旧时过来的世家子弟是很清楚的，那么他刻画这个情节可能有深意。", "answer_votes": "77", "answer_comment": "​30 条评论"}
{"answer_author": "李浅墨", "answer_id": 143908110, "answer_text": "我来说一个不能播的吧。那是我小学三年级，第一次读金庸的小说，看的是碧血剑。一个不到10岁的少年，沉醉在袁承志牛逼闪闪的人生之中，爽的不要不要的，然后无意之中我读到了这里。。。袁承志心道：“他还没睡，胡大哥可下不了手。”生怕胡桂南遇险，于是跃墙而入，只听得男女嬉笑之声不绝，循声走去，忽听得玉真子笑道：“你身上哪一处地方最滑？”那女子笑道：“我不知道。”玉真子笑道：“我来摸摸看。”多年以后我已经无法重新体会当年这段文字对一个少年的震撼。事实上比起金庸，古龙更爱写香艳的片段，写的也更多，但永远嵌在我深深的脑海里的就是这段文字。而能写出这个情节的金庸无疑也是老司机（嘿嘿）。算了，不匿，谁还没个年轻时候。。。", "answer_votes": "21", "answer_comment": "​10 条评论"}
{"answer_author": "There There", "answer_id": 129815791, "answer_text": "金书撩汉第一人必须是赵敏。她原本是志在沙场庙堂，想要轰轰烈烈干一番大事业的。结果看上张无忌之后把她运筹帷幄，高瞻远瞩的本事全用在了把张无忌的身上。赵敏点了点头，叫店小二拿一只火锅，切三斤生羊肉，打两斤白酒。张无忌满腹疑团，心想她是郡主之尊，却和自己到这家污秽的小酒家来吃涮羊肉，不知安排着甚么诡计。赵敏斟了两杯酒，拿过张无忌的酒杯，喝了一口，笑道：“这酒里没安毒药，你尽管放心饮用便是。”张无忌道：“姑娘召我来此，不知有何见教？”赵敏道：“喝酒三杯，再说正事。我先干为敬。”说着举杯一饮而尽。张无忌拿起酒杯，火锅的炭火光下见杯边留着淡淡的胭脂唇印，鼻中闻到一阵清幽的香气，也不知这香气是从杯上的唇印而来，还是从她身上而来，不禁心中一荡，便把酒喝了。赵敏道：“再喝两杯。我知道你对我终是不放心，每一杯我都先尝一口。”张无忌知她诡计多端，确是事事提防，难得她肯先行尝酒，免了自己多冒一层危险，可是接连喝了三杯她饮过的残酒，心神不禁有些异样，一抬头，只见她浅笑盈盈，酒气将她粉颊一蒸，更是娇艳万状。张无忌哪敢多看，忙将头转了开去。脏兮兮又清冷的小店，一只火锅，三斤羊肉。烛火掩映下杯子上的胭脂唇印。受这一段的启发，我出门见人都要涂个口红。赵敏低下了头，轻声道：“好罢！我跟你说，当时你咬了殷姑娘一口，她隔了这么久，还是念念不忘于你，我听她说话的口气啊，只怕一辈子也忘不了。我也咬你一口，也要叫你一辈子也忘不了我。”张无忌听到这里，才明白她的深意，心中感动，却说不出话来。赵敏又道：“我瞧她手背上的伤痕，你这一口咬得很深，我想你咬得深，她也记得深。要是我也重重的咬你一口，却狠不了这个心；咬得轻了，只怕你将来忘了我。左思右想，只好先咬你一下，再涂‘去腐消肌散’，把那些牙齿印儿烂得深些。”张无忌先觉好笑，随即想到她此举虽然异想天开，终究是对自己一番深情，叹了口气，轻声道：“我不怪你。算是我狗咬吕洞宾，不识好人心。你待我如此，用不着这么，我也决不会忘。”赵敏本来柔情脉脉，一听此言，眼光中又露出狡狯顽皮之意，笑道：“你说：‘你待我如此’，是说我待你如此不好呢，还是如此好？张公子，我待你不好的事情很多，待你好的，却没一件。”张无忌道：“以后你多待我好一些，那就成了。”握住她左手放在口边，笑道：“我也来狠狠的咬上一口，教你一辈子也忘不了我。” 兵法有云：“以正和，以奇胜。”赵敏这一口，如果只到，我咬你一口，叫你一辈子忘不了我。只能算标新立异。可加上后面一段，我想重重咬你一口，可是又舍不得，咬得轻了，又怕你忘了我。只好涂药让它烂得深些。这一番轻重难量，真是奇中有变。张无忌哪里能还记得她是自己的对头人呢。赵敏将嘴唇凑到张无忌耳边，低声道：“你的周姑娘要糟啦！你叫我一声好姊姊，我便出头去给她解围。”张无忌心中一动，知道这位姑娘足智多谋，必有妙策使周芷若脱困，但她年纪比自己小得多，这一声“好姊姊”叫起来未免太也肉麻，实在叫不出口，正自犹豫，赵敏又道：“你不叫也由得你，我可要走啦。”张无忌无奈，只得在她耳边低声叫道：“好姊姊！赵敏将嘴凑到张无忌耳边，轻轻说道：“你这该死的小淫贼！”这一句话似嗔似怒，如诉如慕，说来娇媚无限，张无忌只听得心中一荡，霎时间意乱情迷，极是烦恼：“倘若她并非如此奸诈险毒，害死我的表妹，我定当一生和她长相厮守，甚么也不顾得了。”倚天常常会给人一种错觉。赵敏是邪魅性感的霸道总裁，张无忌是身手不凡的傻白甜。他每每捉襟见肘之时，赵敏总是在一旁轻松应付，外加调笑。“你的周姑娘要糟啦！你叫我一声好姊姊，我便出头去给她解围。”这话既幸灾乐祸，又俏皮可爱。You dirty boy！说真的，处男张无忌跟赵敏都是这种PLAY，整日只会要他赌咒发誓，又自怨自艾清汤寡水的周芷若哪里还有什么滋味。 也难怪她会输。赵敏嫣然一笑，说道：“你在给自己找个不杀我的原因，我知道你实在舍不得我。”张无忌怒道：“就算是我不忍心，那又怎样？”赵敏道：“我很喜欢啊。我一直不知你是否真心待我，现下可知道了。”张无忌叹了口气，道：“赵姑娘，我求求你，你自个儿走罢。”赵敏摇头道：“我一定要见谢大侠。”……赵敏道：“你见谢大侠不在，为甚么反而欣慰？”张无忌道：“又来胡说八道，我几时欣慰了？”赵敏微笑道：“难道我不会瞧你的脸色么？你一推开房门，怔了一怔，绷起的脸皮便放松了。”张无忌不去睬她，自行斜倚在炕上。赵敏笑吟吟的坐在椅中，说道：“我知道你怕谢大侠杀我，幸好他不在，倒免得你为难。我知道你真是不舍得我。”张无忌怒道：“不舍得你便怎样？”赵敏笑道：“我欢喜极了。”张无忌恨恨的道：“那你为甚么几次三番的来害我？你倒舍得我？”赵敏突然间粉脸飞红，轻声道：“不错，从前我确想杀你，但自从绿杨庄上一会之后，我若再起害你之心，我敏敏特穆尔天诛地灭，死后永沦十八层地狱，万劫不得超生。”……赵敏笑道：“为甚么你就甘心受我欺骗？因为你心中喜欢我，是不是？”张无忌忿忿的道：“是便怎样？”赵敏道：“我很开心啊。”张无忌见她笑语如花，令人瞧着忍不住动心，而她给自己重重打了四个耳光后，脸颊兀自红肿，瞧了又不禁怜惜，便转过了头不去看她。……张无忌道：“我不要你跟着我。”赵敏道：“为甚么？”张无忌道：“你是害死我表妹的凶手，我岂能和仇人同行？”赵敏道：“好，你独自去罢！”张无忌出了房门，忽又回身，问道：“你在这里干么？”赵敏道：“我在这儿等你义父回来，跟他说知你救韩林儿去了。”张无忌道：“我义父嫉恶如仇，焉能饶你性命？”赵敏叹了口气，道：“那也是我命苦，有甚么法子？”张无忌沉吟半刻，道：“你还是避一避的好，等我回来再说。”赵敏摇头道：“我也没甚么地方好避。”张无忌道：“好罢！你跟我一起去救韩林儿，再一起回来对质。”赵敏笑道：“这是你要我陪你去的，可不是我死缠着你，非跟你去不可。”张无忌道：“你是我命中的魔星，撞到了你，算是我倒霉。”被偏爱的都有恃无恐。赵敏很好的诠释了这一句话。她也真是有大将风范。意中人对自己误会甚深，伤心之余还能摸透对方的心思，语笑不禁。让张无忌对他全然没有办法。张无忌在海外对着周芷若赌咒发誓，还是抵不过赵敏的嫣然一笑。他在赵敏面前，总是情绪非常丰富。既生气，又不舍。那一句“你到舍得我？”，无疑是个错付真心，委屈至极的小男人。又爱又恨的情绪，跃然纸上。统领群豪令行禁止的大教主此刻荡然无存。一想到故事后面五行旗在少林大显神威之后对他齐齐鞠躬的壮观场面，再看看此时，令人莞尔。最后“你是我命中的魔星”。是又无奈，又有爱。男人通常只会跟两种女人说这样的话。一种是前世的情人，一种是现世的情人。对着自己亲妈，恐怕都说不出口。其实张无忌也是会撩妹儿的。。。两人来到房中，张无忌低声道：“浇菜那个老农本领更大，你瞧出来了么？”赵敏道：“啊，我倒看不出。”张无忌道：“他肩挑粪水，行得极慢，可是两只粪桶竟没半点晃动，那是很高的内力修为。”赵敏道：“比起你来怎么样？“张无忌笑道：“我来试试，也不知成不成。”说着一把将她抱起，扛在肩头，作挑担之状。赵敏格格笑道：“啊哟！你将我当作了粪桶么？” ……饭后张无忌和赵敏入房，闩上了门。两人在饭桌上这般真真假假的调笑，不由得都动了情。赵敏俏脸红晕，低声道：“我们这是假的，可作不得真。”张无忌一把将她搂在怀里，吻了吻她，低声道：“倘若是假的，三年两载，又怎能生得个娃娃，抱回家去给你爹爹瞧瞧？”赵敏羞道：“呸，原来你躲在一旁，把我的话都偷听去啦。” 果然Dirty Boy郡主诚不欺我。教主抗得妙，郡主答得俏。闺中儿女，人间之乐也。再看看下面老金的措辞“一把搂在怀里”，速度跟力量肯定是掌握得刚刚好啊。还有就是，这个“搂”字。用得妙极，一下味儿就变了。跟抱它是两码事，两码事。“搂”这个字里面，有缠绵的味道。比方说，张无忌搂住杨逍，或者张无忌搂住大师伯，这个画面就有点儿令人不寒而栗。但是如果张无忌抱住杨逍，抱住大师伯，这个画面就平易近人了许多。倚天的好多撩人的戏码，说真的，不适合未成年人看。不是说少儿不宜，而是get不到那个感觉。比如张无忌后面的低声，可能就会有纯情的孩子觉得，那就是简单的小声说个话嘛。但我担保此时的dirty boy绝不仅仅是为了不让杜氏夫妇听见的才压低声了。这一节，就是当年十一二岁初看的我，没有体会到的┑(￣Д ￣)┍而且我还是看未删减版的天方夜谭跟三言二拍长大的呢。------------------------------------------张无忌心想：“我日间只在厨房，料来也见不到寺中高手，晚上相机寻访义父下落，倒也方便。”但仍是故意装着踌躇，待那引他入寺的僧人也从旁相劝，这才勉强答应，说道：“师父，最好你一个月给我六钱银子，我五钱银子给我妈，一钱银子给我媳妇买花布……”管香积厨的僧人呵呵笑道：“咱们一言为定，六钱就是六钱。”易三娘又叮嘱了几句，这才同了杜百当慢慢下山。张无忌追将出去，道：“妈，我媳妇儿请你多照看。”易三娘道：“我理会得，你放心便是。”污也污完了，在这个答案向着不可描述的方向发展的时候，我要力挽狂澜，让它恢复到正常状态。张无忌的情话水平，跟情话boy令狐冲那是比不了的。跟郭靖的笨口拙舌却透着朴实温暖的情话也是不一样的。但是张无忌的情话，有个特点，就是贵在真实。我说的这个真实，不是说他说得是真话，而是就如同 @果果心在评论提到的一样，有一种现世的烟火气息。在漫长的人生岁月里，你说不定能碰到。这时，张无忌种情话的妙处，你就能体会到。就是，他的话里面，有他内心深处自然而发的牵挂。并且，说不定哪天，你就会对一个人产生这样的牵挂。又或者，有那么一天，有哪个人，会对你有这种牵挂。这牵挂不似直白的我爱你，却比我爱你更具体，更生动。以赵敏的能力，跟杜百当夫妇相处，是完全不需要担心的。他这一句话，说和不说，对赵敏来说，没什么差距。甚至赵敏可能都不知道他曾经说过这么一句话。但是，当他决定在少林寺潜伏下来，慢慢查询最爱的义父的下落的时候，他想起她来。追出去，跟已经往山下走的易三娘特意补了一句：“我媳妇请你多照看”。这证明，这句话对他来说很重要。他是真的，在挂念她。", "answer_votes": "414", "answer_comment": "​83 条评论"}
{"answer_author": "轻云流风", "answer_id": 125505371, "answer_text": "谢谢邀请我印象最深的是《笑傲江湖》第十七章“倾心”里的这一段。情话Boy的令狐冲靠着动人的情话攻陷了盈盈的心理防线，也给我们上了一堂“如何追求女神”的课程。那姑娘道：“哼，希罕么？你就跟我说，我还不爱听呢。你可知我是甚么人？是甚么来头？”令狐冲摇头道：“我不知道。我连姑娘叫甚么名字也不知道。”那姑娘道：“你把事情隐瞒了不跟我说，我也不跟你说。”令狐冲道：“我虽不知道，却也猜到了八九成。”那姑娘脸上微微变色，道：“你猜到了？怎么猜到的？”令狐冲道：“现在还不知道，到得晚上，那便清清楚楚了。”那姑娘更是惊奇，问道：“怎地到得晚上便清清楚楚？”令狐冲道：“我抬起头看看天，看天上少了那一颗星，便知道姑娘是甚么星宿下凡了。姑娘生的天仙一般，凡间哪有这样的人物。那姑娘脸上一红，“呸”的一声，心中却十分喜欢，低声道：“又来胡说八道。”这时她已将枯枝生了火，把洗剥了的青蛙串在一根树枝之上，在火堆上烧烤，蛙油落在火堆之中，发出嗤嗤之声，香气一阵阵的冒出。她望着火堆中冒起的青烟，轻轻的道：“我叫做‘盈盈’。说给你听了，也不知你以后会不会记得。”令狐冲道：“盈盈，这名字好听得很哪。我要是早知道你叫作盈盈，便决不会叫你婆婆了。”盈盈道：“为甚么？”令狐冲道：“盈盈二字，明明是个小姑娘的名字，自然不是老婆婆。”盈盈笑道：“我将来真的成为老婆婆，又不会改名，仍旧叫作盈盈。”令狐冲道：“你不会成为老婆婆的，你这样美丽，到了八十岁，仍然是个美得不得了的小姑娘。盈盈笑道：“那不变成了妖怪吗？”令狐冲伸了伸舌头，说道：“这个也不许，那个也不许，将来谁做了你的……”说到这里，见她沉下脸来，当即住口。盈盈哼的一声。令狐冲道：“你为甚么生气？我说将来谁做了你的徒弟，可有得苦头吃了。”他本来想说“丈夫”，但一见情势不对，忙改说“徒弟”。盈盈自然知道原意，说道：“你这人既不正经，又不老实，三句话中，倒有两句颠三倒四。我……我不会强要人家怎么样，人家爱听我的话就听，不爱听呢，也由得他。”令狐冲笑道：“我爱听你的话。”这句话中也带有三分调笑之意。盈盈秀眉一蹙，似要发作，但随即满脸晕红，转过了头。一时之间，两人谁也不作声。忽然闻到一阵焦臭，盈盈一声“啊哟”，却原来手中一串青蛙烧得焦了，嗔道：“都是你不好。”令狐冲笑道：“你该说亏得我逗你生气，才烤了这样精彩的焦蛙出来。”取下一只烧焦了的青蛙，撕下一条腿，放入口中一阵咀嚼，连声赞道：“好极，好极！如此火候，才恰到好处，甜中带苦，苦尽甘来，世上更无这般美味。”盈盈给他逗得格格而笑，也吃了起来。令狐冲抢着把最焦的蛙肉自己吃了，把并不甚焦的部分都留给了她。", "answer_votes": "397", "answer_comment": "​75 条评论"}
{"answer_author": "知乎用户", "answer_id": 142356169, "answer_text": "看了许多答案，果然敏敏是大家公认的撩汉高手。我也这么认为。不论是酒馆先饮三杯，还是咬烂手背，甚至是耳语吹气说“该死的小淫贼”，都是经典教学的大杀器。然而这么妖气十足的敏敏，曾经也做过一些文气十足的事，在我印象中十分深刻。张无忌接箭在手，见来箭并无箭镞，箭杆上却绑着一信。张无忌解下看时，信封上写的是“张教主亲启”，拆开信来，一张素笺上写着几行簪花小楷：金盒夹层，灵膏久藏。珠花中空，内有药方。二物早呈君子左右，何劳忧之深也？惟以微物不足一顾，委之婢仆，弃诸尘土，岂贱妾之所望耶？先说你要的东西我早就给你啦（你现在还不要我的心其实我也已经给你啦），然后说你居然给了那个让我吃醋的俏丫头，我不能忍呐", "answer_votes": "82", "answer_comment": "​32 条评论"}
{"answer_author": "蓉草与则人", "answer_id": 143826799, "answer_text": "一路下来不是冲哥就是无忌哥哥，这俩撩妹圣手说出啥撩妹的话来都不足为奇。但碰上愚笨得很的靖哥哥，说出一段情话来就不得了了。“郭靖也是微微一笑，说道：“你这样多好看，干么先前扮成个小叫化？”黄蓉侧过了头，道：“你说我好看吗？”郭靖叹道：“好看极啦，真像我们雪山顶上的仙女一般。”黄蓉笑道：“你见过仙女了？”郭靖道：“我没见过，见了那还有命活？”黄蓉奇道：“怎么？”郭靖道：“蒙古的老人家说，谁见了仙女，就永远不想再回到草原上来啦，整天就在雪山上发痴，没几天就冻死了。”", "answer_votes": "61", "answer_comment": "​18 条评论"}
{"answer_author": "捌望月", "answer_id": 162501076, "answer_text": "说起撩妹这件事，实在是有点伤心，前几年，“如何撩妹”、“五分钟，你也可以变成情圣”这类的教材，在网路上遍地都是，有的人还摇身一变成了把妹达人甚至出了书。现在呢，谈“撩妹”立刻被斥为直男癌，倒是燕公子之流靠传授如何套汉子成了网红。公平吗？当然不公平。不过就算现在撩妹教程重新兴起，又有用吗？当然没用。网上那些九流的把妹教程，基本上都是肥宅自我意淫的产物。说不定论坛上那些号称“泡妞圣手”三个180的大神，和你一样满脸痘喜欢抠着脚看美剧。撩妹这种东西，跟真正的高富帅金庸老先生学就够了。比如《天龙八部》里的段誉，一提到他，脑中的印象应该是个书呆子，但此子撩妹的情商高得令人发指。比如说在参合庄初遇阿朱，他是这么说的：段誉道：“我早料到姊姊跟阿碧姊姊一般，也是一位天下少见的美人，可是我心中啊，却将姊姊想得跟阿碧姊姊差不多，哪知道一见面，这个……这个……”阿朱抢着道：“原来远远及不上阿碧？”阿碧同时道：“你见她比我胜过十倍，大吃一惊，是不是？”段誉摇头道：“都不是。我只觉老天爷的本事，当真令人大为钦佩。他既挖空心思，造了阿碧姊姊这样一位美人儿出来，江南的灵秀之气，该当一下子使得干干净净了。哪知又能另造一位阿朱姊姊。两个儿的相貌全然不同，却各有各的好看，叫我想赞美几句，却偏偏一句也说不出口。”阿朱阿碧两女，在书中颜色相仿，各有千秋，再加上年龄、地位相若，暗地里没有相互比较较劲，是谁也不信的。评价这样两个女孩的相貌，绝对不能厚此薄彼，但各拍马屁一百，却又显得诚意不够。段誉厉害就厉害在用了“抖包袱”这一招。阿朱一出现，他先不做评价，却开始玩悬念，“将姊姊想得跟阿碧姊姊差不多，哪知道一见面，这个……这个……”言下之意就是两女根本不一样了，按照正常人的思路，接下来肯定要分出个高下，两女一听就急了，所以一个抢着道“原来远远及不上阿碧？”一个同时道“你见她比我胜过十倍”，貌似各自谦虚，其实是谁也不服谁。这时段誉才悠悠然抛出结论：你俩是不同style的美女，打分谁高谁低还真打不出来，只能佩服老天爷。于是阿朱的反应是“笑道：‘呸，你油嘴滑舌地已赞了这么一大片，反说一句话也说不出口。’”很是受用啊。再来看初遇王语嫣那段，段誉先喊她神仙姊姊，少女不肯，说“我姓王，你叫我王姑娘就是。”换了一般人，大概也就借篙下船，喊一声王姑娘了，但段誉却偏偏不肯：摇头道：“不行，不行，天下姓王的姑娘何止千千万万，如姑娘这般天仙人物，如何也只称一声‘王姑娘’？可是叫你作什么呢？那倒为难得紧了。你称作王仙子吗？似乎太俗气。叫你曼陀公主罢？大宋、大理、辽国、吐番、西夏，哪一国没有公主？哪一个能跟你相比？” 王语嫣此时对他毫无半分情愫，但听他这么说，是这个反应：那少女听他口中念念有词，越觉得他呆气十足，不过听他这般倾倒备至、失魂落魄的称赞自己美貌，终究也有点欢喜。开口闭口就是“女神”的男同胞们，现在可以反思一下自己了。这两段，在金迷中其实很有名，多读几遍书也能注意到，反而是下面这段很容易让人遗漏的细节，让我忍不住拍案叫绝。说的是少林寺三英大战群雄后，段誉与钟灵历劫重逢，此时距离与钟灵分手，已经过去将近三十章。钟灵和他目光一触，脸上一阵晕红，似笑非笑的道：“你早忘了我罢？还记不记得我姓甚么？”敲黑板啊同学们，女孩子问你还记不记得她姓什么，你要是傻乎乎地回答“当然记得，你姓钟嘛”，那就是零分啊！这一题考的是你的恋爱值，不是记忆力，是一道陷阱题啊！这么一道高难度的题目，段誉是怎么回答呢的？段誉见到她的神情，脑中蓦地里出现了一幅图画。那是她坐在无量宫大厅的横梁上，两只脚一荡一荡，嘴里咬着瓜子，她那双葱绿鞋上所绣的几朵黄色小花，这时竟似看得清清楚楚，脱口而出：“你那双绣了黄花的葱绿鞋儿呢？”钟灵的反应是“脸上又是一红，甚是欢喜” 。这一关算是安全度过了。这就不是临场发挥这么简单了，要求当事人要事无巨细地记得第一次见面的场景、细节，过了这么多章还历历在目。读者诸君请想一想，你们第一次见心仪女孩的时候，她穿着什么样的鞋子？是达芙妮还是Jimmy  Choo？回忆不出来的请自觉点赞。：）所以啊，人家段誉把除了王语嫣和朱紫以外的远房堂妹全部get可不是靠主角光环哦。对于他为什么成功，金庸老先生没说，倒是评价了和他性格类似的便宜老爹段正淳：段正淳来中原与马夫人偷情时，说自己十几年来都带着给马夫人抹汗的手帕，金老先生画外音说：“段正淳说十几年来身边一直带着那块旧手帕，那倒不见得，不过此刻却倒真便在怀里。他容易讨得女子欢心，这套本事也是重要原因，令得每个和他有过风流孽缘的女子，都信他真正爱的便是自己，只因种种难以抗拒的命运变故，才无法结成美满姻缘。”用我们现在的话来说，这俩人就像是商场里的中央空调，你以为他是暖男，其实每个进来购物的人他都要喷人家一脸暖气。所以女孩子们要睁大眼睛看清楚，爱的深浅，和情话的多少是不成正比的。你以为他情深似海一句说话一个眼神就撩拨得你心头小鹿乱撞从此非君不嫁，谁知道这只是他千锤百炼在无数女孩身上操练出来的一套业务技能。又有人说了，不学段誉、韦小宝这样的高手，难道跟着萧峰、郭靖这种死直男学吗？读者诸君，不解风情的死直男说起情话来，虽然简单粗暴，但可贵在直抒胸臆，就像冬天里的一口烈酒，乍喝之下粗粝得辣嗓子，但喝下去之后，五脏六腑都热了起来。萧峰说：“我既误杀阿朱，此生终不再娶。阿朱就是阿朱，四海列国，千秋万载，就只一个阿朱。”郭靖说：“蓉儿不是什么小妖女，蓉儿是很好很好的姑娘。”感情这东西，大概也跟武功一样，到了最高境界，都是讲究重剑无锋，大巧不工吧。喜欢这篇文章的话，欢迎关注我的微信公众号“捌望月的小世界”，写一些适合饭中睡前马桶上的有趣小内容 ", "answer_votes": "75", "answer_comment": "​12 条评论"}
{"answer_author": "我喜欢你是寂静的", "answer_id": 125570565, "answer_text": "对张无忌在猜疑赵敏这段印象深刻，虽然恨你，但更爱你，这种矛盾心理下的爱意更令我难以忘怀。赵敏抚着红肿炙热的面颊，怔怔的瞧着他，过了一会，眼光中渐渐露出怜爱的神色，长长叹了口气。张无忌生怕自己心动，屈服于她美色和柔情的引诱之下，将头转了开去，突然一顿足，说道：“我曾立誓为表妹报仇，算我懦弱无用，今日下不了手。你作恶多端，终须有日再撞在我的手里！”说着大踏步便走出庙门。他走出十余丈，赵敏追了出来，叫道：“张无忌，你往哪里去？”张无忌道：“跟你有甚么相干？”赵敏道：“我有话要问谢大侠和周姑娘，请你带我去见他二人。”张无忌道：“我义父下手不容情，你这不是去送死？”赵敏冷笑道：“你义父心狠手辣，可不似你这等胡涂。再说，谢大侠杀了我，你是报了表妹之仇，岂不是正好偿了你的心愿？”张无忌道：“我胡涂甚么？我不愿你去见我义父。”赵敏微笑道：“张无忌，你这胡涂小子，你心中实在舍不得我，不肯让我去给谢大侠杀了，是也不是？”张无忌给她说中了心事，脸上一红，喝道：“你别罗唆！我让你多行不义必自毙。你最好离得我远远的，别叫我管不住自己，送了你性命。”赵敏缓缓走近，说道：“我这几句话非问清楚谢大侠和周姑娘不可，我不敢在背后说旁人坏话，当面却须说个明白。”张无忌起了好奇之心，问道：“你有甚么话问他们？”赵敏道：“待会你自然知道。我不怕冒险，你反而害怕么？”张无忌略一迟疑，道：“这是你自己要去的，我义父若下毒手，我须救不得你。”赵敏道：“不用你为我担心。”张无忌怒道：“为你担心？哼！我巴不得你死了才好。”赵敏笑道：“那你快动手啊。”张无忌呸了一声，不去理她，快步向镇甸走去。赵敏跟在后面。两人将到镇甸，张无忌停步转身。说道：“赵姑娘，我曾答应过你，要给你做三件事。第一件是为你找屠龙刀，这件事算是做到了。还有两件事未办。你见我义父，那是非死不可。你还是走罢，待我替你办了那两件了，再去会我义父不迟。”赵敏嫣然一笑，说道：“你在给自己找个不杀我的原因，我知道你实在舍不得我。”张无忌怒道：“就算是我不忍心，那又怎样？”赵敏道：“我很喜欢啊。我一直不知你是否真心待我，现下可知道了。”张无忌叹了口气，道：“赵姑娘，我求求你，你自个儿走罢。”赵敏摇头道：“我一定要见谢大侠。”以上。看的我哭笑不得，真是一个愿打一个愿挨。哈哈", "answer_votes": "56", "answer_comment": "​8 条评论"}
{"answer_author": "谁家的小熊猫", "answer_id": 143925805, "answer_text": "看来大家普遍觉得冲郎和无忌哥二人最厉害！单比较这两个人，我觉得冲不如忌。看令狐冲大段大段的情话/贫嘴，总有一些背台词的感觉，好像一个演技很好的演员，熟极而流，却未甚走心，因而有用力过猛之嫌（当然盈盈喜欢）。这也是由笑傲江湖的走向决定的，令狐冲重情重义，想要报答盈盈，而又知道盈盈脸皮薄，所以必须在那七分真情上再加上三分演绎，才不辜负她。因而冲盈最后曲谐，多少有些戏假成真之意。冲郎的卖力演出，终究喜剧结尾，可喜可贺。相反无忌哥，好像是个从无演戏经验的毛头小子，他所说所做的，都来自最平常的生活，所以读者就好像看真人秀，各种恋爱中的试探挣扎折磨欢乐痛苦，都一一呈现，精彩让人目不暇给。张无忌所说的情话，似乎都是不得已而为之，却不可不为，所以更显得禁欲和贵重。当然，这也是由倚天的大环境和张无忌与赵敏性格碰撞导致的。说来说去，谁会调情/说情话，还是得推一个人：创作出这不同剧情，不同性格，不同爱情的金老爷子。", "answer_votes": "14", "answer_comment": "​2 条评论"}
{"answer_author": "卢天亮", "answer_id": 125481005, "answer_text": "天上的月亮又圆又白。每年中秋都能想起，印象不可谓不深⋯⋯", "answer_votes": "79", "answer_comment": "​22 条评论"}
{"answer_author": "果果心", "answer_id": 125494597, "answer_text": "谢邀。题主在描述里说到用情话撩妹，并举了令狐冲的例子。要知道，杨过和令狐冲这种“轻熟男”在小说男主角里是凤毛麟角，金庸笔下男一号还是“傻小子”比较多，他们说起情话直抒胸臆、朴实真诚。所以论调情还是欧阳克、段正淳、石中玉、韦小宝等等这些“老司机”比较在行。而最让人动心的还是杨康这段。射雕英雄传第十三回，他身陷归云庄被关在小屋里，穆念慈去救他：    穆念慈甚是焦急，道：“我去盗铁铐的钥匙。”完颜康道：“你别去，庄内敌人厉害，你去犯险必然失手，无济于事。”穆念慈道：“那么我背你出去。”完颜康道：“他们用铁链将我锁在柱上，背不走的。”穆念慈急得流下泪来，呜咽道：“那怎么办？”完颜康笑道：“你亲亲我罢。”穆念慈跺脚道：“人家急得要命，你还闹着玩。”完颜康悄声笑道：“谁闹着玩了？这是正经大事啊。”无法脱身、性命堪忧算什么，就算天崩地裂、刀山火海，多危急的情况统统不管他只要你，对他来说眼前最重要的事就是和你在一起……面如冠玉目似春波的小王爷笑嘻嘻斜乜着眼看着她，薄唇一动：你亲亲我吧。哪个姑娘能把持得住，不能再想了，我要控制不住自己狂狷的荷尔蒙了。————分割线————如果说金庸小说里印象最深的情话……中国人向来含蓄，真正面对着心爱的人往往内心酸涩，甜言蜜语难以启齿，所以最深情的告白经常是自言自语或者对着不相干的人说的：比如“四张机，鸳鸯织就欲双飞……”比如“千秋万载，四海列国……”比如“小师妹这时候不知在干什么……”比如“什么时候，姑娘再叫我去鞭打？”但是最打动我的还是“百胜刀王”胡逸之对“天下第一美人”陈圆圆，他的痴情古今无人堪比：“那日我在成都，无意中见了陈姑娘一眼，唉，那也是前生冤孽，从此神魂颠倒，不能自拔。韦香主，胡某是个没出息、没志气的汉子。当年陈姑娘在平西王府中之时，我在王府里做园丁，给她种花拔草。她去了三圣庵，我便跟着去做伙夫。我别无他求，只盼早上晚间偷偷见到她一眼，便已心满意足，怎……怎会有丝毫唐突佳人的举动？”“我怕泄漏了身份，平日一天之中，难得说三句话，在她面前更是哑口无言。这二十三年之中，跟她也只说过三十九句话。她倒向我说过五十五句。”“小兄弟，人世间情这个东西，不能强求，你能遇到阿珂，跟她又有师姊师弟的名份，你一生之中，已经看过她许多眼，跟她说过许多话。她骂过你，打过你，用刀子刺过你，那便是说她心中有了你这个人，这已经是天大的福份了。”“你喜欢一个女子，那是要让她心里高兴，为的是她，不是为你自己。倘若她想嫁给郑公子，你就该千方百计的助她完成心愿。倘若有人要害郑公子，你为了心上人，就该全力保护郑公子，纵然送了自己性命，那也无伤大雅啊。”“唉，你总是不明白我对陈姑娘的情意。我这一生一世，决计不会伸一根手指头儿碰到她一片衣角。”有一种深情是根本没想过要得到对方：你存在于我的世界就已经足够，你一切都好是我最大的心愿！杨康和胡逸之，“你亲亲我吧”和“不会伸一根手指头儿碰到她一片衣角”这也许是调情和深情的区别了。", "answer_votes": "163", "answer_comment": "​23 条评论"}
{"answer_author": "八尾先生", "answer_id": 142540876, "answer_text": "《神雕侠侣》李莫愁撞了个空，一个筋斗，骨碌碌的便从山坡上滚下，直跌入烈火之中。众人齐声惊叫，从山坡上望下去，只见她霎时间衣衫着火，红焰火舌，飞舞周身，但她站直了身子，竟是动也不动。众人无不骇然。小龙女想起师门之情，叫道：“师姐，快出来！”但李莫愁挺立在熊熊大火之中，竟是绝不理会。瞬息之间，火焰已将她全身裹住。突然火中传出一阵凄厉的歌声：“问世间，情是何物，直教生死相许？天南地北……”唱到这里，声若游丝，悄然而绝。", "answer_votes": "7", "answer_comment": "​4 条评论"}
{"answer_author": "刘海涵", "answer_id": 125879820, "answer_text": "韩小莹拉住郭靖的手，问道：“靖儿，她可是姓黄？”郭靖道：“是。”韩小莹一时茫然无言。柯镇恶喃喃的道：“你想娶梅超风的师妹？”朱聪问道：“她父亲将她许配给你么？”郭靖道：“我没见过她爹爹，也不知她爹爹是谁。”朱聪又问：“那么你们是私订终身的了？”郭靖不懂“私订终身”是甚么意思，睁大了眼不答。朱聪道：“你对她说过一定要娶她，她也说要嫁你，是不是？”郭靖道：“没说过。”顿了一顿，又道：“用不着说。我不能没有她，蓉儿也不能没有我。我们两个心里都知道的。”韩宝驹一生从未尝过滋味，听了这几句话怫然不悦，喝道：“那成甚么话？”韩小莹心中却想起了张阿生：“我们江南七怪之中，五哥的性子与靖儿最像，可是他一直在暗暗喜欢我，却从来只道配我不上，不敢稍露情意，怎似靖儿跟那黄家小姑娘一般，说甚么‘两个心里都知道，我不能没有她，她不能没有我’？要是我在他死前几个月让他知道，我其实也不能没有他，他一生也得有几个月真正的欢喜。”", "answer_votes": "24", "answer_comment": "​2 条评论"}
{"answer_author": "啊咧", "answer_id": 125630880, "answer_text": "《倚天屠龙记》去灵蛇岛的船上，赵敏咬了张无忌一口，然后偷偷涂上化腐消肌膏后赵敏道：“嗯，我问你：是我咬你这口深呢，还是你咬殷姑娘那口深？”张无忌脸上一红，道：“那……那是很久以前的事了，提它干么？”赵敏道：“我偏要提。我在问你，你别顾左右而言他。”张无忌道：“就算是我咬殷姑娘那口深。可是那时候她抓住了我，我当对武功不及她，怎么也摆脱不了，小孩子心中急起来，只好咬人。你又不是小孩子，我也没抓住你，要你到灵蛇岛来？”赵敏笑道：“这就奇了。当时她抓住了你，要你到灵蛇岛来，你死也不肯来。怎地现下人家没请你，你却又巴巴的跟了来？毕竟是人大心大，甚么也变了。”张无忌脸上又是一红，笑道：“这是你叫我来的！”赵敏听了这话，脸上也红了，心中感到一阵甜意。张无忌那句话似乎是说：“她叫我来，我死也不肯来。你叫我来，我便来了。”两人半晌不语，眼光一相对，急忙都避了开去。赵敏低下了头，轻声道：“好罢！我跟你说，当时你咬了殷姑娘一口，她隔了这么久，还是念念不忘于你，我听她说话的口气啊，只怕一辈子也忘不了。我也咬你一口，也要叫你一辈子也忘不了我。”张无忌听到这里，才明白她的深意，心中感动，却说不出话来。赵敏又道：“我瞧她手背上的伤痕，你这一口咬得很深，我想你咬得深，她也记得深。要是我也重重的咬你一口，却狠不了这个心；咬得轻了，只怕你将来忘了我。左思右想，只好先咬你一下，再涂‘去腐消肌散’，把那些牙齿印儿烂得深些。”张无忌先觉好笑，随即想到她此举虽然异想天开，终究是对自己一番深情，叹了口气，轻声道：“我不怪你。算是我狗咬吕洞宾，不识好人心。你待我如此，用不着这么，我也决不会忘。”赵敏本来柔情脉脉，一听此言，眼光中又露出狡狯顽皮之意，笑道：“你说：‘你待我如此’，是说我待你如此不好呢，还是如此好？张公子，我待你不好的事情很多，待你好的，却没一件。”张无忌道：“以后你多待我好一些，那就成了。”握住她左手放在口边，笑道：“我也来狠狠的咬上一口，教你一辈子也忘不了我。”赵敏突然一阵娇羞，甩脱了他手，奔出舱去……这段真的好甜啊啊啊啊啊每一句都是隐隐约约的表白表达出的心意却直接真挚朦朦胧胧纯情美好看的我都要和他们一起脸红了嘤嘤嘤", "answer_votes": "55", "answer_comment": "​10 条评论"}
{"answer_author": "桃谷六仙也没有我仙", "answer_id": 133738400, "answer_text": " “盈盈，救出恒山门人之后，我和你立即拜堂成亲，也不必理会甚么父母之命，媒妁之言。我和你退出武林，封剑隐居，从此不问外事，专生儿子。”", "answer_votes": "13", "answer_comment": "​3 条评论"}
{"answer_author": "小钱", "answer_id": 125694991, "answer_text": "殷离说，你咬了我一口，我一辈子也忘不了你。“我说，当时我苦劝他来灵蛇岛，他非但不听，反而咬了我一口。我手背上齿痕犹在，决非假话。我……我好生记挂他。”赵敏说，我也咬你一口，让你一辈子忘不了我。“好罢！我跟你说，当时你咬了殷姑娘一口，她隔了这么久，还是念念不忘于你，我听她说话的口气啊，只怕一辈子也忘不了。我也咬你一口，也要叫你一辈子也忘不了我。”张无忌听到二女所说，悄悄地摸了摸手臂，上面有几个齿痕，那是朱九真的狗留下的。又过一月有余，他的臂骨已接续如旧，被群犬咬伤之处也已痊愈，但臂上腿上却已留下了几个无法消除的齿痕疤印，每当想起这是为小姐爱犬所伤，心中反有甜丝丝之感。", "answer_votes": "42", "answer_comment": "​31 条评论"}
{"answer_author": "遥遥头", "answer_id": 125415959, "answer_text": "“汉人是人，契丹人也是人，又有什么贵贱之分，我..喜欢做契丹人，这是真心真意的话，半点也不勉强。”“便跟着你杀人放火，打家劫舍，也永不后悔，跟着你吃尽千般苦楚，万种熬煎，也是欢欢喜喜。”“有一个人敬重你、钦佩你、感激你，愿意永永远远、生生世世、陪在你身边，和你一起抵受患难屈辱，艰险困苦。”世间女子有绝色的，有贤淑的，但只有你在我落魄时给了我最为珍贵的理解和陪伴。他们之间的从来都不仅仅是因为英雄落难时机正好，是因为阿朱真真切切理解并且懂得萧峰的骄傲。这并不容易，也绝不是随便一个女子易地而处就能做到的。所以“阿朱就是阿朱，四海列国，千秋万载，就只一个阿朱。岂是一千个、一万个汉人美女所能代替得了的” ", "answer_votes": "297", "answer_comment": "​36 条评论"}
{"answer_author": "Hunter", "answer_id": 126122188, "answer_text": "在倚天里面，灵蛇岛上遇波斯明教三使，张无忌初逢圣火令武功，与之比拼僵持不下，约定同时撤回内力后退却还是遭遇暗算。赵敏为救张无忌，从暗处掠出，拿过无忌腰间倚天剑连使两招，是昆仑派的玉碎昆岗，崆峒派的人鬼同途，此两招皆有同归于尽之意，后想使出武当之天地同寿，从小腹穿过与后人同归于尽 ，被张无忌阻止。之后，几人得以平安，谢逊叹道:“你出全力相救无忌，当然很好，可是怎么连自己的命也不要了？”赵敏道:“他……他……”说到此处，顿了一顿，心中迟疑下面这句话是否该说，终于忍不住哽咽道:“他……谁叫他这般情致缠绵地……抱着……抱着殷姑娘。我是不想活了！”说完这句话，已泪如雨下。张无忌听了赵敏这句话，不由得心神激荡:“赵姑娘本是我竟一往情深如此。”情不自禁，伸过手去握住了她手，嘴唇凑到她耳边，低声道:“我对你才情致缠绵，你以后无论如何不可再这样了。”本来为救张无忌，赵敏已存死心，得救是赵敏未料到的事情。死而逃生，已属庆幸，又能得意中人如此表白之语，我觉得这才是最撩人的情话。", "answer_votes": "24", "answer_comment": "​4 条评论"}
{"answer_author": "孤独患者小小白", "answer_id": 177180291, "answer_text": "天龙八部“杏子林中尚略平生义”一章，乔峰契丹人身份要被揭开，三十年前的雁门关一役往事要被掀开，丐帮、西夏、燕子坞等多股势力聚集，险象环生，疑窦丛生，就在读者恨不得赶紧读到下一段时，金庸老爷子却费笔墨写了一段老年人的三角恋。谭公谭婆老夫妻登场，原著里写了“两人都是六十多岁的年纪”，然后赵钱孙来了，双目凝视谭婆，神色间关切无限，柔声问道：“小娟，近来过得快活么？”接着人人敬仰的泰山“铁面判官”单正来了，赵钱孙却一直不买人家账，频繁在口头上挤兑单正，还出言伤人，人家忍无可忍问他为啥，赵钱孙居然说：“你没得罪我，可是得罪了小娟，这比得罪我更加可恶十倍。” 而生气的原因很简单，就是他问小娟：“你近来过得快活么？”尚未答话，被单正的五个儿子打断了，就这么简单。他还当着人家丈夫面前宣示主权：小娟是她的闺名，天下除我之外，谁也称呼不得！接下来，当着众人的面，赵钱孙说：“你丢下了我，去嫁了这老不死的谭公，我心中如何不悲，如何不痛？我心也碎了，肠也断了，这区区外表的脸皮，要来何用？”", "answer_votes": "4", "answer_comment": "​添加评论"}
{"answer_author": "梵兔", "answer_id": 133666883, "answer_text": "不管是调情还是情话，印象最深的跟题主一样，首当其冲的就是wuli冲哥啊！不是我说，冲哥真是金书第一调情高手，因为他的情话具有认主技能，一般只对任大小姐一个人使用，所以兼具了调情+专情，是真·情话而不是类似杨过韦小宝那样的到处撩的感觉的。具体如下：1、那姑娘笑道：“我声音又粗糙，又嘶嘎，就像是乌鸦一般，难怪你当我是个老太婆。”令狐冲道：“你的声音像乌鸦？唉，时世不大同 了，今日世上的乌鸦，原来叫声比黄莺儿还好听。”那姑娘听他称赞自己，脸上一红，心中大乐，笑道：“好啦，令狐公公，令狐爷爷。你叫了我这么久婆婆，我也 叫还你几声。这可不吃亏、不生气了罢？”令狐冲笑道：“你是婆婆，我是公公，咱两个公公婆婆，岂不是……”那姑娘道：“咱们这样子……这样子……成甚么样子？”令狐冲笑道：“公公婆婆，那便是这个样子了。”【冲哥对盈盈第一撩，注意冲哥的撩是有前提的，前提即【盈盈并没有反对他的撩】，不仅不反对，还娇羞地接受了，对于冲哥来说，这无疑是一个很好的信号，他才能够继续撩下去。须知令狐冲屡屡撩盈盈，前提便是“一个愿打，一个愿挨”，盈盈即害羞又傲娇，明明心里很喜欢他的调情，但是又总是一副“你这个人呀讨厌死了”的模样，才是冲哥撩盈盈的趣味所在。】2、令狐冲低下头来，见到她娇羞之态，娇美不可方物，心中一荡，便凑过去在她脸颊上吻了一下。那姑娘吃了一惊，突然生出一股力气，反过手来，拍的一声，在 令狐冲脸上重重打了个巴掌。（盈盈））柔声问道：“你……你胸口很痛，是不 是？”令狐冲道：“胸口倒不痛，另一处却痛得厉害。”那姑娘问道：“甚么地方很痛？”语气甚是关怀。令狐冲抚着刚才被她打过的脸颊，道：“这里。”那姑娘 微微一笑，道：“你要我赔不是，我就向你赔个不是好了。”令狐冲道：“是我不好，婆婆，你别见怪。”那姑娘听他又叫自己“婆婆”，忍不住格格娇笑。【调情的最高境界就是情不自禁，谁说冲哥不喜欢盈盈，这明显的一见钟情而不自知。】3、令狐冲道：“我抬起头来看天，看天上少了哪一颗星，便知姑娘是甚么星宿下凡了。姑娘生得像天仙一般，凡间哪有这样的人物。”那姑娘脸上一 红，“呸”的一声，心中却十分喜欢，低声道：“又来胡说八道了。”这时她已将枯枝生了火，把洗剥了的青蛙串在一根树枝之上，在火堆上烧烤，蛙油落在火堆之 中，发出嗤嗤之声，香气一阵阵的冒出。她望着火堆中冒起的青烟，轻轻的道：“我叫做‘盈盈’。说给你听了，也不知你以后会不会记得。”令狐冲道：“盈盈， 这名字好听得很哪。我要是早知道你叫作盈盈，便决不会叫你婆婆了。”盈盈道：“为甚么？”令狐冲道：“盈盈二字，明明是个小姑娘的名字，自然不是老婆 婆。”盈盈笑道：“我将来真的成为老婆婆，又不会改名，仍旧叫作盈盈。”【众位男士，看到没看到没，教科书式的撩妹方法，别说盈盈之前就已经芳心暗许了，这就算是第一次见面，也必然要沦陷啊！】4、令狐冲伸了伸舌头，说道：“这个也不许，那个也不许，将来谁做了你的……”说到这里，见她沉下脸来，当即住口。盈盈哼的一声。令狐冲道：“你为甚么生 气？我说将来谁做了你的徒弟，可有得苦头吃了。”他本来想说“丈夫”，但一见情势不对，忙改说“徒弟”。盈盈自然知道原意，说道：“你这人既不正经，又不 老实，三句话中，倒有两句颠三倒四。我……我不会强要人家怎么样，人家爱听我的话就听，不爱听呢，也由得他。”令狐冲笑道：“我爱听你的话。”冲【哥话中之意便是“我愿意做你的丈夫”但是也不点破，but就凭女孩子的七窍玲珑心，还会听不懂？其实很多女孩子胡闹刁钻都是因为男朋友不听自己的话，没有安全感，一句“我爱听你的话”其实胜过千言万语】5、盈盈微微一笑，道：“人家说你是个浮滑无行的浪子，果然说话这般油腔滑调，没点正经。也不知是甚么缘份，我就是……就是喜欢了你这个轻薄浪子。”令狐冲笑道：“我几时对你轻薄过了？你这么说我，我可要对你轻薄了。”说着坐起身来。盈盈双足一点，身子弹出数尺，沉着脸道：“我心中对你好，咱们可得规规矩矩的。你若当我是个水性女子，可以随便欺我，那可看错人了。”令狐冲一本正经的道：“我怎敢当你是水性女子？你是一位年高德劭、不许我回头瞧一眼的婆婆。”盈盈噗哧一笑，想起初识令狐冲之时，他一直叫自己为“婆婆”，神态恭谨之极，不由得笑靥如花，坐了下来，却和令狐冲隔着有三四尺远。令狐冲笑道：“你不许我对你轻薄，今后我仍是一直叫你婆婆好啦。”盈盈笑道：“好啊，乖孙子。”令狐冲道：“我叫你作婆婆之时，可曾油嘴滑舌吗？”盈盈道：“那你一辈子叫我作婆婆好了。”令狐冲道：“我要叫你一辈子，只不过不是叫婆婆。”盈盈脸上浮起红云，心下甚甜，低声道：“只盼你这句话，不是油嘴滑舌才好。”令狐冲道：“你怕我油嘴滑舌，这一辈子你给我煮饭，菜里不放猪油豆油。”盈盈微笑道：“我可不会煮饭，连烤青蛙也烤焦了。”令狐冲想起那日二人在荒郊溪畔烤蛙，只觉此时此刻，又回到了当日的情景，心中满是缠绵之意。【正经地说调笑的话，又是只有两个人才懂的梗，属于小情侣之间特有的情趣。此时“婆婆”这个称呼对于冲盈来说，跟现在小情侣互相叫“猪”“笨蛋”没什么区别。另外，冲盈二人的调情一直很自然，是因为冲哥抛出去的梗，盈盈都能恰好接上。有时冲哥调戏盈盈，是因为看见盈盈害羞的心动，有时候又是冲哥故意开的玩笑，盈盈也会反过来打趣他。笑傲江湖以“琴瑟和谐”来比喻冲盈之恋，是很恰当的。】6、盈盈侧头向令狐冲瞧去，见他脸孕笑容，甚是喜悦，低声问：“你说这里好不好？”令狐冲微笑道：“咱们把东方不败赶跑后，我和你在这里住上几个月，你教我弹琴，那才叫快活呢。”盈盈道：“你这话可不是骗我？”令狐冲道：“就怕我学不会，婆婆可别见怪。”盈盈嗤的一声，笑了出来。【再次证明冲哥调情的前提——与盈盈的心心相印。两个人看到了东方不败居住的美景，同时想到了这里很适合日后隐居，不需要别的言语，两句话便敲定此事，就好像他们之前已经商量过很多次“哎呀我们以后可一定要选一个好地方隐居呐，那里的风景一定要怎么样怎么样怎么样”。另外，婆婆梗再次出现~冲盈的结合在我看来其实是必然的，因为在当时那个纷扰的江湖上，只有他懂她，也只有她懂他，因为他们所追求的自由、超然世外、无为，都是一样一样的。】7、盈盈道：“你怎地不设法前去相救？”令狐冲又叹了口气，道：“听林师弟的语气，对我颇有疑忌之心。我虽好意援手，只怕更伤了 他夫妻间的和气。”盈盈道：“这是其一。你心中另有顾虑，生怕令我不快，是不是？”令狐冲点了点头，伸出手去握住她左手，只觉她手掌甚凉，柔声道：“盈 盈，在这世上，我只有你一人，倘若你我之间也生了甚么嫌隙，那做人还有甚么意味？”盈盈缓缓将头倚了过去，靠在他肩头上，说道：“你心中既这样想，你我之 间，又怎会生甚么嫌隙？事不宜迟，咱们就追赶前去，别要为了避甚么嫌疑，致贻终生之恨。”【这是真正意义上的情话了，出自内心，真挚无比。冲盈二人这一段话也最让我感动，知己+爱人，这才是爱情最圆满的样子。】8、盈盈轻声问道：“冲哥，你睡着了吗？”令狐冲道：“我睡着了，我正在做梦。”盈盈道：“你在做甚么梦？”令狐冲道：“我梦见带了一大块牛肉，摸到黑木崖上，去喂你家的狗。”盈盈笑道：“你人不正经，做的梦也不正经。”两人并肩坐在车中，望着湖水。令狐冲伸过右手，按在盈盈左手的手背上。盈盈的手微微一颤，却不缩回。令狐冲心想：“若得永远如此，不再见到武林中的腥风血雨，便是叫我做神仙，也没这般快活。”盈盈道：“你在想甚么？”令狐冲将适才心中所想说了出来。盈盈反转左手，握住了他右手，说道：“冲哥，我真是快活。”令狐冲道：“我也是一样。”【题主提到的，这一段也当真是经典。冲哥言下之意就是：我梦到我去你的闺房里和你做不可描述之事了~（哎呦喂）而且和婆婆梗一样，这个梗又是只有两个人知道，冲哥拐着弯说出来调戏盈盈的，并且冲哥其实是没有睡着的，也就是说这个“梦”并不是冲哥做的，而是冲哥现在正想的。脑补一下冲哥脑内，maybe刚听盈盈说完带肉喂狗的故事，马上就开始脑补自己是如何带肉摸到黑木崖，跟盈盈嘿嘿嘿了……（捂脸，好羞羞）单身狗表示受到了一万点伤害。】9、令狐冲道：“你这般花容月貌，不论如何改扮，总是惊世骇俗。旁人一见，心下暗暗喝采：‘嘿，好一个美貌乡下大姑娘，怎地跟着这一个傻不楞登的臭小子，岂不是一朵鲜花插在牛粪上了？’待得仔细多看上几眼，不免认出这朵鲜花原来是日月神教的任大小姐，这堆牛粪呢，自然是大蒙任小姐垂青的令狐冲了。”盈盈笑道：“阁下大可不用如此谦虚。”【冲哥日常调戏，只是这次调戏还自夸了一下，也是萌cry】10、令狐冲哈 哈大笑，可是没能笑出声来，但见盈盈笑得更加欢喜了，忽见她眼珠转了几转，露出狡狯的神色，左眼眨了一下，又眨一下。令狐冲未明她的用意，只见她左眼又是 眨了两下，心想：“连眨两下，那是甚么意思？啊，是了，她在笑我要娶两个老婆。”当即左眼眨了一下，收起笑容，脸上神色甚是严肃，意思说：“只娶你一个， 决无二心。”盈盈微微摇头，左眼又眨了两下，意思似是说：“娶两个就两个好了！”令狐冲又摇了摇头，左眼眨了一眨。他想将头摇得大力些，以示坚决，只是周 身穴道被点得太多，难以出力，脸上神气，却是诚挚之极。盈盈微微点头，眼光又转到剃刀上去，再缓缓摇了摇头。令狐冲双目凝视着她。盈盈的眼光慢慢移动，和 他相对。两人相隔丈许，四目交视，忽然间心意相通，实已不必再说一句话，反正于对方的情意全然明白。娶不娶仪琳无关紧要，是和尚是太监无关紧要。两人死也 好，活也好，既已有了两心如一的此刻，便已心满意足，眼前这一刻便是天长地久，纵然天崩地裂，这一刻也已拿不去、销不掉了。【这算情话嘛>< 】说句题外话。第一次看笑傲我十七岁，看完冲盈日常我数学课都没上好，满脑子都是冲哥撩盈盈时说的话……我想如果我遇上了一个像令狐冲这样会撩的，不，哪怕只有他的一半会撩，但凡他长得还算符合我的审美，我大约都会像盈盈一般沦陷的吧。对于女孩子来说，这些话真的是要人命啊。", "answer_votes": "104", "answer_comment": "​24 条评论"}
{"answer_author": "未知何处是潇湘", "answer_id": 126421984, "answer_text": "阿朱就是阿朱，四海列国，千秋万载，就只一个阿朱，岂是一千个，一万个汉人美女所能替代得了的？", "answer_votes": "8", "answer_comment": "​添加评论"}
{"answer_author": "周熙婷", "answer_id": 125617129, "answer_text": "萧峰虽是个粗豪汉子，但她这几句话中的含意，却也听得明明白白，她是说要和自己终身在塞外厮守，再也不回中原了。萧峰初时救她，只不过一时意气，待得她追到雁门关外，偕赴卫辉、泰安、天台，千里奔波，日夕相亲，才处处感到了她的温柔亲切，此刻更听到她直言吐露心事，不由得心意激荡，伸出粗大的手掌，握住了她小手，说道：「阿朱，你对我这麽好，不以我是契丹贱种而厌弃我麽？」阿朱道：「汉人是人，契丹人也是人，又有什麽贵贱之分？我……我喜欢做契丹人，这是真心诚意，半点也不勉强。」说到後来，声音有如蚊呜，细不可闻。萧峰大喜，突然抓住她腰，将她身子抛上半空，待她跌了下来，然後轻轻接住，放在地下，笑眯眯的向她瞧了一眼，大声道：「阿朱，你以後跟着我骑马打猎、牧牛放羊，是永不後悔的了？」阿朱正色道：「便跟着你杀人放火，打家劫舍，也永不後悔。跟着你吃尽千般苦楚，万种熬煎，也是欢欢喜喜。」萧峰大声道：「萧某得有今日，别说要我重当丐帮帮主，就是叫我做大宁皇帝，我也不干。阿朱，这就到信阳找马夫人去，她肯说也罢，不肯说也罢，这是咱们最後要找的一个人了。一句话问过，咱们便到塞外打猎放羊去也！」阿朱道：「萧大爷……」萧峰道：「从今而後，你别再叫我什麽大爷、二爷了，你叫我大哥！」阿朱满脸通红，低声道：「我怎麽配？」萧峰道：「你肯不肯叫？」阿朱微笑道：「千肯万肯，就是不敢。」萧峰笑道：「你姑且叫一声试试。」阿朱细声道：「大……大哥！」萧峰哈哈大笑，说道：「是了！从今而後，萧某不再是孤孤单单、给人轻蔑鄙视的胡虏贱种，这世上至少有一个人……有一个人……」一时不知如何说才是。阿朱接囗道：「有一个人敬重你、钦佩你、感激你、愿意永永远远、生生世世、陪在你身边，和你一同抵受患难屈辱、艰险困苦。」说得诚挚无比。", "answer_votes": "146", "answer_comment": "​22 条评论"}
{"answer_author": "西元", "answer_id": 126282570, "answer_text": "       不请自来。      “若是我萧峰一人，大理段家这龙潭虎穴那也闯了，生死危难，浑不放在心上。但现下有了小阿朱，我要照料陪你一辈子，萧峰的性命，那就贵重得很啦。”     ——摘自《天龙八部》第23章“塞上牛羊空许约”        当晚，无情的误解让萧峰亲手杀死了他一生中最爱的女人。        青石桥旁，晓镜湖畔，阿朱如花的笑靥在夜风中凋零，大雨滂沱，萧峰泪也滂沱。        片尾曲王菲《宽恕》里如是唱道:        “你给我保护，我给你祝福。         你英雄好汉，需要抱负。         可你欠我幸福，拿什么来弥补？         难道爱比恨更能宽恕？”         终究是塞上牛羊空许约。         总而言之，我觉得上述这是金庸小说里让人印象最深的情话。太悲情。", "answer_votes": "9", "answer_comment": "​添加评论"}
{"answer_author": "富一代杜小命儿", "answer_id": 125510474, "answer_text": "杨过待她走远，笑问：“倘若你是她，便嫁哪一个？”小龙女侧头想了一阵，道：“嫁你。”杨过笑道：“我不算。郭姑娘半点也不欢喜我。我说倘若你是她，二武兄弟之中你嫁哪一个？”小龙女“嗯”了一声，心中拿二武来相互比较，终于又道：“我还是嫁你。”杨过又是好笑，又是感激。", "answer_votes": "17", "answer_comment": "​3 条评论"}
{"answer_author": "鸡腿蒙面侠", "answer_id": 125486542, "answer_text": "调情:赵敏本来柔情脉脉，一听此言，眼光中又露出狡狯顽皮之意，笑道：“你说：‘你待我如此’，是说我待你如此不好呢，还是如此之好？张公子，我待你不好的事情很多，待你好的，却没一件。”张无忌道：“以后你多待我好一些，那就成了。”握住她左手放到口边，笑道：“我也来狠狠地咬上一口，叫你一辈子也忘不了我。”赵敏突然一阵娇羞，甩脱了他手，奔出舱去……张无忌表示，我撩起妹来，我自己都怕。情话:张无忌心想：“我日间只在厨房，料来也见不到寺中高手，晚上相机寻访义父下落，倒也方便。”但仍故意装着踌躇，待那引他入寺的僧人也从旁相劝，这才勉强答应，说道：“师父，最好你一个月给我六钱银子，我五钱银子给我妈，一钱银子给我媳妇买花布……”管香积厨的僧人呵呵笑道：“咱们一言为定，六钱就六钱。”虽然不是对对方说的，不过张同学应该是个疼爱人的人。", "answer_votes": "8", "answer_comment": "​6 条评论"}
{"answer_author": "匿名用户", "answer_id": 125484349, "answer_text": "你要是杀了周姑娘，杀了我手下任何一个亲近的兄弟，我便不再当你是朋友，我永远不跟你见面，便见了面也永不说话。---------------------这货撩妹于无形啊。", "answer_votes": "27", "answer_comment": "​21 条评论"}
{"answer_author": "今日污染", "answer_id": 125475584, "answer_text": "“师父对我恩重如山，弟子粉身难报，但是，但是，【蓉儿……蓉儿可不是小妖女，她是很好很好的姑娘……很好很好的……】”他心中有无数言辞要为黄蓉辩护，但话到口头，却除了说她“很好很好”之外，更无别语。&lt;img data-rawwidth=\"550\" data-rawheight=\"340\" src=\"https://pic4.zhimg.com/50/5678270dae20670e07fbfc70383933ce_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"550\" data-original=\"https://pic4.zhimg.com/5678270dae20670e07fbfc70383933ce_r.jpg\"&gt;", "answer_votes": "23", "answer_comment": "​添加评论"}
{"answer_author": "浪潮", "answer_id": 130284302, "answer_text": "这答案怎么能没有我神雕撩妹第一人过神？背景：杨过进了绝情谷，见了公孙绿萼。杨过不小心给情花刺了下，绿萼向杨过解释了情花的功效。杨过板着脸道：“我看错了也说不定。不过这谷中要太平无事，你原是笑不得的。”那女郎奇道：“为甚么？”杨过道：“古人说一笑倾人城，再笑倾人国，其实是写了个别字。这个别字非国土之国，该当是山谷之谷。”那女郎微微弯腰，笑道：“多谢你，别再逗我了，好不好？”杨过见她腰肢袅娜，上身微颤，心中不禁一动，岂知这一动心不打紧，手指尖上却又一阵剧痛。那女郎见他连连挥动手指，微感不快，嗔道：“我跟你说话儿，你却去思念你的意中人。”杨过道：“冤枉啊冤枉，我为你手指疼痛，你却来怪我。”那女郎满脸飞红，突然发足急奔。", "answer_votes": "10", "answer_comment": "​2 条评论"}
{"answer_author": "文若", "answer_id": 125612851, "answer_text": "【自来英雄难过美人关，英雄三招，当然敌不过美人三招】【闺房之乐，有甚于画眉者。你说给夫人画眉不是英雄？】【不相干，就算是龙，也有给人收伏得服服帖帖的时候。】撩的时候确实一幅老司机的风范，可惜光能说不能干，只撩有什么卵用？", "answer_votes": "4", "answer_comment": "​1 条评论"}
{"answer_author": "冰冰", "answer_id": 125430970, "answer_text": "阿绣越是哭泣，他越是心慌，只道：“到底为了什么事？你跟我说好不好？”阿绣抽抽噎噎的道：“都是……都是……你……你不好，你……你……还要问呢！”石破天大吃一惊，心想：“我什么事做错了？”他对这位温柔腼腆的阿绣十分敬重，她既说都是他不好，自然一定是他不好了，当下颤声道：“阿……阿绣姑娘，请你跟我说，我是个蠢人，自己做错了事也不知道，当真该死。”阿绣泪眼盈盈的回过头来，说道：“昨儿晚上我做了个梦，吓人得很，你……你……你对我这么凶！”说到这里，眼泪又似珍珠断线般流将下来。石破天奇道：“我对你很凶？”阿绣道：“是啊，我梦见你使金乌刀法第七十三招，从半空中一刀劈将下来，将我杀了。”石破天一怔，伸拳在自己胸口重重捶了两下，道：“该死，该死！我在梦中吓着了你。”阿绣破涕为笑，说道：“史大哥，那是我自己做梦，原怪不得你。”石破天见她白玉般的脸颊上兀自留着几滴泪水，但笑魇生春，说不出的娇美动人，不由得痴痴的看得呆了。阿绣面上一红，身子微颤，那几颗泪水便滚了下来，说道：“我做的梦，常常是很准的，因此我害怕将来总有一日，你真的会使这一招将我杀了。”石破天连连摇头，道：“不会的，不会的，我说什么也不会杀你，别说我决不会杀你，就是你要杀我，我……我也不还手。”阿绣奇道：“倘若我要杀你，你为什么不还手？”石破天伸手搔了搔头，傻笑道：“我觉得……我觉得不论你要我做什么事，我总会依顺你，听你的话。你真要杀我，我倘若不给你杀，你就不快活了，那还是让你杀了的好。”阿绣怔怔的听着，只觉他这几句话诚挚无比，确是出于肺腑，不由得心中感激，眼眶儿又是红了，道：“你……你为什么对我这么好？”石破天道：“只要你快活，我就说不出的喜欢。阿绣姑娘，我……我真想天天这样瞧着你。”他说这几句话时，只是心中这么想，嘴里就说了出来。阿绣年纪虽比他小着几岁，于人情世故却不知比他多懂了多少，一听之下，就知他是在表示情意，要和自己终身厮守，结成眷属，不禁满脸含羞，连头颈中也红了，慢慢把头低了下去。", "answer_votes": "15", "answer_comment": "​9 条评论"}
{"answer_author": "jj cao", "answer_id": 126070562, "answer_text": "却听得小龙女问道：“过儿，这几天来你好吗？”问到这句话时，关切之情溢于言表。杨过听到这温柔语意，见到这爱怜神色，便是天塌下来也不顾了，那□还想到甚么逃走？说道：“姑姑，你不恼我了？”    小龙女淡淡一笑，道：“我怎么会恼你？我从来没恼过你。你转过了身子。”杨过依言转身，只是不明她的用意。    小龙女从怀□取出一个小针线包儿，在针上穿了线，比量了一下他背心衣衫上给樊一翁抓出的破孔，叹道：“这些日子我老在打算给你缝件新袍子，但想今后永不再见你面了，缝了又有甚么用？唉，想不到你真会寻到这□来。”说话间凄伤神色转为欢愉，拿小剪刀在自己衣角上剪下一块白布，慢慢的替他缝补。    当二人同在古墓之时，杨过衣服破了，小龙女就这么将他拉在身边，替他缝补，这些年来也不知有过多少次。此时二人都已将生死置之度外，当真是旁若无人，大厅上虽是众目睽睽，两人就似是在古墓中相依为命之时一般无异。    杨过欢喜无限，热泪夺眶而出，哽咽道：“姑姑，适才我激得你呕了血，我……我真是不好。”小龙女微微一笑，道：“那不关你的事。你知道我早有这个病根子。没见你几日，你功夫进步得好快。你刚才也呕了血，可没事吗？”杨过笑道：“那不打紧。我肚子□的血多得很。”小龙女微笑道：“你就爱这么胡说八道。”", "answer_votes": "6", "answer_comment": "​添加评论"}
