{"question_id": "54003912", "question_text": "纵观知乎，很多人都在做机器学习的相关研究，请问现在机器学习领域是否饱和了呢？以及市场上真的需要如此多的机器学习的人才？机器学习未来是否会成为第二个泡沫？", "question_title": "机器学习领域是否已经达到饱和？", "question_commet": "​12 条评论", "answer_number": "100 个回答", "question_followers": "2,526", "brower_number": "487,505"}
{"answer_author": "Jacky Yang", "answer_id": 261459354, "answer_text": "这个话题很有意思，我想从个人和公司两个方面谈点自己粗浅的感受。先说个人:机器学习人才大致可以分为两类:一类是研究型人才，侧重在发明算法; 另一类为应用型人才，着重于使用算法。研究型人才自不必说，这个领域的很多博士被疯抢，就能看出端倪，至少远没有到饱和的地步。其实不止机器学习，任何领域的创新型人才，恐怕都是很抢手的。绝大部分人恐怕属于应用型人才，当然，这里应用其实就是指垂直领域的综合性应用，而不是mnist这类samples。如果只是调用机器学习的包(比如sklearn)做一些简单的例子; 或者在caffe或tensorflow跑几个例子，设计(修改)一下网络，调整一下超参数，拿数据训练及测试一下，这类人才将来肯定会饱和的。工作量不大，又没有太多创新的话，可替代性就高了。那么哪种人才不容易被淘汰呢？以我个人的经验看，大致有这么三种:1.一种是具有一定的机器学习基础，又对某个领域具有深刻认识的人才。这类人在某个行业扎根很深很久，熟知其痛点和需求，尤其清楚有哪些坑。既可以在公司里做产品经理，时机成熟也可以创业，可谓进可攻退可守。2.另一种是技术基础扎实，学习能力强，具有一定的理论基础。尤其是算法实现能力强，甚至可以对框架进行优化，而且速度快的人，老板最喜欢了。你可以打听一下，有多少公司在讨(zhuang)论(bi)AI，但就是不知道怎么做。数一数，恐怕有一大堆吧。3.第三种是产品开发型人才，这类人可能不一定很懂算法，但很清楚怎么做机器学习应用，怎么把产品做到极致，好用。比如人脸识别系统，算法只是一小部分，更重要的是整个系统架构，做一个demo当然容易，但一个端到端的人脸识别系统包括视频采集，解码，人脸检测，特征提取与人脸数据库(检索)，业务逻辑，联动报警，分布式多级部署等等。以上第一类人才侧重于\"我们要做什么，哪个方向\"，第二类人才侧重于\"怎么做\"，第三类人才负责\"怎么把产品做好\"。再谈公司:一个公司从立项到交付，也需要这三类人的通力协作: 第一类人协助管理层做决策，比如，根据多年的金融领域经验，决定做一套股市分析预测系统，第二类人赶紧跟上，先研究国内外有没有相关的论文和研究成果，包括开源实现，然后快速实现一个原型，至少验证技术大致可行性，后期慢慢优化，这一步过了之后第三类人出场，做一套完整的股票分析预测系统……机器学习在垂直领域里的需求非常多，如果能把需求跟技术很好地结合，个人感觉，对企业来说，很长一段时间里都不会饱和。机器学习只是工具，解决问题才是最终目的。机器学习也需要跨界。举个例子，机器学习与IOT结合就会产生很多的应用。比如:通过设备运行数据，预测其故障可能性，使用寿命。最近参加了日本最大的AI和IOT展，感触很深。一方面，各行各业对机器学习的需求非常旺盛，里三层外三层，简直围的水泄不通，另一方面，脚踏实地才能保持企业甚至整个产业链的健康持续发展。另外，日本这些企业生意是真的很好，我很嫉妒。最后上图，顺便发福利:&lt;img src=\"https://pic4.zhimg.com/50/v2-abeacace80fd0ae00137fa60e059d707_hd.jpg\" data-rawwidth=\"2048\" data-rawheight=\"1536\" class=\"origin_image zh-lightbox-thumb\" width=\"2048\" data-original=\"https://pic4.zhimg.com/v2-abeacace80fd0ae00137fa60e059d707_r.jpg\"&gt;&lt;img src=\"https://pic4.zhimg.com/50/v2-5c378334017253b3f336fdc5e52931e8_hd.jpg\" data-rawwidth=\"2048\" data-rawheight=\"1536\" class=\"origin_image zh-lightbox-thumb\" width=\"2048\" data-original=\"https://pic4.zhimg.com/v2-5c378334017253b3f336fdc5e52931e8_r.jpg\"&gt;&lt;img src=\"https://pic3.zhimg.com/50/v2-fcd4e9f9ec070fd35ecefbac145d2a43_hd.jpg\" data-rawwidth=\"2048\" data-rawheight=\"1536\" class=\"origin_image zh-lightbox-thumb\" width=\"2048\" data-original=\"https://pic3.zhimg.com/v2-fcd4e9f9ec070fd35ecefbac145d2a43_r.jpg\"&gt;什么？AI用于\"接客\"，还省力？哦，日语里接客就是迎宾的意思，比如下图这位花姑娘，就在\"接客\":&lt;img src=\"https://pic3.zhimg.com/50/v2-d2590a865fedf99ff2e9ee2691a829e7_hd.jpg\" data-rawwidth=\"1536\" data-rawheight=\"2048\" class=\"origin_image zh-lightbox-thumb\" width=\"1536\" data-original=\"https://pic3.zhimg.com/v2-d2590a865fedf99ff2e9ee2691a829e7_r.jpg\"&gt;", "answer_votes": "348", "answer_comment": "​38 条评论"}
{"answer_author": "立党", "answer_id": 244241414, "answer_text": "处于一个直接用框架甚至抄代码的太多，正经做research的还不够的地步。当然最多的不是用框架的，而是人工智能分析师，这种人主要属于一行代码都没写过，就开始为人工智能乃至人类社会规划未来百年蓝图的那群理论家、思想家、战略家们。他们主要的活动场所，是知乎、微信公众号、幼儿科幻级电视节目，以及各种微信讨论组。保守估计，这批人目前的数量，跟西藏被遗弃的藏獒数量差不多。", "answer_votes": "128", "answer_comment": "​18 条评论"}
{"answer_author": "misa shen", "answer_id": 244552342, "answer_text": "我大舅90年从北大毕业到美国罗德岛读博，读一半从气象转行程序员，他说从他那个时候开始，留学生就开始为了工作转行程序员了。（大家对那个年代的留学生所知甚少，一是经济原因，二是教育问题。我大舅北大研究生毕业后写了一千多封信，找了一年才找到一个愿意全额奖学金收他的老师）来张89年的GRE考试单，报名费15元哈哈哈：（在我家珍藏多年）<img data-rawheight=\"1280\" src=\"https://pic4.zhimg.com/50/v2-a4e6e46269210a25d6de4488242a4ddc_hd.jpg\" data-rawwidth=\"956\" class=\"origin_image zh-lightbox-thumb\" width=\"956\" data-original=\"https://pic4.zhimg.com/v2-a4e6e46269210a25d6de4488242a4ddc_r.jpg\">他儿子，我表弟，大学依然依家里意思学习计算机。而从我小时候开始，我就听过“美国最火的专业是金融和计算机”，当时我还想着，那等我长大了，计算机和金融就该过时了吧。于是大学很傻逼的学了个材料。出国以后发现，现在的就业形式跟我大舅三十年前来美国根本没有区别。计算机和金融依然是最火的专业。几十年了，计算机依然是“新兴产业”。但是呢，“程序员行业已经饱和”这句话从小听到大，这个话题从知乎诞生一直到现在。我并不是非常了解机器学习，但个人观点是：任何具有重大意义的新兴行业，发展起来都是曲折漫长的，饱和与否只跟需求有关，跟热度无关。机器学习试图用电脑代替人脑思考学习，意义重大，绝对不是时代的一个小浪花而已。如果刚冒出来个新行业就说饱和，只能说你太高看人类发展速度了。一个小小专业的发展速度，在社会发展的洪流当中，在历史的进程面前，真的不值一提。结尾再来点有历史价值的照片：（跟答案无关啊，就是晒一晒）托福的备战书：<img data-rawheight=\"640\" src=\"https://pic4.zhimg.com/50/v2-aa988670f137f1fdcba917dd04ce86c7_hd.jpg\" data-rawwidth=\"1135\" class=\"origin_image zh-lightbox-thumb\" width=\"1135\" data-original=\"https://pic4.zhimg.com/v2-aa988670f137f1fdcba917dd04ce86c7_r.jpg\">价格亮了<img data-rawheight=\"640\" src=\"https://pic3.zhimg.com/50/v2-2df3f94af2ab00b18e61361528f95e4d_hd.jpg\" data-rawwidth=\"1135\" class=\"origin_image zh-lightbox-thumb\" width=\"1135\" data-original=\"https://pic3.zhimg.com/v2-2df3f94af2ab00b18e61361528f95e4d_r.jpg\">内容：<img data-rawheight=\"640\" src=\"https://pic4.zhimg.com/50/v2-e0abd1bfb7a78a55774adac374d4a224_hd.jpg\" data-rawwidth=\"1135\" class=\"origin_image zh-lightbox-thumb\" width=\"1135\" data-original=\"https://pic4.zhimg.com/v2-e0abd1bfb7a78a55774adac374d4a224_r.jpg\">我们家最悠久的传说是什么呢，就是我大舅为了托福考出好成绩，拿词典背单词，背到二十多遍的时候背一页撕一页，最后撕了整个英汉字典。发个在我大舅家吃饭的照片~（左我男票，中间我大舅，右边我爸）<img data-rawheight=\"1280\" src=\"https://pic3.zhimg.com/50/v2-1b1e51147d3eacfe7493a7f162ebc577_hd.jpg\" data-rawwidth=\"1707\" class=\"origin_image zh-lightbox-thumb\" width=\"1707\" data-original=\"https://pic3.zhimg.com/v2-1b1e51147d3eacfe7493a7f162ebc577_r.jpg\">波士顿程序员的幸福生活：<img data-rawheight=\"1080\" src=\"https://pic3.zhimg.com/50/v2-3d0a0b2a4046e544ae52be56b38ab201_hd.jpg\" data-rawwidth=\"1616\" class=\"origin_image zh-lightbox-thumb\" width=\"1616\" data-original=\"https://pic3.zhimg.com/v2-3d0a0b2a4046e544ae52be56b38ab201_r.jpg\">", "answer_votes": "524", "answer_comment": "​126 条评论"}
{"answer_author": "霍华德", "answer_id": 201701516, "answer_text": "少年 你对饱和一无所知我本科金属材料➕机械 冶金这行当诞生恐怕两三千年了 从青铜器到铁器 再到钢铁 工业革命之后 炼钢炼铁也有两百年了 我说我们用的最多的铸铁 已经用一百多年了 而且没有根本的改进 你敢信？每年十多万材料冶金毕业生，积压几十年了，这才叫饱和～机械这行当从蒸汽机开始，也两百年了，汽车用的内燃机也发明快一百年了，我说内燃机的效率这一百年提高不超过70%，你敢信？每年十几万机械毕业生，积压几十年了，这才叫饱和～博士搞电子和微电子 电子这行当从真空电子管开始 差不多也一百年了 贝尔发明电话 摩托罗拉发明对讲机 MIT林肯实验室发明雷达 惠普兄弟发明微波测试技术 也差不多是第一次世界大战的事了，你敢信？每年十几万电子毕业生，积压几十年了，这才叫饱和～微电子就是半导体，我们现在的芯片都是得益于此，但PN结的发现已经是上世纪40年代的事情了，经过50年代的分立半导体晶体取代真空管，60年代集成电路的发展，70年代计算机体系结构和指令集的发展，但带领下芯片技术突飞猛进摩尔定律逐步失效，英特尔新一代芯片只比上一代快了5%，你说气不气？每年几万微电子毕业生，积压了十几年了，这才叫饱和～机器学习这套东西，2010年之前只有少数美国顶级高校的计算机专业在教，当时自动化学PID，统计系学假设检验，都不学机器学习，对口的人才很少，哪怕到今年也才刚刚创立大数据和人工智能专业，第一批毕业生要四年以后，教育的滞后造成了巨大的需求缺口。深度神经网络2006年提出，ALEXNET2012年提出，对抗生成网络2014年才提出，alpha狗的深度强化学习2016年才提出，重大突破都是近几年时间发生的，大量的知识还在论文上，都没有编辑成教材，你说这算饱和吗？现在绝对是进入机器学习的最佳时机。", "answer_votes": "804", "answer_comment": "​94 条评论"}
{"answer_author": "刘诗昆", "answer_id": 244592928, "answer_text": "机器学习并没有达到饱和，而真正达到饱和的是深度学习里多种模型的无意义的堆砌运用在一些稀奇古怪的应用而声称自己做出创新结果的文章。而这类文章命名为通常是deep-variational/adversarial-recurrent/convolutional-encoder-decoder- network/model 的笛卡尔乘积。然而由于这样低门槛的工作吸引并涌入了一大批研究者，所以导致一些简单的low hanging fruit 问题已经被摘完了。然而机器学习还有众多问题还没解决，比如continual learning, 模型可解释性，catastrophic forgetting，生成式模型等等。希望这样的现象也有利于加大对于真正硬骨头问题和有价值研究的投入吧。", "answer_votes": "107", "answer_comment": "​13 条评论"}
{"answer_author": "匿名用户", "answer_id": 245009924, "answer_text": "根本没饱和，是还没开始。机器学习和一般码农不一样，面试没有套路，不依赖刷题。不客气的说绝大多数声称要招机器学习人才的公司并不知道这个人招进来能做啥，能提供什么价值。所以自然就倾向于招有经验的，让这个人把需求发掘出来把架子搭起来，所以就望向了硕士博士，发过paper的，或者在大公司已经做过实际工程的。你说这个池子能有多大？另外，真正搞机器学习的，里子里一定是个合格能干的工程师，不然调参效率都上不去，更别说把模型带到生产环境中去了。这又要刷掉一批眼高手低的求职者。于是乎，现状是你发现大家都在找机器学习经验的人，似乎有巨大的泡沫，但是其实都是精确瞄准那一小撮，其他人根本是论外。这PhD的生产可没培训班那么效率，周期更是四五年去了，这不都把企业逼到美国来挖人了。所以不要担心饱和不饱和，而是担心自己功夫够不够硬。", "answer_votes": "72", "answer_comment": "​10 条评论"}
{"answer_author": "何波", "answer_id": 245297609, "answer_text": "我96年上大学的时候，我爸说现在学计算机是不是太热了，饱和了？", "answer_votes": "30", "answer_comment": "​13 条评论"}
{"answer_author": "Terence Zhu", "answer_id": 273369225, "answer_text": "有点想知道提问者这么问的意图是？如果真的对machine learning感兴趣那应该毫不犹豫去学和研究。根据我在MIT这两年的观察，只要自身做出的成果足够好，什么方向都会向你敞开大门。知乎学术相关的讨论现在颇有一种万般皆下品，唯有ML高的样子（不知道是不是因为我关注的话题的关系，欢迎指正）。不知道有没有哪位做queueing theory，scheduling theory的？EECS/OR相关的学者们应该都知道这是一个发展了很久，大家都觉得饱和的领域了。但是今年CMU的CS faculty recruiting ad上明确说了她们就是想要做queueing theory的人 （http://www.cs.cmu.edu/~harchol/facultyad.pdf）。隔壁lab一个小哥PhD期间埋头做queueing theory，产出了很多我看来是天书一般的结果，发了很多好paper。原本他的导师和同组学长都劝他说要做点别的，因为queueing theory太老了，找faculty很难找。现在呢？应该所有人都觉得CMU在向他招手了吧（反正我觉得他是真·天选之子XD）。这个故事就说明了一点，只要你好好做就永远都会有机会。", "answer_votes": "35", "answer_comment": "​17 条评论"}
{"answer_author": "Kenneth", "answer_id": 244840693, "answer_text": "这提问者要不是真蠢就是故意在黑。机器学习领域都还没正式开始呢，这头几十年顶多也就算个序章。饱和？那至少得等科幻电影不再拿人工智能当点子的时候才有丁点希望。——你看过科幻天体物理的，科幻心灵控制的。你看过科幻环卫工作的吗？你看过科幻公务员办公的吗？", "answer_votes": "21", "answer_comment": "​8 条评论"}
{"answer_author": "孤云独去闲", "answer_id": 201741449, "answer_text": "我觉得没饱和。我很同意@yycc的说法。特别靠谱又很懂原理的人不好找。我们有些遗留下来的老项目老代码，模型训练，预测之类的前人都已经写好了，但那些作者该跳槽也都跳走了。现如今如果新的数据集很稀疏，或者有更丰富的数据类型，或者客户提了更高级的要求，这时候就要拓展原来的老模型，对吧。这可不简单，需要对统计和优化有一定的理解，还要有行业知识，编程能力也不能差，还得心细。这种人一点也不好找，要不然怎么会有refer bonus这一说呢。", "answer_votes": "11", "answer_comment": "​8 条评论"}
{"answer_author": "微软亚洲研究院", "answer_id": 201662980, "answer_text": "机器学习是人工智能领域较为年轻的分支，相关学科建立、集成学习系统研究以及各种学习方法的实际运用，将机器学习领域带入新阶段。在过去的十多年里，我们见证了数据科学在学术界和商业界的发展，学会了如何正确地使用分布式计算、GPU，如何很快的建立抽象模型等等。人过智能仿佛完全转化成了机器学习，每个人都在处理数据、基于数据为复杂的世界建模。那么，机器学习领域是否已经达到饱和了呢？今天，我们想借用卡内基梅隆大学（CMU）计算机学院院长Andrew W. Moore和副院长Philip L. Lehman最近在微软亚洲研究院分享的相关观点，来回答这个问题。我们划定了一个具体的时间范围，探讨过去两年和未来两年机器学习的发展情况。————这里是正式回答的分割线————<img src=\"https://pic1.zhimg.com/50/v2-05cc6f5f9ffabee23b3e43b7ebdd1646_hd.jpg\" data-rawwidth=\"640\" data-rawheight=\"427\" class=\"origin_image zh-lightbox-thumb\" width=\"640\" data-original=\"https://pic1.zhimg.com/v2-05cc6f5f9ffabee23b3e43b7ebdd1646_r.jpg\">大约2014年，许多人开始意识到我们在机器学习领域所做的工作还远远不够，它们仅能实现改变世界蓝图的一半，而另一半则是被我们视为数据科学最顶层的决策系统。上世纪90年代，我们对所建立的系统都十分乐观。但渐渐地，我们发现，这些系统在应用到实际生活中时并没有效果，比如在优化城市交通数据时，一个完美的优化算法并没有帮助，因为那时我们没有任何关于城市交通的数据。所以现在，我们严肃认真地考虑重新回到基于数据科学的大规模优化和决策上。过去两年中，机器学习领域的最大变化对于许多大型搜索引擎公司来说，机器学习超过百分之五十的工作在于测试和验证。因此，我对未来稳定、可靠且经过长期验证的机器学习模型充满期待，以及如何确保深度学习算法不会在运行几个月后走向奇怪的方向。对于机器学习算法，会有工具帮助快速诊断目前正在发生什么以及如何解决。例如，你有一些系统问题导致了随机梯度下降的更新，并带来了额外的延迟等，而对于这些问题你都可以很快地理解，并改进。但在我的学术生涯中，还没有看到过类似的技术，所以我希望接下来的几年，我们的机器学习模型可以在稳定性、安全性和长时间的可靠性上有更大的突破。首先我想展示一下一位同事最近的研究成果。他研究的是针对如飞机和汽车动力系统的操纵系统前期和后期条件类型分析，这曾经被认为是最重要的证明软件正确性的方法之一。我的这位同事采用老式方法将系统与控制系统中的统计和数值方法结合，来证明如果有一个机器人控制算法，即使是一个非线性的算法，它也会按照所说的来做。现在，美国许多的自动驾驶系统研究在提高系统安全的问题上停滞不前，因此，这项工作将非常具有实用意义。在军事方面，使用自动驾驶技术可以避免很多不必要的牺牲，仅仅使用一辆车就可以带动其余的自动驾驶车辆。虽然听起来很简单，但这项应用实现的最大阻碍还是证明我们所使用的机器学习系统和这些自主驾驶场景的可靠性。所以，当我们在新的研究领域找寻策略时，自适应算法的安全性验证相比于增加现有算法速度的准确性，可能会更重要。我们还做了很多有趣的研究。如今，人类生物识别也已成为一个科学研究方向。与从演讲录音中提取演讲内容相反，我的一位同事，Rita尝试了从中提取其他的声音信号，进而得到关于演讲者的信息。我们可以从低分辨率的数据中准确的预测出人的气管形状和大小，同时，这些信息与人的身高、体重等其他身体特征也密切相关。简而言之，她可以在一场演讲录音中了解演讲者的身高、体重、成长地等等。这也是机器学习新应用的一个例子。此外，一个研究的重要领域是逆向强化学习（Inverse Reinforcement learning）。众所周知，在强化学习中，我们会定义一个奖励函数（reward function），然后尝试寻找最大化奖励函数长期结果的策略。而在逆向强化学习中，我们则是尝试根据其他个体选择的行为来推断它们的奖励函数。比如，根据车流和行人已有的移动轨迹我们可以预测每个人、每辆车的移动可能。所以，当我们把目光投向计算机视觉的未来时，实际上我们已经将重心从观测即时信息，转向了预测将来15秒的状态信息。这对于自动驾驶和人群的安全都将有重大意义。我们关注的另一个领域是，自主平台在机器人相关方面的成熟应用。预测空间的3D模型在机器人技术进步的基础上，也已经非常成熟了，而这也是将来机器人发展的基础。如果你熟悉这一成熟技术背后的计算模型，从获取数据到传送到云端，它使用了大量的EM 算法以加速前后的推理。而我的一位同事的研究突破在于使算法有了一个非常准确的增量，不再需要上传数据到云端。通过简洁的代数技巧（algebra trick），我们可以模拟整个EM算法的运行。更有意义的是，低功耗的远程设备就可以完成。接下来的两年内，机器学习领域可能会有的突破目前说机器学习领域已经饱和为时过早，我们还有很多有趣的方面没有探索。情绪压力测试是一个快速成长的领域，微软是这方面的专家。在匹兹堡，我们也对这一领域充满兴趣。这里有一个重要的应用，我们可以通过观察人们说话时的面部特征，评估他们对于某件事情情绪波动的程度。举个例子，当用于医疗时，我们可以通过观察病人的反应，判断治疗是否有效。一年前，我们曾有实验表明，在医生可以判断病人生理特征表现的六周前，我们就成功判断了治疗的效果，通过对面部肌肉的检测我们可以获得许多情绪信息。因此，未来我们或许可以更快捷、有效地帮助患有精神疾病的病人。同时，对于大家关注的用户和电脑间的对话系统，我们的两位同事发现，对于复杂对话，病人谈论到一些疾病症状，或者学习上有疑问想获得反馈的孩子们，机器能够对对话产生更快、更成功的结果，因为机器可以根据用户情绪调整反馈结果。所以，通过这些客观证据我们可以看出，如果想建立一个优秀的对话系统，则需要考虑到实际情绪的相互作用。现在在CMU，我们有计算机视觉实验室，有对于语言技术的研究，我相信在不久的将来，情绪认知也会是我们的研究重心。接下来，我想谈谈知识图谱。在美国，许多企业和大学包括微软，以及一些政府机构经过一系列的会议讨论一致认为，我们需要分享构建的大型知识图谱。因为对于对像阿里巴巴、亚马逊这样的零售公司来说，为各种产品构建单独的知识图谱是非常困难的，同样的，对于做地图的公司来说，为城市地标构建单独的知识图谱也非常困难。患者想要讨论医疗健康问题、学生想讨论关于学习的问题等等，在未来，商业领域之外的对话系统构建方面，我们还有很多工作可以做。医疗、教育、政府等，如果每个公司都单独构建知识图谱，那么这将消耗大量资金，同时，不同的语言也会带来很多不必要的资源浪费。因此，我们强烈认为，合作将是未来工作的基础，我们将一起构造开放的知识网络。首先，我们可以将各种实体作为知识图谱的节点，这些实体可以是埃菲尔铁塔、CMU音乐学院、甚至可以是一个投影仪等等。对于这些数以万亿的实体，目前我们有很多类型的实体工具，它们各有利弊。成本高、针对性强的图谱难以大范围应用，通用的图谱又过于耗时。例如GIS系统虽然已经很完善但仍难以应用到其他领域。所以，将来我们在构建和存储实体时，需要在数据库中为他们和其他实体建立对话联系。然后，我们要匹配引擎（matching engine）。这与搜索引擎非常相似，同样需要快速的深度学习能力。匹配引擎从演讲、文本、可视范围中选取内容，以构建知识图谱中实体的概率分布，这对于构建一个准确的匹配非常重要。所以，对基于知识图谱实现具体应用的人们来说，他们需要处理概率集合以形成总体结论。大家都知道，现在大部分的知识图谱是基于三元组的，三元组是一种原始的表达事实的方式。除了科学实验，它还出现在一些与科学相关的领域，如经济、金融等。专家们发现，因为缺乏统一的数据模式，即使有很好的数据集，它们还是很难在数据间建立连接。这也是我们希望通过构建全局知识图谱来帮助我们的地方。有趣的是，在构建全局知识图谱中，我们还有很多机器学习的问题需要解决，比如合并指向同一实体的不同对象或者区分相像但不同的对象等。虽然我们有很不错的概率模型，但是在公共领域之外，它们无法像成熟的算法一样处理数万亿的内容（mentions）以建造理想的对话系统。发现问题，解决问题，这是一件非常令人兴奋的事情。————这里是回答结束的分割线————以上回答摘选自微软研究院AI头条，讲堂|CMU计算机学院院长：未来24个月，机器学习领域将可能有哪些重大突破。 感谢大家的阅读。本账号为微软亚洲研究院的官方知乎账号。本账号立足于计算机领域，特别是人工智能相关的前沿研究，旨在为人工智能的相关研究提供范例，从专业的角度促进公众对人工智能的理解，并为研究人员提供讨论和参与的开放平台，从而共建计算机领域的未来。微软亚洲研究院的每一位专家都是我们的智囊团，你在这个账号可以阅读到来自计算机科学领域各个不同方向的专家们的见解。请大家不要吝惜手里的“邀请”，让我们在分享中共同进步。也欢迎大家关注我们的微博和微信 (ID:MSRAsia) 账号，了解更多我们研究。", "answer_votes": "234", "answer_comment": "​16 条评论"}
{"answer_author": "yycc", "answer_id": 137533685, "answer_text": "希望那些已经从业或者即将从事机器学习／深度学习的，应该意识到自己真正的竞争对手是两种人，一是入行早的，二是学艺精的，当然这两个都有前提，下面仔细说。对于入行早的，在一个机器学习还是比较陌生的领域，如果他们深入参与一些项目，那么拿到的一手经验其实是很难得的，如果加上时间的沉淀，那么这种人其实就是有经验的高级人才，坑都被挖了后给填了，留给后来的人更多的是修修补补了。对于学艺精的，当所有人都在谈机器学习／深度学习的时候，你就要谈得比别人深，比别人专，你的学历，你的技能，你付出的努力，都比大多数人好时，你就不用担心那么多人。很多人从事这一行，这样无形中拉高了从业的门槛，希望已从业的能踏实做，为后来的人积点福，而即将从事的能踏实学，为学弟学妹立标杆，最后说一句，未来缺的一直都是高级人才，饱和的是低端市场。", "answer_votes": "120", "answer_comment": "​5 条评论"}
{"answer_author": "张戎", "answer_id": 244162641, "answer_text": "说到机器学习方向饱和的人，可能是没见过一些基础学科的专业的饱和程度。之前在学校读书的时候，就听一些老师说过，最近放出来一个助理教授的职位，但是收到了200-300封简历，全部都是北美欧洲或者国内名校的PHD。之前听说在1980年的时候，数学PHD还不需要做posdoc就可以找到工作；到了1990年，基本上都要做一两年的posdoc才可以找到下家；到了00年以后，回国的话马上还能找到一个不错的职位，虽然工作不高，但是对论文的要求也没那么高；等到了2010年以后，国家千人计划等项目的开启，没有在国外混到一个好职位的，没有几篇好文章的，基本上在国内就没法找到教职了。等到了2020年以后，还真不知道是什么样的行情了，进入好学校的要求肯定是越来越高，要求的论文数量也是越来越多，质量也是越来越高了。现在国内这些大公司放出一个机器学习工程师的岗位，我想是不需要和300个PHD来PK这个岗位的（高端职位除外）。即使被这个组或者这个部门放弃了，换一个部门或者小组重新投一份简历就好了，实在不行可以换一个公司投简历。至于学校的话，就没那么多学校了，公司的数量远远大于学校的数量。退一步讲，公司总有那么多业务需要做的，无论是推荐业务，安全业务，还是运维业务。只要有业务，就需要有算法工程师去对接，就要做离线算法的优化，线上项目的对接等工作。如果是在公司里面做人工智能相关的工作，除了机器学习方向，还有自然语言处理，语音识别，图像处理等热门方向。即使是机器学习，做不同的业务线所使用的方法也是截然不同的。例如，虽然都是机器学习，但是推荐系统却不能够解决业务安全的事情，反过来，一个安全系统也不能够完成推荐系统的工作。综上所述，可以选择的方向和工作类型都是非常多的。因此，目前看上去其实还好，相比较于一些传统的基础学科方向，机器学习方向远远没有饱和。", "answer_votes": "167", "answer_comment": "​36 条评论"}
{"answer_author": "李文哲", "answer_id": 274374963, "answer_text": "在大数据时代，之前只有那些专业人员才会接触到的工具比如SQL已经逐渐成为每个岗位必备的技能； 目前来看，数据分析也有类似的趋势，不懂数据分析的产品经理、市场、运营、招聘、甚至CEO都很难再适应时代的发展；在人工智能时代，作为AI领域最基础的科学-机器学习，会离我们很遥远吗 ", "answer_votes": "7", "answer_comment": "​6 条评论"}
{"answer_author": "知乎用户", "answer_id": 261615853, "answer_text": "普通人对某个领域是否饱和的理解是：看一两本书，顶多考个证，就能找份不错的工作，这叫行业没饱和。不然行业就是饱和了。", "answer_votes": "1", "answer_comment": "​2 条评论"}
{"answer_author": "温酒", "answer_id": 262537756, "answer_text": "二十一世纪是机器学习的世纪……", "answer_votes": "38", "answer_comment": "​11 条评论"}
{"answer_author": "军师", "answer_id": 201849753, "answer_text": "AI人才缺口巨大。<img src=\"https://pic4.zhimg.com/50/v2-bf38a4c519dfd829ecd15357d412522e_hd.jpg\" data-rawwidth=\"689\" data-rawheight=\"575\" class=\"origin_image zh-lightbox-thumb\" width=\"689\" data-original=\"https://pic4.zhimg.com/v2-bf38a4c519dfd829ecd15357d412522e_r.jpg\">人工智能·招聘信息分享薪资情况<img src=\"https://pic4.zhimg.com/50/v2-093a22a1d9ce0d7adf101736c5341c35_hd.jpg\" data-rawwidth=\"521\" data-rawheight=\"929\" class=\"origin_image zh-lightbox-thumb\" width=\"521\" data-original=\"https://pic4.zhimg.com/v2-093a22a1d9ce0d7adf101736c5341c35_r.jpg\">这个就不能被称为饱和了吧。", "answer_votes": "13", "answer_comment": "​9 条评论"}
{"answer_author": "知乎用户", "answer_id": 137884549, "answer_text": "互联网需求旺盛的应该不会饱和，别的地方嘛，其他不敢说，我大山东真没啥公司有机器学习方向的需求。。。。", "answer_votes": "2", "answer_comment": "​3 条评论"}
{"answer_author": "Yuqiao Chen", "answer_id": 137695593, "answer_text": "现在谈饱和还太早了。要讨论一个方向是否已经饱和，要看这个方向能带来多少潜在的行业。我们可以把一个方向考虑成一棵树的节点，这个方向的容量是以之为根节点的子树的总节点数。假如某个方向能节点能产生很多分支，那么这个方向的容量肯定是庞大的。就好像当初有人说计算机行业会饱和，现在看来那简直是可笑至极。但假如说现在讨论的是iOS开发是否饱和了，那么这个是有可能的，因为iOS开发这个方向位于树的末端。那么问题来了，机器学习处于树的哪个位置呢？肯定不是末端，而且从长远来看，机器学习带来的分支不亚于互联网。所以，从长期来看，机器学习不会如此轻易地饱和。或许当机器学习发展到一定程度后你就不用担心它饱不饱和了，毕竟这可是最有可能实现共产主义的技术。------------------------------------------补充一点长远来看不容易饱和并不表示短期内不会饱和，毕竟短期内房子就那么大，突然来一堆人还是遭不住的。不过这所房子的门槛还是不低的，这方面不需要太担心。", "answer_votes": "7", "answer_comment": "​4 条评论"}
{"answer_author": "优达学城（Udacity）", "answer_id": 204068020, "answer_text": "骚年，你是不是想搞个大新闻啊！无论这里的饱和是指工业界职位，还是研究领域内课题，实际情况都恰巧与此相反。“机器学习”走入大众视野才是近两年的事情，即便带有泡沫成分，也绝不会是昙花一现，很多岗位连人都没招上，怎么可能就把“机器学习”列入“夕阳产业”呢？<img src=\"https://pic2.zhimg.com/50/v2-54573d26c634092d635f4a70f6264ba2_hd.jpg\" data-rawwidth=\"982\" data-rawheight=\"480\" class=\"origin_image zh-lightbox-thumb\" width=\"982\" data-original=\"https://pic2.zhimg.com/v2-54573d26c634092d635f4a70f6264ba2_r.jpg\">为了更清晰地了解当前“机器学习”的岗位需求情况，推荐大家通过相关招聘网站进行检索，同时也可自带梯子，登入几家大厂基于机器学习算法构建，并正在推广的职位搜索服务。换到学术界来讲，“机器学习”相关研究课题不止不会“无矿可挖”，只是粗略看一下领域相关的会议，用在浏览器中打开开发者工具使用 jQuery $(\"classname\").size() 计算下文章数量：http://papers.nips.cc/http://openaccess.thecvf.com/menu.pyhttp://dblp.org/就会发现各大会议中，“机器学习”的论文接收量逐年上涨，一派繁(guan)荣(shui)景象。我们在使用的大多数方法，很多时候其实是给数据点画三八线做分类，依靠偏导数计算梯度等方式优化模型的初级方法，很多东西在研究人员看来，都还是说不清道不明的。so，“机器学习”饱和到让数以万计的研究人员下岗失业，几十年内估计是不可能了。。。就连近几年的爆款方法“深度学习”，据笔者所知连自主调节结构在训练过程中逐渐“生长”都做不到，在大多数情况下，我们在做的事情都是：调参！且不论生物、金融等各个领域的产业界与学术界都在向“数据科学”这个万金油的行当靠拢，就连量子物理学博士，都需要“机器学习”方法处理大量数据辅助研究工作。总之，这一波“机器学习”热潮绝不是只是个大新闻而已，与其坐而论道不如上手试玩~<img src=\"https://pic2.zhimg.com/50/v2-405b92ed9ab1710f446b7b5b5e4d7df9_hd.jpg\" data-rawwidth=\"764\" data-rawheight=\"378\" class=\"origin_image zh-lightbox-thumb\" width=\"764\" data-original=\"https://pic2.zhimg.com/v2-405b92ed9ab1710f446b7b5b5e4d7df9_r.jpg\">", "answer_votes": "18", "answer_comment": "​添加评论"}
{"answer_author": "姜山.meta", "answer_id": 244839553, "answer_text": "在知乎上有几年了，似乎和写程序员相关的任何一个方向都被提问过是否饱和了。", "answer_votes": "2", "answer_comment": "​1 条评论"}
{"answer_author": "freddy", "answer_id": 245495529, "answer_text": "。。。。并不 所有 计算机graduate level以上的领域 机器学习 神经网络 数据库 高等算法 这一类的领域 一直缺人。可惜也没多少人会这些东西。。。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "子楠", "answer_id": 201685128, "answer_text": "看招聘启示就知道了。一般学历要求越高，工资给的越低的职位所在的领域，越趋近于饱和。比如某些公务员学历要求已经博士以上了，然而工资只有四五千。", "answer_votes": "27", "answer_comment": "​7 条评论"}
{"answer_author": "以石为马", "answer_id": 244831351, "answer_text": "转行机器学习的人还没毕业呢，还有机器学习的市场还没饱和呢，人才怎么这就开始饱和了", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 137610452, "answer_text": "在Heuristic没有彻底消失之前这都不是饱和的，总的有人发掘新的heuristic 好伐 ", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "Prince LIU", "answer_id": 244870367, "answer_text": "这个问题好啊。不请自来。Quora有一个类似问题“机器学习是否过热”。这两个问题差不多嘛。所以答案也是差不多的。答案当然是一点也不饱和。很多答主都说了什么不饱和。我从另一个方向答一下吧，就是：为什么不少人都产生了“机器学习的人饱和了，或者过多”这样的错觉。机器学习看上去很热，哇，很多人都搞。高校里面凡事可以和这个沾边的学科实验室，都是发展“机器学习”。什么通讯，EE，电子，自动化甚至物理都朝这方面发展。这是好事啊。说明这个方向后备人才储备充足，不会很容易就出现之前VR搞到一半夭折的情况。也说明这个方向确实是个有前景的方向，因为即便google脑子热，带着计算机一块嗨，但总不能其他学科脑子也都不好使吧。但是呢，看上去一堆人都在发展机器学习，或者准备开始机器学习。事实上，机器学习没有个3-5年的沉淀真的很难成事。而很多人超过80%的人，都在这3-5年间因为这样或者那样的原因就放弃了。因为机器学习真的很难搞，涉及的学科比传统计算机多得多，个人觉得比传统程序员要难搞。不是“多做几个项目”就可以的。前几天搞到一本原版《统计推论》（统计学科中的bible级别的教材），略兴奋，发个朋友圈，结果一堆人问我“你个搞计算机的，看统计学干嘛？“ 瞬间无语了。每个学科都是如此，题主估计刚刚从事机器学习不久，发先周围的人特多。过几年，你如果依然坚持机器学习，就会发现，身边都是老面孔。所以大概机器学习分为三个阶段：其下平旷，有泉侧出，而记游者甚众，所谓前洞也。这个阶段，算是大部分人发出“搞机器学习的人是不是太多了” 感慨的地方。遂与之俱出。盖余所至，比好游者尚不能十一，然视其左右，来而记之者已少。这个阶段应该是很多从业2-3年，且有些小成果的阶段了，你就会发现，网上叫“机器学习”“人工智能”喊得最欢快的人，基本都是外行。这和买了个beats就大谈自己对音质的追求，是一个道理。盖其又深，则其至又加少矣。这算是第三个阶段。你这是就会发现，“机器学习” 真的很缺人。", "answer_votes": "30", "answer_comment": "​13 条评论"}
{"answer_author": "babyquant", "answer_id": 201783923, "answer_text": "机器学习、数据挖掘、应用统计、数据科学基本是指差不多的东西，人工智能一般指计算机视觉和自然语言处理。统计是比较老的概念，比如生物统计在生物制药用的比较多，这个在中国还没兴起，在美国已经比较饱和；统计在银行计算信用违约之类也有应用，但地位比药厂差远了。制药是研发费用比例最高的行业，20%左右，银行显然更偏销售和管理。统计在量化基金的地位还是可以的，毕竟金融数据高噪音，对建模严谨性要求很高，计算机毕业的往往低噪音的工程应用接触多了难免简单粗暴。互联网公司也有搞量化分析的，比如谷歌，但他是工程师文化，里面做量化的地位不如码农。谷歌当然最喜欢自然语言处理的人，比如搜索、机器翻译都需要；微软的聊天助手也需要，这块还是很火的，也只有计算机博士能做，而且已经有成熟的应用。计算机视觉比自然语言处理在应用的技术成熟度差了一些，深度学习就是研究这个的，有了突破，但距离普通人的视觉还是差一些。在一些小场景上逐步突破吧。要给图像写标注是耗费大量人力的体力活，总之不容易。自动驾驶这些也是在研究的，总之人工智能这些领域都是风投喜欢投的。自然语言也是每隔一段时间就会有高潮低潮，因为大规模的应用不多，每次有点突破大家热情高涨死劲投钱，然后发现貌似离真实有用还挺远。当年IBM的语音识别小组整个被文艺复兴挖去研究股票市场了，重挫自然语言的研究进展，却成就了一代量化基金的辉煌……总之，想做研究就去这些不成熟的领域，想按部就班做产品做开发就去成熟的领域，都可以活的不错……关键是自己喜欢而去擅长", "answer_votes": "30", "answer_comment": "​2 条评论"}
{"answer_author": "Makaay", "answer_id": 280302260, "answer_text": "哈哈哈！图来自今晨朋友圈~&lt;img data-rawwidth=\"1080\" data-rawheight=\"1920\" src=\"https://pic4.zhimg.com/50/v2-d59b56d75757e1e3ee4dd81305bd5248_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"1080\" data-original=\"https://pic4.zhimg.com/v2-d59b56d75757e1e3ee4dd81305bd5248_r.jpg\"&gt;", "answer_votes": "13", "answer_comment": "​1 条评论"}
{"answer_author": "jk fdre", "answer_id": 244501180, "answer_text": "至少从今年我们组校招面试情况来看，还是远远的供不应求的状态，一般硕士期间但凡研究方向涉及到机器学习的，有能力发出一篇中文核心期刊水平的，或者自学机器学习接近一年，做个1-2个比赛，拿到前10%水平的应届生，人均3-4个1-2线互联网机器学习offer。据我说知，目前正儿八经招机器学习工程师的主要分为2类：第一类：1-2线互联网公司，比如bat，滴滴京东之类的第二类：ai领域的初创公司，比如商汤，face++，地平线一类的。作为一个互联网从业者，对于第二类公司并不是特别了解，但根据我的判断，目前一定是远远的供不应求状态。重点分析一下第一类公司，对于第一类公司，bat在机器学习方面起步的比较早，但是也仅限与广告与推荐领域可能有5年以上的积累，其他大多数的部门也是属于刚起步的摸索阶段。对于2线的互联网公司，像滴滴，美团这样的，本身成立都没有几年，开始好好做机器学习最多也就是这1-2年的事情。1-2年意味着，基本上大多数的策略模型还属于迭代的初期，摸索阶段。以后的发展趋势呢，必然是1-2线公司会在现有基础上不断迭代和发展现有模型，越来越多的小公司会开始拥有自己的机器学习业务。我个人更倾向于把目前目前机器学习就业比做07-08时候的移动开发，都是属于刚刚新起的，在未来很长一段时间都会就业比较好的领域。而且由于机器学习的模型具有像app那样的非通用性，以后只要是涉及到机器学习业务的公司，不管大小，一定要配备自己的机器学习工程师。比如小公司需要做一个推荐系统，必然不能直接把网上开源现成的拿下来自己用，一定需要有专门的人做个性化的修改。当然，这两年供不应求，不代表5年以后供不应求。随着做这行的人越来越多，我的判断是在未来的5-10年一定会出现一个拐点。当然，出现了拐点，也并不代表就找不到机器学习工作了，而是，社会对于机器学习的人才需求不会像这两年这样迫切。同样，可以拿移动开发来对比，10年前移动开发刚兴起的时候，很多人都一窝蜂的去学，10年后的今天会移动开发这门技术的人，必然不可能拿到像10年前那样高的收入，但是，只要你技术过硬，依然可以找到很不错的工作。机器学习技术在未来的几年内一定会有一个飞跃式的提升，做这行的人也一定会越来越多，但是社会的需求量也会随着时间的推移而提升。综上，个人感觉这还是一个可以为之奋斗很长一段时间的领域，但是如果未来的某一天真的出现了什么强人工智能之类的东西，或者计算机也能够通过机器学习学会写代码了，那就谁也说不准了，哈哈。", "answer_votes": "13", "answer_comment": "​15 条评论"}
{"answer_author": "月光宝盒娱乐频道", "answer_id": 203151163, "answer_text": "如果说饱和是指技术发展已经达到了不可逾越的瓶颈，那么机器学习离饱和还很远，因为从技术层面上说，今天的机器学习、人工智能仍然只是黎明前的一线曙光。深度学习给领域带来了满满的希望和憧憬，但喷薄的红日还深藏在地平线下，很多重要问题还远远没有解决，比如深度学习仍然是无法解释的黑科技，自然语言的理解和生成还处在婴儿期，类人的智能推理还没摸到门槛。当然饱和也可以是指基于机器学习技术的产业发展达到了瓶颈。这个问题很大程度上决定于资本的走向。二十年前的通信领域蓬勃发展，正如今天的机器学习。但今天其相关产业已渐近饱和。虽然通信技术中仍有重要问题没有解决，技术的发展空间也还很大，但资本正在慢慢从产业中退出，从而导致了产业发展的减速，或者说饱和。资本是否会持续注入某一个领域俺以为又由两个互相影响的因素决定。一个是市场的需求，一个技术是否以成功的商业模式落地。从商业模式上说，当下有很多基于机器学习技术的创业公司，但其中真正能落地的商业模式却很少。这也是机器学习产业泡沫的一个表现。从需求上说，俺以为市场的潜在需求是巨大的，而且这其中的大多数还没有被发现。就好比手机发明之前，连电话都不普及、不必需，但手机一旦被发明，它竟成为我们今天生活中不可缺少的元素。同样，俺相信今天在机器学习领域，一定有更多像当年的手机一样未被发掘的市场需求，当成功的商业模式真正落地把这些需求发掘出来的时候，将会是整个产业的真正飞跃。作为机器学习的从业者，俺以为有两条正道儿。如果你想创业，就去真正开发市场需求，给工业界或消费者真正提供价值，而不是云山雾罩的炒作概念。如果你想做科研，就去真正攻克技术壁垒，为技术的发展提供新鲜的思想和认知。很多同学只满足于会调几个包，会把现成的算法简单的集成一下。虽然这样的“技能”在泡沫破碎之前可能会给你一个工作机会，但当泡沫破碎之后，这种门槛很低的技能却会让你在大浪淘沙的时候首先被淘汰。总之，像所有新兴产业一样，热潮必定带来泡沫，但泡沫也吸引了人才、推动了发展。即使泡沫会破碎，那些真正创造价值的企业和真正掌握技术的人才都会岿然不动。", "answer_votes": "12", "answer_comment": "​1 条评论"}
{"answer_author": "洋葱办刘主任", "answer_id": 246044780, "answer_text": "谁觉得饱和的给我出来，我给你介绍工作！", "answer_votes": "1", "answer_comment": "​3 条评论"}
{"answer_author": "匿名用户", "answer_id": 137954765, "answer_text": "永远都是分蛋糕的人多，做蛋糕的人少。现在机器学习用的火的领域也就是视觉，nlp，推荐，自动驾驶。这几个领域都是前人做好了蛋糕，大家再一窝蜂滴去分。我记得社交火的那几年，好多人去分蛋糕，论文各种灌水，各大公司各种做社交平台，现在已经分的差不多了。目前国内比较新的蛋糕是自动驾驶，可惜还太小。不知道将来会不会做大。要是觉得蛋糕不够分，那就去做一个新蛋糕吧，让大家也来分分。希望大家多多支持那些做新蛋糕的人，起码把泡沫分散一点吧，如果有泡沫的话。机器学习不是只有视觉, nlp, 推荐和自动驾驶，不是只有深度学习+沾沾自喜的trick。世界很大，机器学习世界也很大，大家把蛋糕做多了，做大了，推动机器学习在各行各业的应用对从业者和学习者都是有巨大好处的。", "answer_votes": "8", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 245500786, "answer_text": "不是。国家刚刚制定了人工智能领域的发展战略，说明我国目前这方面的人才还是不足的。饱和是什么样子呢，比如说Android ，现在网上的中文教程一抓一大把。机器学习的相关资料，前沿论文，大多是英文的。这能从侧面反映出问题。招聘网站上，算法工程师相关岗位月薪很高，这也能反映出问题。加紧努力吧，站在时代变革的风口浪尖，正是时势造英雄的时候。", "answer_votes": "5", "answer_comment": "​添加评论"}
{"answer_author": "大魔王kiki", "answer_id": 257398658, "answer_text": "怎么可能饱和，国内真正能搭建机器学习系统的工程师不多，需掌握机器学习算法，hadoop、spark等平台技术，C++、java、python、scala、R等语言。机器学习一般与大数据结合在一起，业务层的应用系统开发需求层出不穷。传统的软件系统都面临着人工智能软件的冲击，各行各业大大小小公司的系统都得更新换代，这需求足够大，人才紧缺啊，怎么能说饱和呢！ ", "answer_votes": "4", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 244823596, "answer_text": "某些人真是没见过世面，什么时候机器学习领域到了几百个PhD毕业生抢一个位子的地步再来扯什么饱和吧", "answer_votes": "16", "answer_comment": "​5 条评论"}
{"answer_author": "ShadowMov", "answer_id": 273663933, "answer_text": "虽说要退乎，但看到这个问题还是忍不住来答一发。我认为，从某种意义上，现在AI相关的学生有很大的可能是过饱和的。施一公曾有言，21世纪是生物的世纪，然而现在21世纪已经过去了接近五分之一，生物学依然停留在实验室里，只有少部分成果得到了工程化，整个行业无法容纳这么多一般的研究者。再来看看当今的AI领域：几把剑悬在这个领域的头顶。没有足够的理论支持调参和修改网络过度依靠运气和经验对于开放性的问题没有很好的解决方案等等。CV、NLP这些目前AI最擅长的问题很有可能会是这几年AI发展的主力军，但如果在最近的几年，AI本身的问题没有得到妥善的解决，天花板没有抬高，这些热点问题能解决的迟早都会被解决掉，而那么当今的AI恐怕就要步生物科技的后尘：持续投入看不到产业化的希望。这意味着，企业砸钱，却不能看到这些钱快速变现，政府砸钱，不能看到这些钱带来税收，这项投资由短期可以看见利益的投资变成了大长线。这个时候，这个领域就会开始缩圈，仰仗国家、大企业输送有限的科研经费，为了减少重复的不必要的研究，各个研究单位需要少数高端人才来解决难题，资源开始往少数知名专家手里集中。虽然说长期来看，AI肯定是没有到成熟期，但短期内还是极有可能面临过饱和的问题的。", "answer_votes": "3", "answer_comment": "​添加评论"}
{"answer_author": "九乡河龙牙", "answer_id": 202875411, "answer_text": "这个领域低端的太多，中高端的极度稀缺。从身边情况来看但凡基础扎实、能力靠谱的基本上都是用人单位询问多少钱愿意来的架势。。。饱和这个词我的理解是学历好、能力强、重点院校但是依然找不到一份大家认为这种光环下的好工作~这种情况才叫真的饱和了~", "answer_votes": "3", "answer_comment": "​添加评论"}
{"answer_author": "哈sea", "answer_id": 202214120, "answer_text": "饱和谈不上，因为招聘岗位的数量和待遇都是相当不错的。但是我觉得这一行在中国最大的问题应该是最优秀的人士都把精力放在了撰写IPO文件而不是技术研究上，从证监会找IPO文件阅读精通去找工作要比学习各种神经网格、调参技巧更能打动面试官。当然，我不是研究机器学习的，我只是利用人工智能解决生产需求的，更具体的说是用tensorflow解决金相分析问题，可能没有触及到更核心的领域吧。", "answer_votes": "3", "answer_comment": "​添加评论"}
