{"question_id": "55112104", "question_text": "本题已加入知乎圆桌 »「机器学习 · 学以致用」，更多「机器学习」相关话题讨论欢迎关注。", "question_title": "未来不懂机器学习的程序员是否会被淘汰？", "question_commet": "​4 条评论", "answer_number": "64 个回答", "question_followers": "1,004", "brower_number": "109,498"}
{"answer_author": "军师", "answer_id": 185296034, "answer_text": "对岗位淘汰的问题简单说下：我觉得这个可以参看一些安卓岗位经历的薪水变迁。经过供不应求这一阶段后，大批人开始从事安卓开发，最后供大于求。程序员是有鄙视链的，这里我不想讨论谁高谁低，各个领域都有高手，我想说的是就程序员这个工种来说，某个方向越容易学到“工业级可以用”的水准，越容易贬值且被替代。唯有不断爬坡不断学习才能保证自己在某领域达到一个不错的水平。前端也迟早会变成下一个安卓，等着js混乱的局面结束，前端的普通水平开发者也会面临安卓开发曾经面临的问题。当大批水货程序员占据某个市场之后，某些高级程序员也会面临工资再也无法上涨的问题（整个市场被水货占据，拉低了平均值，高峰也会被迫降低）。所以如何成为某个领域的高手才是问题的关键。根据以上，现在正面回答问题：不是未来不懂机器学习的程序员就会被淘汰。只要你可以在某个领域做到大于平均值水平并不断提高实力就OK，但是市场给的同岗位同水平价钱会较以往下降。任何方向都会保有很多岗位（IOS等独特的开发派系这个看苹果吃饭），每个方向都需要有人做一些配合产品上的东西（基础建设加上领域专家），不懂机器学习没关系，做基础的功能、架构就好了。但是有些跟机器学习有点关系的岗位，很可能就要明码标价，要求会捎带一点机器学习了（这时ML应该已经普及了），比如数据库相关岗位（反正你会数据库，加个数据处理不是什么大问题吧，有老铁给出了这样一个文章 @WhySoSerious 亚马逊推出机器学习工具给数据库调优，DBA要失业了？ ），web后端（leader会觉得，后端嘛，顺道搞几个模型，反正你会flask不是，python嘛，顺道搞搞呗，还能省一笔钱再招人）。密切相关的CV、ML、DL、NLP之类的就不用说了，AI工种和图像工种以后离不开ML的。编译器、虚拟机方向等独特小众领域（不是PLT）可能若干年都不会涉及到ML，或者发展比较慢。（有大牛已经开始在寻找nlp手段用来处理编译器的某些环节了，似乎还没有找到）综上，懂一些ML还是比较好的，能提高自己在市场上的竞争和薪水溢价能力。我是军师，国内首家高质量强专业性机器学习社区----集智（https://jizhi.im）联合创始人&COO，互联网界的信息贩子，招聘相关信息可以免费发布在我站或者知乎专栏，需要帮助或商务合作请私信。", "answer_votes": "103", "answer_comment": "​16 条评论"}
{"answer_author": "Garvin Li", "answer_id": 225174123, "answer_text": "我觉得这个问题要区分领域去对待，首先假设把淘汰与否的阈值设定为能否得到一份月薪过万的工作。如果对于一个程序员来讲，他的领域是做前端的UI呈现或者是基于Android SDK开发这样的工作，我觉得只要懂数据结构即可，是否懂得机器学习算法并不会影响到这个程序员是否被淘汰。因为从我个人的观点来看对于绝大多数与数据交互并不复杂的IT领域的程序员，机器学习算法只是个人能力在算法方面扩展，是否具备这样的能力并不会导致程序员淘汰。PS：如果想学习了解机器学习，可以通过一些封装好的云服务快速上手，可以试试阿里云机器学习PAI从另一个角度来看，目前有越来越多的IT领域都在专注对于数据方面的应用，我们看到很多招聘的JD中都包含一项“有数据挖掘相关背景者优先”。从这点来看，其实如果程序员对于自身有更高标准的要求，不仅限于不淘汰。那么掌握机器学习算法一定是一个大大的加分项，当然这里提到的这部分能力一定是要以实际项目应用的经验为基础。综合以上的论述，未来不懂机器学习算法不会导致程序员被淘汰，但是如果想追求更高的层级，程序员需要更多的掌握相关的算法。", "answer_votes": "20", "answer_comment": "​5 条评论"}
{"answer_author": "阿里云云栖社区", "answer_id": 226523808, "answer_text": "毫无疑问，人工智能是目前整个互联网领域最火的行业，随着AlphaGo战胜世界围棋冠军，以及各种无人驾驶、智能家居项目的布道，人们已经意识到了AI就是下一个风口。当然，程序员是我见过对于新技术最敏感的一个人群，举一个例子：当TensorFlow刚刚面世的时候，几乎所有搞大数据的同学一见面就开始交流这方面的内容，仿佛所有人一夜之间成了“TFboys”（tensorflow_boys）。我觉得之所以程序员对于新技术很敏感有两个原因，其一是技术这碗饭会逼着你不停地去学习，不然很快会被淘汰；其二是程序员大多是理工男，对于新事物是充满好奇的。<img src=\"https://pic4.zhimg.com/50/v2-7aa519f5b5daf275d0183e28ebfa97d1_hd.jpg\" data-rawwidth=\"600\" data-rawheight=\"370\" class=\"origin_image zh-lightbox-thumb\" width=\"600\" data-original=\"https://pic4.zhimg.com/v2-7aa519f5b5daf275d0183e28ebfa97d1_r.jpg\">（先声明下我不是算法大神，我是阿里机器学习产品经理，不过我身边都是各种各样的算法大牛）首先讲下我个人的学习经历，我最先接触编程是在刚上大学的时候，2010年左右。最早的时候大家都信奉PHP是最牛的语言，当时觉得能做网站的人都是大仙。过了不到3年，移动互联网的浪潮来了，几乎所有人全部转去学Android开发、iOS开发，而且最初的时候做移动端开发是非常吃香的（这股浪潮很像现在的AI浪潮，我确信不到三年时间市面上的算法工程师会成指数性增长）。我自己当时是在做android开发，也是在一家大的手机公司实习，我当时觉得开发手机软件挺酷的，直到有一个契机让我见识到了AI。当时是有一次机会调用了某个以色列公司开发的眼球识别SDK，13年那时候看到眼球识别这总高端技术是觉得非常神奇的，后来我偷偷搜了下后端的技术，这才第一次认识到了世界上居然有机器学习算法这种东西。于是理工男的那种对新技术的好奇心就促使我去学习机器学习算法，刚一开始先认识了一些基础的算法，比如LR、KNN、RF这些，当时在国内没有这么多的视频课程可以学习，买了一本《机器学习实战》的书，是外国翻译过来的，把里面的很多代码都自己推敲了一遍，成长很大。但是学习机器学习，光知道算法是远远不够的，还需要数据和场景去操练。正好当时阿里举办第一届天池大赛，奖金记得有100万，于是就和几个小伙伴结队参赛，比赛比了两个月，当时真正的在TB级别的数据下实践了特征工程、调参、交叉验证、计算F1分等等。而且第一次体会了分布式集群的威力。当时比赛用的是阿里云的xlab，也就是机器学习PAI的前身。比赛的时候我就深深的爱上了这款云端的机器学习工具，导致后来我义无反顾的投身阿里云，做了PAI的产品经理，开启了我的机器学习业务实践之路。给大家分享几位云栖社区用户对这些问题的看法：第一位用户海洋的云：Q1:你看好人工智能吗？你想入门AI么？ 虽然目前是个AI小白，但是我很认可很看好人工智能的发展，也非常非常非常非常想入门AI。 如果说工业时代的历史意义是解放了生产力，那么我们现在的时代应该算是人工智能时代，利用计算机AI技术来辅助我们完成更多人类自身难以完成的事情。从Siri到AlphaGo，智能家居、智慧医疗， 还有无人驾驶，等等，人工智能已经深深地影响了我们社会生活的各个方面。虽然现在人工智能的发 展还是有一些瓶颈、困难和挑战的存在，但是随着硬件设备的进步，随着越来越多的人进入AI领域， 随着越来越多的业务引入AI技术，随着越来越多的数据场景利用AI技术实现更大的价值的时候，我们 将迎来更好的时代。 Q2:人工智能在哪些方面已经落地应用？在医疗领域有IBM Watson，很多银行开始使用聊天机器人办理业务，无人驾驶、无人机等等。 阿里有阿里云ET，可以人脸识别，可以写对联；阿里人工智能客服好像在今年618已开始使用；在网上好像看到过末端配送机器人小G的相关视频；“NASA计划”以及前两天发布的智能音箱等等。Q3:作为一个普通程序员，你觉得如何做才能顺利入门人工智能？ 自己还没有完全入门，只能说说自己的初步规划。在有自己擅长的编程语言基础上，学习一些数学统 计学和机器学习的基础知识，在此基础上，可以多了解一些业务场景，参加天池、kaggle等比赛，以 实践来发现自己的不足之处，及时调整学习方案。在此基础上，可以开始尝试学习深度学习、迁移学 习、增强学习、GAN等相关技术，可以在arxiv上查询相关技术的最新研究成果，从综述到具体算法细 节的推导再到算法调优，一整套理论学习下来，外加自己多coding实践，估计应该可以顺利入门人工 智能了吧。第二位用户巴洛克上校你看好人工智能吗？你想入门AI么？很看好，也很想学习我认为这是人类跨越到下一个文明的关键，如果有机会很想深入了解，因为本身就很喜欢黑科技的东西一直幻想，有一天能像电影里一样，能和一个虚拟激光投射出的智能系统对话，帮我处理一些问题,并且不会开车也能开车。人工智能在哪些方面已经落地应用？很多方面像机器人小度，下棋的阿尔法狗，特斯拉的自动驾驶，手机助手像siri，医疗方面辅助诊断治疗，还有智能客服，电器上的智能控制面板，人像识别；作为一个普通程序员，你觉得如何做才能顺利入门人工智能？首先喜欢，兴趣最好的老师，然后精通至少一门编程语言 ，精通把算法与数据结构，多思考，还有一点数学一定要很好；查看更多云栖社区用户的看法，请点击  人工智能浪潮之下普通程序员如何入门AI？-聚能聊-云栖社区-阿里云", "answer_votes": "18", "answer_comment": "​5 条评论"}
{"answer_author": "Wendell", "answer_id": 184255236, "answer_text": "忍不住要强答一下，题目是问「未来不懂机器学习的程序员是否就被淘汰了？」翻译过来的意思是「未来掌握机器学习算法是不是程序员的必备技能？」而目前的高票答案是在强调「程序员不会被机器所替代」，显然离题。回到题目来。目前机器学习的发展非常快，随着硬件性能、算法、软件环境的不断迭代，在越来越多的细分领域都有了用武之地。举个例子，知友 @Twisted Python 的业余作品用于汉字生成的（kaonashi-tyc/zi2zi）就已经非常接近实用了，这会大大降低中文字体的开发成本。当然了，在可见的未来，肯定也不是所有的软件产品都必须要用到。所以结论就是，未来如果不懂机器学习算法，作为一个程序员的职业发展会逐渐受限，至少在「架构师」或者「技术总监」这样的级别上，完全不懂机器学习是不可想象的。这就好像说，在进入大数据时代之前，你只会用SQL Server来存储数据，这没问题。但是现在你要说你只会用SQL Server，嗯，你还是可以碰运气找到工作，只是太受限制了。", "answer_votes": "15", "answer_comment": "​4 条评论"}
{"answer_author": "知乎用户", "answer_id": 185364838, "answer_text": "机器学习，现有基于非大脑仿生的所谓机器学习，不过是较出色的归类法。归类→定量→分析→定性，一直都有，从未消失。我仍愿描述未来。未来客观定量分析被自动化智能化全部攻占后，最牛逼的，是主观和直觉，即第六感强大的碳基人。当嵌入式芯片成为人人之标配时，大家回到同一起跑线呗。如果有超乎寻常的敏锐直觉，如果再接受主观分析强化训练，这才是短期难以超越的优势所在。从不可能中发现可能，在微光中找到曙光，哀嚎遍野中发现生机，万众雀跃时提前滚蛋。具备此种能力者，物以稀为贵。but……我所描述终将实现，起步价为五十年。但愿你们仍活着。", "answer_votes": "4", "answer_comment": "​6 条评论"}
{"answer_author": "foruok", "answer_id": 142794948, "answer_text": "我不认为会这样。在软件开发中，其实编码、实现，在整个工作中的占比不超过30%，更多的，是对人的理解、产品的理解、需求的理解、团队的协作等等。机器学习只能处理重复性的、规律性的、易量化的那部分，什么是美，什么是艺术，什么是统合综效，什么是整合资源，怎么在小概率情况下艺术地做出置之死地而后生的反常决定，这都不是机器学习擅长的，而是人擅长的。", "answer_votes": "31", "answer_comment": "​8 条评论"}
{"answer_author": "执·龙根", "answer_id": 151059903, "answer_text": "汽车来了，马车被淘汰了，车夫转成了司机。相机来了，画画被淘汰了会画画的转成了摄影师。互联网来了，信件被淘汰了送信的改送快递。被淘汰的永远是技术而不是人。", "answer_votes": "22", "answer_comment": "​11 条评论"}
{"answer_author": "知乎用户", "answer_id": 184351200, "answer_text": "看你赶上的是什么时代了。直观上，机器学习应该取代的是一些低级工种，比如GitHub搬运工。但是恰恰这种低级工种机器学习目前不能替代，反而一些高端的需要高级人才的场景，比如性能优化是机器学习可以开始覆盖的地方。比如前两天新闻上说的有公司用机器学习做性能优化。这说明什么呢？性能优化，是依靠经验和大量数据的，而机器学习是这方面的强项，阿尔法狗一夜之间学习的围棋经验可能比得上人类学十年。反而那些搬运工的工作，变数太多，目前机器学习的能力是做不到的。因为这里面需要有太多的人工干预和选择，这和经验和数据无关，无非熟练工做的快一些。这些人是被更优秀的人淘汰的，而非机器。还轮不上机器淘汰他们。所以，好好学习天天向上才是王道。对机器学习感兴趣有求知欲就去学习，在游戏和应用上，我们还需要更多的人类智慧，这是机器学习永远赶不上的。也许未来会超过人脑，但那和我没关系了，起码现在机器学习仅仅是一个强有力的辅助工具。", "answer_votes": "45", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 184110270, "answer_text": "花两周学一下试试看呗。程序员找什么工作不是突击两周准备笔试面试的。。。我总是1，特别相信和热衷于自己刚开始理解和明白的东西，2，把自认为已经理解的东西视作平常之物、置之不理。3，希望自己不明白的东西都没有用。因为上面这3种自相矛盾的毫无道理的想法。产生了无尽的纠结、固步自封和走马观花。希望以后能摆脱这些误区。", "answer_votes": "22", "answer_comment": "​8 条评论"}
{"answer_author": "飞龙", "answer_id": 185075674, "answer_text": "不会淘汰，基础开发是必要的，但是基础开发不会有高回报，那样跟淘汰也差不多了。如果你不懂我说的是啥，去看看基础开发岗位的薪资走势，先是php，然后是ios，然后是安卓。无一例外，全部饱和。在可见的未来内，应该先是java web，然后是前端，然后是iot。反正基础开发的话，应届生除了special应该不高于10k（我认为拿应届生而不是所有员工更有能反映前景），数据岗起步就多少了。大家都知道程序员之间是有鄙视链的，虽然有点主观色彩但是的确能发现一些趋势。究其根本，你家互联网根本不能造血，要靠vc来输血。vc为何不把钱砸在产能更高的机器学习上呢？", "answer_votes": "9", "answer_comment": "​3 条评论"}
{"answer_author": "def", "answer_id": 184254916, "answer_text": "最开始据说不会汇编就不能当程序员然后说不会保护模式就不能当程序员再紧接着据说不懂oo就不能当程序员接着说不会反汇编 不懂底层做了啥不能当程序员后来说不懂web不能当程序员现在说不懂机器学习了", "answer_votes": "11", "answer_comment": "​5 条评论"}
{"answer_author": "林土司", "answer_id": 184389374, "answer_text": "不懂机器学习不一定 不懂人类学习的是要淘汰的", "answer_votes": "7", "answer_comment": "​添加评论"}
{"answer_author": "渣卡", "answer_id": 149265011, "answer_text": "你这是封建迷信，要不得", "answer_votes": "7", "answer_comment": "​添加评论"}
{"answer_author": "张海", "answer_id": 184446545, "answer_text": "就说现在好了，不懂数据结构，算法，设计模式，GUI，连DB，开多线程，RSA加密，发PUT请求，RPC调用。。。绝对干不了程序员？开玩笑，他们是工资最高的前端程序员！", "answer_votes": "3", "answer_comment": "​添加评论"}
{"answer_author": "Delta", "answer_id": 143573094, "answer_text": "已举报——理由为宣扬迷信", "answer_votes": "6", "answer_comment": "​1 条评论"}
{"answer_author": "知乎用户", "answer_id": 184256076, "answer_text": "你猜现在调个sklearn的包跟用现成的框架写前端比起来哪个更容易？", "answer_votes": "7", "answer_comment": "​8 条评论"}
{"answer_author": "张松阳", "answer_id": 203748829, "answer_text": "谢邀<img src=\"https://pic4.zhimg.com/50/v2-130ca78816fd813abc8bb44ee9745c7f_hd.gif\" data-rawwidth=\"200\" data-rawheight=\"186\" data-thumbnail=\"https://pic4.zhimg.com/50/v2-130ca78816fd813abc8bb44ee9745c7f_hd.jpg\" class=\"content_image\" width=\"200\">机学习将会成为未来大部分工科专业和理科专业的必修课，如同线性代数，概率论课程一样，成为广大理工科专业的基础，进化为一种通用基础知识。机器学习越来越成为一种建模理工科问题的新工具，如其他答主所言，机器学习慢慢的去神秘化，成为一种基本常识。1.对于已经在工作岗位的程序员的未来发展。 机器学习是个很宏大的领域，而目前的人工智能的迅速升温只是其中一个分支---深度学习。如果有业务场景的需求，可以去补一些深度学习的东西，提高个人竞争力。如果没有这个需求，补一些机器学习的基础也有助于开阔思路，处理未来的工作，甚至改变职业发展规划。2. 对于还在学校的未来的程序员，时间那么充裕，不妨用网上的资源多学一点机器学习的知识，对于未来的行业趋势变化，也能做到手里有粮，心里不慌。。。。。你说会不会淘汰，你来问就说明你内心深处开始慌了，所以赶快去学习吧。<img src=\"https://pic4.zhimg.com/50/v2-6efab2ddc63efcc1fd307e9aca7ba6d5_hd.jpg\" data-rawwidth=\"600\" data-rawheight=\"600\" class=\"origin_image zh-lightbox-thumb\" width=\"600\" data-original=\"https://pic4.zhimg.com/v2-6efab2ddc63efcc1fd307e9aca7ba6d5_r.jpg\">", "answer_votes": "7", "answer_comment": "​添加评论"}
{"answer_author": "九乡河龙牙", "answer_id": 185119357, "answer_text": "现在深度学习简历遍地走，然后面试吹的天花乱坠.....最后随便问几道概率论和线代的题目能做出来的不足三成，供各位面试官参考筛选....", "answer_votes": "4", "answer_comment": "​5 条评论"}
{"answer_author": "知乎用户", "answer_id": 184587500, "answer_text": "说得好像 懂机器学习的程序员会运维，会前端，会数据库，会android，会ios似的========说个题外话，会php的程序员不会被淘汰，因为php是世界上最好的语言。", "answer_votes": "4", "answer_comment": "​添加评论"}
{"answer_author": "王一松", "answer_id": 184413475, "answer_text": "是的，会被淘汰，因为这种程序员不会吹逼、不会炒作，难以竞争过其他会吹逼会搞噱头的伪程序员。", "answer_votes": "5", "answer_comment": "​添加评论"}
{"answer_author": "碎景", "answer_id": 184559421, "answer_text": "spring flask http://asp.net mvcvue react angularhibernate  entity frameworkhadoop spark storm   elasticsearch 这些东西实现起来不容易,但用起来嘛,也就是看看doc的问题.未来机器学习可以大规模投入生产之后,估计也会是这种情况,该搬砖的继续搬砖.", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "天使不哭", "answer_id": 184134268, "answer_text": "对于不懂得实时提高自己自身能力，让技术保持新鲜的程序员，除非退休，不然淘汰只是早晚的事吧，和机器学习有什么关系？", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "悬壶醉世", "answer_id": 185988788, "answer_text": "这要看你问的是什么了我理解你提了两个问题。问题1：机器学习是软件开发的必备技法？问题2: 机器学习将取代程序员进行编程工作？先说第一，如果真有需要被淘汰的程序员会主动学习机器学习。再说第二：举个例子，前端每个人审美不同需要不同的页面，即便现在大家喜欢很多年后就审美疲劳了。主观意识永远站在客观存在的对立面，客观存在统一客观，主观意识混乱驳杂。这意味着人很难在统一服务中获得满意度（体力劳动除外，我说的也不是特殊服务那种）。。。机器学习无法从沟通中获得主观一致性就无法通过机器学习代替程序员~~~~~~但是半机器学习代码生成器是可以有的~~~~程序员是操作代码的人，机器学习是代码生成器~~~~~这样理解就舒服很多了~~~~~", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 185682428, "answer_text": "你觉得不懂编程的医生会不会被淘汰？", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "秋田", "answer_id": 185407252, "answer_text": "工种都会饱和的，就像几年前的前端，安卓等，机器学习估计也很快了吧，实际需求没想象的大。其实我们只是差永久学习的信仰而已。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "散华一抹", "answer_id": 184588328, "answer_text": "论参差不齐，号称搞人工智能机器学习不是独一档？", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "张飞", "answer_id": 238051279, "answer_text": "机器学习感觉也就是算法，一直都没懂，到底机器学习是什么，以前就有阿。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "看山", "answer_id": 229042795, "answer_text": "说实话，机器学习的学习成本比前后客户端大太多了，至少需要两三年才能真正算入门可以活用，光那一大堆数学原理就刷掉一大部分毅力不足的人，而且需要真正在企业里结合业务的实践，才能真正算有经验的机器学习工程师。所以机器学习这块，未来竞争只会更加激烈，很长一段时间之内不会有淘汰一说。", "answer_votes": "0", "answer_comment": "​3 条评论"}
{"answer_author": "沙泓州", "answer_id": 226380236, "answer_text": "刚有汽车的时候，人们会问，未来不懂开汽车的马车司机会否淘汰？从现在来看，答案是不会都淘汰，但大部分岗位会消失，少部分又专又精的会留下，但不再是主流。机器学习同理。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "mR Wang", "answer_id": 226297214, "answer_text": "你们想过你造出很多ai  以后的ai 还需要你吗", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "柳华芳", "answer_id": 225800350, "answer_text": "哈哈哈，不至于，程序员又不是万能的上帝，不需要啥都懂，人工智能如果真能智慧到超级程度，程序员直接失业了，啥也不用学了", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "张力", "answer_id": 225625329, "answer_text": "当年你们骗我说聪明的程序猿用delphi，现在又来忽悠我去折腾ml", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "Jon", "answer_id": 225608111, "answer_text": "我都服了。国务院发了个文把你们吓成这样？infra还要不要人做了？", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 225607272, "answer_text": "我觉得这需要看如何来解释“懂”，未来可能存在两种情况：一是机器学习的库无处不在，你可以用一个简单的很好理解的类或函数来完成你的输入输出；二是第三方的免费的或商业的 PaaS,FaaS 铺天盖地，码农们远程调用即可。这两者可能共同存在，前者能提供从更细的粒度上控制模型，后者可能简单到你不需要了解什么 决策树、逻辑回归、支持向量机 等等专业术语和算法细节，按用途划分，无需训练，开箱即用。最后，只要人还得操作机器、管理机器、还需要互联网媒体，大部分码农的日子依旧那么过……直到，机器完全自我管理，人类开始混吃等死。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 225529491, "answer_text": "国家已经将人工智能的学习任务下到中小学了, 人工智能从娃娃抓起. 所以未来机器人学习会像智能手机一样容易. 懂机器学习, 什么叫懂? 就像懂围棋一样, 什么叫懂? 是知道规则, 还是能打败AlphaGo? --------------------设想: 未来是一个多元化的世界, 不懂什么都不会被淘汰, 什么都不懂很可能被淘汰. 未来是一个生产力发达的世界, 什么都懂很可能被淘汰, 什么都不懂可能不被淘汰, 被豢养. ", "answer_votes": "0", "answer_comment": "​1 条评论"}
{"answer_author": "涂图", "answer_id": 215686296, "answer_text": "程序员的岗位有非常多种，大家各司其职，并不是每个岗位的程序员都需要懂机器学习。当机器学习变得重要起来，那大家也会自发的去学习了解这方面的知识，来为自己的工作增加便利。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "假大空0x0000", "answer_id": 204255440, "answer_text": "机器学习好比是高楼大厦，很厉害现在也很热门 但是少不了下面地基的支持。比如现在的gpu运算，用到了很多硬件的东西。有一些机器学习的模型专门为分布式系统所设计。所以机器学习是建立在很多东西的基础上的。再举一个简单的例子。神经元网络可以学习产生一个XOR的模型。确实很多问题都可以通过机器学习实现，但是对于XOR写一个简单的公式就可以完成的东西，没有必要浪费资源使用机器学习。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "danjk159", "answer_id": 203994042, "answer_text": "支持张汗东的答案，之前有和朋友讨论了下这个问题，其实挺尴尬的，现在机械学习能够支撑的是有一定规则的工作方式，如沙盒游戏，围棋，象棋等，到了现实情况因为不可控因素过多，机械学习在近未来实用化比较少或者没有。如果说是程序员需要掌握机械学习来工作这个事情。反正都学了好多种编程语言了还在乎学习一种规则吗。", "answer_votes": "0", "answer_comment": "​添加评论"}
