{"question_id": "56079273", "question_text": "再也不会是朋友。", "question_title": "很重视的友情对方却不看重是一种怎样的体验？", "question_commet": "​8 条评论", "answer_number": "509 个回答", "question_followers": "2,838", "brower_number": "994,803"}
{"answer_author": "小约翰", "answer_id": 147562631, "answer_text": "谢邀。杜甫：《赠李白》（二年客京都）《赠李白》（秋来相顾尚飘蓬）《与李十二白同寻范十隐居》《饮中八仙歌》（李白斗酒诗百篇）《冬日有怀李白》《春日忆李白》《梦李白二首》《天末怀李白》《不见》（不见李生久）《寄李十二白二十韵》李白：《赠汪伦》&lt;img data-rawwidth=\"429\" data-rawheight=\"493\" src=\"https://pic4.zhimg.com/50/v2-e68ac3105726099f5423c983e581c6e0_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"429\" data-original=\"https://pic4.zhimg.com/v2-e68ac3105726099f5423c983e581c6e0_r.jpg\"&gt;（更新内容，本文完全为抖机灵，李白给杜甫也写过好几首诗，详情见评论区）", "answer_votes": "5.4K", "answer_comment": "​475 条评论"}
{"answer_author": "刘焫鹦", "answer_id": 148049500, "answer_text": "光说李白？太天真！请你们记住，你欠别人的，这个世界有一个人，会替你还回来。李白：《春日归山寄孟浩然》《黄鹤楼送孟浩然之广陵》《淮南对雪赠孟浩然》《游溧阳北湖亭瓦屋山怀古赠孟浩然》《赠孟浩然》孟浩然：《留别王维》王维：《菩提寺禁裴迪》《山中与裴迪秀才书》《酌酒与裴迪》《赠裴十迪》《口号又示裴迪》《赠裴迪》根据 @小约翰的答案杜甫：《赠李白》（二年客京都）《赠李白》（秋来相顾尚飘蓬）《与李十二白同寻范十隐居》《饮中八仙歌》（李白斗酒诗百篇）《冬日有怀李白》《春日忆李白》《梦李白二首》《天末怀李白》《不见》（不见李生久）《寄李十二白二十韵》李白：《赠汪伦》除此之外，还有李白：《送贺宾客归越》《对酒忆贺监二首并 序》（写给贺知章的）杜甫：《饮中八仙歌》“知章骑马似乘船,眼花落井水底眠”既写李白又写贺知章明明是三个人的电影，我却不能有姓名所以这个事情是这样的：杜甫：太白，你把我留在身边，让我的眼里只有你，而你，却想着汪伦。李白：曾经，汪伦是我的朱砂痣，现在，孟浩然是我的白月光。孟浩然：对不起，我爱的是王维。王维：得不到的永远在骚动，被偏爱的有恃无恐。我暗恋裴迪。裴迪：友达以上，恋人未满。这不是四角恋，而是五人恋。------------------所以这个问题完美解释了：王维和李白为什么没有交集？ - 唐诗 - 知乎", "answer_votes": "928", "answer_comment": "​53 条评论"}
{"answer_author": "灰白云", "answer_id": 147933397, "answer_text": "狗子刚上高中时还是一个热情似火朝气蓬勃的三好学生。从小24K吃货一枚，小学时每天傍晚自己干掉一盆蛋炒饭，初中最美好的记忆之一就是和同桌躲在桌子下面偷偷吃上好佳。到了高中，因为和另一枚18K吃货Y志趣相投，两个人当了半年的陌生人之后，终于在某个夜黑风高的晚上，在那条通往小卖部的校道上一拍即合，从此成为吃喝拉撒形影不离的好朋友。在我二十多年的交友圈子中，我的她的关系真正配得上“闺蜜”两字。我们的友情升温很快，在班级里也总是隔空喊“我对你的爱如滔滔江水延绵不绝”，自己班和兄弟班都知道我们是超级要好的朋友。一起做过很多事情。一起打热水、上厕所、去澡房、偷袭对方的胸、每个月回学校花一半的生活费买一堆零食放在她床上、在绿茵场上摆爱心叶子、一起在班级锦旗后面写下我们的减肥计划（减肥成功奖励自己一顿肯德基）、一起逃晚自修、陪她表白自己喜欢的男生看她在校医院的门口掉眼泪。等等。总之形影不离。高中时候我还很喜欢看上海作家协会出版的《新概念作文大赛作品选》，有一篇叫做《你是我的定格，我是你的过客》。有一天我就说：Y，你是我的定格。Y笑了笑。后来有一天（好像是我的生日？）Y送了一个自己缝制的玩偶给我，背后缝了这句话。然后我说其实后面还有一句，叫做“我是你的过客”。Y就说你不要胡说八道。后来那个玩偶我包起来放了好多年。就这样慢慢地到了高一的最后时间，文理开始分班。她要去文科了。不知道是哪一天开始，她突然开始和以前不一样。甚至我感觉到她在故意疏远我。Y性格开朗，又很有个性，人古灵精怪又和大家都好，在学校已经第四年了（初中三年高中一年），所以朋友很多也倍受同学喜爱。我个性也比较非主流。升高中没多久积极参加学生会，倒追当时的学生会主席谈了人生第一场恋爱，不过没多久就不欢而散了。那时候诗读太多人也矫情，分手的时候哭成傻逼从第一天哭到第二天泪一直流眼睛肿得像手榴弹。和Y成为好朋友的时候也是我刚刚从失恋中走出来，感情上也比对待其他朋友更特别更为依赖。高一的我们都有很多朋友。她在学校已经是老油条啦，凭着人见人爱的个性和所有性格不同的同学都打成一片，即使偶尔有和班里女生开撕也常常是自己占了上风（大家都喜欢她）。总之，她和男生女生都很处得来。我上高中才进学校，不过凭借着我“积极向上”、知心姐姐、热情似火的性格我也有了自己的朋友圈，生日的时候收到了很多女生送我的礼物。总之，我跟大家也挺处得来。虽然不同班，但两边的老师好多都是一样的，班级也很近，我就经常去她门口找她。起初她也经常来班里找我，给我送外卖，但是慢慢地我感觉到她好像开始刻意疏远我，并且很快又形成了自己的交友圈，和初中时候的同学们（一起分到了文科班）走得更近一些。甚至避而不见。就这样不知道过了多久，我渐渐地感觉到于我而言她是我所有朋友里最重要的人，重要到所有人加起来都不如她一个。而于她而言我可能是她那么多朋友里的其中一个而已。和其他所有和她玩得好的朋友并没什么两样？既然两个人都走向了不同的道路，或许对她而言，已经没有必要守着这份感情了。而我还站在原地。慢慢地随着时间流逝，我们的距离更远了。她依然过得很开心。我也有了自己交心的朋友。但是渐行渐远的感情对我打击很大，影响了我整个高中。那时候的自己正处在青春期，虽然大大咧咧但是内心其实很敏感。可能是失恋和这份友情连续对我的打击太大，加上非主流时期女孩的矫情和脆弱，也是从那个时候开始，我的性格开始有了变化。从可以和身边很多人成为好朋友谈笑风生到慢慢封闭了自己的心。直到我毕业，接近三年的时间，我已经形成了和从前完全不一样的性格和人格。我的情绪开始非常不稳定，变得暴躁易怒，开始对朋友表现得冷漠，甚至对别人大吼大叫，又在深夜的时候自己躲在被子里哭很久流很多很多眼泪，在每个月回家的时候自己一个人听着歌坐到天亮。总之，我成为了一个彻底的LOSER。彻底到和我要好的朋友们也受不了我的堕落一个个开始疏远我了，“我的果汁分你一半”的同桌也鄙视我，所以到毕业的时候我已经没剩下多少朋友了。总之，高中改变了我。这个改变一直延续了很多年，甚至现在。不过其中我也认识到了自己的一些缺点。首先，太过热情。可能是因为刚进高中特别没有安全感，也或许是我从小就特别在意别人的想法，也过分关注别人的感受，所以所有的事情总想做得面面俱到。比如新同学来了我就很热情地去引路，因为我怕我表现得很平静会让新同学对新环境不适应，比如感觉到身边有谁不开心我就立马关心她，舍友感冒了我就立马放下手上的事情照顾她等等（很多年后想起来，觉得这些举动只是满足了我的圣母心、提供了安全感罢了）。热情能够很快地消除人与人之间的小尴尬，但是热情过度别人也吃不消。第二，那时候的我还挺挫的。前面我说了，我是个吃货。因为本身身板就宽，学校伙食取之不尽所以我很快把自己吃成了胖纸，不柔软那种。总之除了性格好一点，在我们这种长腿美女遍地有的学校里就是彻头彻尾的屌丝了（我们学校管得宽，很多漂亮的妹子都穿裙子、化浓妆），24K那种。虽然不想揭穿，但不得不承认，太挫的人总是比好看的人更容易失去很多东西……（以上更新于2月22日）--------2月23日更新：十年前的往事，已经过去很多年但是当时很多一起的细节还记得很清楚，虽然大多数的记忆都开始慢慢模糊。大学后我开始了全新的生活，虽然偶尔还是会为曾经的感情伤怀，但我已经相较以前更加成熟和独立。偶尔回想起青春期的刻骨铭心，也会笑那时候幼稚和缺少自我的自己。在这里我着重回答一下几点大家关心的：1、听起来对方并没有做错什么啊？是的。我原意不在指责谁对谁错。至今，她依然还是我人生中排行前三的好朋友。我觉得友情其实跟爱情是相似的，两个人没有走到最后常常不是因为谁对谁错。只是我觉得没有很好地结束一段友情有些遗憾吧，而且那时候的自己确实很难受，后来我们加了微信好友，她还是那个快乐逗比的女生，像和她所有好朋友打招呼一样很开心地来和我聊天，但我却无法做到笑脸相迎。就像楼下@七颗球 所说的，我觉得感情里面很难受的一件事情是：你把ta当做最好的朋友，但是ta并不缺你一个。人在这种不平衡的感情里反而最容易受伤。我们不能说没有被看重，只是当你很重视一个人的时候当然也会对对方有所期待，期望自己相对于其他人而言会重要那么一点点，然而最后你发现不是。这个时候就会很难受。2、后来的我怎么样了？步入大学生涯的我，更加成熟和独立，开始了全新的生活。记得高中时候说过一句很非主流的话：我觉得眼泪这东西跟能量一样也是守恒的，如果年轻的时候眼泪流尽了流干了，长大了就不会随便掉眼泪。（大致是这么说的）大学的我还真的没怎么哭过。并且很快有一天我的脑门开窍了，觉得马德不能这么堕落下去啊，我这么机智的人要自我毁灭吗？！No！我不能成为辣鸡！LOSER！然后开始积极参加聚会、社团、练舞等等等等，到了毕业时候我已经不再是高中那个敏感脆弱的大胖子了，会打扮，有很多人追，矫情的病也治好了，独立并且（自认）比很多男生更能干，大家都叫我“灰哥”。下面是几点我想说的：1、在一段感情中，人格独立很重要。重视感情是好事，但过分依赖感情容易成为别人的累赘。到大学后我看到过很多女孩子为了很小的事情感伤很久纠结不已，为了感情歇斯底里丧失自我，每当这时候我总像看到当初的自己，才明白这样的自己于别人而言是多大的累赘，顿时心里满是厌恶，更加坚定要成为独立自主、可以面对感情和处理情感能力的人。2、女孩子应该注重自我提升。依靠热情、主动去靠近朋友，不如让自己更加优秀、得体，用魅力去去吸引她们。你若盛开，蝴蝶自来。在人际在友情在爱情里，具备个人实力（思想、能力、才华、容颜、身材、品味、眼界等等）方得一往情深。-----------------------办公室中。断断续续讲了好久，啰嗦和不完整的表达让我难受，找个时间再来完善。mark下。感谢各位的赞。", "answer_votes": "303", "answer_comment": "​53 条评论"}
{"answer_author": "七棵球", "answer_id": 147850915, "answer_text": "我仅把他当最好朋友 他却又不缺像我一样的朋友", "answer_votes": "257", "answer_comment": "​29 条评论"}
{"answer_author": "河西", "answer_id": 147916194, "answer_text": "想微微的反驳一下赞最多的那条答案。李杜的关系：李白盛名已久的时候，杜甫刚刚风华正茂。两人在东都洛阳相识，同高适一起去拜访李邕。杜甫对于李白是仰慕比友情更深切的一种，两人诗风不同，杜甫以现实主义登顶的诗人，自然会写些生活的常态，因此也做出了《三吏》《三别》这种以个人际遇表现人间疾苦的篇别，送别诗自然也是常态。他还送过韩十四，赠过韦丞相。李白以浪漫主义见长，诗歌的内容大多来自好山好水的感慨，赠他人诗不多。因为我们的小学课本《赠汪伦》留下了很深刻的印象。李白给杜甫写的诗叫做《鲁郡东石门送杜二甫》。醉别复几日，登临遍池台。何时石门路，重有金樽开。秋波落泗水，海色明徂徕。飞蓬各自远，且尽手中杯。醉酒开篇，山水之间，举杯收场。“道是无晴却有晴。”流传下来的诗篇少可能是被遗落或者难以用恰当的语言表述两人的感情。李杜之交显于诗歌，但不止于诗歌。最后附上最喜欢的诗仙的一句送别诗：仙人抚我顶，结发受长生。—— 《经离乱后天恩流夜郎忆旧游书怀赠江夏韦太守》ps：有时候我很怀疑是不是那种答案多了，所以人们喜欢把历史搞成段子来混淆视听。文学和历史可以用轻松的方式来阐述，但是对篡改和意淫绝不姑息。个人观点，从朋友圈看到这条回答有些生气，不要给没有读过这些诗词的人留下一些奇怪的印象。我就是看那层不爽，求喷求驳正。", "answer_votes": "354", "answer_comment": "​50 条评论"}
{"answer_author": "棉朵喵呜", "answer_id": 147875867, "answer_text": "大概就是，无论什么我都想到你，但无论什么时候你都不会想到我吧。", "answer_votes": "201", "answer_comment": "​17 条评论"}
{"answer_author": "艾雲", "answer_id": 148136537, "answer_text": "就好比你主动找ta问ta最近为什么都不找你聊微信了。ta说也没必要天天都和你吹水吧。你想也对，就没再纠结，聊起其他的了。然而，之后ta也没有主动找过你。上次上上次上上上次每次都只有你主动。你不找ta，ta也不找你。你觉得友情需要维系，害怕长期的沉默失联只会让友谊冷却发霉腐烂，最后只能在回忆里找回关于这段友谊的欢声笑语，你又以为高中几年的友谊也是mean something to them的，所以你一次次卖力地将自己的热脸杨ta的冷屁股贴，直到你看到ta朋友圈里那些热闹的聊天截图，那些在评论下的互动，你才发现自己只不过是ta生活里的一个无关重要的过客，少你一个不少，多你一个不多。ta就仿佛一尊大佛，安静地盘坐在微信的那一端，心系万物，但唯独没有你。", "answer_votes": "106", "answer_comment": "​26 条评论"}
{"answer_author": "潘粤明的山楂锅盔", "answer_id": 147855886, "answer_text": "对了 突然想起这个帖子。嗯 我转发口红从来没被抽中过。倒是后来抽中了一百块钱，再后来还抽到了一整箱吸脂可乐，到现在还没喝完嘻嘻。—————以下为正经答题部分—————这是第一次知乎发回答…也没想到会有人看完评论我 安慰我。谢谢评论区的小伙伴们。挨个比心。今天在微博看到了李白杜甫的那个回答，顺着打开了知乎。感觉这个问题还真是问我问的刚刚好。我也把李白杜甫那个回答截图发到了朋友圈。于是她评论我了。她说：“取关不是因为对你或者对感情有意见，是对你转发的微博有意见。你的重点错了。”exo me？不好意思我大概就是自己给自己添堵自己内心演一场戏是吗？不好意思我的重点就是在于你在别人面前提起我时的语气，你无关痛痒的态度。像我这样的同学从来没有要求过谁关注我。我想大概我触犯到她的原则了吧…大概她就是讨厌这种微博讨厌的要死而我好死不死的就是转了这样的微博。可能有人会问 这算什么原则啊。可是她就是这样一个…很有原则的人 高一的时候我有一次惹到她了 很生气的那种 可是我一头雾水，不知道自己是哪里惹到她了…死乞白赖的道歉问她怎么了，才知道是因为我叫她的时候踢了她的凳子（她坐在我前面）…就是这样没错，她认为别人踹了她的凳子就是对她的不尊重对她的侵犯…好吧，每个人都有自己的原则，我尊重你。评论里有一个小伙伴说的我觉得棒极了。发生这样的事情，归根结底，还是因为这段感情的不对等。好了，以下为原答案——好巧不巧，昨天刚经历了这样的事情。反正知乎小透明，就当给自己记下来好了。她呢，是我高中很要好很要好的好朋友，也是我上高中时认识的第一个朋友。所有的隐秘心事都彼此分享。晚上不吃晚饭一起去球场看自己喜欢的男孩子。后来她学美术，离开了大半年。她不在的日子很想她。知道她要回来的那天，去买了校门口她最喜欢的糖葫芦。她天赋异禀，不过学了大半年的专业美术课，就考上了央美。后来就上大学了。我在山东，她在北京。大一只在寒假见过一面，平时也鲜有联系。可我总觉得，跟她的感情应该不会因为这些而疏远。她在微博上有小几千的粉丝，画的表情包在微信表情里上架我每次都会去下载；设计的贴纸在app中付费下载，我也会去买下来。她的圈子里越来越多的是她们美术圈的人，各种大触。就是越来越远吧。我的微博一向就是个闲置。发些无病呻吟的文字，自拍，转些有趣的东西。前阵子有个口红抽奖，我呢，就转了。转了好几次。然后，就在昨天。我突然发现，自己关注的人里没有她了…就点进她的微博去看，发现她也没再关注我。她的第二条微博说，有些同学，主页上没有任何营养，哪怕啥也不发也没关系，可是天天转发口红抽奖我是真的受不了，必须取关[拜拜]很烦 。 原话。我是懵逼的。我截了图去问她 是说我吗…她说，是。什么事情，好好说不行吗？为什么一声不吭把我移除了粉丝然后取关我，再发一条这样的微博？可是这些话我没有问她。在翻她评论时，我更是难过。她给人的回复里有这样一句话“受不了了…这样的同学为什么要我关注ta”。眼泪一下子就下来了。嗯，我看重的感情，对她来说，我却是一个…毫无营养的，同学。好吧。那就同学吧。谁还没几个不惹人喜欢的同学呢。我就是她那个招人烦的同学吧。很难过，也哭了。狼狈死了。可又有什么关系？所幸我不是只有她这一个“好朋友”；所幸其余的好朋友，我不用加上个引号。", "answer_votes": "107", "answer_comment": "​106 条评论"}
{"answer_author": "樊佳伟", "answer_id": 147916117, "answer_text": "就像是友情上的备胎", "answer_votes": "80", "answer_comment": "​5 条评论"}
{"answer_author": "Wong Sharon", "answer_id": 147854453, "answer_text": "遇到过几个这样的朋友，可能因为我太细腻，所以格外吸引神经大条的朋友吧，神经大条就是反应迟钝、线条粗放，让你感觉彼此付出不对等。最初当然我也不平衡呀，我有颗多么敏感的少女心。后来，慢慢的，我习惯了。我理解这种不对等的关系，结局有两种。一、我心里不舒服，对方又不自知，只好越走越远。记着，上赶着不是买卖，这个世界离了谁都一样，没有一个人完美到让你放不下，也没人会来不来的就喜欢你离不开你，毕竟你又不是人民币。你也不用去抱怨、解释甚至激励，毕竟你又没有传销组织的本事。二、如果对方人品、心智真的值得你喜欢，那么就暂时不要放弃，稍退一步，也淡一点。再看看，不付出就不会不平衡。当对方主动找我时，我仍然保持善良宽容热心。当然不要忘了提升自己，让自己保持进步。慢慢的对方就会发现人潮人海中你是多么可贵。然后就慢慢（这个过程可能1年）离不开我，甚至主动经营我们的关系，这时候你就看到了自己人性光辉的力量。当然，我基本把这几段朋友的关系都维护成了第二种情况。题主这种男女之间的友谊关系，没法套用，因为显然他不喜欢你，腻了你，毕竟男女之间没有纯友谊，当初我也不信，没办法，这就是现实啊。放了他吧，当作屁一样，然后潇洒转身大步走开。", "answer_votes": "74", "answer_comment": "​11 条评论"}
{"answer_author": "kxgh BTHgf", "answer_id": 147930718, "answer_text": "就是你的种种在意，在她看来不过玻璃心", "answer_votes": "108", "answer_comment": "​7 条评论"}
{"answer_author": "任木木", "answer_id": 147900391, "answer_text": "自作多情原来不止在爱情里出现", "answer_votes": "102", "answer_comment": "​5 条评论"}
{"answer_author": "钱娟", "answer_id": 148571683, "answer_text": "&lt;img data-rawwidth=\"332\" data-rawheight=\"515\" src=\"https://pic4.zhimg.com/50/v2-56199ffc19130c7605338b2f6d38477f_hd.jpg\" class=\"content_image\" width=\"332\"&gt;", "answer_votes": "16", "answer_comment": "​5 条评论"}
{"answer_author": "小冷大人", "answer_id": 147826834, "answer_text": "我想我以后不太会喜欢或者被那些莫名其妙喜欢我，关心我的朋友感动，因为我不知道哪一天他们就莫名其妙不喜欢我了，找不到答案问不出原因，是的啊，当初喜欢我要和我做朋友也是没有原因的，他们离开应该也比较潇洒吧，这样的友情我真的不太想要。——————————————————————我跟圈里一个填词曾经是很好的朋友，入社的时候比起其他人他就对我格外热情，后来有各种事情就是对我和其他社员不一样，有的时候也会说很感动我的话，自己的小秘密也只会第一时间跟我说，基本上从诗词歌赋谈到人生哲学2333333333不过要先讲清楚真的一丁点男女之情都没有，就是圈里极少数非常好的朋友就是了，关系怎么好我就不再赘述了，你们只要知道非常非常好就行了～去年有一次我上线发现他在群里给大家道歉，我问他怎么了，大约就是号被盗了骚扰了一众妹子。我们对话大约如下:我开玩笑说:我怎么没被骚扰呢！还有点小情绪呐！他:请冷漠脸对我，我也有自己的苦衷呀，你有什么不开心的我还是你的倾听者我:？？？苦衷？话说你最近是没怎么搭理我了，发生什么啦？他:都是我的问题，不是这样的，是我的错我:没明白，弄得好像我很可怜一样他:不是，你怪我就好了我:谁要怪你？我是想知道怎么了啊喂他:不想别人因为我被骚扰了我:你知道咱俩说的不是一个事么……(-ι_- )他:我蠢，我先匿了我:所以是要采取不说话的方式吗？之后我还陆续发过一些好好沟通没有什么问题不能解决的话，都石沉大海，然后就没有然后了( ´•̥̥̥ω•̥̥̥` )他在群里跟其他人正常谈笑风生，这边呀却不想跟我说话，超心凉的有没有？关于他被盗号跟其他妹子的矛盾完全跟我没关系呀，总觉得自己被他负面情绪牵连躺枪了嘤嘤嘤……当时呀，在电脑这边我的情绪还稍稍崩溃了一下，因为我最讨厌朋友们采取这种方式，以为时间过去了一些都会和好如初。但是没有受过治愈的伤口，时间过去了大概只会烂掉吧（此处可以说我矫情）当时他要考研的说，我就安慰自己，他太忙啦！等他考完研来解释我就原谅他！ヾ(≧∪≦*)ノ〃但是呀，每天看着他在群里跟别人正常聊天会觉得自己并没有被他像他说的那么重视，甚至不怎么重要，对于突然不想理我的人，我想我也想要离开一下。我就以自己学校安排有事情的理由暂时退了社群。以前他闹脾气退社的时候我都会第一时间给他顺毛，我退了之后很多小伙伴来问我怎么了，然而他没有。但是后来他还会给我的说说点赞，QQ总是跳出来点赞的提醒又想到这个人根本不想理我，好几个月每每看到我都很难过。( •̥́ ˍ •̀ू )终于等到他考完研了，然而依旧是冷战状态┑(￣Д ￣)┍大概又过了五六天，他忽然来找我聊天，感觉就像随手翻到我顺便聊一下的样子，言语间就好像之前什么都没发生过，他冷战让我煎熬的这好几个月都不存在一样。我主动提了，他说恍若隔世，好像忽然想起来了，又说自己忘性很大。是呀，我为这份友谊煎熬了这么久原来只有我难过，只有我在意，他心安理得得很呢hhhhhhhhhhh我表示我已经不抓狂也不需要顺毛了，顺便给他半年的反射弧点个赞。归根结底我是觉得自己没有被在意，我还是很高兴把前面的话都说出来，但是回不到以前了。他:嗯，你就是想太多了，说出来你可能稍微舒服点，不过你空间真的很好玩。好玩你个鬼啊！！！你TM有没有听我说话！！！一直到这最后他都没有认真的跟我沟通，真不知道这些人哪里来的永远都不会失去我的自信……可能他要失望了，之后我在也没理他了，心好累，坚强的自己不需要抱抱。你们以为完了吗？图耐污年前他突然拉我进清华的一个诗词的群，当时还是犹豫了一下的，不是好朋友了毕竟一个圈的太排斥也不好，就接受了进去了。刚进去一会他就把我踢出来了┑(￣Д ￣)┍这就尴尬了。如果他私聊我一声说拉错人了我还是可以理解的，然而并没有，感觉仅存的一点好感也没了，就这样吧。", "answer_votes": "62", "answer_comment": "​53 条评论"}
{"answer_author": "匿名用户", "answer_id": 147882934, "answer_text": "舍友生日每个都尽心尽力买礼物隐藏小惊喜。就因为我的生日在寒假所以没有一份礼物甚至没有祝福语，有的甚至连简简单单的“生日快乐”都没有。开玩笑似的向一个舍友抱怨了几句，她随口就说“谁让你寒假生日”其他舍友哈哈大笑，然后就揭过了。我很怂，连坏脸色都没有摆。我也有假期生日的同学，我有的是发的红包，有的是快递礼物过去。真的不是纠结那些钱，只是态度的问题，哪怕说几句祝福语也行。明明在学校时我们之间玩的也是很要好的，天天腻歪在一起，我真的把她们当我大学最好的朋友的。委屈到想哭，我以后也不要给她们准备小惊喜了。", "answer_votes": "104", "answer_comment": "​100 条评论"}
{"answer_author": "匿名用户", "answer_id": 147829373, "answer_text": "我认为你是我最好的朋友啊，可是你的好朋友里并没有我呀，只是有些观点相同而言，也并不一定要成为好朋友的，我那么酷的人，才不要把你当初我最好的朋友了，现实就是我只能和我不是很喜欢但也说不上讨厌的人一起玩了，至少她很漂亮。", "answer_votes": "33", "answer_comment": "​4 条评论"}
{"answer_author": "匿名用户", "answer_id": 148049095, "answer_text": "唉。最近刚想通了这件事。后来发现好像还是没想通。从什么秘密都想分享，谈恋爱了，打算出国，选学校，找工作，写论文，到渐渐发现对方对自己根本没当回事，我开开心心去分享的事对方却藏着掖着。后来不经意得知，因为她怕她说了自己有工作了，还在上学的我会感觉自卑。哈？什么玩意儿。。。不是很懂这种脑回路，渐渐发现路早就岔开了，以前那些看到不舒服的话根本也不是我想多了。而是，很早以前，我就自作多情还以为我们是朋友。以至于现在看到她扯一些低俗无聊的皮我再也没兴致接茬，而是当她是陌生人，觉得这个人为什么这么庸俗。以前会觉得这么久的朋友这么多年的友情真可惜，后来明白一直是自己的一厢情愿。不开心就不勉强自己了，有些人真的是只能陪你一段路吧。", "answer_votes": "5", "answer_comment": "​1 条评论"}
{"answer_author": "知乎用户", "answer_id": 147927235, "answer_text": "个人看了问题和描述是这样想的：       1. 有的时候，我们不能以自己的待人标准去要求别人，要不然当发现对方达不到标准，内心就会失衡。你付出了，就无悔了，问心无愧。至于结果只能：“但尽人事各凭天命” ，顺其自然一些，过于计较得失，自己也不会开心。友谊，爱情等这种感性的东西都是“强扭的瓜不甜”。倒不如洒脱些，放开手，目光不要聚焦在他一人身上，这样他有压力，你也痛苦。 还有，不要用自己觉得好的方式对待别人，要不然吃力不讨好，只能感动自己。就像别人口渴了，你还执意让人家吃饼干的感觉。要用别人喜欢的方式对待别人。       2. 建议题主广交朋友，“天涯何处无芳草，何必单恋一支花？” 广泛播撒友谊的种子，悉心浇灌（真诚待人的品质还是不要变），总会有志同道合的小伙伴和你打成一片。如果他主动来找你，如果再次接受他你会开心，那就欢迎当普通朋友，如果你不想再理他，就也“甩”了他，反正自己怎么开心怎么来；如果他不回来了，那是他自己没福气，失去了你这么好的伙伴，该伤心的是他。总之对所有人的期望少一些，失望就不会太大。  3.看题主的描述，题主好像还是学生，特别希望题主将目光收回来，多关注自己，多把注意力转移到学习上，或自身的特长上，“你若盛开，清风自来”。       4.八卦一下，题主确定没喜欢上这个男同学？你的表现和态度可能也让男同学误认为你喜欢上他了，所以故作冷淡，有意和你保持距离也不一定。或者，这个男生可能确实遇到了些难事，过了这个阶段就好了。     5.最后，突然想起，微博上宋丹丹姐说的一句话很火，大意就是：“包括朋友，我累了我就躲远了，你喜欢我我喜欢你我们就在一起，我们都不喜欢，千万不要在一起。”深以为然。    总之，1.好好爱自己，培养自己的闪光点；2.不要再追问这个男同学，把这段关系放一放，冷一些；3.实在特别放不下的朋友，付出了就不要计较得失，开开心心的。4.如果害怕付出后受到伤害，就只对对你好的人好就行啦；4.做让你自己觉得开心的事！", "answer_votes": "39", "answer_comment": "​9 条评论"}
{"answer_author": "匿名用户", "answer_id": 147879930, "answer_text": "我最好的朋友是她，而她却有很多个。我什么事儿都跟她说，跟她同一个学校，她谈了三年的恋爱我不知道，分手了我也是最后一个才知道。新交的男朋友两年了我至今不知道长啥样。认识十年，有八年都是我主动联系她。直到去年，因件小事幡然醒悟，那么多年追着她跑实在是太累了，心里太委屈了。如我所想的，我不找她，她就不会主动找我，一年没有联系了，我们渐渐淡出彼此的生活，就这样吧。曾经对你的好都是认真的，可是我现在不能再不要脸了。有时候会觉得可惜，但并不后悔，每个人只能陪你走一段路。听说这周五你订婚，祝福你。", "answer_votes": "47", "answer_comment": "​18 条评论"}
{"answer_author": "童言", "answer_id": 148269114, "answer_text": "她失恋了说要自杀，我飞身赶去；她需要倾诉我一直耐心倾听直到手机发烫，在她被孤立和中伤时坚决站在她这边，每次出来吃饭都是我付账（我俩收入差不多），发生争执总是我道歉，她的生日和结婚当天我都当成重要的事情对待，她跟我的一个朋友交往，我因为朋友绿了她而跟那朋友形同陌路。我把她当成我十多年来最好的朋友，然而从中学时期到前两年正式绝交为止，她约我出来吃饭只付过一两次账；送我的生日礼物不超过三次；从美国旅游回来给各种乱七八糟的朋友甚至前同事都带了礼物，对我连“忘了带你的礼物”这种敷衍的话都懒得说，看到她的朋友圈晒礼物图我评论了句“我的呢”人家完全无视不回答；因为我无意中说不喜欢她的偶像而大发雷霆，发了一大堆朋友圈骂我，并且不听我的解释；约好了一起出去旅游，还有几天就要出发了临时告诉我她去取了痣，拍照不好看不去旅游了，为了不浪费好不容易跟别人调出来的假期，最后我只好一个人去——诸如此类的事情不胜枚举。但最让我不能接受的是，她特别敏感暴躁，一点点小事就马上翻脸，要么很凶地骂我要么不停地质问我。有时在网上聊着聊着聊着她突然就问“你刚刚是讽刺我？！”“没有啊，我在搞笑啊，我不是还发了个捂嘴笑的表情吗？”“有个表情就不是讽刺我？你是不是讨骂？”“刚刚好好聊着天我为什么要莫名其妙讽刺你？你又不是才认识我，我们做朋友这么久我从来没有讽刺过你。”“知人知面不知心，我怎么知道你怎么想？”就这件事大概解释了快一个小时吧。时间长了我真的挺累的，但是还是舍不得中学时就积淀的友情吧，想了好几次绝交最后都算了。结果有一次她托我办个事，事情不大但当时我确实很忙，就跟她说我很忙，她也说没关系忙完再说。结果过两天我帮她做完了事情微信她的时候发现我被拉黑了，我发验证信息也没通过……\n大概就是在那一瞬间吧，我突然理解了曾经看过的一句话：我说我把你当好朋友，不代表我是你的好朋友……\n要说什么体验吗？也没有什么伤心难过，这么多年大概疲了吧，只有一点点生气和疲倦，还有突如其来的解脱感。\n我最后发了个验证信息，说“如果这样以后也不用联系了”，果然没理我╮(╯▽╰)╭平心而论，中学时她也曾经为我仗义执言，她跟我很聊得来，也曾在我被劈腿时听我倾诉过，对我表达过支持。但是她是一个很幼稚又自我的人，做事说话很少考虑对方的感受，习惯了别人迁就她，而且情绪管理也有问题，跟她做朋友很累很累，尤其是工作以后，这种感觉特别明显。我反思过，我也有错，付出过多热忱，虽然嘴上说不要求回报，但心里的不满其实是逐渐累积的。但是那个时候我还意识不到友情也不能单方面付出，总觉得不好开口，总觉得做朋友不该这么计较，可能也因为她比我小，心里还有“大姐姐情结”吧（虽然她只比我小一岁不到）。这件事对我是个教训。我体会到友情和爱情一样需要双方共同经营，彼此付出，严重倾斜的天平迟早有一天会被压垮。现在跟我感情很好的两个朋友，我很关心她们，但不会过分，出去玩要么AA要么轮流请，大家都有空就一起玩，没有空就跟其他朋友玩，旅游也不是非要约一起。奇怪的是，我们三个的感情反而更牢固。有些人不一定是坏人，甚至有可能在别人印象中还相当不错，但他们不适合做你的朋友。如果一段友情只有你很重视，那么说明这不是一段值得继续下去的友情。", "answer_votes": "30", "answer_comment": "​14 条评论"}
{"answer_author": "Lu Houcong", "answer_id": 147895189, "answer_text": "啊，我也有过类似的困惑吧。就好比，友情是分级别的。你把别人放在了高的优先级，而别人却没把你放在对等的优先级。想了想，就好比热脸贴了冷屁股。从此以后，醒悟。学会拒绝。让爱自己的人获得更多我的爱。", "answer_votes": "64", "answer_comment": "​添加评论"}
{"answer_author": "峦西", "answer_id": 147850759, "answer_text": "李银河与冯唐。&lt;img src=\"https://pic2.zhimg.com/50/v2-783e944bbfcb6314c10126c53848a9f9_hd.jpg\" data-rawwidth=\"440\" data-rawheight=\"2256\" class=\"origin_image zh-lightbox-thumb\" width=\"440\" data-original=\"https://pic2.zhimg.com/v2-783e944bbfcb6314c10126c53848a9f9_r.jpg\"&gt;又找到一条：&lt;img data-rawwidth=\"720\" data-rawheight=\"1281\" src=\"https://pic1.zhimg.com/50/v2-49333304cba88837020f1f695d270c80_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic1.zhimg.com/v2-49333304cba88837020f1f695d270c80_r.jpg\"&gt;", "answer_votes": "56", "answer_comment": "​9 条评论"}
{"answer_author": "小报告", "answer_id": 148172356, "answer_text": "后来就慢慢想通了其实每个人都有自己的生活没有谁非要来听和接受你的情绪付出是自己的选择 全心全意付出是期望自己会得到同样的回报只不过常常适得其反友谊 感情不对等 说到底就是无法摆脱孤独活着不好吗习惯了就好", "answer_votes": "53", "answer_comment": "​1 条评论"}
{"answer_author": "庄梦蝶", "answer_id": 147895277, "answer_text": "&lt;img src=\"https://pic1.zhimg.com/50/v2-0b4a1cce0bab132287c94293b5ae2941_hd.jpg\" data-rawwidth=\"1080\" data-rawheight=\"1920\" class=\"origin_image zh-lightbox-thumb\" width=\"1080\" data-original=\"https://pic1.zhimg.com/v2-0b4a1cce0bab132287c94293b5ae2941_r.jpg\"&gt;这我可有太多话想说了，每到深夜我睡不着的时候，我就会想为什么你要抛弃我我哪里对不起你了，我掏心掏肺的对你竟然最后换来的是这种结局，我知道我们不会回到从前，我丝毫并不觉得对你有任何亏欠，知乎上有人说过，高中毕业了就删除一些人吧，无论是网络上的删除还是心理上的删除。我这个人很深情，但是我要是被伤了心之后我依然会很无情。前一段时间我进行的摘抄有一句话，这句话真好。   掏心掏肺的对待一个人可能会换来一生的知己，也会换来一生的教训。我依然相信友情，只是我永远不会再相信你。还想再说点，真想说一句我爱豆的话，过去的我老是太单纯，所以总被别人骗。以后再也不会了。永远都不会了！我曾经总是很单纯的认为只要我真心的对你把所有自己的秘密都分享给你，就同样也能换取你的真心，我错了真是大错特错。说她是狗吧，我都觉得侮辱了狗，狗还能给我一片真心一片爱呢。9年的感情仍然比不上他后来交的朋友，与你相遇并不幸运，你让我长了一辈子的教训。用情最深的人反而最受伤害。", "answer_votes": "52", "answer_comment": "​7 条评论"}
{"answer_author": "林一方", "answer_id": 147956222, "answer_text": "在你眼里他是特别的存在，在他眼里你什么都不是。实际上，题主为什么觉得你们关系特别好？是不是觉得他性格和你合得来，人又特别好？其实么，别人也是这么觉得的。一个优秀的人大概会吸引很多人，大部分人都会觉得他值得自己去付出。但如果你从来没有让他觉得感兴趣，他又为什么会觉得你值得让他给出你希望的回应？感情这种东西，哪有真正对等的。“今天天气超级好！风吹起来特别舒服。\n楼下的猫好可爱，上次给它带了吃的它很开心呢。\n我去听音乐会了，特别特别棒，我想着你也能去就好了。\n谁敢欺负你我弄死他！\n有一家火锅特别好吃，我请你去吃饭吧。\n这本书特别好看！送你一本吧！\n我发现一个惊天大秘密！我就告诉你一个人哦~\n你在哪？别动我去找你！打不上车？那我跑着去。\n这么久不见你都瘦了。\n又一年过去了，好开心你还一直在。\n刚刚去看了天气预报，你们那里今天晚上会下雪！\n明天会很冷~你要注意啊~” “哦。谢谢。” ", "answer_votes": "17", "answer_comment": "​4 条评论"}
{"answer_author": "匿名用户", "answer_id": 147918726, "answer_text": "就到这为止吧。再也不会和她一次次表明她在我心中的重要位置和意义。不想再自取其辱了，在我明白不论我怎么对她好在她心里我和其他几位没太大的区别后。她最最需要的一直都不是我。最好的朋友有最好的朋友，又有什么办法呢。我大概只不过是个一定时期的朋友罢了，过了这个时期，谁知道这段友情会如何发展呢。2.23到目前为止内心已经平静了许多，虽然一想到还是止不住的心酸。昨晚打了这几行字后哭了半个晚上，为我不切实际的幻想与现实对比带来的深深的讽刺而难过，又嘲笑自己的妄想。我是那种认定了一个人就会一直对她好，不管发生了什么，都始终陪在在身边。在我心里，她是我最好的朋友。我想跟她分享我遇到的这世间所有的美好以及我所有的悲喜。因为大学以前忙于学习，几乎没交什么朋友。所以，我很感谢这一生能遇到她，让我真正体验了友谊带来的幸福感和欣喜感。她是本地人，我们大学所在地是个一线城市。我还想过以后我就在这个城市安家，以后我们分别结婚生子了也能像现在这样，陪在彼此的身旁。我的未来，都有她的影子。可是我渐渐发现，在她心里，最好的朋友不是我。我们每次出去玩的合影她都不在意。单独想跟她出去玩她还会想叫上其他人。她对我的称呼和其他舍友一样，她给我的所有备注是我完整的大名，但她有给亲近人特殊备注的习惯。她对我的建议只是听听而已。一开始我觉得没什么，我没有权利干涉别人的交际圈。可是当我明白我在她心里跟其他舍友是一个性质，我其实没有那么重要时，甚至明白了她从来没有把我纳入她未来的生活而且跟我谈起她和她最好的朋友以后都不会出本地还会在一起时，巨大失落逐渐把我的幻想彻底击碎。昨天我无意发现的一件事情压倒了我心底最后一根防线。在她心里，还真是，没有我的位置啊。她人很好，对每个人都很好。我一直对自己说，她对我好不是因为她人好，是因为我对她很重要。可是昨天过后，我再也不这么认为了。强烈的对比赤裸裸的摆在我面前，我除了承认我对她来说根本没那么重要之外，没法再欺骗我自己。     我认了，感情是两个人的事。不论我怎么努力，都不会改变我在她心中的位置。我还是会想以前那样对她好，照顾着她，希望她这一生平安喜乐。可我再也不会再畅想我们未来的样子，不会再一次次表明她对我来说有多么重要，不会再为她对别人更好失落，不会再奢望她会对我的定义有舍友以外性质，不会珍藏我们每一次互动，每一次聊天截屏，每一次值得纪念的时刻。她还不知道我内心经历的挣扎与平息，我也不会和她提起。       此生，大概是无缘了吧，最远只能到这了。曾有多欣喜与希望，如今就有多无奈与失望。我也不再想大学毕业后我们还会不会密切联系，只要此刻，我们还是在一起的，就足够了吧。从将她视为我最好的朋友、我的家人到只是大学时期结交的朋友。这场我的内心戏过后，唯一改变的就是心里永远缺了一块，仿佛不论过了多久都难以填满。        罢了。", "answer_votes": "42", "answer_comment": "​26 条评论"}
{"answer_author": "无爱一身轻", "answer_id": 147881142, "answer_text": "题答到一半，却写不下去了。只能说曾经把酒言欢，抵足而眠或许只留在过去。拥有对方陪伴过的这段路程，已实属幸运。来年陌生的，是昨日最亲的某某", "answer_votes": "39", "answer_comment": "​3 条评论"}
{"answer_author": "陈丙烯", "answer_id": 147884286, "answer_text": "大一时通过学生组织认识了一个男生，刚开始就是在网上聊，很投机，每天都聊天什么话都说，于是面基了，初见他有些腼腆，也是正常。之后也是经常聊天，每天互道晚安，我是真的把他当朋友的。但后来他在学生组织内犯了点错误，发票圈承认错误又感慨什么的，我就私戳他问他出了什么事，他不说，他说不能告诉我，（＊那干嘛发票圈）哦好吧事关重大只能告诉很亲近的朋友是吗，好吧看来我不算很亲近的朋友。后来聊天的次数越来越少，他说话越来越客套，回复的越来越慢，经常过一天才回复，过了大概两三个月我实在忍不住了想把话说开，于是发了一大段，大概意思是感觉关系越来越疏远了，不知道自己做错了什么。他倒是出乎意料地秒回了，说他这人就是有点怪，说不清。后来就再也没有聊天。但我心里真的是一直把他当朋友的，虽然算不上挚交但绝对算朋友。后来他生日，之前关系好的时候我一时兴起提前准备好礼物了，把他约出来给他了，回去后他私戳我说很喜欢，我也很高兴。当晚看他发了一条微博，“……没想到失去的人脉还能重回（大概这个意思记不清了）……”人脉。我把他当朋友，他把我当人脉。哈哈，人脉。", "answer_votes": "12", "answer_comment": "​10 条评论"}
{"answer_author": "Eric Wu", "answer_id": 148007435, "answer_text": "大多数人会选择“看破”。“看破”其实是一种自我保护机制，在你的玻璃心得到了保护的同时，也意味着你将永远的失去某些爱与被爱的能力。从某种程度上说是一种悲哀。", "answer_votes": "40", "answer_comment": "​7 条评论"}
{"answer_author": "努力努力再努力", "answer_id": 147907210, "answer_text": "我本将心向明月，奈何明月照沟渠。—————————————————————————看了之后，忍不住说一下。不知道他玩不玩知乎。我俩是高二才认识的，源于分班，当时山东正实走班上课，然后我去的那个班被拆了！拆了！了！我估计是因为我的那个班级是真的垃圾，很垃圾，当然我成绩也不好。然后我就被分到他的班，他在我眼中绝对算得上学习好，人缘好的模范生，我当时也是有不会的题就去问他，他也耐心地讲给我听，不知道从什么时候起我俩就变得熟络起来，到了高三，基本上我俩就形影不离了，一起早起，一起吃饭，一起回宿舍睡觉，感觉那段时间是最棒的时光了。然后一直到高中毕业，他就理所当然的去了一所985，当时他还给我发短信来着，我打心里替他高兴，但也有点难受，因为上大学我俩就不会像以前那样几乎是天天在一起上课学习吃饭了，于是我就和他约定：“我俩一周通一次电话，你能做到吗？”大一的时候，我们还能一个星期打一次电话，通话内容也没什么，就是互损对方，吹吹牛逼，聊聊最近发生了什么事情。那时候觉得，虽说不在一起上学了，但我俩的感情还在呢！大二的时候，渐渐的就变成一个月通一次电话了，打电话的时候我总是兴奋的和他夸夸其谈，他有时会表现出一种很冷漠的感觉，我能感觉得到，他总是“哦”“哦”“哦”的，我也不是滋味，总感觉自己给他打电话是自己找不愉快，到大三大四的时候就几乎几个月或者半年通一次电话，也聊得不如之前那么掏心窝子了。我其实觉得，或许我们的友情也就到这里了吧，他身边有那么多优秀的朋友，个个比我优秀，或许我不必非得把自己硬留在他的朋友圈，适当的距离或许好一点。我是一个非常看重友情的人，我记得当时我已买了啥好东西都会第一时间先拿给他，那时就想把好东西和他分享，心里很是高兴。其实我总觉得，我们这段友情，我一直是付出方，他从来都不是一个看中这段感情的，或许他的性格就是这样冷漠。但我的内心却很难受，我也和自己说过很多次，友情双方必然会有一个一直在付出，不管这一方是谁，只要你们的友情还在，也就够了。但是，你知道吗？那种你掏心掏肺的对他好，但他总认为是理所当然，我受不了，“我本将心向明月 ，奈何明月照沟渠”。以前无论多忙，我们寒暑假都会出来聚几天，但现在呵呵。我俩聊天，永远是我主动找他，我说一句他回一句，从不主动私信我。以前他的朋友圈空间我都会去评论，但现在已经很少很少，几乎没有了。我现在也不像以前那样了，以前总觉得他是我最好的朋友，一辈子都是，我不管他那没把我当成他的好朋友，反正我一直把他看得很重很重，也很珍惜我们的这段感情。但现在，我们这段感情已经八年了，记得有句话“朋友或是情人,能走过三个月的已不容易,能坚持六个月的值得珍惜，能相守一年的堪称奇迹，能熬过两年的才叫知己，超过三年的值得记忆，五年后还在的，应该请进生命里。十年后依然在的，那就不是朋友了，已经是亲人，是生命的一部分了！”很遗憾，可能我们的感情到不了十年了，但我还是很高兴自己的生命中出现过这个人，在我最青春的时候！只是，现在不会像以前那样拼命的想挤进他的圈子，不会那么看重我俩的这段友谊了。前段时间发了个朋友圈：“千万不要把你的感情浪费在不爱你的人身上，一点都不要，那看起来很蠢，你的感情不是廉价物。有好多爱你的人等着你去爱呢！”然后他回复：“很多？在哪儿？”要是搁以前我肯定会开玩笑地骂他，现在我就嘴角一扬，呵呵。题主问的是自己有什么感受，那我觉得最大的感受就是委屈，难受，无论男女，当你发现你这么看重和他之间的这段感情他却表示很惊讶的时候，我觉得你可以适时的收敛一下自己，可能他没你想的那么看重你俩的这段感情。手机码字可能有错别字，另外想到一句就说一句，望担待！^ ^   ", "answer_votes": "12", "answer_comment": "​1 条评论"}
{"answer_author": "匿名用户", "answer_id": 147880280, "answer_text": "自己看重的友情对方却不看重是种什么体验？就像失恋一样。不，比失恋还惨。因为那种心就像被人一拳打过来一样，闷到痛，被打到的心又好像被火烧一样。又像有一口血要从心脏的地方喷出来，但是却除了空气，什么都没有。饶是这么心痛，眼睛却比任何时候都要干。就像此刻的我。本来是被微博上的李白和杜甫的乐子逗乐了想上来看看抖机灵的段子，翻看了几篇答案，才发现原来自己浑然当了这么多年的傻子。。。。。。我以为的挚友因为各自的成长境遇不同导致现在变淡了，原来是这么多年来，她一直都没重视，没在意，没看的上我吧。从前年年尾自我开始的觉得这段友情走不下去了：为什么你有了男朋友的，我不是第一个知道，甚至一年后才知道（而你是第一个知道我有男朋友的人）；为什么哪怕不是第一个知道的，连开玩笑介绍男朋友认识都闪烁其词，甚至已经是一出门就能见到你男朋友的，都要和我在门前道别；你和你的朋友策划的旅游，我只是个半路子搅和进来说要参加的人或者半路邀请参不参加的人，哪怕这个朋友也曾是我的同学；约出来见面聊天都会玩手机。。。。。。或者真的如Eason的最佳损友里面的那句“位置变了，各自有队友”十一年的友情，终于还是慢慢淡下去，但是至少也还是彼此昨日最亲的某某。小心翼翼，如履薄冰。曾经的自己用过这八个字形容我和她的友情。但那时的自己也总以为是她的性子太凉薄的缘故。对谁也一样，也就没差。也怕失去这段友情，毕竟自己真的很珍惜这段友情。从开始到十年。。。初二的分班认识，继而成为同桌。最后成为“好朋友”。不同的高中，不同的大学。中间也有保持联系，不是没有中断过，但是，断的是我，续的也是我。以前也总想不明白，其实自己脾气也算不好，但是对她真的没耍过小性子，为什么对我就这么冷淡，是不是我做的不好。不是没有试过直接说出来，但是就是那种拳头打在棉花上。。。甚至每当我以为我们是最最好的朋友的时候，也可以反手给我一个清醒：抱歉，其实你不是在我的友情顺位里排第一的。其实，不是第一也无所谓的。但至少还是有位置的。。。或许曾经是有过的。但是今天的知乎告诉了我，没有。今天才知道，一直以来，无论过去到现在，她对我的态度大概也还是那种你来不来，我亦无所谓。我从来不是某人的顺位的榜上有名。大概觉得我不配。很难受，就好像心被狠狠地揍了一拳一样。过去的一年，还以为自己终于学会了点豁达。不再因为这段友情而情绪波动。但其实发现自己原来对于你从未把我当好友这事很耿耿于怀。不甘又如何。多年来现在才发现，原来一直作怪的直到现在还是我自己。放手也罢了。最最后一次抱着这样的想法听这首歌，听完，才觉得自己原来是多么的可笑。 朋友 我当你一秒朋友朋友 我当你一世朋友奇怪过去再不堪回首怀缅时时其实还有朋友 你试过将我营救朋友 你试过把我批斗无法再与你交心联手毕竟难得有过最佳损友你玩知乎吗?你会看到这个答案吗？如果你不是没把我当闺蜜的话你会告诉我吗？", "answer_votes": "33", "answer_comment": "​13 条评论"}
{"answer_author": "不是丸子的错", "answer_id": 148038411, "answer_text": "从心疼对方慢慢变成心疼自己", "answer_votes": "26", "answer_comment": "​2 条评论"}
{"answer_author": "陆渐声", "answer_id": 150433474, "answer_text": "《琅琊榜》，长亭送别时，萧景睿对他一直十分敬重的苏兄说了这番话：“我曾经因为你这么做，非常难过，可是我毕竟已经不再是一个自以为是的孩子了，我明白了，凡是人总有取舍，你取了你认为重要的东西，舍弃了我，这只是你的选择而已，若是我因为没有被选择，就心生怨恨，那这世界岂不是有太多不可原谅之处，毕竟谁也没有责任要以我为先，以我为重，无论我如何希望也不能强求，我之所以这么待你，是因为我愿意，若能以此换回同样的诚心，固然可喜，若是没有，我也没有什么可后悔的。 ”虽然梅长苏亦是很珍惜与景睿的情谊，但终究没能两全。于景睿而言，一朝大厦忽倾，无外如此吧。&lt;img data-rawwidth=\"638\" data-rawheight=\"3412\" src=\"https://pic1.zhimg.com/50/v2-55c66f1cd80d1a94761d75b7bf8d9836_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"638\" data-original=\"https://pic1.zhimg.com/v2-55c66f1cd80d1a94761d75b7bf8d9836_r.jpg\"&gt;", "answer_votes": "23", "answer_comment": "​5 条评论"}
{"answer_author": "熊圈圈", "answer_id": 147919098, "answer_text": "    就是你自己想了太多以后的美好未来，人家并不想参与，你还强拉着别人，强迫别人和你一起。别人本来没把你当会事，你却自导自演一出感动自己的戏。   一切都源于你的在乎，她不在意，甚至有点不屑。你给的不是她想要的，废力还不讨好，你却觉得自己付出太多，她却认为你给的让她麻烦，甚至是累赘。&lt;img src=\"https://pic2.zhimg.com/50/v2-32589896abc879d8cb95e403c1585f92_hd.jpg\" data-rawwidth=\"1242\" data-rawheight=\"1231\" class=\"origin_image zh-lightbox-thumb\" width=\"1242\" data-original=\"https://pic2.zhimg.com/v2-32589896abc879d8cb95e403c1585f92_r.jpg\"&gt;最后祝，所遇皆是良人。", "answer_votes": "23", "answer_comment": "​2 条评论"}
{"answer_author": "匿名用户", "answer_id": 147686006, "answer_text": "就像被劈腿一样吧", "answer_votes": "23", "answer_comment": "​1 条评论"}
{"answer_author": "好大一朵长颈鹿", "answer_id": 147639727, "answer_text": "小学最要好的朋友，每天不论干什么事都黏在一起，从小学二年级的时候，直到小学毕业。初中在一个学校，一栋楼，她们教室在一楼的最右边，我们教室在一楼的最左边。刚上初中的时候，到一个新班级，我就特别想念她，也有可能是身边的人都不熟悉的原因，每天都会在下课十分钟的时候跑到一楼去找她，跟她站在她们班门口聊天。某次，我问她你为什么不来我们班找我，她说太远了。有一次找她的时候，跟她说要不今天放学我们一起回家吧（我回家的时候会路过她家）但是她果断的拒绝了我，原话我忘记了，但是意思就是她要和新的小伙伴在一起。从此很少再找她。", "answer_votes": "22", "answer_comment": "​24 条评论"}
{"answer_author": "SUM UNA", "answer_id": 147624295, "answer_text": "初中时候的朋友，天天一起聊八卦互相鼓励那种，当时说要做一辈子的好朋友高中考入了同一所学校，还记得高一圣诞节，我买了一张大大的贺卡，满满当当写了一页心里话，打电话说送给她～我:诶？你在哪，我写了贺卡送给你！她:啊，不用了吧我:我已经写完啦，你有事我放在学校门卫这里吧？她:真的不用啦，你写了我到时候还要写一张还给你多麻烦恩，从此以后变成点头之交", "answer_votes": "21", "answer_comment": "​8 条评论"}
{"answer_author": "匿名用户", "answer_id": 147944933, "answer_text": "今天晚上就又有了这种体验，心里难过的不行，看了回答发现不只是自己这样，每一个回答都有我的影子哈哈。其实就是自己太贱了才会有这种感受。明明都是爹妈捧手里的心肝，干嘛这么委屈自己去讨好一个不在意你的人。", "answer_votes": "19", "answer_comment": "​6 条评论"}
