{"question_id": "56278855", "question_text": "全方位对比一下，我是文科。", "question_title": "中国人民大学与武汉大学那个好？", "question_commet": "​添加评论", "answer_number": "14 个回答", "question_followers": "17", "brower_number": "18,841"}
{"answer_author": "老杨", "answer_id": 149604215, "answer_text": "这问题提的意义不大，能读人大的基本上不会读武大，你应该拿人大和浙大南大对比，具体到某些专业，人大可以和清华复旦交大PK了。", "answer_votes": "1", "answer_comment": "​2 条评论"}
{"answer_author": "BurgessClarke", "answer_id": 149455879, "answer_text": "首先比较地理位置，人大的优势在于北京，劣势也在于北京，虽然实习机会多、吃喝玩乐很方便，但是毕竟始终有清北压一头……这个很尴尬，而武大在中部是无敌的。其次比较排名，人大是一所人文社科为主的学校，法学、理论经济学、应用经济学、政治学、社会学等等排名都是全国第一（有的和北大并列第一），但是国际化程度很低……如果你以后想从商或者从政，人大没问题，如果想日后出国的话最好还是清北复交浙武这些大学。最后看兴趣的话，如果你喜欢人文社科，来人大是绝不会后悔的，本科即使你选了其他的专业，这些优质的政治、经济课程你也是可以选修的。而武大优势在于文理兼长，各个学科排名都不是最高但是都有其优势的。当然最后怎么选还是看成绩为主啦，人大的分会稍微高一丢丢，不过也没差太多。祝高考成功！", "answer_votes": "3", "answer_comment": "​10 条评论"}
{"answer_author": "Louis Miyamori", "answer_id": 214134461, "answer_text": "     “文科”有点含糊，你将来准备学的是人文（文史哲艺）还是社会科学（政治学、法学、经济学、社会学）？   如果有志于文史哲方面学术研究的话，武大在中文（TOP10）、历史（TOP6）、哲学（TOP3）方面完胜人大，历史积淀非常深厚，而且，不管是哪一学科，校外甚至国外学者前来讲学也不少。不过在人大读人文类专业的话，尽管多数学科排名没武大高，但也算全国TOP10的水平了，而且哲学可与武大中山一比，去北大或北师蹭课或者交流也方便。  如果是社科的话，武大的马克思主义全国第一（人大第二），情报学全国第一，理论经济学全国第二，法学、新闻传播学TOP4，政治学第九，社会学略弱。而人大是政法经领域全能TOP3（好多都是第一）。可以说，在中国论社科，人大NO.1，北大NO.2,武大和南大复旦并驾齐驱NO.3（考虑到地域因素、开放程度、资金状况恐怕把复旦排前面的人多些）。假如有人有志于社科而没有考上北复人的话，武大和南大就是首选了。(财经类会多个上财央财)  摆出结论：社科的话，优先推荐人大。人文的话，优先武大。不过，即使你在人大读人文或者在武大读社科那也是赚到了。毕竟全国范围内除了北大复旦南大，再没有哪几所学校敢在人文社科方面挑战中国人民大学和武汉大学。", "answer_votes": "4", "answer_comment": "​5 条评论"}
{"answer_author": "沈嘉诚", "answer_id": 149644384, "answer_text": "真是服了什么问题都有了现在...........人大只是一个211好嘛....这还用问当然是武大！“晋太元中，........”", "answer_votes": "4", "answer_comment": "​16 条评论"}
{"answer_author": "匿名用户", "answer_id": 220338720, "answer_text": "如果你高考能去人大，就去人大。如果去不了，你可以去武大读本科，再去人大读研～(￣▽￣～)~人大很欢迎武大的推免生，社科领域，其他领域不了解。如果你也没考上武大，那就很遗憾了。人大的好：资源。人大资源真的好于武大，毕竟一线城市，毕竟也是一个版本的top3，毕竟首都，不要不相信，这个差别真的不是一般的大。在人大也有清北这样的资源可以接触。虽然会被压一头，但是和优秀的人在一起会让你更优秀。中部老大是很霸气，但也容易成为井底之蛙。辐射地。这个指的是学校在哪个区域比较受欢迎。据我所知，武大的主要辐射地是珠三角一带 尤其去深圳工作的特别多。包括政府企事业单位等。当然中部地区和除北京在内的北方城市也都很好。我认为人大的辐射地会更广。尤其如果你想留京，去人大一定更便利。就业。由于辐射低和专业设置的问题，人大学生就业取向里中央直属机关、各企业总部更多，北京单位更多。武大企业更多，地方人民政府和单位更多，南方单位更多。不过如果你要考中央部委公务员或选调生，去武大也是没问题的。据说武大还是部委选调生报名条件中的指定985之一。(只是听人说过，可能不准确)武大的好：国际名气。这个我也是不信的，后来听说很多挺了解中国的国际友人不知道人大。但听武大老师说过，他去访学自我介绍时候，发现国外的老师不仅知道武大，甚至还因此认得“武汉”这两个汉字。老师当时开玩笑说，这估计就是“国际知名高校”的意思～(￣▽￣～)~校园。这个东西就没有可比性了。武大真的真的很美很美，论“美”清北人都比不上武大。清北人在北方，校园比较规整，而且地是平的。(清北人校园也很漂亮，但是更多的是有种大气磅礴的感觉，而不是美，或者说是规整的美感)但武大有山有水，时而婉约，时而雄壮。郭沫若先生校庆时候为武大题词“珞珈之山，东湖之水，山高水长，流风甚美”武大的论坛也叫做珞珈山水。郭沫若先生曾在自传体小说中描述武大美景，最后说“太平十分在这里读书，尤其教书的人是有福了”。    校园小有校园小的好，校园太大诱惑就多。校园小节约时间，夏天在武汉上山下坡真的很难受，上课都要奔波30分钟的时候，我觉得我的人生浪费在了路上。但看美景有利于舒缓心情。武大的校园可以让你找个没人的地方藏起来，静静的坐着不被打扰。如果你在这个问题上有明显的偏好，还是要考虑清楚。不过不建议纠结这个问题。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "廿止一文", "answer_id": 160347301, "answer_text": "@唉，怎么说呢。现在好多人拿什么大学排名说事，说人大甚至连前三十都排不到……那我得告诉您。对于绝大多数人来说，读完大学，他们就应当滚去社会了。而现在所谓大学的排名，非要去参考什么科研实力等等等等等等……和学生没关系的东西。……你一个要滚去工作的人，大学的科研实力和你有什么关系么？而且，人文社科的科研实力本身就不好估计，我还真就不信哪个排名能够客观的量化估计人文科学的科研实力。说了这么多，其实也就是一个观点：所谓大学排名，对于一个普通学生来说，都是放x。哪个高考录取分数高，就去哪个。别想着什么这个大学排名高还分数低，你真以为自己能捡到便宜么？你以为别人很傻么？咳，答到这里其实有跑题嫌疑。不过也可以回答你的问题吧，大概。武大？让分数说话吧。毕竟，市场决定价格（科科）所以分数决定好坏（科科）是不是很有道理？（无耻……）", "answer_votes": "1", "answer_comment": "​3 条评论"}
{"answer_author": "Samak", "answer_id": 149398731, "answer_text": "人大好，出路好", "answer_votes": "1", "answer_comment": "​1 条评论"}
{"answer_author": "匿名用户", "answer_id": 148442413, "answer_text": " top3最好", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 166238625, "answer_text": "若是比较学术水平或许看一个很直接的现象，每年保研时人大文科专业收的是武大南大乃至复旦的推免生，相反，很少听说人大的推免生去武大的，他们很多是去北清本校或者出国。", "answer_votes": "0", "answer_comment": "​1 条评论"}
{"answer_author": "匿名用户", "answer_id": 151859391, "answer_text": "为什么知乎上对比学校的炸鱼问题这么多，都上大学的成年人了，一炸就炸上来，毫无分析判断能力，给你母校丢人不？另外高三就好好学，别闲着没事到知乎引战，毕竟很多纠结上清华还是北大的人最后只上了二本啊", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 150203764, "answer_text": "事实上人大无论出国人数还是出国比例都排名前几～学工部统计，本科三分之一出国，三分之一国内研究生，三分之一就业～", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "emerald", "answer_id": 149382139, "answer_text": "如果你在高中开始比较这两所大学，说明你还有提高的空间，努努力考北大或者复旦？如果非要比的话，还是人大好。人大生源优质，文科专业实力强，无明显短板，北京地域优势大，师资力量优，是一所很棒的学校。", "answer_votes": "0", "answer_comment": "​4 条评论"}
{"answer_author": "匿名用户", "answer_id": 149621585, "answer_text": "如果是各位武黑，天天拿我武强行头条有意思么，引出一堆人告诉你人大比武大分高些，我承认啊，完了吧好么？如果是高中生小弟弟小妹妹，乖乖回去看课本，到时候拿自己位次比，看专业，现在这种问题想的越早考砸几率越大。还跑到某乎上面问了我去，某乎果真药丸。", "answer_votes": "4", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 166665812, "answer_text": "pr做得好真是重要，武大已经逆天了这是高考用脚投票的结果<img src=\"https://pic3.zhimg.com/50/v2-a8fc38b8cd301887685cc5a860ba2e23_hd.jpg\" data-rawwidth=\"1086\" data-rawheight=\"868\" class=\"origin_image zh-lightbox-thumb\" width=\"1086\" data-original=\"https://pic3.zhimg.com/v2-a8fc38b8cd301887685cc5a860ba2e23_r.jpg\">", "answer_votes": "0", "answer_comment": "​7 条评论"}
