{"question_id": "56676679", "question_text": "比如说，有哪些对某些模型的深刻理解，对A模型和B模型之间的联系，对某些数学概念的几何理解，对某些高级机器学习模型的通俗描述，说出来可以加（zhuang）分（bi）的?", "question_title": "机器学习相关岗位面试中，有哪些加（zhuang）分（bi）项？", "question_commet": "​添加评论", "answer_number": "30 个回答", "question_followers": "2,907", "brower_number": "258,595"}
{"answer_author": "知乎用户", "answer_id": 151505274, "answer_text": "举一个我面试中遇到过的目前最牛的例子，简称M。我一般负责和人吃饭闲聊。这位先生以前在Intel，只大概看过机器学习的一些东西。我：目前深度学习当中用mapreduce的比较少，因为我们经常要SGD，M：哦我猜一下，所以你们用MPI，然后你要优化Allreduce。我：。。。对的，然后很多时候网络会有瓶颈，M：恩，因为你们不想上infiniband。我：。。。对的，M：然后你们 网络的 吞吐速度是够的，但是延迟不理想。我：。。。对的，M：所以你们想要有异步通信，但是同时又要控制 模型不发散。我：。。。对的。我：然后我们的模型在部署的时候希望尽量高速，一个方法是 找稀疏解，M：但是你们发现稀疏性不够，目前的运行库需要1-5%的稀疏性才行。我：。。。对的，M：但是你们估计最多只有30%上下的稀疏性，否则模型质量就下降。我：对的。但是还是有一些办法，因为部署的时候模型是固定的，M：所以可以做即时编译然后内联参数。我：。。。对的。所以面试的加分项就是面试官还没问问题，你就先回答完了。装b结束了，说说我大概想表达的意思吧：机器学习里面了解怎么推公式，怎么解释算法等等，都是停留在技术的层面上。技术牛肯定是有加分的，但是如果要找一位算法/系统架构师，更容易加分的是了解这些技术背后真正解决的问题，在出现 需求的时候能很快解释背后的原理，然后找到解决问题的思路。这也是为啥我在面试的时候不问具体技术细节的缘故 - 开个玩笑，好的架构师只需要写头文件就行。。。=== 因为评论说没看懂，具体展开说 ===SGD+MPI+Allreduce：这个问的是机器学习当中SGD算法怎样并行化，以及如何处理并行当中的计算模式，讨论可以见Allreduce (or MPI) vs. Parameter server approaches网络瓶颈：需要正确估计计算时间和网络通讯之间的比例，保证可以实现pipeline：Pipeline (computing)Infiniband以及ethernet：问的是大规模系统架构的时候的硬件选择问题，不想上Infiniband是因为成本问题，以及容易被少数vendor lock in的风险。网络的吞吐和延迟的区别：What is the difference between latency and throughput?异步通信的时候对于收敛性的影响：可以参见google的async sgd，sync sgd revisited，Eric Xing的latency bounded sgd，以及EASGD等一系列文章的讨论。模型的稀疏解：这个涉及到对于模型稀疏化能力的正确估计，目前的很多网络要保证不丢准确率的情况下，很难做到传统稀疏矩阵的那种要求。稀疏矩阵库的计算效率问题：这个如果做过数值优化的话应该是常识，但是五秒钟里面能从上一条跳到这一条然后找到瓶颈还是让我很惊讶的。即时编译和内联参数：这个比较涉及到数值优化的一系列可能性，以及对于编译器的期望，本身就是一道可以展开说一个钟头的问题。。。比如说，我们在做矩阵乘法的时候是需要pre-pack矩阵的，如果我们知道参数矩阵不会变，我们就可以预先pack，然后如果你可以自己写编译器来利用这些特性的话，你甚至可以没有那个矩阵，直接出一个程序把参数都写在指令里头。一般面试是不会涉及到那么多问题的，其中一两个就够讨论了，M先生属于特别牛的那种。。。", "answer_votes": "1.5K", "answer_comment": "​74 条评论"}
{"answer_author": "Xenophon Tony", "answer_id": 150058292, "answer_text": "Update: 有人说我show off，因为这个问题就是加（zhuang）分（bi）啊！这些并不会是面试官真实会问的问题，看清题目再comment啦~~以及，装逼需谨慎，该装的都装了，被好奇宝宝面试官追问下去答不上来，圆（ji）不（chu）好（cha）也别怪本答案啦~~科科以及PCA那里，感谢@木遥大神指正！那个norm constraint是个hypersphere，令这个问题无论如何都不会是凸优化问题嘛，constraint被我默认成小于等于了_(:з」∠)_…==========================================装逼可以啊，聊聊相同模型的不同理论解释嘛，比如说dropout as a bayesian approximation, EM as a coordinate descent, k-means as a matrix factorization, word embedding as matrix factorization, DPM as a CNN...这些东西我能说一天，相当地有意思。你别看这个世界上有这么多模型，实际上可能只是同一模型的不同分身罢了。事实上，我建议题主把SVM这个机器学习中最可爱的算法了解透彻，同一个模型，我可以用subgradient descent求解hinge loss（比如说PEGASOS），我可以用它primal和dual的形式分别求解二次规划，再进一步，我们可以用interior point method，用primal-dual的方法用牛顿法求解，再有就是大家都熟悉的SMO，它又是怎么工作的？数学是个很神奇的东西，它有自己的语言有自己的世界和规律，然而万变不离其宗。我觉得概念简单但不容易深入理解的还有Lasso，EM还有variational inference，把这些都能说明白表达得清楚，面试官肯定是被你说的一愣一愣的，计划通(●°u°●) 」应题主要求，补充一个具体的例子：貌似前面的说的都和优化有关，木有办法，优化算是ML的主线剧情了，补充一个具体的例子，PCA，面试官问道你的时候你可以这么跟他扯。说到这个主成分分析啊，大家都知道它是在找最大的特征值对应的特征向量，嗯？歪？可能很多人又道听途说了很多诸如最大的特征值对应着最大的variance，嗯，sounds good! 很多人觉得这是一个凸优化问题，然而真相是残酷_(:з」∠)_具体到公式来说，PCA解决的问题是  s.t  ，是协方差矩阵，由于协方差矩阵都是半正定的，而这个函数的Hessian矩阵 自然也是半正定的，也就是说这是个凸函数，然而exo me，前面的符号竟然是max？？？差评！也就是说这个函数有多个局部最优，虽然忧桑，但是局部最优也是满足KKT condition的，(...skip the math...)，我们发现eigen vector刚好可以满足KKT的stationarity condition！然后结论，找到所有的局部最优（eigen vectors），然后选最大的，解决。希望面试官还好。这个时候你应该淡淡地说，我觉得用EM解决PCA的办法更为精妙，我简单地写一...“啊我们今天就到这儿吧，我们得到消息马上通知你！！！”不过，如果看毕真的有人认为像如上PCA这类基础知识都能算是加（zhuang）分（bi）项的话，那...正如评论里所说的，这些所谓的加（zhuang）分（bi）不仅能让你看起来很厉害的样纸，还能甄别哪些公司靠谱哪些公司不靠谱。", "answer_votes": "247", "answer_comment": "​45 条评论"}
{"answer_author": "孤云独去闲", "answer_id": 150985298, "answer_text": "先声明我的答案只是我个人经验，我感觉比较适合咨询类企业。在四大工作过的朋友应该知道我在说什么。加州那些科技企业的机器学习岗位，我不知道。下面是原答案。我负责onsite前一轮，onsite也会参与。一般上来都是让被面试者自我介绍。然后根据项目经验提几个问题，这好像没法投机取巧吧？做没做过，做得好不好一般都能猜个八九不离十。第二个环节是问一下我们的项目你有什么建议。考察被面试者思路是不是清晰。有些人说着说着就说漏嘴了，暴露出一些概念性的错误。不过我觉得犯一两个错问题不大，只要有足够多的亮点，我都会建议onsite。其实paper，github，kaggle这些干货才是加分项，其他的都意思不大。onsite面试会更加concrete，我会把我在工作中碰到的一些实际问题包装成一道大题六个小问这种形式，比如给candidate看点raw data，然后介绍一下客户给我们的要求，我会扮演一个团队合作者的角色，让面试者从头到尾作为主要负责人，过一遍建模的整个流程。大方向上问完了，再问一些细节，比如missing value，data imbalance，partially labeled data，sample quality，feature colinearity等等。最后再问模型的分析，比如如何找出重要的特征，如何证明模型的合理性，如何justify outliers等等。我肯定是挑着问的，不然时间不够。#####既然高票答案这么装逼，那我也小装一下吧。比如在第二个环节里，面试者这么跟我讲svm的primal解法和 dual解法，扯topic model和nmf，我应该不会被扯晕。我会让你说的更多，除非你能白纸把svm的解法整个推导一遍，否则肯定会被问到写不出来的地方。你说kkt，我问你kkt和stationary point的关系。你说em等价于majorization minimization，我问你为什么每次update的都是lower bound。类似的太多了，bayes，我问你为什么一个分布是共轭先验。什么？你还敢扯variational bayes。你真当来面试faculty job来了？能推导的出来最优近似的factor的分布q（）吗，里面要算很多expectation的哦，要能有close form的积分哟，不能乱写哟。大哥，要知道我认识的突然给张白纸，顺顺利利能把svm完整推导一遍的人，不多，基本上最后都是faculty了。既能推导svm，又能推导卡尔曼滤波的，那就更少了。知道高票答案里面涉及了多少个方向吗？太容易被抓把柄了，呵呵。高票答案说的这些算法的等价关系，确实是没错，但我觉得还是要慎重表达呀。真懂了，再说会比较好。总之，我意思就是面试官也都是读博士发paper这么过来的。我们review paper的时候最喜欢挑刺儿了。说这种很细节很学术的东西的时候请一定小心，被抓住把柄就不好看了。上班么，还是要解决问题，做工程，对吗？面试的时候发散性的回答有风险，如果没把握，切中要害言简意赅的回答应该为佳。迅速理解提问者的意图也很重要。#############下面这段有争议，可能比较适用于在美国找工作，国内的我不知道。我也不能光吐槽，还是要提供解决方案。被问过这样的问题，ee，物理，统计等等硕士毕业，（cs的比较牛逼，没人问过我）怎么当上machine learning scientist的职位。我说fresh在我们公司基本不可能呀，你可以先干一些data manipulation的活呀，熟悉sql，先进来干呗，从做feature开始呗。慢慢就会接触到更多模型设计，实验设计，presentation之类的露脸的活了呗。否则该怎么办？没工作经验，没paper，没code，上来就让做model，那雇主风险也太大了吧。（我上面这段写的有点问题，被骂了。一般来说，美国毕业的博士和硕士水平差距，比国内的硕博差距要大。好像国内读三年研究生就很牛掰了，不比读五年的博士差多少。美国硕士有的实际就上一年课，半年找工作，三学期毕业，还不进实验室。这搞毛线，跟phd差的就很多了。我上面那段话，只适用于在美国找工作。）####补充一点内容。我在咨询公司工作，跟科技类公司盈利方式很不一样。我们的项目，管理模式，data scientists的工作内容，可能也会有相应的特殊性。我不想说太多。但有一点很明显，data 是有价格的，一个用户的浏览记录，他的电话号码，购买记录，这些价值都不一样。那我们的data呢，比这些要贵得多得多。我工作里处理的data，也就几个g，需要spark吗？需要h2o么？目前不需要。当然我有很熟悉数据库的同事，他们很擅长从非常非常大的数据库里帮我筛选出这几个g。前几天跟讯飞的一个大神聊天，他嘲笑我们这就是过家家，连gpu都不用。我承认。但这根本不是重点好吗，我怎么觉得我们是私人订制裁缝，客户来说要做一套贴身的正装。我们拿出最好的数据（仿佛羊毛），帮他们设计一整套方案，包括问题抽象，建模（包括做feature），实验设计，模型解释，模型展示。这不就跟写paper做科研很像了么？有的客户喜欢时髦的模型，有的客户喜欢传统统计。那就没办法了，既要会odds ratio，又要知道relu，sgd，cnn这些。没办法呀，我是烦死odds ratio了，对于continuous variable我都不知道这玩意有啥用。我说我要做feature elimination来决定feature重要性，consultant说不行，不好解释。靠，这根本就不是技术问题了，我认栽。我们的面试比较简单，很少会让人写code，主要还是类似面银行，保险，广告这些公司的套路。难点在于过简历关吧，对于没工作经验的人，有个好文凭，有几篇好paper，甚至有好gpa还是有很大优势。有工作经验那就看经验跟我们有多相关了，以及一些soft skill。我感觉知乎上在校学生还挺多的，我写答案也就是希望给别人介绍多一些的路线。不同企业的数据分析人员的工作也还是不太一样的，企业内大家的技能树也不一样。比如说我领导，技术也就那样了，但人家商业分析能力强，项目管理的好，理解力又强，我很是佩服，要好好向他学习。就算是做数据，选择还很多的，找到自己喜欢的就好。祝大家找工作顺利。", "answer_votes": "80", "answer_comment": "​40 条评论"}
{"answer_author": "知乎用户", "answer_id": 150932968, "answer_text": "没code没paper才需要装逼。无paper、无开源项目开发、无kaggle比赛 的三无研究生说自己做机器学习，本身就有问题。倒是有面试官更装逼。你问决策树细节，根本没什么人能答上来，也没有必要答上来。基础好的人，花一天看理论，一天读sklearn代码，两天就搞定。按照这人的面试方法，cmu教授也未必能通过。", "answer_votes": "91", "answer_comment": "​14 条评论"}
{"answer_author": "陈默", "answer_id": 151528006, "answer_text": "装b最大苦恼：装的自己都陶醉了，对面却一脸懵b。", "answer_votes": "14", "answer_comment": "​1 条评论"}
{"answer_author": "致熵", "answer_id": 149989791, "answer_text": "题主的那些都加不了分，既然是入职就不要搞虚的，你应该说你用什么实现了什么。不管这个实现的东西是某大公司的挑战竞赛，还是你实验室的实验项目，总之企业需要的是实际动手能力。", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 150217660, "answer_text": "说说我面试别人的一些感受吧。我以两个例子吧，比如决策树，假如一个应聘者能把决策树算法讲清楚，这个讲清楚我指的是至少要把节点裂变的方法讲清楚，能了解常用的决策树算法，以及决策树如何解决overfit问题。这样的人姑且算合格，如果一个刚毕业的学生能把上面这些讲清楚，那就算合格；再进一步，他如果说用某个决策树算法解决过具体问题，我就会问下他用了多少特征，数据量多大，准确率和覆盖率有多少，训练时间是多长，可能我也不会问多高深的问题，但真正用过一个模型和没有用过只是死记硬背的人，给出的答案绝对不一样，没有真正用过的人几个数据回答过后，可能就磕磕巴巴，扯不到点子上。而如果第二关过了，我一般会扩展下问题，考察下应聘者知识的广度，我可能不要求应聘者精通所有的方法，用过所有的方法，但一专多能还是需要的，你可能只用过一个分类算法，但至少要多了解几种分类算法，因为，之所有有那么多种分了算法，就是因为，还没有发现某种算法能包打天下，每个算法可能都有自己擅长解决领域，也有自己的不足；根据我的经验，第二关会刷下去很多人。其实，细节最能考察一个人，各种算法都有自己的坑，没有真正用过的人，不知道坑在哪里。要说加分项，我觉得，真正用过踩过不少算法的“坑”，能把这些坑准确的说出来，必然会加分不少；", "answer_votes": "55", "answer_comment": "​19 条评论"}
{"answer_author": "爱琳李", "answer_id": 150762541, "answer_text": "有一次去面试，聊到某某算法，我说哦我看过源码，细节是blah blah blah要不是那个源码是Python 2.7,而我是3.5，我也不会去看2333333聊到另一个概念，我说主流的模型有A,B,C。其中C的论文我看了一遍没看懂，大概是blah blah blah。面试官笑了一下，说呵呵我没看过233333Anyway,面试哪有技巧。你必须很努力才能看起来毫不费力。", "answer_votes": "34", "answer_comment": "​10 条评论"}
{"answer_author": "优达学城（Udacity）", "answer_id": 217810492, "answer_text": "对准备工作面试的比喻多种多样，譬如准备上战场、鼓足勇气向异性邀约。最佳情况是精神紧张，而最坏的情况则是感到恐惧，做好机器学习面试准备也不例外。你知道你的表现要么会非常出色，要么就很糟糕。但是如何确保效果很棒呢？                                      思维能力+准备工作 ＞ 技术准备当你已经进入机器学习面试阶段时，我相信你的技术能力已经基本过关了。或者说，到了这个时候，再补充更多的技术知识并不一定能帮助你更好地通过面试。就好像高考最后冲刺阶段，老师不会让你做更多的难题，而会教你一些做题的技巧。那么在机器学习面试时，什么可以让你脱（cheng）颖（gong）而（zhuang）出（bi）？公司和职位了解你即将参加面试的职位的产生背景，即为何公司产生了这一空缺职位，将是准备工作必不可少的一部分。了解为何接受面试有助于了解你对公司的价值。例如，如果公司想要寻找一名机器学习工程师，那么很清楚的是，他们正在尝试解决很难用传统算法解决，或者传统算法根本行不通的复杂问题，并且这个问题是他们非常想要解决的问题。发现核心问题在申请此类岗位时首先要做的是想象下你处在该岗位的情形。要做到这样，你需要搜索尽可能多的关于该公司和职位的信息，并整理你的调查，问问自己：我可以为这家公司解决一个什么样的核心问题？回答该问题的过程应该能够让你很兴奋，并促使你进一步了解关于该问题的相关信息：现有的方法、该领域最近的发展状况——并得出一系列更加具体的挑战。如果你了解你要加入的团队，那么找到一个合适的问题可能很轻松；否则，你应当选择看上去对公司来说最为关键的问题。换句话说，思考一下公司面临的挑战，然后尝试确定他们可能会问的问题。探索潜在数据来源准备过程的下一步应该是思考：回答这些问题，你需要哪些数据？有些也许能够立即获得，但是某些其他的信息可能需要你构建其他关联性来收集。深入探索公司的基础设施和运营状况，他们运转所用的堆栈是什么，他们具有什么样的 API，他们已经在收集什么样的数据，等等。如今的大部分企业都拥有一个博客，他们会在博客上讨论他们的挑战、方法、成功和失败情况。这些博客可以帮助你深入了解他们的运营情况，并了解他们可能拥有什么样的产品和服务。准备讨论机器学习解决方案现在你需要作出一个非常大的概念性跳跃：机器学习如何适应所有这一切？根据你要实现的目标，以及你认为可能可用的数据，能够变成学习问题吗？什么样的模型是合适的？举个例子，很多推荐系统（例如 Netflix 和 Amazon）遇到的主要挑战是分类归并，而不是预测，一旦你能够整理似乎具有相似的偏好和行为的用户群，就很容易推荐他们可能觉得实用的产品。这种思维流程将帮助你讨论对公司来说最关键的问题。没人会指望你一来参加面试，就能够针对他们数个月或数年来苦苦解决的问题给出完整的解决方案！但是大家都喜欢对他们的核心问题展现出真实的兴趣、激情和好奇心的应聘者。面试者可能会向你提出更加技术性的问题，具体取决于你的面试官和面试阶段，但是你应该抓住一切机会表示你对公司和职位都思考研究过。当他们提出更加开放性的问题（例如“描述当你处理一个项目时遇到的技术性挑战，以及你是如何解决这一挑战的？”）时，你可以试着给出和公司的兴趣保持一致的答案。技术和示例问题成为一名机器学习工程师所必须掌握的5项技能是什么？我的结论是：计算机科学基础知识和编程概率和统计学数据建模和评估应用机器学习算法和库软件工程和系统设计接下来，我们将针对这几项技能，介绍在机器学习面试中你可能会遇到的相应问题，并向你提供一些应对方法。计算机科学基础知识和编程示例问题如何查看链表具有循环？给出二叉搜索树中的两个元素，找到它们的最低共同祖先。编写一个对给定堆栈进行排序的函数。任何基于比较的排序算法的时间复杂度是什么？可以证明吗？如何在加权图中找到从一个节点到另一个节点的最短路径？如果某些权重是负值呢？从给定字符串中找到所有回文子字符串。*对于所有此类问题，你应该能够推理出你的方法的时间和空间复杂度（通常用大 O 记法），并尝试尽可能实现最低复杂度。*广泛实践是熟悉不同类别的问题的唯一方式，这样才能快速得出有效的解决方案。InterviewBit、LeetCode、Interview Cake、Pramp 和a href=\"http://interviewing.io/\"> http://interviewing.io 等编程/面试准备平台在这方面非常有帮助。概率和统计学示例问题某个人群中男人和女人的平均身高为μW和μM 。整个人群的平均身高是多少？最近的一项调查研究指出意大利有三分之一的汽车是法拉利，并且有一半的颜色是红色。如果你看到远处有一辆红色汽车正在向你开来，那么这辆车是法拉利的概率是多少？你想寻找在你的网站上投放横幅广告的最佳位置。你可以让广告位大小（或厚度）小、中或大，并选择垂直顶部、中间或底部位置。至少需要多少总页面访问次数和广告点击次数，才能95% 确认其中一种位置比所有其他位置效果都要好？*注意，有很多机器学习算法都有概率和统计学偏差。从概念上理解这些基础知识非常重要，但是与此同时，你必须能够将抽象的公式与现实数量联系起来。数据建模和评估示例问题一位奶农想要弄明白影响到奶牛产量的因素。她一直在记录每日温度（通常是 30°C 到 40°C）、湿度 (60-90%)、消耗的粮食 (2000-2500 kgs)，以及产出的奶量（500-1000 升）。你应该如何处理这些数据并建模，以便预测出每天的牛奶产量（升）？这是什么样的机器学习问题？贵公司正在构建一个面部表情编码系统，需要获得标准高清 1920×1080 像素摄像头拍摄的照片，并持续指出用户是否处于以下某种状态：没有情绪、开心、忧伤、生气或害怕。当用户的脸部没有出现在相机框架中时，它应该指出特殊的状态：无。这属于什么类型的机器学习问题？如果每个像素由 3 个值构成（红色、绿色和蓝色通道），那么处理每个图片的原始输入数据复杂度是多少（维数）？有没有降低维数的方法？你会如何表示系统输出内容？解释下原因。在过去一个世纪收集的天气数据得出了气温上升和下降的循环模式。你会如何对该数据（平均年度气温值序列）建模，以预测未来 5 年的平均气温？你在一家在线新闻服务机构上班，工作职责是收集全球各地的文本报告，并将每个故事当做一篇文章，内容整合自不同的新闻媒体。你会如何设计此类系统？你会应用什么样的机器学习技巧？应用机器学习算法和库示例问题我正在尝试将一个隐藏层神经网络拟合到给定的数据集，我发现迭代训练多次后，权重来回摆动（变化很大，经常在正值和负值之间摇摆）。我需要调整哪个参数，才能解决这一问题？在训练支持向量机时，你会优化什么样的值？套索回归使用 L1 范数系数作为惩罚项，而岭回归使用 L2 范数作为惩罚项。哪个正则化方法更有可能导致稀疏解，一个或多个系数刚好为 0？在使用反向传播训练 10 个层级的神经网络时，我发现前 3 个层级的权重根本不变！后面几个层级 (4-6) 在变化，但是很慢。这是怎么回事，如何解决这一问题？我发现了一些关于欧洲小麦种植区域的数据，包括年度降雨量（R，单位是英寸）、平均海拔（A，单位是米）以及小麦产量（O，单位是千克/平方千米）。经过简单的分析和一些图表，我认为输出与降雨量的平方及海拔对数有关：O = β0 + β1 × R2 + β2 × loge(A)，我能使用线性回归将模型中的系数 (β) 拟合到数据吗？*数据科学和机器学习挑战（例如 Kaggle 上的挑战）是了解不同类型的问题和细微差别的很好方式。尝试参加尽可能多的挑战，并应用不同的机器学习模型。软件工程和系统设计示例问题你负责运行一个商务网站。当用户点击某个商品以打开详情页面时，你会根据商品特征以及用户的购买记录建议另外 5 个用户可能感兴趣的商品，并在页面底部显示这些商品。对于这一行为，你会使用什么服务和数据库表格？假设可以使用这些服务及表格，请写一个查询或流程来获取要建议的 5 个商品。为了衡量用户吸引力和视频热门程度，你需要从在线视频播放器（例如 YouTube）上收集什么数据？一个简单的垃圾邮件检测系统的工作原理如下：它一次处理一封电子邮件，并输出其中每个唯一单词的出现次数（术语频率），然后将这些计数与之前见过的、是否标为垃圾邮件的电子邮件进行对比。为了扩大此系统的规模，以便处理大量电子邮件，你能设计一个在多台计算机上运行的映射降低机制吗？你想生成一个实时可视化图表，展示用户目前正在查看和点击的网页部分，就像热图。为此，你需要在客户端和服务器端使用什么样的组件/服务/API？结论这篇文章想要呈现的是机器学习面试体验的两个方面：背景方面和技术方面。如果有一点值得强调的话，那就是你应该避免侧重于后者，而忽略了前者。雄心勃勃的机器学习初学者很容易就沉浸在技术准备中，而很少会对面试提出“为何…”这种问题：为何有一个空缺职位，为何该公司要寻找机器学习人才（以及机器学习解决方案！），他们为何对你感兴趣？理解这些问题将使你需要解决的技术挑战变得有意义和背景信息，回答这些问题将使你脱颖而出，成为最适合推动公司向前发展的应聘者 。作者：Arpan Chakraborty编译：优达学城原文链接：http://blog.udacity.com/2016/05/prepare-machine-learning-interview.html", "answer_votes": "15", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 149991669, "answer_text": "“有哪些对某些模型的深刻理解，对A模型和B模型之间的联系，对某些数学概念的几何理解”这些东西如果是你看来的，不是自己领悟的，觉得能zhuangbi那我倾向于扣分有不同于他人的见解，则是大大的加分", "answer_votes": "2", "answer_comment": "​8 条评论"}
{"answer_author": "Spark", "answer_id": 151630790, "answer_text": "更新。。。内容非原创，是从英语翻译过来的，翻译过程中可能会有一些误解。为避免误导，请有需要的直接阅读原文：40 Interview Questions asked at Startups in Machine Learning / Data Science---------------------------先把问题答好了在想着加（zhuang）分（bi）的事吧。机器学习/数据分析岗位面试时会遇到的40个问题。Q1：给定一个大小为1000列，100,000,000行的基于分类问题的训练集。你的经理要求你通过降低数据的维度来减少模型计算时间。你的计算机内存有限。你应该如何做？（你可以做一些实际的假设）Answer：由于计算机内存有限，首先应该关闭计算机上的所有应用，包括浏览器，使机器可用内存最大化。对数据集进行随机采样。这意味着可以得到一个更小的数据集，比如，有1000个变量和300000行，然后进行计算。为了降低维度，可以把数字变量和类别变量分开，并去除相关变量。对于数字变量，使用相关系数，对于类别变量，使用卡方检验（chi-square test）。利用PCA方法挑选出可以解释数据集中最大方差的成分。可以使用在线学习算法，如Vowpal Wabbit。利用随机梯度下降算法建立一个线性模型。我们也可以利用经验来估计哪一个预测器（predictors）可以影响因变量。然而，这是一个直观的方法，错误的估计出有用的预测器将导致严重的信息损失。Q2：在PCA中旋转变换是必要的吗？如果有必要，为什么？如果不旋转这些成分，将会发生什么？Answer：有必要。需要旋转变换（正交的）是因为它能够最大化了变量之间的差异。主成分分析的初衷就是选择更少的成分（而不是特征）使得原始空间的数据投影到变换后的空间具有较大的方差。通过旋转，成分之间的相对位置不变，而仅仅是改变了点的坐标。如果不旋转，PCA的作用就减弱了，我们也需要选择更多的成分来解释方差。Q3：假设有一个癌症检测的数据集。你建立了一个分类模型，并且得到了96%的精度。为什么你不应该为此模型的表现感到高兴？你还可以做些什么改进？Answer：癌症检测结果是一种不平衡的数据（Imbalance data）。在一个不平衡的数据集中，不应该把精度作为衡量性能好坏的指标，因为96%的精度可能意味着正确预测多数类别，但是我们感兴趣的类别是少数类别（4%），这些代表了实际被检测为患有癌症的人群。因此，为了评估模型的性能，我们应该使用TP（True Positive Rate）、TN（True Negative Rate）和F等指标衡量模型分类精度。如果少数类别分类性能表现的很差，可以采取以下措施：使用欠采样、过采样和SMOTE算法是数据平衡化；通过Probability Calibration方法选择合适的预测阈值，并且使用AUC-ROC曲线寻找最优阈值；对类别添加权重，以保证少数类别具有更大的权重；也可以使用异常检测方法。Q4：为什么朴素贝叶斯是“朴素”的？Answer：“朴素”是因为它假设了数据集中的所有特征是同等重要的并且是条件独立的。然而，这是一个很强的假设，在实际情况中，这个假设通常很难严格成立。Q5：解释朴素贝叶斯算法中的先验概率、似然和边缘似然概念？Answer：先验概率代表了数据集中因变量的比例，它是指你不依靠额外的信息能做出最有可能的类别猜测。比如，在一个垃圾邮件分类的数据集中，因变量是二进制的（0和1），1（垃圾邮件）的比例是70%而0（非垃圾邮件）的比例是30%，据此，我们可以估计一个新的邮件有70%的可能是垃圾邮件。似然是指存在其他变量的情况下，把一个给定的观测分类为1的概率。比如，“FREE”这个词出现在垃圾邮件中的概率就是似然。边缘似然是“FREE”出现在任何邮件中的概率。Q6：你在处理一个时间序列数据集。你的经理要求你建立一个高精度模型，开始你是用了决策树算法，因为你知道他在所有的数据上表现的还算不错。可是后来你尝试了一个时间序列回归模型并且得到了比决策树更高的精度。可能发生上面的情况吗？为什么？Answer：时间序列数据是线性的。然而，决策树算法在非线性的情况下具有最好的表现。决策树不具有鲁棒性是因为它不能够像回归模型那样很好的映射线性关系。因此，我们知道线性回归模型对于具有线性假设的数据集有着更好的预测效果。Q7：现在有一个项目是要帮助一家食品快递公司赚更多的钱。问题是，公司的快递团队无法按时配送食物，结果客户很不高兴，为了让他们高兴，他们决定终止免费配送服务。那种机器学习算法可以帮助他们？Answer：你一定在大脑中快速搜寻机器学习算法的列表，但是请等等，这个问题考察的是机器学习的基本原理。这不是一个机器学习的问题，这是一个路径优化问题。机器学习问题需要包含3件事：要有一个模式；你不能通过数值方法解决它（即使是写出一个多项式）；你需要有数据。记得通过这三个要素来判定是否可以使用机器学习方法解决一个实际问题。Q8：你的模型现在表现出低偏差和高方差。你应该使用什么方法解决？为什么？Answer：当模型的预测值接近实际值时会出现低偏差的情况，换言之，模型对训练集合的分布拟合的很好，这看起来很不错，但是实际上这样的模型泛化能力很弱。这意味着，当把这个模型用在一个它从未“看到”过的数据上时，它的表现会让人很失望。在这种情况下，我们可以使用Bagging算法（类似随机森林）来解决高方差的问题。Bagging算法把一个数据集分成若干个通过随机采样得到的子集，然后，在每个自己上训练一个基分类器，最后对训练过的分类器进行投票，将测试样本指派到得票最高的类中。 此外，也可以通过如下手段解决高方差的问题：使用正则化方法降低模型复杂度；使用变量重要性最高的n个特征。使用数据集中的所有变量可能导致算法很难找到有意义的信号。", "answer_votes": "120", "answer_comment": "​18 条评论"}
{"answer_author": "吴海波", "answer_id": 150295715, "answer_text": "当然是加分项，这些内容至少能代表题主有很强的主动思考意愿，虽然工业界经常是调个api，但会调的人多了，能不能把业务作出效果可就不一定了。有句话不是说细节是魔鬼嘛。前提是别不懂装懂。", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "东东", "answer_id": 150426468, "answer_text": "真正的加分项是你如何解决问题，创造有价值的业务，为公司带来收益。理论公式推导属于科研工作的组成部分，科研和工业还是有很大的区别，老板招一个数据挖掘工程师不是来搞科研做理论研究的，是为公司创造价值的。对于数据挖掘的学习者，这些理论知识的学习很有必要，但是只会理论不会解决实际问题，这和我们学习数据挖掘的目标是本末倒置的。 ", "answer_votes": "3", "answer_comment": "​添加评论"}
{"answer_author": "木木", "answer_id": 150575709, "answer_text": "理论能力的确能加分，面试官能考查出你对模型的把握程度，但切忌东拼西凑看资料，应系统的掌握几个重要模型的原理。但不要忘了根本计算机基础，编码能力，工业界除了bat大公司的部分团队有那些只会python，r的算法科学家，其他大多需要你强悍的编码能力，因为没有多余的人力来帮你把算法实践上线，因此编码基础还是第一位。现在很多学生或者工作一两年的年轻人，都想做机器学习，去看一堆书但是没深入，没理解透彻，实践就是跑一个sklearn，认为这样就是机器学习算法工程师。由此而忽略了数据结构算法基础，工程项目实践，面试时体现出糟糕的编码能力和业务理解能力。我认为实践经验是加分项，掌握几个经典模型并有过实践。如果是校招你有大把的时间去理解原理并尝试自己工程实现，从单机到并行，去理解透彻。如果是社招，除了基础原理，我认为以往的模型算法实际经验，解决问题的能力更重要。当然了，这种观点也许只适合我们是小公司。", "answer_votes": "3", "answer_comment": "​添加评论"}
{"answer_author": "子楠", "answer_id": 150346748, "answer_text": "你就说你做过的项目，在项目中如何和队友协作，设计了哪些方法处理异常值就够了。你要装逼的话最好针对如何分析数据，找到方法能够利用机器学习为公司的业务做出提升（比如帮某公司的健康设备设定出预测对客户体型变化（减肥）的最佳的当日锻炼时间）。至于你工作内容，大部分时间模型全是调包，挨个试……大部分时间都在清洗数据，你要不是大牛也涉及不到数学上去解决算法，工作中你最多也就是卖个萌用np.eye()来做one_hot encoding，也是自己看着清爽。至于你如何理解卷积的物理意义,你做NLP时对LSTM和GRU的比较和使用，谁TM在乎。", "answer_votes": "6", "answer_comment": "​添加评论"}
{"answer_author": "王刚", "answer_id": 151014291, "answer_text": "我觉得题主的意思是，假如自己干货已经足够了，那么在面试中知道哪些装逼的点、技巧或者方式，比较有可能锦上添花、克敌制胜呢？所以，我认为：1.  机器学习中可以装的逼，和其他领域相比，也没有什么特别的，所以推荐花点时间，研读一下：《假装的艺术》（美，劳伦斯 怀特德）链接：http://pan.baidu.com/s/1kV4ZzRx 密码：hnru万变不离其宗，一通百通，融会贯通2. 面试场合装逼，和其他场合最大的区别是，你需要征服的是HR的口味——也就是说，他们需要什么，咱们就给什么！具体而言，李委员领导下的百度，可能比较喜欢技术细节的装逼，所以是不是AI独角兽的视野分析，更能征服在场的考官们？马主席笼罩下的阿里，可能比较喜欢运营思想的出色，所以是不是阿里帝国大杀四方流芳百世风格的演讲，更能get到G点？小马哥执掌的腾讯，可能比较喜欢通过产品致胜千里，所以是不是QQ和微信之后，物联网和5G时代新一个独领风骚的产品创意，比较惊艳？任大教主统领下的华为，可能比较希望能够在长长久久地把产品销售到南北极等每个角落，所以是不是如何发挥狼性文化早日将菊花企标映照到外太空的宏伟计划，更能狗脱颖而出呢？…… 不一而足，因地制宜，随机应变。好运！加油！", "answer_votes": "7", "answer_comment": "​4 条评论"}
{"answer_author": "匿名用户", "answer_id": 151133193, "answer_text": "唉只是想面个实习生各位大佬至于这么为难我们吗", "answer_votes": "9", "answer_comment": "​2 条评论"}
{"answer_author": "张明锋", "answer_id": 149944432, "answer_text": "世界顶级的机器学习大会的best paper award.现在难道到了人人都能做机器学习的地步了？还是公司跟风导致的“人才”需求巨大？退而求其次之也是在kaggle中拿过前100名的名次吧。", "answer_votes": "4", "answer_comment": "​18 条评论"}
{"answer_author": "匿名用户", "answer_id": 151341183, "answer_text": "保研面试的时候，装了一个X后某导师当场放了offer（当然，本宝宝最后没有选择该校）。老师跟我聊他现在正在做的一个项目，他说现在这个项目遇到一个问题，就是用统计机器学习的方法做出来的模型的漂移现象严重。具体的项目不能透露，但是意思就是用当前时间和场景下采集的数据集训练出的高精度模型，放到其他看似相同的场景就会表现很差，甚至同样的场景随时间推移而导致模型越来越差。问我解决思路。然后本宝宝“老师，我觉得您这个项目根本不需要机器学习技术”老师：&lt;img data-rawwidth=\"198\" data-rawheight=\"191\" src=\"https://pic4.zhimg.com/50/v2-61023b9dfcf4678d8cb44e070278299f_hd.jpg\" class=\"content_image\" width=\"198\"&gt;hhh当然不是单纯为了装x而装x了，那样就无法圆场惹。其实现在有一些人给我的感觉是“为了用机器学习而设计方案”，而且竟然会发生在大学里，而且这样的课题竟然申请通过了。由于不能透露项目信息，感觉讲的好假大空啊(´Д` )总之意思就是，在工程上，第一重点不是该用哪个机器学习模型，而应该是任务本身的结构。所以在面试中考察工程中的机器学习问题是，与其将各种高大上的前沿算法/模型往任务上生套，还不如先分析一下这个任务本身的复杂性和先验知识。-------还有个装X失败的例子。大学里想找个实习的时候，去了一家小企业面试。面试官让我讲讲贝叶斯定理的时候，我在纸上随手写了个P(A)P(B|A)=P(B)P(A|B)结果还没等我开口，面试官就说写的不对。我说：“这是对的，将左边的P(A)移到右边之后就是常见的形式，实际上大部分问题中P(A)也不用展开成全概率的形式”面试官：“你这写都写错了，再回去考虑考虑吧”_(:з」∠)_对于该面试官我实在不知道该说什么...反正以后面试时，还是先把传统的东西讲了，再讲带有装X性质的东西吧...", "answer_votes": "9", "answer_comment": "​28 条评论"}
{"answer_author": "yongning1984", "answer_id": 165831644, "answer_text": "其实我们不需要您装逼，我们只想听“上一个项目中我们通过xxx分析结果，相应的我们做了xxx，所以最后结果提升了xxx，对于business的impact有xxx”这样就可以了。手推公式跟手写代码，我确实都被考过，可是我不会拿这个来判断一个人行不行，毕竟公式这种东西到处都有的抄，可是碰见问题如何解决以及对于问题的impact有没有sense才重要嗯，很无聊，一点都不高大上，不过这就是业界的现实了。", "answer_votes": "3", "answer_comment": "​1 条评论"}
{"answer_author": "机械键盘侠", "answer_id": 151515326, "answer_text": "不要回答，这是HR和技术面试官挖的坑", "answer_votes": "3", "answer_comment": "​1 条评论"}
{"answer_author": "匿名用户", "answer_id": 151038733, "answer_text": "玩虚的只能减分呢", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "csyr peng", "answer_id": 150386821, "answer_text": "我觉得，机器学习的难点和重点都在数据上，监督学习，无监督学习，模型测试，风险函数，损失函数……都离不开数据，所以如何分类定位数据就尤为重要了", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "小丑鱼", "answer_id": 237538741, "answer_text": "作为一个去年秋招时候极力想挤进机器学习领域岗位的自己，想来回答一波。自己因为从本科开始都是电子通信背景（就是焊板子，测板子）专业的学生，研二出去校外实习才接触到机器学习这块，感觉特别有意思，就自学了吴恩达的经典机器学习课程，李航的《统计学习方法》，在ieee上发表了一篇包含机器学习算法的论文，后来毕业论文开题也是关于HMM和svm相结合的动作识别课题，作为一个之前对机器学习一无所知的人，才开始在脑子里开始建立一点对机器学习的认识。在此，多谢实习过程中老板和同事对我的支持，让我看到了更大的世界。后来，根据自己不断的了解，又了解了深度学习，数据挖掘，推荐系统，大数据spark框架等知识框架，才对整个大数据，互联网，人工智能这些名词有了一个初步了解。但由于自己走入此神秘大门的时间还不长，好多技术还需要更多的时间和机会去研究和积累，所以，最终找的工作并不是自己特别心仪的平台，但有相关性，我已经很庆幸，因为，我已经迈出了第一步。废话少说，根据自己失败或者成功的经验，下面说一下自认为找工作或者面试过程中的加分项吧：（1）心平气和。状态很重要，这不仅关乎面试官对你的初步印象，也关乎你自己在面试的过程中能不能思绪流畅的知无不言言无不尽，平和的心态让人更加的自信，真的有一种你和面试官在一种平等的位置上，双向选择，相互交流。（2）表达。有时候，人们总说，工科生亦或是程序员一般表达能力偏低，你千万不要相信，他们说的生活中，在面对面试官，对于你有发言权的知识和技术的时候，你应该是思路清晰，毫无束缚的，充满热情与活力的表达和交流。（3）对技术细节的掌握。其实面试官真正看中的并不是你和别人一样都知道某个知识点，某个院里，都刷了某题，都能把算法推倒出来。。。。他们更关注的是，你知不知道如何处理特殊情况，比如，大家都知道SVM的分类原理是使间距最大化，但你知不知道出现在距离边缘上面的数据怎么处理？别人都知道分类效果可以通过ROC,AUC来度量，但你知不知道通过ROC,AUC还可以对类别用来排序等等，就是说你不光要了解算法，还要知道怎么用，知道怎么用后还要知道某些遇到的特殊问题的解决办法细节，还要知道更广泛的应用。就是要在某个你解决的问题上精益求精，有自己的想法，解决方案和见解，不要不求甚解，马马虎虎。（4）对自己做过项目的熟知。有些面试官只是通过你做过的某个项目进行考察，就可以知道你对知识的掌握，同样，不要像叙述流水账一样的去描述项目，而是要抓住重点，特别是你负责的那部分，要详细的说，你做了什么，遇到问题怎么解决的，有什么问题没有解决的，其实这时，如果面试官很懂，也可以就自己迷惑的地方交流一下，有时候会有以外的收获，如果你分析的很到位，这个不会起到坏的影响，反而让面试官觉得和你配合交流很舒服。（5）好好写代码。因为机器学习岗位涉及的知识面比较多，数学，统计学，数据结构等，一般代码写的6是基本要求，如果代码写的周密又很有思路，真的很加分。先这样吧。。。吃饭去。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "钢的弦", "answer_id": 152327556, "answer_text": "Kaggle Master，BAT实习，顶会paper，Keras contributor", "answer_votes": "0", "answer_comment": "​2 条评论"}
{"answer_author": "杨傻大", "answer_id": 152099506, "answer_text": "认识寇神算不算？", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "yeoman", "answer_id": 152098542, "answer_text": "认识寇神算不算?", "answer_votes": "0", "answer_comment": "​1 条评论"}
{"answer_author": "本体匹配调谐", "answer_id": 151507262, "answer_text": "数据挖掘竞赛名次", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 151261410, "answer_text": "我想问问，机器学习面试的大都是什么学历？本科机器学习 有人要吗？（小二本）", "answer_votes": "0", "answer_comment": "​2 条评论"}
{"answer_author": "匿名用户", "answer_id": 151076847, "answer_text": "嗯，你刚才说的是tensorflow吗？我刚混上contributor，你可以去查查我的id，可能你们用过我写的代码也说不定。额你说的这个问题，你可以去瞅瞅那部分的文档和代码，我上周刚提交的comment被接受了，正好改了你说的问题。哦你说这篇论文啊，你看那个第一作者的名字是不是xxx，那是我的简写，我不太喜欢用英文名发论文，但是中文拼音太长，哦你说这个地方有点看不明白吗，是这样的，你说代码吗，这你得找我老板要了。有顶会，有工程，什么都好说", "answer_votes": "3", "answer_comment": "​2 条评论"}
