{"question_id": "60885598", "question_text": "希望各位同学对考生负责，真实反映学校情况", "question_title": "你为什么不推荐高考考生报考华中科技大学？", "question_commet": "​15 条评论", "answer_number": "154 个回答", "question_followers": "413", "brower_number": "268,295"}
{"answer_author": "匿名用户", "answer_id": 182724278, "answer_text": "谢邀。在我看来，这道问题没有丝毫不妥。看了已有的回答，爱校之心可以理解。但爱一所学校，并非不允许别人说一句坏话，甚至看到相关问题就急着跳脚；而应该理性面对这所学校的优缺点，将学校真实的一面展示给别人。这是对学校的负责，也是对即将成为新HUSTer的学生负责。还有许多校友，实在没有必要把问题上升到 「司马懿之心」的高度。你若理性介绍这所学校，别人自然会对你刮目相看；反倒是阴阳怪气地质疑问题，让人对华科学子的人文素质有了较大疑惑。为什么我不推荐高考考生报考华中科技大学：学习压力较大，如果想要取得较好的加权成绩可能要每天刷题泡图书馆；名声不够响，尤其在北方地区，很多人并不知道华中科技大学是一所一本学校；男女比例感人，男生想要脱单会比较有难度；经常停水停电，影响正常生活；部分文科院系存在感不高；排名较高专业如机械光电等就业形势较差，容易被忽悠入坑；校园外是万年修不好的光谷广场，假期出游可选择的地方太少；人文气息较差，不要和我说什么人文讲座，一个学校的人文气息不是靠一个讲座就可以撑起来的；学生太多，对学生每个人的关怀分摊下来就稍微少了些。当然，华科也有很多优点：华科学生大多低调务实，如果想认真学习度过大学四年，这里是很好的选择；活动丰富，只要你愿意，你完全可以把大学过得多姿多彩；食堂很多，饭菜非常好吃；互联网氛围浓厚，跟得上时代潮流；创新力极强，如果有创业想法华科会很适合。启明学院的创新团队为学生提供了一个非常好的创新平台，我认为国内无出其右者；校园非常大且是一个大校区，满足你的对大学之大的幻想；科研导向，科研平台非常多，科研实力也很强；工业界校友极多，且有大量企业家校友；性价比在同档次学校中很高。上面只是临时想到的几点的简单罗列，还是那句话：爱一所学校，并非不允许别人说一句坏话；而应该理性面对这所学校的优缺点，将学校真实的一面展示给别人。欢迎考生对未来有清晰规划后报考华中科技大学。以上。", "answer_votes": "284", "answer_comment": "​2 条评论"}
{"answer_author": "捉飞机", "answer_id": 182794188, "answer_text": "来说几个华科特别有意思的现象1. 华科帮帮忙 这是由华科互联网团队冰岩作坊开发的一款服务型产品，你可以在群里找人帮你做任何事… 拿快递、带饭、带点名等等等等。发展到如今，已经有八个联动的大群，由微信机器人小二负责运营。顺路类的产品很多见，但是通过稳定的微信群解决学生即使需求的校园产品还是比较少，挺酷吧？不过，如果你来华科了，有这么方便的小二，说不定会越变越懒，所以我建议你别来。<img data-rawheight=\"1334\" src=\"https://pic2.zhimg.com/50/v2-603f889d99d4d252667e970d4af166d9_hd.jpg\" data-rawwidth=\"750\" class=\"origin_image zh-lightbox-thumb\" width=\"750\" data-original=\"https://pic2.zhimg.com/v2-603f889d99d4d252667e970d4af166d9_r.jpg\"> 2.iKnow华科公众号之前是不是觉得华科很土？都是理工科生很呆板？很无趣？ 可是 真相是 华科人太骚了 以iKnow华科为代表的华科人，骚气要冲破全国。比如，他们拉着一群华科男女搞了渔网袜穿搭大赛。<img data-rawheight=\"385\" src=\"https://pic1.zhimg.com/50/v2-32b309ccfc209fd05cc5821f41f87347_hd.gif\" data-rawwidth=\"640\" data-thumbnail=\"https://pic1.zhimg.com/50/v2-32b309ccfc209fd05cc5821f41f87347_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"640\" data-original=\"https://pic1.zhimg.com/v2-32b309ccfc209fd05cc5821f41f87347_r.gif\"><img data-rawheight=\"533\" src=\"https://pic4.zhimg.com/50/v2-d8d2cf3d958c33d38c7869745a757c36_hd.jpg\" data-rawwidth=\"800\" class=\"origin_image zh-lightbox-thumb\" width=\"800\" data-original=\"https://pic4.zhimg.com/v2-d8d2cf3d958c33d38c7869745a757c36_r.jpg\"><img data-rawheight=\"1143\" src=\"https://pic1.zhimg.com/50/v2-990d7a7594380c568ae31e19e3eee727_hd.jpg\" data-rawwidth=\"800\" class=\"origin_image zh-lightbox-thumb\" width=\"800\" data-original=\"https://pic1.zhimg.com/v2-990d7a7594380c568ae31e19e3eee727_r.jpg\"><img data-rawheight=\"1200\" src=\"https://pic4.zhimg.com/50/v2-e7edf89209a391cb4839c3dc6cd767b7_hd.jpg\" data-rawwidth=\"800\" class=\"origin_image zh-lightbox-thumb\" width=\"800\" data-original=\"https://pic4.zhimg.com/v2-e7edf89209a391cb4839c3dc6cd767b7_r.jpg\">敢不敢相信？？下面这个是男孩子是货真价实的男孩子 华科的男孩子 <img data-rawheight=\"1200\" src=\"https://pic4.zhimg.com/50/v2-30bea977f9f6e202daa287573d8462ca_hd.jpg\" data-rawwidth=\"800\" class=\"origin_image zh-lightbox-thumb\" width=\"800\" data-original=\"https://pic4.zhimg.com/v2-30bea977f9f6e202daa287573d8462ca_r.jpg\">所以说，如果你心理承受能力太弱，还是别来了。这群人太会玩。3.食堂 来华科 一年胖十斤不是梦 <img data-rawheight=\"768\" src=\"https://pic2.zhimg.com/50/v2-ac160e9371018703c787a61c6326b485_hd.jpg\" data-rawwidth=\"960\" class=\"origin_image zh-lightbox-thumb\" width=\"960\" data-original=\"https://pic2.zhimg.com/v2-ac160e9371018703c787a61c6326b485_r.jpg\"><img data-rawheight=\"959\" src=\"https://pic4.zhimg.com/50/v2-955884dad63302324ec07ff719cd1cea_hd.jpg\" data-rawwidth=\"1280\" class=\"origin_image zh-lightbox-thumb\" width=\"1280\" data-original=\"https://pic4.zhimg.com/v2-955884dad63302324ec07ff719cd1cea_r.jpg\"><img data-rawheight=\"1002\" src=\"https://pic2.zhimg.com/50/v2-58bfe59d64aaba0ef92275e9fe283550_hd.jpg\" data-rawwidth=\"1280\" class=\"origin_image zh-lightbox-thumb\" width=\"1280\" data-original=\"https://pic2.zhimg.com/v2-58bfe59d64aaba0ef92275e9fe283550_r.jpg\"><img data-rawheight=\"800\" src=\"https://pic2.zhimg.com/50/v2-fe54857f3d83dae9399df0643ff78793_hd.jpg\" data-rawwidth=\"800\" class=\"origin_image zh-lightbox-thumb\" width=\"800\" data-original=\"https://pic2.zhimg.com/v2-fe54857f3d83dae9399df0643ff78793_r.jpg\"><img data-rawheight=\"776\" src=\"https://pic3.zhimg.com/50/v2-ff61931f3d0cd9e8f3849f6061870985_hd.jpg\" data-rawwidth=\"1280\" class=\"origin_image zh-lightbox-thumb\" width=\"1280\" data-original=\"https://pic3.zhimg.com/v2-ff61931f3d0cd9e8f3849f6061870985_r.jpg\">总之，来这里你会变骚 变懒 变胖 嘿嘿嘿 说实话 华科值不值得报我们每个人都不能给出客观的建议毕竟我们都只上过华科的本科… 不知道同档次其他学校本科怎么样只能说 华科不完美 但也有很多很多很多会让你留恋的地方 顺其自然吧 过自己想要的生活不辜负自己的每一次选择  http://weixin.qq.com/r/PEP745DExs25rdSA9xYu (二维码自动识别)", "answer_votes": "67", "answer_comment": "​24 条评论"}
{"answer_author": "坤Abraham", "answer_id": 181935999, "answer_text": "我们不推荐华中科技大学，是因为那里的学生太过低调，太认真学习而减少了娱乐，我们不推荐向往张扬青春的同学报考，因为这里不适合你。我们不推荐华科，是因为它对自己的学生要求很高，老师上课太过认真，考试太严，让你不得不学习，在这里混四年太难，所以不适合你。我们不推荐华科，是因为这里的学霸太多，虽不比清北华五却依然让你有些被碾压的感觉，这里学风太浓，图书馆总是人满为患，所以不适合你。我们不推荐华科，是因为它总会出一些大新闻，弯了的前主席，反同与顶同的争执，这里的工科男竟然没有默不作声，竟然理性的去反思去看待问题，真是奇怪。这里不是一个适合搞大新闻的地方，或许不适合你。我们不推荐华科，是因为这里夏天积水，全年时而停水。学校一直被吐槽，每年修修补补，依然做得不够好。即使我们看得到学校的努力，即使领导能听到不一样的声音，我还是不推荐它。我们不推荐华科，是因为这里的人文气息太少。每周的人文讲座竟然会爆满，余华来讲座排队竟然绕了报告厅一圈，校园文化节这么多僵硬的活动竟然也会有很多人参加，这里的人文气息不够留住你。我们不推荐华科，是因为这里的道路笔直，树木太高大以至于遮住了阳光，这里缺少美丽的建筑，60年出头的校史也没啥底蕴，整个学校充斥着面向互联网时代编程的浮躁。它太过功利地追求机械上的完美，或许也不适合喜欢柔美的你。我们不推荐华科，是因为它有着7000亩土地，80万课树，太大太大，东西长四公里，韵苑和紫菘成为了异地恋，走路太费劲，只能骑车穿越校园。这里太大，也不适合喜欢小而精致的你。我们不推荐华科，是因为这里的团队太多，dian，联创，冰岩，电工基地，机器人，各种各样的启明团队让你眼花缭乱，他们严苛的招人规则又让你望而却步。这里的选择太多，或许也不适合你。我们不推荐华科，是因为这里的校友名字不够响，微信之父张小龙也不过只是腾讯的副总，天才李一男竟放弃了百度继承人搞起了电动车，那些一出校门就创业的人竟然也没冲进胡润前十。这里的年轻人太踏实，只会搞技术，玩不了权势，或许也给不了你需要的。我们不推荐华科，是因为武汉是最大的县城，不靠海也没啥好风光，每天不一样，却在经受城市崛起的阵痛，2049太远，我们早都毕业。武汉的野心太大，或许不适合喜好安逸的你。我们不推荐华科，是因为这里的华科男太沉稳太踏实，热爱运动，醉心学习和科研，和女生说话就脸红。话少，钱多，死得早。不会约炮的男人有什么出息？你一定看不上的。我们不推荐华科，是因为我们知道它很好，而我们喜欢低调而不爱炫耀。不推荐不代表就要黑他，推荐也不见得就认为它完美。我们不推荐华科，是因为我们知道它还有很多很多不足，泼水节被人诬陷就不敢办了的校领导，怎么修也会见到的东九海，还有那让人爱不起来的武汉。可是我们依然爱她呀！我们每天都能看到她在慢慢变好，越来越多的活动和讲座，越来越美观的校园，努力讲课和科研的老师，身边热爱学习却很会浪的小伙伴，还有仍然努力倾听学生声音的领导。至少我们知道，她一直在努力，从未放弃！如果高考可以重来，我或许会去尝试其他的学校，比如一个财经类大学治治我的单身病。但是我依然会推荐你来华科，因为它真的很man又很人性，它的潜力还很大，它能给你你想要的一切！并非怼提问者，大学四年，总有那几段时光让你对母校生无可恋，无可厚非也可以理解。可当我们毕业回首时，我们也会发现，其实，她真的很好，我们也真的很感激！青春那么美好，既然来了，干嘛悔恨呢？向前看，发掘学校的美，我们可以经历非常美好的时光！（＾∇＾）&lt;img data-rawheight=\"640\" src=\"https://pic2.zhimg.com/50/v2-844a66d1a3d5dc7710abd6d3ade992a3_hd.jpg\" data-rawwidth=\"640\" class=\"origin_image zh-lightbox-thumb\" width=\"640\" data-original=\"https://pic2.zhimg.com/v2-844a66d1a3d5dc7710abd6d3ade992a3_r.jpg\"&gt;", "answer_votes": "585", "answer_comment": "​152 条评论"}
{"answer_author": "Eidosper", "answer_id": 183110568, "answer_text": "如果没有自制力的话，四年你会吃成猪的我给你讲！", "answer_votes": "25", "answer_comment": "​19 条评论"}
{"answer_author": "刘昱杰", "answer_id": 184861800, "answer_text": "怎么讲呢，我是华科16级的机械学院在读，我当年上华科是因为报同济分数差了一点点滑档了。我只讲我自己的情况，希望大家理性看待。我作为一个从小到大不怎么爱学习的学生，对书本没那么多兴趣，读书不为出人头地，只为不给家里丢人。高中前两年基本在混，因为爱上了单车，当时在疯狂地练车，也曾经有还不错的车队主管找我谈过，但家里反对，最终没能走成职业车手的路子。在学校很混蛋，打架，喝酒，除了抽烟什么坏孩子干的事情都干过。(抽烟伤肺，我对身体还是很在意的)到了高三，当时想从家里拿点钱出去混社会，后来想明白以后别人议论起来说刘家的小子是个混子连大学都没上过实在让家里没脸，于是好好念了一年书，高考考了大概省里八百多名，来到了这个学校。到学校之后，首先面对的是一个北方人对气候的不适应，潮湿，多雨，被子在窗户外面晒着好好的收晚了就成湿的了。其次是与人相处的问题，大家都很乖很安静看起来也很友善，但我有时候会觉得少了朋友之间应该有的亲热。我的社交圈子仍然以北方人居多，除了生活中几位聊得来的同学，其余酒肉朋友都是在训练比赛中认识的。(我还在骑车，还在坚持训练和比赛，只不过已经放弃职业路线了)在学校里偶尔作为一个通达的北方人被别人耍心眼伤心伤到体无完肤，不过现在没有了。大家都在认真学习，但一部分人并没有开阔的视野，不明白自己要追求什么。环境有一点压抑，少有人陪我喝酒。(这个是我个人原因)至于劝人别报华科的问题，有的人是考上了本来就喜欢的华科很为学校感到骄傲，于是像高票答案那样写一大段赞美学校的话。华科好吗？吼啊真的好到那个地步吗？我没这个感觉所以我不劝那些和我一样的高中毕业生报考华科。我个人以及朋友认为我是一个社会生存力远远强于校园生存力的人。像我这样的人，我可以明确地告诉你。你不适合来华科混这个道理是我来了以后才悟出来的。我从小到大，除了训练比赛还干了很多事情，喜欢摇滚所以当过鼓手，为了装逼写过段子，犯文青病骑单车进藏，学马术，玩摩托，登山，漂流，没列出来的都是水平不精装逼装不好的。还有喝过很多种酒爱好很多，有的领域有点能力，而念书，恰恰是我不太擅长的那一项读书可以被看做全中国最公平的一个行业，任何人都拥有通过学习知识改变社会阶级的可能性。所以，读书也是全中国竞争最惨烈的一个行业我保留知难而退的权利，但在华科，这样不是很容易。所以我劝那些已经认定和自己我差不多的人，如果你是一个成年人，有做决定的能力，别报华科。话说回来我17岁高考的，当年填志愿还是太年轻，naive……………………………………………………………………写在四级考试前夜，明天还是很随意的…………………………………………………………………………写了不少主流价值观眼中的负能量，但知乎上认识我的都是熟人，就不匿了，如果你不信我写的这些话，我的ID是真名，头像是本人，在我离开华科以前来找我。很赞同前面一个校友本拉希的回答https://www.zhihu.com/question/60885598/answer/182921007?utm_source=qq&utm_medium=social …………………………………………………………………………写这个东西是给也许有的同路人看的，如果你不是，用大拇指向右划，看下一条去", "answer_votes": "68", "answer_comment": "​107 条评论"}
{"answer_author": "本拉希", "answer_id": 182921007, "answer_text": "容易陷入两种极端，一种是永远高三，然后出来之后发现自己成功达到了一颗重要棋子的完美要求，一种是永远大一，出来之后发现自己无棋可走。局外人，局外人", "answer_votes": "47", "answer_comment": "​6 条评论"}
{"answer_author": "J.Vessalius", "answer_id": 181901598, "answer_text": "停电时的西十二教学楼...╮(╯▽╰)╭<img src=\"https://pic3.zhimg.com/50/v2-3969f24b8b29171c1070b869492c5865_hd.jpg\" data-rawwidth=\"1440\" data-rawheight=\"1080\" class=\"origin_image zh-lightbox-thumb\" width=\"1440\" data-original=\"https://pic3.zhimg.com/v2-3969f24b8b29171c1070b869492c5865_r.jpg\"><img src=\"https://pic2.zhimg.com/50/v2-84656320bd195fdd3e4d9e8763e8fa5c_hd.jpg\" data-rawwidth=\"123\" data-rawheight=\"108\" class=\"content_image\" width=\"123\">—————————————————————————(下面原回答)因为我科每年招的人实在太多了<img src=\"https://pic4.zhimg.com/50/v2-bc740404bcbea3d5faa71e964a9b4c78_hd.jpg\" data-rawwidth=\"850\" data-rawheight=\"92\" class=\"origin_image zh-lightbox-thumb\" width=\"850\" data-original=\"https://pic4.zhimg.com/v2-bc740404bcbea3d5faa71e964a9b4c78_r.jpg\">这是华科2016届本科毕业生，共7064人（顺便纠正一下：华科男女比没有那么夸张啦，作为一个工科强的综合大学还是不错滴！）<img src=\"https://pic4.zhimg.com/50/v2-396456261bcd838df99455a81e9e8692_hd.jpg\" data-rawwidth=\"948\" data-rawheight=\"193\" class=\"origin_image zh-lightbox-thumb\" width=\"948\" data-original=\"https://pic4.zhimg.com/v2-396456261bcd838df99455a81e9e8692_r.jpg\">这是中国科学技术大学的，2015届本科毕业生共1675人听说朱清时任校长的时候每年招生人数更少，不到1000，那时候中科大发展极快所以可以感受一下教育理念的差距人多，就容易被埋但是你如果足够优秀的话，在华科，你也能拥有不输于任何一所中国Top7以后大学的资源—————————————————————————突然想到人多有一个好处...出国申请时排名的比例会很好看(逃", "answer_votes": "23", "answer_comment": "​21 条评论"}
{"answer_author": "千叶", "answer_id": 187699769, "answer_text": "答主当年填报志愿时，“学风好”是我选择华科的重要一点，现在看来，当时的我之所以如此决策，一是潜意识里有在我们高中广泛存在的歧视文科，崇拜理工的思想；二是大学生堕落四年的新闻常常见诸报端，导致我产生了“学风好的大学至少可以保证我不堕落，同时间接反映了学校管理的严格，是认真负责的好学校”的认识；如果深究一番，还和我成长的家庭氛围对我的潜移默化有关，在我的家人及亲戚中以教师，工程师，医生居多，他们当年多是典型的好学生，崇尚“吃得苦中苦”的价值观。在大学中，我经常问周围同学为什么选择本校，但凡严肃回答的，都或多或少地涉及到上述三点，他们和我有相似的心路历程。现在看来，这三点之间存在很强的内在联系。歧视文科，推崇理工的氛围间接反映了本地的经济和文化实力（文科水平更能体现地区教育资源的差异），崇尚吃苦，勤奋和不堕落等价值观，也体现了职业特点偏向于保守，规矩。根据华科2015年的就业报告显示，华科生源主要来自于湖北（37%），河南（7%）和湖南（7%），江西（6%），毕业去向为制造业和信息及软件行业的超过半数，而加上社会对华科的普遍评价，更能印证这种联系。然而，经历大学后，我并不觉得华科的校风真有那么好，如果挂科率高也能证明学风好的话。从专业角度出发，许多考试压根不能反映出学习能力，很多题目多年不换，使得学生几乎不需要平时听讲，考前猛刷几天的题目便可混过，改卷也十分随意和不规范，这伤害了真正喜欢本专业学生的积极性，也让许多学生觉察到了考试的无意义。在这种情况下，挂科率高只能说明大家不愿意为之认真准备，一些人玩脱了而已，不要安慰自己是管理严格了。同时照本宣科念PPT的老师比比皆是，只管招人不管培养。从通识教育的角度出发，中学阶段的教育本质上是选拔性功能（给人分层）而非教人真正有用的知识，这导致了经历过高考的学生在探索自我和通识教育，情商教育是十分匮乏的，此刻他们最需要的不是再回归到应试，而是开拓视野，补充必要的通识教育。但多年的应试文化，加上学校制度使得华科形成了这样一种以学霸/学渣为符号的场域，而这套评价系统完美地承接了高中生在意权威评价，用成绩衡量一切的旧有模式，看似很和谐，但学生的精力是有限的，一个人如此在意成绩，必然不可能花很多时间探索自我，因为反省自我需要较长思维链，而探索自我（自知力）在当今变化迅速的社会里是一种宝贵的资源。（提人文类讲座的可以看看这样的活动绝对处于弱势，而且通识教育也不是靠几个讲座几场活动就能带动起来的，学校在这件重要事情上花费的成本十分不均等。）其实，学渣和学霸的粗暴逻辑，同时误导了两拨人。“学渣”们自我评价很低，而负能量过大的人，根本没有精力研究新事物，也没有人告诉他们该做什么；而“学霸”也被这个标签所限制，沉没成本过高，导致不敢做可能掉成绩的事情，因为他们对跌出“好学生”有一种深入骨髓的恐惧，而人们偏爱贴标签和本质主义的归因方式，喜欢给微弱的偶然波动做出貌似深刻的解释，也使这种恶性循环不断持续。实际上成绩好根本不能等于专业能力强（工科尤其如此），如果寻求在专业道路上有所发展，那么最应该做的是探索自己适合何种方向（科研/工程？）以及各方向的人才需求和标准，然而极少有人能说出来各方向于己而言的利弊得失，甚至连了解的兴趣都没有，他们选择了一条最省事的路-考试。如果一个大学生临毕业时仍然对专业的排名津津乐道，说明他对专业的认识仍然停留在高中阶段。说到这里，你还觉得树多，食堂多，校友牛逼，排名是选择大学的重要因素么？最后，对于即将报志愿的考生来说，一个简便的方法是问自己：你最骄傲的事情是什么？如果你过去的成就感更多来源于自发性的活动，你的自我评价更多的是创意和丰富而非吃苦勤奋，那么请你不要来一所学风很好的大学。", "answer_votes": "95", "answer_comment": "​51 条评论"}
{"answer_author": "知乎用户", "answer_id": 185159688, "answer_text": "我不推荐【学弟】报华科，学弟去武大更好。学妹来华科更好。", "answer_votes": "17", "answer_comment": "​2 条评论"}
{"answer_author": "Leo Blunt", "answer_id": 182406827, "answer_text": "我不推荐华科 是因为这所学校的学生都要期末了还在图书馆门口办音乐会。&lt;img src=\"https://pic4.zhimg.com/50/v2-833885e6d3c53ece0f2b02a273f38082_hd.jpg\" data-rawwidth=\"2048\" data-rawheight=\"1536\" class=\"origin_image zh-lightbox-thumb\" width=\"2048\" data-original=\"https://pic4.zhimg.com/v2-833885e6d3c53ece0f2b02a273f38082_r.jpg\"&gt;我不推荐华科，是因为这所学校办音乐会就算了还只请胡咏言这样级别的指挥。我不推荐华科，是因为他演出演1812就算了，还不用加农炮演。我不推荐华科，是因为琴台的音乐实践行只派了三台大巴，就100多人去。华科这么差的艺术氛围，千万不要来。利益相关：16级华科学生", "answer_votes": "39", "answer_comment": "​33 条评论"}
{"answer_author": "Fernweh", "answer_id": 217664823, "answer_text": "     近几天和招办的老师聊到，为什么我们学校硬实力上比武大要厉害，各种数据，人才引进也比武大要好，文科新闻，社会，公管，经管，理科物理发展飞快，工科医科很强劲，但是就是分数线差武大那么一些，而且外界也觉得我们学校和武大差一些。   老师分析了一下几点：  1.华科出身的校友太过低调，在社会上很少出头露面，相对于武大的雷军，陈东升，我们的优秀校友如微信创始人张小龙，信中利的汪潮涌，以及海康威视三位掌门都是那种低调到骨子里的人，确切地说，是学校的气质使然，校友之间非常团结，却又普遍低调，在这个信息发达，舆论爆炸的时代，校友效应没有打出来，那么在人们看来，就会相对于隔壁的大肆宣传差一些，但是事实上是，如果你去参加面试，面试官很可能就是你的校友，并且校友之间纽带感强烈，总结来说，华科的校友普遍低调但是关系很好，舆论曝光度低，但因为太过低调，人们很难知道哪位是华科著名校友。2.建校时间短，校名普遍，且偏理工，缺少自身特色，相对于之前的网红李培根校长，泼水节，涂鸦墙，现如今的华科缺少一种独立于其他学校的特色，诚然，创新创业，学在华科这是学校要打造的品牌，但是在育人，情怀上缺少太多，刘玉老师说，我们华科人是做实事的，不像隔壁只讲情怀，但是放在如今遍地开花的大学身上，我们确实缺少了一些为之骄傲自豪，与众不同的东西。3.校园建设，主校区确实很有那种80年代的大学的感觉，方方正正的路，一幢幢苏式建筑以及昏黄的路灯，有那种上世纪末校园爱情片的氛围，但是缺少地标性建筑，别说毛爷爷，四年顶个球，实在看不下去，这点，跟隔壁百年名校的建筑差远了……当然了，现在梧桐雨正在建设，喻家湖科普公园规划中，东校区整体规划正在酝酿，总体上，学校是在改善校园设施的先说这一些吧…晚点更", "answer_votes": "6", "answer_comment": "​9 条评论"}
{"answer_author": "匿名用户", "answer_id": 182135721, "answer_text": "不上702 703就来不了华科", "answer_votes": "8", "answer_comment": "​10 条评论"}
{"answer_author": "艾夫", "answer_id": 183348244, "answer_text": "为什么我不建议你考华中科技大学？1.华科的食堂太多，选择恐惧症会在每一天缠绕着你，让你心神不宁。2.华科的树太多，有时候想要晒太阳，却经常被树荫挡住，气死人了3.华科的工科不太行，清华和上交是更好的选择4.华科的面积太大，你会经常迷路，从东边去一趟西边累死人5.华科教学楼和图书馆太大，要走到教室自习室花的时间太多，一本书找半天，烦死了，而且进去图书馆必须带学生卡，太麻烦。6.华科的教室空调太凉，容易感冒7.华科的课本很多都是自己出版的，网上很难平价买到，暑假不能预习课程，让人难熬。8.华科的课外活动太多，容易分心，不利于学习9.华科的同学来的地方太杂，大多数人不会讲你的方言，你会觉得没有共同语言10.华科旁边有太多娱乐游玩放松的地方，出门右转就是光谷步行街，坐一会儿公车就是珞珈创意城，武汉大学，容易玩物丧志11.华科周边交通不发达，只有西边才能一出门就是地铁站，东边只能一出门就是公交站12.华科的校车不发达，只有从东边直达校大门、东边直达西边、喻园直达校大门三种路线，不能从西边直达校大门，很不方便。13.华科没有晚自习，每天的课太少，最多只有七节课，大多数专业经常三四节而已，甚至没课，不像高中一样固定八节课。14.华科有一些班女生太多，只有几个男生，性别比例失调，不利于身心发展。15.华科保研率太高，挑战性比别的大学低，不开心。所以你还是别考华科了。建议报考关山口男子职业技术学院。", "answer_votes": "29", "answer_comment": "​17 条评论"}
{"answer_author": "超人不会飞", "answer_id": 181871978, "answer_text": "大家都去报考清华北大吧，我科实在太渣了，大家不要来", "answer_votes": "16", "answer_comment": "​5 条评论"}
{"answer_author": "匿名用户", "answer_id": 181956142, "answer_text": "因为不想再多一个没事干就知道挂知乎的华科学子", "answer_votes": "19", "answer_comment": "​2 条评论"}
{"answer_author": "Zoe", "answer_id": 182840248, "answer_text": "不推荐浙江考生来华科。三十四个食堂里没有一个能买得到肉馅的烧卖 差评！武汉的粽子也没有五芳斋的好吃 差评！肉馅的月饼也买不到 差评！食堂的菜放很多花椒和辣椒 差评！", "answer_votes": "14", "answer_comment": "​38 条评论"}
{"answer_author": "王岩", "answer_id": 181815668, "answer_text": "补充一下我的回答。分割线下面是原来回答的内容。现在刚刚高考完，所以大家可能面临选校问题。我作为一个毕业的华科学生，理性分析下华科。先谈缺点：1. 华科在群众中的名气不大。群众不代表企业和学校，意思是如果你去找工作，人家不会不知道华科，如果你保研考研，人家不会不知道华科。但是你跟七大姑八大姨说起你上了华科，可能会没面子，他们很可能不知道。2. 女生少。这也是所有工科学校的弊病，包括清华，上交，哈工大等学校。尤其是你去一个工科专业，很可能班上只有一两个女生。不过是可以联谊的，武大和华师妹子挺多的。3. 周围由于建设噪声比较大。停水问题。经常被淹。这些是因为武汉在重点开发光谷，而华科在光谷的正中心。不过开发了这么多年了，应该快好了吧。等好了就可以享受生活了。4. 同歌同行取消了，泼水节也取消了。感觉学校越来越变得保守了。华小科原来是学生运营的一个微信公众平台，里面内容很学生味，很喜欢。但现在变成了党的宣传平台，我都取消关注了。感觉学校党政管理越来越严格了。这不是缺点哦。优点：1. 很多优质学生团队。包括联创团队，点团队，冰岩团队等等。这些团队可以说是中国领先的，里面大部分人水平蛮高的。出了很多好产品，包括海豚浏览器，卷皮网，贝贝网，恋爱笔记等。我自身是从联创出来的，感觉联创是很极客的那种，好多队友一起组队比赛，一起做项目，一起通宵，一起学技术，感觉蛮好。点的话有刘玉老师带队，接各种大项目，毕业后各种创业，各种bat的offer。2. 有一些强势学科，包括机械，光电，电气，能源，材料，计算机，临床，等。华科的工科是很不错的。医学因为并了同济医学院，也非常厉害。我看到有人回答，机械光电啥的不挣钱。首先我认为不会不挣钱，肯定是比平均线要高的，但如果非要和计算机比，那可能达不到，不过到了后期可能就高了。而且大家选专业主要还是看兴趣，钱我感觉是第二位。我是计算机的，华科的计算机是非常好的了在全国，本科生出来后年薪十几万是很正常的，稍微优秀些，挣到20万以上也很容易。同时保研去清北复交的也很多。出国的嘛，以我们班为例子，有6个，我们班17个人，算不少了。3. 有启明学院，里面会有每个学科的实验班。这个很nice，大家入学后会有一个考试，按照考试成绩会筛选进入实验班。实验班有更好的老师教课，小班教学，内容更难，形式像交大的致远学院和清华的姚班。4. 吃的很不错。食堂比较多，有三十来个，旁边有个光谷步行街，里面好多小吃街。学校里面还有麦当劳。5. 图书馆是新盖的，非常赞，很适合自习。我去过不少学校，感觉华科的图书馆算是最好的之一了。我是说的图书馆里面，它外貌看起来还是蛮丑的。6. 貌似要盖恒温游泳池了。还要盖个创新大楼，非常大的那种。选学校首先还是要看看专业排名，然后再是看看学校的各种氛围和硬件设施。我不赞同那句话 ”本科选学校，研究生选专业“。感觉是在胡扯。如果你不喜欢历史，报了北大调剂到历史了，活的又不好，出来后挣得又少。还不如来华科读个计算机。学弟学妹，有报大学的问题，可以问问我哦。-------------------------------------------------------------------------------------------------------------------------------不明白为什么要问这个问题。满满的恶意。我科怎么了，机械电气临床等都是中国王牌。还有计算机，虽然usnews水，但我科也是排到了世界第11位，也是反映一些水平。不要黑的这么赤裸好不好。为何不报名，推荐报。分数又低，回报又大。", "answer_votes": "59", "answer_comment": "​66 条评论"}
{"answer_author": "NiSS", "answer_id": 182940510, "answer_text": "因为在分数不够的情况下，盲目报考高分学校是会影响前途的。", "answer_votes": "56", "answer_comment": "​8 条评论"}
{"answer_author": "知乎用户", "answer_id": 184045279, "answer_text": "如果是友校提问，那你也太无聊了。如果是考生提问，华科学生回答起来也挺尴尬的。我们毕竟对其它学校不熟，我们有的缺点别人可能也有。我怀念在这里度过的四年时光，想念曾经的同学。但是母校还是有挺多可以进步的地方（1）地处武汉，和北京上海的同学相比，感觉眼界还是要窄一些。这个从整个学校都异常热衷保研就可以看出来。（2）学校管理官本位气息浓厚，你去找基层行政人员办事，你会觉得挺操蛋的。（3）学校教育挺死板：①不能跨学科选课，因为课表早就给你安排好了②有些学院大四还有一堆必修课，这个时候难道不是实习或者准备科研的阶段吗（4）优势学科集中在传统工科，资源太过倾斜，信息学科相对较弱（CS同学别喷。。）（5）我觉得学风没有宣传中的那么好，平时打LOL期末刷题大四清考的现象挺普遍的。当然华科也有很多优点，食堂是最突出的一个！还有一个题外话，我在华科上学的时候，知道了老校长朱九思的事迹，他有一句话“敢于竞争，善于转化”。他在位的时候是华科腾飞的起点。", "answer_votes": "6", "answer_comment": "​6 条评论"}
{"answer_author": "Ada不是爱达", "answer_id": 182023090, "answer_text": "千万别来华科！什么狗屁学校啊辣鸡辣鸡！真的！题主，身为一个华科大二在校生我真的不建议报考华科毕竟少一个人下课买到椒盐小土豆的概率就大一点啊哈哈哈哈！&lt;img data-rawwidth=\"595\" data-rawheight=\"600\" src=\"https://pic4.zhimg.com/50/v2-76119451ab019dd73a5e762a03b14897_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"595\" data-original=\"https://pic4.zhimg.com/v2-76119451ab019dd73a5e762a03b14897_r.jpg\"&gt;", "answer_votes": "16", "answer_comment": "​10 条评论"}
{"answer_author": "很烂很颓废", "answer_id": 188889736, "answer_text": "原答案写的蛮克制的刚发表便觉得 这不是自己喜欢的东西但因为比较客观想看的可以直接往下 主观的想写在前面初中三年 玩两年 初三努力 进了当地最好的（小城市）高中高中三年 高一打球打游戏 高二打球谈恋爱 高三读书 进了华科倘若不是因为进高三受到双重刺激 除了读书无可发泄 怕是也不会那样子读总而言之就是 我对于苦读 对于考高分 对于学术 没那种强烈的渴望 我tm是那种会翘课打球在球场打赤膊不害臊上课想尽办法玩手机的娃娃高三把老子搞懵了毕业了觉得自己能搞搞学术 学学物理学 报了华科光电至今我庆幸的是我在院队结识了一帮最初的 最好的 兄弟伙如下 &lt;img data-rawwidth=\"1280\" data-rawheight=\"720\" src=\"https://pic4.zhimg.com/50/v2-2e06bb717195c46d9f14e36298db7bca_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"1280\" data-original=\"https://pic4.zhimg.com/v2-2e06bb717195c46d9f14e36298db7bca_r.jpg\"&gt;又通过校队提高了球技 认得了上至0809级的老学长 获得了许多打球 做人 生活的指点 同时蛮辛苦的训练和艰难的比赛也是一种磨练所以说我大学还是在做我原来就喜欢的事打了各种比赛 一年多 攒一堆球衣&lt;img data-rawwidth=\"720\" data-rawheight=\"720\" src=\"https://pic3.zhimg.com/50/v2-a3fe99358e1e939e88821ea4aedc1c10_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic3.zhimg.com/v2-a3fe99358e1e939e88821ea4aedc1c10_r.jpg\"&gt;对于学习我也还是那个态度 学知识还是蛮让人愉悦的 思考也是 但是考试啥的真的烦不胜烦...平时有时间 宅在寝室读金庸读村上春树读马尔克斯读渡边淳一(///▽///)这才美滋滋好伐我想表达的就是 如果你十八年来都是一个乐于潜心读书的人 华科绝对适合你如果你更加热衷于生活热衷于学习之外的一些事 就算报华科 也至少不要报这种工科大院...不仅仅是学习考试会让你焦头烂额 能不能遇到志同道合之人 也是难说-----------原答案--------- ----------------之前看到不少似贬实褒的回答文采还是不错的(｡ì _ í｡)现在正好是填志愿的时候如果恰有高三毕业的小鲜肉希望自己的回答能予你们以启发吧比较长 可以耐心 辩证地 看看至于华科的腊肉们 我就不说了…                   华科的学风还是没得黑的                   但是！！一来 过分强调加权 偶尔容易跑偏 个人感觉还是会有不少学院的年级有这种情况 大学要不要加权？当然要 不错的加权会让你之后很多事情更加顺利 保研啊出国啊各种 可是大学绝对不能仅仅是加权加权应该是学习的附赠品加权应该是你确实学到东西了然后复习复习就能考到的那个分几年每天拼死拼活 然后刷到高加权这想起来肯定也是件热泪盈眶的奋斗故事然而不能说所有人都适合这种故事吧毕竟大学应该有更多的记忆：比如大学恋爱 体育比赛 辩论会等等 这样的大学不至于太扁平吧                                关于食堂37个 老夫报之前也看中了这个反正...食堂是吃不出家的感觉的 除非你到了毕业那天另外呢 37个食堂 各有各的管理者吧貌似...于是你会发现有的好吃不贵 有的不仅难吃还贼..不便宜...而且华科挺大的 只能说你到哪都能找到个吃饭的地方 但是并不等于37个食堂就是你的日常                                 华科人一年招几千上万人还基本都是各省前列你说华科人能不有才吗？必须有才啊但你也许会觉得欠点儿什么...大概就是 不张扬 少个性 总之我见过的大多数人 优秀的蛮沉默的命里有诗和远方年轻怎能不张扬╮(￣▽￣\"\")╭交通有点儿差校内靠单车电驴校车基本无忧但是出去....东小门出门公交车？武汉的公交车真的 司机都是些退役f1赛车手西小门出去坐地铁？讲道理真的血难走尤其拖着行李箱另外如果选择进来读工科一定要保证自己有文学作品的阅读量也要坚持学学英语人文素养很重要 华科这方面分为一般专业我就不吐槽了怕爆粗就这样咯至于华科的优点则不胜枚举在此不赘述了╮(￣▽￣\"\")╭", "answer_votes": "18", "answer_comment": "​11 条评论"}
{"answer_author": "伊丽莎白巴托里", "answer_id": 182411998, "answer_text": "全是学霸（一周5次以上刷图书馆的占一半）课业要求较高（期末强行突击拿分没那么简单，老师要求都挺高标准的）游戏主机/掌机持有率超低（高中开始就是游戏迷，到了我科整个年级找不到同伴，很绝望）为了享受大学生活每天都嗨的千万不要来我科，因为你不光会学习很惨，还会很突兀，就像人群里钻出来的光头但是想学习想深造的 话可以放出来 我科是华中地区学风最优良的学校之一 稍微膨胀一点可以去掉之一", "answer_votes": "10", "answer_comment": "​19 条评论"}
{"answer_author": "注孤生", "answer_id": 182270735, "answer_text": "你们都不报的话，我弟应该可以成功做我的校友了！一定要给我弟这个机会！&lt;img data-rawwidth=\"320\" data-rawheight=\"320\" src=\"https://pic3.zhimg.com/50/v2-ceae6caa3ced840e647470ca09d29a6e_hd.jpg\" class=\"content_image\" width=\"320\"&gt;", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "大胆", "answer_id": 189427577, "answer_text": "好久之前看到这个题目，因为之前一直在忙着复习考试，没有回答，但是还是有很多想说的话。不是回答，只是想对一些回答说几句。    本人华科计算机16级本科生。刚入学那会儿听班里的人说什么什么课可以不用听，什么什么学生组织可以不参加。的确，听到的挺多的。但是有次部门开会，学长告诉我：如果你觉得一件事没有意义，那只能说你还没有认真去做这件事。    自认为，你是什么样的人，你看到的就是什么样的人。你若是一到期末才开始刷试卷，那你会发现有很多人也和你一样。那你自然看不到那些每次上完课就在巩固的人。你若是整天在寝室里叫着外卖，那你会发现和你一样下楼等外卖的人很多。自然也看不到从图书馆下楼去食堂的人有多少。    并不是华科活动不多，而是你真的没有去参与。    和我一样喜欢参与活动的人，诗社，舞社，绘画，定向越野协会，每周都会组织活动，遍布在校园里，不过在寝室等外卖的你，看不到。    在资委会，会有敬老院义工，省博物馆义工，流浪动物救助站的义工，只要你想，你就能参与，可是你没有，你却在抱怨，华科只是机械的做题，来应付考试。在定向越野队，一群热爱运动的人一起跑森林公园，一起去各大高校跑图，一起在操场跑圈，一起骑行到长江大桥。而你会觉得，这太累，不值得。而且，恰恰是这些人，参与学生组织，热爱生活，热爱运动，也同样热爱学习，在自强标兵答辩的时候，看见他们，大一上学期有接近100个工时，而且加权在年级前十。如果你没有发现，你不能说没有，因为华科，真的有他名校的道理。", "answer_votes": "6", "answer_comment": "​2 条评论"}
{"answer_author": "zzzy是zz", "answer_id": 205166921, "answer_text": "江苏 财务管理专业 准大二狗 怒答一波A.学习水课多，给分迷醉:不考虑太远的 说最实在的 成绩 华科的通识课里水课学分比重较高（不想和其他学校横向比较 反正思修毛概马原近代史.......这些通识水课合起来学分已经20%左右了） 而且有些老师给分极其随意 对学生的成绩极其不负责 比如我大一上学期原院系的思修老师和VB老师 感觉他们给分搞不好是弄了个随机数表啥的 极其迷醉 &lt;img src=\"https://pic2.zhimg.com/50/v2-14dac5668d21078c0f7f353f6214b662_hd.jpg\" data-rawwidth=\"200\" data-rawheight=\"173\" class=\"content_image\" width=\"200\"&gt;考试含金量低:很多课如各位校友所言 都是考前几天怒刷一波就能考好的 很多课考试的含金量真不算高 线代? 自然不是水课吧 答主大一下经历了一段很混沌的时间 然后考线代之前刷了两天蓝皮书 90+ 反之亦然自习室:日常人满为患 而且桌椅声咳嗽声 其实并不是很安静 当然这是答主自己的问题 &lt;img src=\"https://pic2.zhimg.com/50/v2-be9fe822dfaa186f26789854678c4173_hd.jpg\" data-rawwidth=\"796\" data-rawheight=\"640\" class=\"origin_image zh-lightbox-thumb\" width=\"796\" data-original=\"https://pic2.zhimg.com/v2-be9fe822dfaa186f26789854678c4173_r.jpg\"&gt;B.生活食:地域而言 江苏的孩子80%接受不了 我在食堂的日常:卧槽这也能加辣? 卧槽这是微辣? ...... 饮食方面武汉相对比较重口味一点 尤其是各种汤 真的好咸 饮食清淡地区的同学真的会有一段痛苦的适应过程 长痘 存在的 答主人生前17年脸上和小姑娘一样干净（呸 装啥小鲜肉 分明就是个糙汉 滑稽.jpg）现在...... 在家调养两周稍微缓了一点&lt;img src=\"https://pic2.zhimg.com/50/v2-51bcd734e45627f579b431f7e823f92c_hd.jpg\" data-rawwidth=\"638\" data-rawheight=\"582\" class=\"origin_image zh-lightbox-thumb\" width=\"638\" data-original=\"https://pic2.zhimg.com/v2-51bcd734e45627f579b431f7e823f92c_r.jpg\"&gt;住行:我科的一个别称完美吐槽 华中停水停电不通知修路封路绕路总之就是行路难大学及其附属韵苑科技财经政法大学&lt;img src=\"https://pic1.zhimg.com/50/v2-c0786d2cea5b456f833b3a6d81ca2fb6_hd.jpg\" data-rawwidth=\"1280\" data-rawheight=\"960\" class=\"origin_image zh-lightbox-thumb\" width=\"1280\" data-original=\"https://pic1.zhimg.com/v2-c0786d2cea5b456f833b3a6d81ca2fb6_r.jpg\"&gt;这是7月9号 答主做完一个海峡两岸交流志愿者活动回校的场景 这是很常见的......C.其他男生多:我科七比一的传说当然是不确切的 但即使是一条经管狗 依然感受到一所工科专长高校的可怕 特别每次有那种水课统考 走进东九西十二 扑面而来的是一股阳刚之气 顶尖高校的男女比例还是很重要的 窃以为3比2最合适 但是我科 这个比例目前为止还是高不少的 男生多的好处很多 坏处嘛 基数大了基佬也多了（手动滑稽.jpg）没有恐同的意思啊  只是建议大学里考虑恋爱的学弟591路向西 学妹们是很欢迎的（继续滑稽.jpg）&lt;img src=\"https://pic1.zhimg.com/50/v2-2081b65132ee0803f27366a0fe41b07e_hd.jpg\" data-rawwidth=\"158\" data-rawheight=\"158\" class=\"content_image\" width=\"158\"&gt;不够自由:其实不太想说这一点 因为目前为止还没有特别感受到 但还是跟风一波 答主本人大一一年觉得最失败的一点 不是没刷到前5%的加权 而是自己的眼界依旧很狭隘 认知方面的格局没有大的长进 这一点窃以为和整个学校不够自由的氛围有不少关系&lt;img src=\"https://pic1.zhimg.com/50/v2-532401ac4743de822f39c9367302f402_hd.jpg\" data-rawwidth=\"565\" data-rawheight=\"436\" class=\"origin_image zh-lightbox-thumb\" width=\"565\" data-original=\"https://pic1.zhimg.com/v2-532401ac4743de822f39c9367302f402_r.jpg\"&gt;目前也没啥了 其实呢来华科的 尤其是湖北之外当地对华科不够了解 认可度很一般地区的同学 大部分两类 一类是考得很差掉到华科的 二类是考得很好捡漏进华科的 答主一开始觉得是自己第一类 但后来发现自己自己是第三类 自以为考得差掉到华科实际上就这水平的 总之不管你的心里账户预期如何 不管你觉得自己少考还是多考了几十分 要是处在华科分数线上面小段 又没勇气复读的 来华科不算吃亏了 但专业方面 慎重 慎重!", "answer_votes": "3", "answer_comment": "​3 条评论"}
{"answer_author": "HectorLee", "answer_id": 182749820, "answer_text": "考六百多分读个专科，当然不推荐。：/", "answer_votes": "13", "answer_comment": "​17 条评论"}
{"answer_author": "朋克雪球兔", "answer_id": 183523931, "answer_text": "不知道，大概是因为武大更好？", "answer_votes": "1", "answer_comment": "​2 条评论"}
{"answer_author": "刘亚光", "answer_id": 182866768, "answer_text": "1.这问题有一个前提，就是至少考生分数要到可以报华科同档次学校的水平。2.问题是“不推荐报考”而非“推荐不报考”3.在这两个前提下，我会推荐高考考生报考北京上海的同档次的学校，会有更大概率更有利于个人发展，但丝毫不因此否认我科依旧是相当不错的求学之地毕竟，一个985高校拥有的资源足够让你成为大牛了，都看个人。", "answer_votes": "12", "answer_comment": "​4 条评论"}
{"answer_author": "匿名用户", "answer_id": 182673148, "answer_text": "我一般也不推荐学生报清华北大,因为毕竟考得上清华北大的,也不会来找我来建议.如果分数够,你一定不要让我推荐华科,那么请也别报考我们武大.说好的,好基友,一辈子,一荣俱荣,一黑都黑", "answer_votes": "21", "answer_comment": "​5 条评论"}
{"answer_author": "知乎用户", "answer_id": 182733968, "answer_text": "因为你的分数配不上这所学校", "answer_votes": "18", "answer_comment": "​1 条评论"}
{"answer_author": "皮卡皮卡", "answer_id": 183526876, "answer_text": "我看了很多答案，觉得大家都很爱我们学校，我也很爱我们学校，但是本着为考生负责的心态，我还是决定讲些现象背后我的想法。我是电气专业的学生，当初一心想读工科具体而言就是电气，也放弃了一些别的选择比如南大之类，于是来到了武汉。首先，我们电气学院都说学风好，我觉得确实大部分人都有自习的习惯，但是还是有很多人如果不是考试前就不会去自习室，或是去了自习室就玩手机。说到考试，我不得不说至少我们专业的考试要么就是可以找到以前的卷子然后各种套路，要么就是找不到什么有用的资料老师也没讲什么重点，然后考试时候看到卷子要么觉得简单的白复习了，要么觉得只是。白复习了……我们专业有很多试验，大部分人对实验不是很上心，找份报告抄一抄，实验时候水一水，老师讲授基本为零，实验器材很多还是坏的…我觉得这样实验课的效果就少了很多。我们很多专业老师讲得不错，有自己独立的思考和理解，但不得不说还有很多老师只是在念ppt而已，条理不清，甚至声音都听不清楚…难以接受。真的不是骗你百分之八九十的人基本考前一周一本书。说到课余活动，那真是。。。很多活动本来想法很好，但真让人办起来真是各种缺乏规划，遇到各种问题，效果只能说是顺利办完了活动。。还有各种学生组织和社团，我觉得很多还是有些水啊，质量良莠不齐（我曾经在一个学生组织听一个外院学长讲什么课可以翘，什么课必须翘…刷新我三观…）我们学校举行各种活动的基因还是有待提高哈。复习期间再来更一波，我觉得我们学校的学生（特别是男生）有一种习惯很不好，不管校内校外不仅总是自称diao丝而且总有种蜜汁自豪感，这个词是一种自嘲没错，但更重要的是你在自嘲的同时能意识到自己自身存在的不足并有勇气去改变它，这并不是一个冠冕堂皇不求上进的借口。举个简单的例子你们走在路上背心拖鞋我姑且不论，你们耷拉了一双拖鞋去自习室，食堂，图书馆你们觉得这真的合适吗？？？你一边自称diao丝一边成天在寝室打lol真的合适？？？我们现在是学生，没有太多时间经济给自己买很多东西，但衣着得体，谈吐自然大方做不到吗？所以说，偶尔自嘲一下我们是正在努力的diao丝未尝不可，但如果这只是你甘于平庸的借口那未免太过可悲。复习期间再来更一波…我觉得我们学校的学生缺乏一种自信，缺乏一种舍我其谁的气魄。你们为什么总是自嘲是三本学校，关山口职业技术大学。我们学校自己的目标就是世界一流大学啊各位！！！也许我们学校名气还不够大，但这样我们更应该每时每刻展现出华科学子的自信，而不总是说哎呀腊鸡三本啦。也许有时候只是自嘲没错，但这却是在经常给自己一个消极的心理暗示。我们要做的是努力学好知识，在外展现出自己的实力。当我们这些学子毕业二十年后如果我们学校没有比现在更出色，我们该怪的不是我们的母校而应该是我们自己。勇敢的打开评论区……另外我所说的只是我的所见所闻，也许与你的有很多不同，大家求同存异就好", "answer_votes": "26", "answer_comment": "​19 条评论"}
{"answer_author": "知乎用户", "answer_id": 182631550, "answer_text": "华中理工变成华中科技以后真是越来越水。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "尔墨", "answer_id": 184913642, "answer_text": "怎么说呢，整个学校给人的感觉就是缺了点灵气，无论从硬件软件设施，还是管理政策方面都是如此。至于高票鼓吹的学霸如云，其中很大一部分不过是勤奋有余，视野狭隘得很呢。", "answer_votes": "12", "answer_comment": "​4 条评论"}
{"answer_author": "匿名用户", "answer_id": 182934658, "answer_text": "校友们都说了很多，也说得很全面，我就不多赘述了，只补充两张图供参考。&lt;img src=\"https://pic3.zhimg.com/50/v2-5833402d409faad1e0a4e4fcd0aa4d1a_hd.jpg\" data-rawwidth=\"928\" data-rawheight=\"811\" class=\"origin_image zh-lightbox-thumb\" width=\"928\" data-original=\"https://pic3.zhimg.com/v2-5833402d409faad1e0a4e4fcd0aa4d1a_r.jpg\"&gt;&lt;img src=\"https://pic1.zhimg.com/50/v2-d6dc8fa70b11106ff8e45214ab68f7ae_hd.jpg\" data-rawwidth=\"640\" data-rawheight=\"693\" class=\"origin_image zh-lightbox-thumb\" width=\"640\" data-original=\"https://pic1.zhimg.com/v2-d6dc8fa70b11106ff8e45214ab68f7ae_r.jpg\"&gt;你觉得活在哪张图里会更有趣一点呢？&lt;img src=\"https://pic2.zhimg.com/50/v2-2727eb79c3d9c1104a0a19da610eda54_hd.jpg\" data-rawwidth=\"1024\" data-rawheight=\"1024\" class=\"origin_image zh-lightbox-thumb\" width=\"1024\" data-original=\"https://pic2.zhimg.com/v2-2727eb79c3d9c1104a0a19da610eda54_r.jpg\"&gt;", "answer_votes": "13", "answer_comment": "​8 条评论"}
{"answer_author": "匿名用户", "answer_id": 182981744, "answer_text": "说一下我在华科的真实感受吧。1.人文和艺术气息差。这里并非说华科不重视人文素养的培养，而是大多数学生没有培养这方面的兴趣和意愿。公选课的时候就能看出来。华科要求理工类的学生一定要选人文艺术类课程，但我周围有同学说，我们理工科的，学那些干什么。我这学期选了一门艺术类课程，觉得很有意思，从没翘过课，但是每次课到课率真是惨不忍睹，很多学生只是为了混学分，根本没想过要好好学点东西。我看到高票赞同的答主说到余华讲座，我想说余华到哪个学校去不是人气爆棚，如果余华来华科都没有人去听，那华科就真的成为三流技校了。2.鱼龙混杂。华科录取分数线之低和好专业分数线之高决定了这一点。如果你是一个比较优秀的同学，来华科可以随便挑专业的那种，那么我不推荐你来华科。因为你来这里可能会觉得周围很多人是在混吃等死，志同道合的太少。华科绝对不缺大神，电工基地启明学院都是大佬，但和你四年一起生活学习的，可能只是些碌碌之辈。3.生源比较局限。学生几乎都来自湖北及其周边省份，中西部地区偏多，东部地区的真的少。我并非地域歧视，我本人也是西部的，但是来自经济发达地区的同学普遍各方面的能力都较为出众，这是事实。所以如果你想更好地锤炼自己的能力，还是报北京上海的学校为好。写在最后：每所大学都有其利弊，连中科大都有人吐槽不要报，所以不要被学长学姐们的胡言乱语左右。其实大学四年的决定权掌握在你的手中，你不但能决定去哪，还能决定怎么过。如果是打四年王者荣耀，那还是去北京上海，那里网速快。但如果肯下功夫学习，相信你在任何一所985都会有很大的收获。去你想去的地方，做你想做的事，要你想要的人生。也欢迎这样的同学来华科，我还是想让华科多几条龙的。", "answer_votes": "11", "answer_comment": "​5 条评论"}
{"answer_author": "发霉的海绵宝宝", "answer_id": 181934904, "answer_text": "因为分数不够", "answer_votes": "9", "answer_comment": "​5 条评论"}
{"answer_author": "匿名用户", "answer_id": 181320270, "answer_text": "关山口男子职业技术学院（又名：华中可基大学），坐落于国标滋养的捂汗光谷光谷原名关山口，因该校男女女比例悬殊，造成光棍众多，后更名为光谷。--------编不下去了...华科是个好学校，欢迎各位基佬前来报考。", "answer_votes": "7", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 181857259, "answer_text": "如果可以的话，请不要报考华科，武大也是一样，选清北好太多了", "answer_votes": "4", "answer_comment": "​添加评论"}
