{"question_id": "61040571", "question_text": "镜像问题:你为什么推荐高考考生报考武汉大学?", "question_title": "你为什么不推荐高考考生报考武汉大学?", "question_commet": "​1 条评论", "answer_number": "101 个回答", "question_followers": "265", "brower_number": "317,947"}
{"answer_author": "吴亦凡ivan", "answer_id": 192622858, "answer_text": "哈哈哈哈哈哈哈可能因为每年樱花节校内游客太多了吧可能因为校旁东湖边蚊子太凶了吧可能因为学校风气太自由了你不能习惯吧可能因为周末晚上梅操舞台的音响声把你吵到了吧可能因为经常在校园里迷路把你惹恼了吧可能每周五放露天电影，小情侣太多把你怄得不行吧可能图书馆天天抢不到座只能去找教室自习吧可能接受不了有的选修课在别的学部要提前好久出发才能不迟到吧问题从来没有善意或恶意，但提问的初衷却可以有报考一所学校以及选择一个专业是一个学生生命中最重要的事之一，谨慎当然没错，三思更是明智但向谁问，怎么问，就体现一个人很多东西了报考一所学校，要考量你想学的专业和这所学校这个专业的实力，那么你可以问“请问武汉大学xx专业怎么样？师资如何？培养计划如何？”等等报考一所学校，要考量你的家乡和学校的相对位置，你未来准备在哪工作和落脚，那么你可以问“在武汉大学学习生活是怎样一种体验？”“在武汉生活和在xx领域工作是怎样一种体验？”报考一所学校当然也要考量这个学校的风气，底蕴，实力，口碑，这些都有很多渠道去探寻，也有很多种方式去提问，武大近些年名气大了不少，这是好事，可能也招惹了许多对这个世界不满的人的憎恶回到问题本身，有那么多的提问方式，谦逊又高效但绝不是“你为什么不推荐高考考生报考xx大学？”为你感到抱歉", "answer_votes": "157", "answer_comment": "​12 条评论"}
{"answer_author": "知乎用户", "answer_id": 269339607, "answer_text": "武汉大学17级新生答一波，如有偏颇，欢迎指正1.校园太大了，入学这么久我还得靠导航才能找到很多地方，以及仍旧分不清各个方向的门2.景色太美了，还没见到樱花盛景，已经被武大的秋天折服了，可能会因为贪看景色耽误路程3.好吃的地方太多了（作为枫园人民的我当然是指枫园以外的地方），很容易长胖的4.漂亮有气质有内涵的小哥哥小姐姐太多了，题主过来可能会自惭形秽5.身边学霸太多了，学风很自由，但你的压力并不会小6.各种活动多的让人眼花缭乱，一场活动有一场的美妙之处，可华丽可朴素，可幽默可严谨，担心题主迷了眼7.学长学姐能力强又太和善，题主可能不太能带给自己的学弟学妹这种归属感因为一开始并不把武大作为第一志向，所以入学后，对我武并没有什么感觉，十分麻木，可现在，已经是深爱了，谁要说我武不好，真跟他急的。来几张美图（似乎是学校学长学姐自己经营的一个公众号里的）&lt;img src=\"https://pic1.zhimg.com/50/v2-61de69a7cede5a1f207979ce68cdbd75_hd.jpg\" data-rawwidth=\"1280\" data-rawheight=\"797\" class=\"origin_image zh-lightbox-thumb\" width=\"1280\" data-original=\"https://pic1.zhimg.com/v2-61de69a7cede5a1f207979ce68cdbd75_r.jpg\"&gt;&lt;img src=\"https://pic2.zhimg.com/50/v2-1967c26b915036a726e594405ebcd8c3_hd.jpg\" data-rawwidth=\"640\" data-rawheight=\"482\" class=\"origin_image zh-lightbox-thumb\" width=\"640\" data-original=\"https://pic2.zhimg.com/v2-1967c26b915036a726e594405ebcd8c3_r.jpg\"&gt;&lt;img src=\"https://pic3.zhimg.com/50/v2-18be8788134feaa8ff38c24a5d3d63a5_hd.jpg\" data-rawwidth=\"1280\" data-rawheight=\"798\" class=\"origin_image zh-lightbox-thumb\" width=\"1280\" data-original=\"https://pic3.zhimg.com/v2-18be8788134feaa8ff38c24a5d3d63a5_r.jpg\"&gt;&lt;img src=\"https://pic4.zhimg.com/50/v2-d9108f0d48c98fc7fcf1d0deb54b9da1_hd.jpg\" data-rawwidth=\"1440\" data-rawheight=\"1080\" class=\"origin_image zh-lightbox-thumb\" width=\"1440\" data-original=\"https://pic4.zhimg.com/v2-d9108f0d48c98fc7fcf1d0deb54b9da1_r.jpg\"&gt;最后，希望题主千万不要选择武大，我真的不想你是我的学弟或者学妹。以及，致所有喜欢武大的，还在奋斗的小伙伴们，我们都在武大等着你，加油。", "answer_votes": "130", "answer_comment": "​82 条评论"}
{"answer_author": "蔡赤赤", "answer_id": 185980935, "answer_text": "  我们不推荐武汉大学，是因为那里的学生太过张扬，只以武大金秋为例，几乎形成了全校辩论的风气，武大校队也是世界顶级大学生华语辩论队之一，外向的风气成了外人眼中浮夸的学风，自然不推荐给沉不下心的你。   我们不推荐武大，是因为它宽松的管理。所谓无晚修，无早操，在这里混四年太容易，所以不适合你。 不过若是走出高中的校园，你尚且不知道什么叫自律，倒还不如拿着书本，回去找找你自己在哪里。  我们不推荐武大，是因为这里的学霸太多，会让题主随时产生自行惭秽的感受和被碾压的危机。如果你是石头，实在是放在哪里也发不了光的，想要在金子堆里蒙混过关一点也不容易。  我们不推荐武大，是因为这里的人文气息太浓。相比同城双子星的华中科技，武大浪漫又不贴合实际，如果你的心中只有功利，这里当然不够留住你。\n   我们不推荐武大，是因为我们不推荐武汉，不靠海也没啥好风光，不愧是中国最大的县城。你要来武汉，还是先做好极端天气下幸存的准备，无论是雨天发大水，伏旱似火炉，还是冬天阴冷没有暖气，的确不适合题主这样尊贵的身躯。只是不知道题主，是出生在上海的弄堂中，还是成长在北京西三环的胡同里。   我们不推荐武大，是因为这里的校友出名的寥寥无几，雷军也不过创立小米还兼任三个CEO而已。不过如果你看过《奇葩说》第四季，自然知道在雷军来的那集和陈铭学长的对话，自然知道武大校友是一个多么值得自傲的标语。  我不是武大学生，起码现在还不是。然而武汉大学四个字已经在我心里魂牵梦绕三年了，也即将填写在我的志愿书上。这篇回答不是怼题主，我对武大了解也有限，题主可能也只是希望了解大学信息，但这么偏激的提问实在招黑。总之，武汉大学是中国最美的大学，在我心中没有之一。欢迎真正的武大学长学姐评论私信，帮助一个少年实现多年的梦想。  以上", "answer_votes": "496", "answer_comment": "​147 条评论"}
{"answer_author": "张帅宾", "answer_id": 192655422, "answer_text": "可能因为我武对华小科太不友好 &lt;img src=\"https://pic2.zhimg.com/50/v2-bad408a14f7fab72d4c00cb1b6811276_hd.jpg\" data-rawwidth=\"1079\" data-rawheight=\"6273\" class=\"origin_image zh-lightbox-thumb\" width=\"1079\" data-original=\"https://pic2.zhimg.com/v2-bad408a14f7fab72d4c00cb1b6811276_r.jpg\"&gt;", "answer_votes": "42", "answer_comment": "​21 条评论"}
{"answer_author": "TF不是TFboys", "answer_id": 192770803, "answer_text": "要是能考上一流大学（清北）和二流大学（人大华五国科大）那当然没必要推荐报武大…", "answer_votes": "28", "answer_comment": "​1 条评论"}
{"answer_author": "李高高", "answer_id": 192829597, "answer_text": "实在不能认同某些答案说的“有能上武大的分数没必要去武大”这种观点。私以为，在高考择校这个问题上其实是比较主观的事情。毕竟某一分数段内的学校硬要分出个高下很难，考察一所学校的综合实力的因素太多。也许你认为学校漂亮没有意义，但对某些同学来说这点很重要。所以不要把自己的想法强加在他人身上。如果硬要我说不推荐来武大的理由，我是不建议自控能力差的人来武大读书的。原因并不是武大自由而散漫。恰恰相反，武大是一所风气自由但大家都很紧张的学校。在这里你会发现优秀的人各种各样，学校为大家提供了优质的发展平台而不仅仅以成绩作为评判标准。所以对自控力差又对未来没什么计划和想法的同学来说，在这里你会感到极大的压力。毕竟纸面成绩只有100分，但优秀的人是没有上限的。再要说的，如果吃不惯籼米，吃不惯辣，受不了潮湿闷热没有暖气，受不了三月的梧桐四月的游客五月的石楠，受不了武大周围高昂的消费水平。那建议换一所学校喽", "answer_votes": "11", "answer_comment": "​9 条评论"}
{"answer_author": "白沙在涅", "answer_id": 192942484, "answer_text": "&lt;img src=\"https://pic4.zhimg.com/50/v2-edf4bce059405b7d84887b4fc3243480_hd.jpg\" data-rawwidth=\"1080\" data-rawheight=\"1920\" class=\"origin_image zh-lightbox-thumb\" width=\"1080\" data-original=\"https://pic4.zhimg.com/v2-edf4bce059405b7d84887b4fc3243480_r.jpg\"&gt;题主你要的答案在上面。下面说一下我的看法。一个人能上什么学校取决于付出了多少努力。能上武大的分数同类型综合大学就那么几所，差别有那么大吗？不是你的这个学科厉害一点就是我的这个学科厉害一点，三本互啄很有意思？这么多年报考的分数线可以说是某种市场调节，大家谁都不傻，形成当下分数线没有谁是虚高或者低估一说，市场决定了分数线，比武大好的自然比武大分高，和武大分差不多的水平也就和武大一样罢了。我就是不明白，某些高校啊，总是很愤怒武大是为个啥？这里点名一下厦大天大这两所，真 菜鸡互啄，大家都是难兄难弟，好专业在各位嘴里一共就那么几个，其他专业一说就垃圾的不行。不知道这些学校某些同学为啥总说武大虚高？武大要是虚高那贵校算什么？你是说市场造假，家长考生都傻，瞎了眼不选你的咯？说到底还是太看重排名，自己学校和武大一样走下坡路，名气又不如武大，然后产生一种阿Q思想，和尚摸得我摸不得？你武大可以排第三可以有大新闻，凭什么我要默默无闻？我也很想出名啊，你们快来看我啊！但我不能这么说 我要表现的沉稳，我要表现出我对浮躁校风的一种嗤之以鼻彰显我的不同，我是不慕名利的好孩子，我和武大那个妖艳贱货不一样。然后就开始全国第三云云，你自己不清楚那个榜不是武大排的吗？你们真的不知道武大学生从来没几个人把这个榜当回事吗？你们知道，但你们不在乎。每次说到这里就开始王顾左右而言他，说到底，诸位之所以身处同等学校之列却非要看不起武大，无非是想成为武大这样有“虚名”的高校。越批判的厉害越渴望，校风这种事可以分导师分院系评价，我从来不认为可以分学校评价。武大某院挂科学生直接贴榜整个学部，狠不狠？某院每天早上六点集体早操，自由不？还有某院组织集体自习，浮夸不浮夸？最后，一首《浮夸》送给在座的各个垃圾末流互啄985。——————————我是虚高的分割线—————有答主表示武大拿钱贿赂了武书连的排行，这个说法其实很久以来都有。到底有米有是个黑箱大家谁都不知道，我是觉得这种类似小孩子似的猜疑大学生就不要说了，江来要负泽任的时候你不承认尴尬不？然后我想再得罪一下众多高校，武大不配第四，很显然是因为主流评级标准达不到第四。而武书连之流巧设加权，让他达到了所以不服众。但是哈，依照这个标准，我们来看下川大山大厦大中大等一系列赶超c9北航中财的学校，一些第七一些第十一些前十五。讲道理不合理程度不比武大强到哪里去，我建议大家都别报考，别推荐，985 你不上个清北华五，那跟垃圾有啥区别？浙大三本为标准，不如浙大的综合985一律不推荐，虚高还爱吹逼，校领导一定都贿赂了武书连排行榜，以武大为首罪大恶极，不如我大xx七子爱国不浮夸，为人民着想，不如我x科务实严谨。我之所以不喜欢别人说武大浮夸这类说法是因为除了清华和科大确实校风明显比武大好的多之外，恕我直言其他学校包括很多理工科大学学风真的不一定比武大好到哪里去。你们真的是想多了，人都有眼睛的，看看清华科大的学风，再看看自己的不觉得菜鸡互啄很无聊吗？", "answer_votes": "66", "answer_comment": "​12 条评论"}
{"answer_author": "不如饮酒高阳池", "answer_id": 192560302, "answer_text": "因为留在武汉一定是计划之外的事。", "answer_votes": "28", "answer_comment": "​15 条评论"}
{"answer_author": "东方尧", "answer_id": 284133603, "answer_text": "我想谈谈这位14同学的答案，当做回复好了&lt;img data-rawwidth=\"750\" data-rawheight=\"1334\" src=\"https://pic2.zhimg.com/50/v2-b3d68219e7b67a3e495de5c0bc70fcba_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"750\" data-original=\"https://pic2.zhimg.com/v2-b3d68219e7b67a3e495de5c0bc70fcba_r.jpg\"&gt;说实话有点不理解先说作弊，每个院抓作弊不一样严格，阁下说的情况可能存在，但不是每个院都这么夸张吧，我考了四年作弊的见过，阁下说的这么夸张的情况，反正我没见过，以此说全校作弊多不合适吧。而且抓到了处罚都不会轻，不知校友是什么院能让你如此愤慨，我见过抓到作弊下跪求放过的也没放过，说不能保研没有评优的也都没有。武大学风自由懒散大家有目共睹，但你想由此证明武大学生品德差，比不上华科，不合适吧，的确进了武大的都不一定是品学兼优，我反问你，进了清北的就都是品学兼优？王敏学那个我是真没看懂，雷军回馈是人家自己觉得武大培养了他，是武大求来的吗？王敏学约炮是自己约的，是武大教的吗？而且本来武大就自由，学校出个禁令不许约炮就开心了？我看这不是集体荣誉感，是阁下逻辑有问题。这破事都说了这么久了，约个炮都能怪学校，那五五开上的小学我也要举报。顺便，集体荣誉感强都能成黑，阁下怕不是在社会主义国家，有东西让学生骄傲才有的集体荣誉感，又不是传销洗脑，爱国算不算集体荣誉感？我中大的朋友很羡慕这种对学校的认同啊，不知哪里让阁下不舒服，何况，如果阁下真的觉得自己因为不爱武大就融不进去集体，还是想想其他原因吧。我觉得阁下所说的情况，放眼全国，似乎没有高校不存在吧，你也没有证明武大的作弊比华科在统计学上多，约炮的比xx大多，校车逃票的比xx大多，那么全国高校，你是不是都不推荐应届生考呢？人身安全，这是我唯一同意的，武大校园全开放式，校外人员很容易进来，的确出了很多事，这没得跑，学校也一直在加强安保，我经常晚会回学校，感觉还是很明显，不过说实话，把武大全封闭了，晚上到教五草坪溜孩子的大爷大妈和诸多游客怕又要喷，这是两难的问题我相信阁下说的都是真的，但这么写，未免有点偏激刻薄，你说武大学风自由懒散容易混，晚上要熄灯，夏天特别热，活动多没法静心学习，千万别来，这都成，但一下说的好像在武大，三观正的人就要每天被气出血，集体荣誉感少的人就要被孤立，走在樱花大道一定会被车撞，阁下觉得，对吗大家都是要毕业的人了，我相信有很多和阁下一样的人非常讨厌这所学校，当然他们其中很多人是考北大人大没考上才来的，我理解，但咱喷母校也要喷的有理有据，喷的百密无疏，喷的慷慨激昂，喷的令人慑服，才体现水平不是，我也没法艾特你，先写在这吧最后为什么不推荐报武大，很简单，考的上清北复交为什么要来武大？", "answer_votes": "28", "answer_comment": "​14 条评论"}
{"answer_author": "淡淡绿茶", "answer_id": 260579491, "answer_text": "12月6号 更新昨晚想去自习，图书馆没位置。。去了两个楼才找到有空位置的自习室  临近考试月 贼可怕以下是原答案我推荐，原因是你的课余生活可以很精彩。关于学风这件事，我想说句公道话学风自由≠学风不好有早读，晚自习就代表学风很好吗？据我所知，很多三本学院也强制上晚自习（没有歧视）亲身体验，平时，非考试月，武大的自习室都很挤  图书馆就更不用说了。最近有期中考试，经学生要求后，学校又加开了很多自习室，如果某个自习室有课，会开放旁边的一个教室当着自习室。所以，我们学风自由≠不好很多高中同学都在国内一流高校，相比之下武大的活动是真的特别多，上了一星期课，挺累，就约个朋友去梅操看个电影，去看一场服装表演，去听珞珈论坛，去看舞蹈，去听合唱，去看情景剧，去看万林展览，在顶楼喝个咖啡，鸟瞰最美的大学。或是跑个汗姆，爬一爬珞珈山，体育嘉年华，趣味运动会。这周六没抢到局座讲座的票，心痛。学校为学生丰富大学生活提供很多机会，但这却成为别人口中学风不好的证据，好奇怪啊。也不明白学风好坏的意义，学风好你就会努力吗，学风不好就是你懒散的理由吗？大学真的是看自己啊，武汉地域不如北上广，但如果你想飞，武大也有足够大的平台，不会拖您老的后腿。", "answer_votes": "60", "answer_comment": "​8 条评论"}
{"answer_author": "御风使者", "answer_id": 193121796, "answer_text": "@醉书生 我这有更全的我武不友好的证据 9月1日更新  听说评论区有人说要七夕的？这种秀恩爱的机会，怎么会放过？喏，下图便是！&lt;img src=\"https://pic4.zhimg.com/50/v2-49b89f12a8c23b34748701984dcbf310_hd.jpg\" data-rawwidth=\"1080\" data-rawheight=\"6536\" class=\"origin_image zh-lightbox-thumb\" width=\"1080\" data-original=\"https://pic4.zhimg.com/v2-49b89f12a8c23b34748701984dcbf310_r.jpg\"&gt;————————假装自己有分割线———————以下是原文：&lt;img src=\"https://pic3.zhimg.com/50/v2-f285fc4da21418f8b6e3714ec74383c6_hd.jpg\" data-rawwidth=\"1080\" data-rawheight=\"10820\" class=\"origin_image zh-lightbox-thumb\" width=\"1080\" data-original=\"https://pic3.zhimg.com/v2-f285fc4da21418f8b6e3714ec74383c6_r.jpg\"&gt;&lt;img src=\"https://pic4.zhimg.com/50/v2-399013c2f739819f67bfeaa937930ce8_hd.jpg\" data-rawwidth=\"1080\" data-rawheight=\"16898\" class=\"origin_image zh-lightbox-thumb\" width=\"1080\" data-original=\"https://pic4.zhimg.com/v2-399013c2f739819f67bfeaa937930ce8_r.jpg\"&gt;其实，除了招生时以外，我武和你科关系还是挺好的。好多撒狗粮的图片。（多图预警，流量党就算了。。。）&lt;img src=\"https://pic4.zhimg.com/50/v2-b337c21767dab6e24b1eb112cd732f05_hd.jpg\" data-rawwidth=\"1080\" data-rawheight=\"5833\" class=\"origin_image zh-lightbox-thumb\" width=\"1080\" data-original=\"https://pic4.zhimg.com/v2-b337c21767dab6e24b1eb112cd732f05_r.jpg\"&gt;&lt;img src=\"https://pic4.zhimg.com/50/v2-850c542fab6e6df1cd81355d212fba3d_hd.jpg\" data-rawwidth=\"1080\" data-rawheight=\"1920\" class=\"origin_image zh-lightbox-thumb\" width=\"1080\" data-original=\"https://pic4.zhimg.com/v2-850c542fab6e6df1cd81355d212fba3d_r.jpg\"&gt;&lt;img src=\"https://pic3.zhimg.com/50/v2-4eb0a6fa218eb2f60f634e4a36f887e2_hd.jpg\" data-rawwidth=\"1080\" data-rawheight=\"5696\" class=\"origin_image zh-lightbox-thumb\" width=\"1080\" data-original=\"https://pic3.zhimg.com/v2-4eb0a6fa218eb2f60f634e4a36f887e2_r.jpg\"&gt;&lt;img src=\"https://pic1.zhimg.com/50/v2-9252ad3237386b7daf635002288d3f87_hd.jpg\" data-rawwidth=\"1080\" data-rawheight=\"5243\" class=\"origin_image zh-lightbox-thumb\" width=\"1080\" data-original=\"https://pic1.zhimg.com/v2-9252ad3237386b7daf635002288d3f87_r.jpg\"&gt;&lt;img src=\"https://pic1.zhimg.com/50/v2-6e6474f9d41b9ae43155110d48641fae_hd.jpg\" data-rawwidth=\"1080\" data-rawheight=\"3999\" class=\"origin_image zh-lightbox-thumb\" width=\"1080\" data-original=\"https://pic1.zhimg.com/v2-6e6474f9d41b9ae43155110d48641fae_r.jpg\"&gt;&lt;img src=\"https://pic1.zhimg.com/50/v2-9b093f3852a8826fdf0d6ebad1a3528c_hd.jpg\" data-rawwidth=\"1080\" data-rawheight=\"1920\" class=\"origin_image zh-lightbox-thumb\" width=\"1080\" data-original=\"https://pic1.zhimg.com/v2-9b093f3852a8826fdf0d6ebad1a3528c_r.jpg\"&gt;&lt;img src=\"https://pic1.zhimg.com/50/v2-fa9d03b71be8f8c1a3564af2e26ce381_hd.jpg\" data-rawwidth=\"1080\" data-rawheight=\"1920\" class=\"origin_image zh-lightbox-thumb\" width=\"1080\" data-original=\"https://pic1.zhimg.com/v2-fa9d03b71be8f8c1a3564af2e26ce381_r.jpg\"&gt;貌似有点文不对题。。。逃（", "answer_votes": "11", "answer_comment": "​4 条评论"}
{"answer_author": "小饼子A", "answer_id": 193418220, "answer_text": "我当时听说武大有樱花就啥也没想得来了。结果到这里才发现，好看的不是樱花，而是一年四季。", "answer_votes": "41", "answer_comment": "​3 条评论"}
{"answer_author": "一顿三碗面", "answer_id": 192965223, "answer_text": "说个小众的原因。听几个在那里读书的同学说，武大的教育和学术氛围都不错，但是有个退学的，原因是受不了当地的湿度，皮肤一直过敏。别的了解不多，只能说，如果你的体质不适合潮湿，建议报考前先去住两天，如果感觉受不了就别去。注：只有很少的人受不了潮湿。那些问题严重的。不只不建议去武大，所有潮湿城市的大学都不建议。", "answer_votes": "20", "answer_comment": "​5 条评论"}
{"answer_author": "打马而过", "answer_id": 198457489, "answer_text": "因为一旦你读了武汉大学，你会发现你青春里最好的四年都在这里，日后回忆起来会觉得其它的生活都索然无味了。", "answer_votes": "24", "answer_comment": "​添加评论"}
{"answer_author": "子翰", "answer_id": 285174577, "answer_text": "武大本科新生来答一句，分享下自己的经验。（我就当这是个寓褒于贬的问题喽）首先志愿的选择肯定要对应分数段。像是武大华科分数段往上的肯定是有更好的选择，分数段往下的自然无缘。在武大的同分数段，像是西交，哈工，北理等，这样的对比才有意义。（有强烈的专业诉求的当然还是优先选择专业强校）私以为，武大有如下优势。1.学部（校区）集中，（实际上武大不分校区）分为12345区，其中1235区相互联通（4区为医学部，5区为国软，不过听说国软跟计院即将有大动作发生吼吼），这样的布局体验，怕是只有武大能带给学生，武大本身就是“文法理工农医”并行发展的综合性大学，完备的学科设置与这样的布局相得益彰，可以给同学们完备的大学体验，更给每一个专业的学生都提供了学习其他学科的便利，并且武大转专业成本较低，可以给每个学生以更大的选择和准备空间。这一点可以与山东大学做明显对比。（山大8个校区，校区之间往来需要较长交通时间而且布局在不同的3个城市）2.同在武汉的华科也具有类似的优势，校区集中，但武大还有这样的优势——校园景色。华科相对来说就是中规中矩的多，道路多是四四方方，武大则是蜿蜒曲折，特别是武大内部还有两座小山，上下坡也比较多，但这何尝又不是一种趣味（答主走了很多次才把路缕清楚，不过建立起地图的感觉着实美妙），武大的一年四季也是各有各的精致，犹是春秋，最美大学绝不是吹的，毕竟环抱珞珈，背靠东湖。这样的特点在1区（文理学部）特别明显，在2区（工学部）3区（信息学部）表现稍弱，但作为历史悠久底座深厚的老校区，23区都具有道路狭窄的特点，虽然给交通带来了一些不便，却给人以独特的感受（安全感？个人喜好吧～）。3.我还想谈一谈对武大自由开放的看法。愚以为，这样的特点，一定程度上也是来自武大校区的开放，校门众多，家属区遍布武大，真真正正地把武大打造成了一个小社会，其实不追求高的生活质量，所有的事情都能在武大内部解决，校医院，警务室，菜市场，大自强，附中，附小，附幼儿园。。。没有什么做不到的。家属区镶嵌在武大各个部位，却给武大增添了很多烟火气息，在教五前的珞珈广场看到拉着手散步的老头老太，在武测家属区看到成群结队的小学生，其实感觉是蛮好的，我倒是挺喜欢坐在星湖园吃饭，左边一个小学生，右边一个老人的，这样更像生活？。我的同学里也有从小在武大家属区长大，附幼，附小，附中，武大，从小到大都被刻上了深深的武大烙印，我也会戏谑她会不会留任武大哈哈。4.对于武大的基础设施问题，特别是频繁的停水停电停网，时不时都会被周围的同学拿来吐槽，其实吐槽归吐槽，却也给大家带来了很多趣味。（说是这么说，但也别停的太久。。。短时还是可以接受的）在食堂来个烛光晚餐，顺便再去创意城约个饭，对面群光，未来城走一遭？想必也是极好的。5.武大没有很紧张的学习氛围（除非考试），更多的还是靠自觉，不过只要想学，学校的设施足以给我们最好的支持，给我们提供最好的资源。（不得不借势夸赞一下可以用武大账号免费下载百度文库hhh）前几天在总图自习看到周围的学长学姐带着几箱书自习顿时压力倍增，其实等到以后就业还是完全靠自觉，现在开始就全交给自己（主要是武大课业压力较小，不安排自习，作业也较少）未尝不是一种好的锻炼。（突然又想到了几十年历史的梅操电影，每周五晚，携三两好友，一起去梅操看超级巨幕，着实是极好的体验，特别是很多时候会放一些上映不久的电影，比如coco）总之，自从知道自己被武大录取之后，我的心就属于武大了，一种强烈的归属感让我深深地爱着她，爱着珞珈，我愿用我剩下的三年半时间，继续走遍她的每一个角落，去发现独属于我武的美。我爱武大，她对我有种特殊的吸引力，相信对每一个武大人也是一样。", "answer_votes": "18", "answer_comment": "​9 条评论"}
{"answer_author": "匿名用户", "answer_id": 268176254, "answer_text": "隔壁理工来答一波。本科江大，有人听过吗，一个二本，我们都叫他武汉人大学。本科的时候，自学了一波单片机，能动手做一些东西，被认为屌的不行。现在在理工读研，大部分人还是不会，不学这个嘛，也不是这个方向的。但是，确实有一些专门做这个方向的，比我强的不是一点半点。这个月头，冒充我们老师参加了一个会议，一开始就是一个武大的老师介绍他们学校嵌入式的教学。他们都不是从最基础的单片机这门课学的，直接学嵌入式系统，一门专业课，一门全校级别的选修课，学完之后可以直接上手做一些简单的系统。然后后面也可以参加比赛，看了一下他们的一些成果，很高端。给我的体会就是，这些成果绝对不是仅仅因为武大的学生多厉害，更有老师的因素在里面。为什么这样说，说一个例子吧。我本科做一个东西的时候，想考虑用pid做，找我们老师讨论，老师回答要我不要想那么多，先做到能动了就够了，遂砍之。现在在理工读研，学到了我那个模样可以用大林算法或者斯密斯预估器做，所以我现在就可以做了。那么这两个阶段的我，并没有太大区别，但是因为我在理工，就可以做一些我以前做不了的东西。有些东西完全不了解，去问老师用处也不大，查书查资料完全不知道从哪个方向下手，自然学的东西有限。再说说理工跟武大。我在理工，有时候一些问题考虑太细致了，我们老师也不一定能回答出来，就会丢给我自己去想，经常2 3天来纠结一个问题，这种问题我觉得如果他比较会或许一个小时能让我搞懂。那天在武大老师的讲话里面，提到了一个问题，现在的学生都是什么难就不搞什么，什么容易就去做，然后开始吐槽。而我目前不管在江大还是理工，遇到的问题是老师并不能给一个完美的解释，甚至根本无法解释，然后叫你自己去想，或许跟你说别想了。而且叫你自己想，他过两天肯定会忘掉然后派别的任务导致自己根本没空深究，最后不了了之。所以，那位老师竟然能说这样一句话，还是可以看到他的水平的。不过私以为他在武大应该也算顶尖的老师？我们导师只在硕导算顶尖的吧。说了这么多，反正以一个学渣的身份，谈一谈从底层仰视下的武大吧。所以那些，我是去华科还是去武大啊？这种同学，请你走开！", "answer_votes": "4", "answer_comment": "​5 条评论"}
{"answer_author": "匿名用户", "answer_id": 185740855, "answer_text": "典型的钓鱼贴，说不定还是自问自答。那我就说一下吧。我见过喜欢黑武大的大部分都是某西开头的c9,天大之类的纯工科院校的一小撮loser，喜欢混迹于211吧网大论坛等地，还基本以快毕业或刚毕业的为主。自己当时选学校没选好怪别人喽，查查2012年学科评估，自己看看最近几年武大的文理科分数线，有机会来武大看看现在武大的环境和基础设施，不提校友会排名，看看国际上各大排名哪个低了，所有人都看不清事实就你们耳聪目明，自己不思进取天天抱着几门夕阳专业，一提武大的马克思就嗤之以鼻，那我就告诉你，在中国永远都是political挂帅，以直男癌无知为荣，在网上黑这个黑那个。去过某C9钱途，座位少的可怜几楼以上全是杂货堆。时间证明一切，自己当时选股没选好别怨别人。另外，某几校似乎才是和山川吉一个档次的，而且只是逼格相同，招生人数少了一半所以比山川吉分数略高，学科实力还没人家强。坐等过两天分数线学科评估双一流出来打脸。", "answer_votes": "30", "answer_comment": "​15 条评论"}
{"answer_author": "匿名用户", "answer_id": 267712041, "answer_text": "12.7更新评论里喷的人很多啊，但是不要那么暴躁好吗？人的素质真的是体现在一言一行一举一动中的，你们的言行也代表了武大的形象，武大从来也不是容不得批评的学校，不要因为有人说了武大的不好就跟被踩了尾巴的猫一样炸毛了好吗？那个说国家级校级科研的是不知道这些名额是分配的吗？人文社科的科研真的超级水啊，不过我觉得评论里工科小姐姐算是比较温和的，笔芯。其实我想说的科研差是指整个培养体系差，没有一个能帮助学生更好进行科研的体系，指导老师很多时候超级水～武大人应该有能接收批评的勇气和胸怀，不是吗？说话就好好说话别动不动就张口闭口脑子的，很难听的。看到有人说食堂的，讲道理文理学部食堂是真的难吃，新开的梅园食堂会好一点，但是占座位的人太多了，就很难受。武大宿舍嘛，有幸在武大最破的宿舍住了3年，说多了都是泪(´△｀)(听说研究生住的三环还有更差的)------------------分割线---------------唉，答主是武大学生。出于好奇点了进来，看到好多答案都在嘲讽题主，觉得自己有必要简单说几句。我个人是不太推荐身边的人报武大，原因：1、城市问题。武汉呢，是一个民风比较彪悍的城市，在各个方面做的也确实没那么好，走在这座城市里感觉没那么舒心自在，所以大学四年我很少出校门。然而，当你走在武汉的大街上，你会发现这座城市的管理真的很差，在交通、卫生方面都是这样。(坐过武汉地铁的人都知道，武汉的地铁很挤，管理很差，这里的民众很少有先下后上的意识，上车全靠挤。今年回家的时候我tm想先下后上，结果被人挤到最后，还被地铁门给夹了！)除了这些呢，我认为最重要的是武汉地理位置不好，相比于沿海地带视野要小很多，在创新创业方面甚至不如沿海的一些普通学校。2、关于武大。首先，说一下最美大学吧。说实话，武大的风景在国内的确是数一数二，樱花大道、老斋舍、老图、情人坡都很美，这里的建筑很多都散发着历史的韵味让人迷恋！是的，武大很美！但是，这种美正在一些人的嘴里变得越来越肤浅：武大很美，但无需整天挂在嘴边，不说学术、不说创新、整天在说的都是武大是最美大学，甚至在招生宣传片里的主题都是最美大学！是的，武大有一个美丽的躯壳，但请不要一直挂在嘴上四处炫耀，来，也让我看看你美丽的灵魂！其次，说说校园管理。一个字，差！走入武大，放眼望去到处都是随意停车，从正门牌坊一直到图书馆再到湖滨再到凌波门，密密麻麻停满了数不清的车，不管能不能停，全都停上了，特别是图书馆门口的阶梯前竟然也被车全部占据了，每次去图书馆看到这种情景都十分不爽！武大就像是一个超大的停车场，每天都迎接着来来往往的车辆。其实，还有一点让我很不舒服的是行驶在武大校内的车从不礼让，各种乱开车乱按喇叭，不知道这里是学校吗，不知道这里是教学区宿舍区吗，甚是反感！还有呢，学校里有很多摆摊的，唉，怎么说呢，校园管理团队永远只是走个过场，从不正真解决问题。在校内遇到很多不舒服说到底都是学校的管理不到位，甚至不作为！最后，说说学风。我身边既有拿奖拿到手软的大神，也有要毕业了学分都修不满的同学。但总体而言，学校比较自由，需要同学自己有很好的自制力与自觉性，这个无论在哪个学校都是一样的。通过自己的亲身体验，可以稍微感觉出来学校整体的创新创业意识不够强烈，没有建立起很好的培训体系，在一些竞赛上成绩不是很理想(比如挑战杯)。在这些方面，我觉得学校还是要走点心的。3、以上都是个人浅见，不喜欢的，你咬我啊。在那些冷嘲热讽的回答里，我看到了一个个武大人正和武大精神愈行愈远。甚是怀念尚重生老师嘴里的武大，那时候我们还没这么自大还懂得谦卑。以上。", "answer_votes": "15", "answer_comment": "​21 条评论"}
{"answer_author": "邱浩然", "answer_id": 192491318, "answer_text": "先考上了再说吧…呵呵呵呵", "answer_votes": "13", "answer_comment": "​19 条评论"}
{"answer_author": "知乎用户", "answer_id": 192522267, "answer_text": "为什么不推荐呢？因为一个会发帖问这种问题的人配不上武大。", "answer_votes": "11", "answer_comment": "​1 条评论"}
{"answer_author": "静水流深", "answer_id": 185562575, "answer_text": "原来这种问题的镜像问题真的好多，不推荐清华那个感觉是在秀，其余都在黑。。。闲得蛋疼的loser们真的好多，就不能学习一个提高自己的姿势水平吗？————分——————割———————线————真的很怀疑是题主自问自答的钓鱼乱黑问题【冷漠脸】问这种问题真的是很没有素养呢【手动白眼】倾向性如此明显难道是华科来的？这俩校不是经常撒狗粮，闹小情绪了？当然这只是个玩笑。类似的这种问题可以问出一系列，毕竟闲着没事干就黑其他高校甚至母校，营造种我这么牛逼这破学校配不上我获得成就感的loser们不少呢→_→都正在考试周或即将考试周吧，不如复习好吧~_~祝喷子们挂科，嗯！最后回答志愿推荐这回事～不亲身经历的学校，请不要随意做评价。对于自己的大学推荐方式，我觉得讲讲自己对自己大学的感觉，描述一下优势学科和学校氛围，记得最后结束的时候说清楚只是自己的一点主观感受，然后让咨询的结合自身实际考虑呗～当然考得太低考不上就不用多费口舌了。利益不相关:  天津大学在读学生别问我天津哪所大学orz，就叫天津大学!", "answer_votes": "2", "answer_comment": "​2 条评论"}
{"answer_author": "李二岁", "answer_id": 196286710, "answer_text": "毕竟我不想问这样问题的你来做我的学弟或是学妹。对不起，我自己还是要选 WHU。&lt;img src=\"https://pic4.zhimg.com/50/v2-4964a717951a1212cf29725c5e833781_hd.jpg\" data-rawwidth=\"1080\" data-rawheight=\"1080\" class=\"origin_image zh-lightbox-thumb\" width=\"1080\" data-original=\"https://pic4.zhimg.com/v2-4964a717951a1212cf29725c5e833781_r.jpg\"&gt;", "answer_votes": "9", "answer_comment": "​添加评论"}
{"answer_author": "赵凯", "answer_id": 235331928, "answer_text": "个人是不推荐报考武汉大学的，首先武汉大学最近几年的排名即使虚高也最多只能排到全国第三左右，其真实实力不过全国前十而已，远远比不上清华，北大这两所大学，当然，清华北大也并不推荐，如果实在是毫无选择，下下之选读个清华北大也不是不能接受，目前世界排名前列的麻省理工，哈弗等都是我比较推荐的大学，如果你对理工科有着超人的悟性，我是建议首选麻省理工的，个人认为从事理工研究的话，麻省更专业，更有前途，哈弗则更加综合，如果你希望成为全方位复合型人才，首选哈弗。    当然如果你不习惯国外生活或者不愿与亲人分离，选择清华北大也不是不能接受，尽管国内的教育水准与世界发达水平有这不少差距，但不能否认这两所高校正在不断进步，尽量缩短着差距，况且作为中国人，我们为何不能多给自己的国家的高校有一分的包容和理解呢？因此我并不是不推荐清华和北大的，就算是为了国家和情怀，但务必选择其中的强势专业，否则即便忍受亲人分离之苦以及只身远赴他乡之痛也一定要选择麻省理工或者哈弗大学。    最后我强调当然不推荐武大这种仅在国内能排上名的大学了", "answer_votes": "13", "answer_comment": "​4 条评论"}
{"answer_author": "匿名用户", "answer_id": 192531655, "answer_text": "1:武大风气确实很浮夸2:我觉得形式主义很严重，政治作风官僚气息都太强，可能国内的高校都这个尿性。3:校园其实也没有你想象中那么美，况且为了校园而不是为了综合实力来武大不值得。4:实力并不高，论科研实力的话不如隔壁华科，但是有些专业确实很强，比如数理金融，测绘这些。5:气候环境真的差沃日6:学风不太好，有的人说这是自由的校风，但我觉得就是学风不好。7:食堂太他妈难吃了沃日。8:分数能来武大的话，选择面很广了已经，武大真不必要是第一选择。好像很多人怼我的样子，那就说明一下，我说的当然是我在武大看到的感受到的，又没有刻意的去黑，当然这个问题本身也提得不太客观。关于学风的问题，你要说课程少等等，空出来的时间用来去做更多有意义的事，不管是看书旅游都行，但是我看到的大部分都是无所事事，虚度光阴。如果这就是自由的风气的话我无话可说。还有有人说我自己自制力不够？？？你认识我吗你就这么说。然后关于学校实力，再怎么也是一个老牌985，实力不会差到哪里去，我说的实力不强，当然是相对于武大的名气而言的，扪心自问武大真能排第三吗？武大优势学科是不少，但是很渣的学科也有那么多。对于人文社科来说，来武大是不错的，工科呢？？然后我说食堂难吃居然也有人反对，那我不说什么了。然后还是那句话，分数能来武大的话选择面是很广的，没必要第一选择武大。", "answer_votes": "47", "answer_comment": "​104 条评论"}
{"answer_author": "匿名用户", "answer_id": 249015537, "answer_text": "问这个问题的人如果不是清北以上的，那么容我说一句——&lt;img src=\"https://pic3.zhimg.com/50/v2-6c3054f809d387cfe904d24536400e31_hd.jpg\" data-rawwidth=\"400\" data-rawheight=\"296\" class=\"content_image\" width=\"400\"&gt;", "answer_votes": "7", "answer_comment": "​1 条评论"}
{"answer_author": "匿名用户", "answer_id": 262300164, "answer_text": "断电断了40多个小时并且现在还在持续。", "answer_votes": "5", "answer_comment": "​添加评论"}
{"answer_author": "LEO", "answer_id": 193627159, "answer_text": "因为毕业之后不论在哪个城市生活，你都会无比的怀念武汉大学没有槽点的校园环境和你在那里挥洒过的青春。", "answer_votes": "5", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 192800717, "answer_text": "你报不报武大，关我们屁事。", "answer_votes": "5", "answer_comment": "​添加评论"}
{"answer_author": "知乎用户", "answer_id": 201281148, "answer_text": "现在在知乎，网大，贴吧。黑武大已经成了一种政治正确了。就我接触到武大本科生而言，大家都是对武大有很清醒的认识的，从来不觉得自己学校是全国前十，大家普遍认为武大就是中国内陆二线城市中的普通综合大学而已。现在看到网上到处都是武大的帖子，各种不知道哪里来的吹子黑子，把武大的名声弄的是乌烟瘴气，感觉很痛心。", "answer_votes": "6", "answer_comment": "​添加评论"}
{"answer_author": "Enther", "answer_id": 239956339, "answer_text": "食堂比华科差太多", "answer_votes": "4", "answer_comment": "​3 条评论"}
{"answer_author": "周周", "answer_id": 228631689, "answer_text": "一般能考比武大好的学校的人不会问这个问题，所以还是先考上武大再来问这个问题吧！另外武大排第几这个问题很重要吗？一天到晚讨论这种有的没的，是不是闲的蛋疼 ", "answer_votes": "4", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 270850539, "answer_text": "很多人提到的学风浮夸，但是中国很多大学好像都有这个问题。但真不是哪个大学都停电停水还断网这么频，没错我说的就是信部，体验极差。", "answer_votes": "3", "answer_comment": "​添加评论"}
{"answer_author": "华仞之锋", "answer_id": 269905405, "answer_text": "我觉得吧……可能因为在武大的图书馆自习室什么的，经常遇到鬼吧。“你好，同学，请问这里有人吗？”你指着一个空荡荡的座位问。“抱歉，有人……”有人……其实关于武大自由风气这个问题，并不能等同于这里的学子都不学习了。我是十点多看到的问题，随即打开图书馆座位预约系统，信部三楼自主学习室情况如下。&lt;img data-rawwidth=\"750\" data-rawheight=\"1334\" src=\"https://pic3.zhimg.com/50/v2-828a17d414dab0425b7b81e51e07a0db_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"750\" data-original=\"https://pic3.zhimg.com/v2-828a17d414dab0425b7b81e51e07a0db_r.jpg\"&gt;&lt;img data-rawwidth=\"750\" data-rawheight=\"1334\" src=\"https://pic4.zhimg.com/50/v2-c6d760621a911d79d418c83c3fed4e8c_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"750\" data-original=\"https://pic4.zhimg.com/v2-c6d760621a911d79d418c83c3fed4e8c_r.jpg\"&gt;&lt;img data-rawwidth=\"750\" data-rawheight=\"1334\" src=\"https://pic2.zhimg.com/50/v2-d251044987b319134eadfe999f1fb127_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"750\" data-original=\"https://pic2.zhimg.com/v2-d251044987b319134eadfe999f1fb127_r.jpg\"&gt;&lt;img data-rawwidth=\"750\" data-rawheight=\"1334\" src=\"https://pic3.zhimg.com/50/v2-b92aac16d75edbc821e7db312102973d_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"750\" data-original=\"https://pic3.zhimg.com/v2-b92aac16d75edbc821e7db312102973d_r.jpg\"&gt;哈哈哈，终于看到了一个空位置有没有！？然而，，，&lt;img data-rawwidth=\"750\" data-rawheight=\"1334\" src=\"https://pic3.zhimg.com/50/v2-f791e83ab5e65bf01d174261294bd204_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"750\" data-original=\"https://pic3.zhimg.com/v2-f791e83ab5e65bf01d174261294bd204_r.jpg\"&gt;。另外需要更正的是，武大国软是需要上晚自习的，18:30-21:00。不过请假挺容易的。另外今年国软要并入计院了……来以后的软工系要三思。", "answer_votes": "3", "answer_comment": "​4 条评论"}
{"answer_author": "Elsevier", "answer_id": 192745546, "answer_text": "其实去了清北读书，也会有失落。得到的和之前没得到YY的心理落差。武大实力还是很强的，最近几年的分数线也开始奇高了，记得十几年前全国卷时一本线上50分左右基本没问题，今年一个亲戚湖北考生告诉我录取线已高出一本线100多分。比较惊讶。对了，那年湖北一本线在北京可以上清北了，全国一张卷3加2的黑暗时代，信息不全网络还不发达。", "answer_votes": "4", "answer_comment": "​8 条评论"}
{"answer_author": "Haiming", "answer_id": 281361672, "answer_text": "看你是个什么样的人吧，每个大学就像每个城市一样有自己的脾气，脾性不符，你会过的很难受的。在我看来武大的脾性是不甘平庸的，你说他浮夸也好，聒噪也罢，总之他注定不平凡，用被认可或者不被认可的方式在反扑，注定有一天，他的不平凡会被既得利益者们所接受，所正视，但是即便这样他也不会停下自己的脚步，武大永远是更好的武大，而你却不一定。如果你是那种甘于平凡，懂得知足的人，我真的十分不建议你来武大。这里平凡不是贬义词，是指那种希望过上安定生活的心态。从建校之初，这里就是一个属于热血青年的学校。这里的活动太多，会分散你本来就不足的精力；这里的学风太自由，会击溃你那不堪一击的自控力；这里的诱惑太多，会摧毁你那空洞的灵魂。武大从建校之初到现在为止，不论在哪个历史时期，遭遇何种的挫折，都没能将他打败，这已经足以证明他的实力。现在所谓的顶尖高校们，无非是依靠较好的区位优势又或者是党的关怀才变成今天的样子，而武大从国立武汉大学到今天，甚少接受来自权力的馈赠，能发展到今天已经实属不易。靠的是8个字，惟楚有材，于斯为盛。", "answer_votes": "3", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 192851970, "answer_text": "简单来说，不推荐报武大是因为这个学校的学科。虽说有测绘遥感水利之强，但是热门工科专业比如计算机电信电气等都不是特别强，给人一种这个学校只有名气没有实力的感觉。反观同等级的华科，计算机、电信、电气、机械等工科实力雄厚，给人一种性价比极高的感觉。再说文理科水平，武大文科很强(马克思也是全国第一)，理科比如化学，生科等也勉强能排进全国前十(印象中是这样，未实证)。所以涉及到就业方面的话，工科实力强的学校就业当然好，武大就给人一种没什么好专业的感觉。再说学风，武大学风可以说极其自由。相比于华科还有早晚自习，武大只要期末考试能过，平时无论怎么浪都行(如果期末挂科可是很悲催的)。所以如果自制力不强千万别来武大，有可能四年下来你的简历上啥都没有，而隔壁寝室的大神绩点、社团、科研、实习都十分可观，别人保研的保研，去藤校的去藤校，签BAT的去BAT，而你只能苦逼考研或随便找个工作。还有就是地域了。不得不说，现在中国的资源都集中在北上广深，武大身处华中地区是一个劣势。同等级的厦大，中山，北理工等都在经济发达地区，可能找工作找实习会方便许多。综上所述，如果你是想学工科，除非对测绘遥感水利情有独钟，不然就别来武大;如果是文科生，武大是一个很好的选择;如果想学理科，武大只能说一般般，但是同等级其他学校理科也很一般，可以考虑复读一年去清北复交科大等。", "answer_votes": "3", "answer_comment": "​5 条评论"}
{"answer_author": "桃李不言下自成蹊", "answer_id": 272158239, "answer_text": "毕业了舍不得走，所以不太推荐。", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "HollyRedCat", "answer_id": 279418982, "answer_text": "因为武大在湖北，在武汉，所以不是很推荐。学校所在地会严重影响到这个学校方方面面。", "answer_votes": "1", "answer_comment": "​添加评论"}
