{"question_id": "61844203", "question_text": "本人今年应该超过投档线没几分，肯定去不了想去的计算机专业，想大一转入计算机学院，不知道难不难？", "question_title": "华中科技大学内转专业难吗？", "question_commet": "​1 条评论", "answer_number": "11 个回答", "question_followers": "24", "brower_number": "14,522"}
{"answer_author": "HectorLee", "answer_id": 191975828, "answer_text": "看你是想转入计算机专业，这个真的还是挺难的。。。计院一届本科生四百多人，我知道的转专业进来的就一个人（他原来是光电王大珩班的）。。。进校有一个计算机卓越工程师班选拔考试，那个基本上算是你能转入计算机的非常难得的机会。计算机不像电气，电信那样有中英中法班，那种班貌似还可以再转一波专业。但是很遗憾，计院木有这种班（好吧，经评论区RMyzc学弟提示，现在计院有中英班了，学弟加油）。如果高考分数不够计算机但确实真的想学计算机的话可以考虑去软件学院学软件工程，第三四年学费会高一些。也可以试一下计算机学院的信息安全专业和物联网专业，这两个专业都在计院，本科阶段和计科学的课程差不多。学弟加油！", "answer_votes": "8", "answer_comment": "​13 条评论"}
{"answer_author": "思凡Sufan", "answer_id": 226658525, "answer_text": "谢邀利益相关：华科第一届计算机校际交流班成员具体的请看我之前的回答 不再赘述----------分-----------割-----------线-----------好吧感觉两个问题还是有点不一样重新答一遍吧大一下学期由自动化测控专业转入CS 目前大二在读关于转专业的情况，我们学校计算机学院由于不接受转入只能通过测试并且交3W6才能进入测试内容是微积分+英语+全英文面试 1.微积分的进度基本是学到哪考到哪，不用很担心，难度属于中高档题，即没有送分题 认真学微积分应该没什么问题就我这一届的题看的话，除了一道证明题没写出来其他基本都还好。2.英语，很简单，和四级难度基本持平3.全英文面试：其实很水……就是英文自我介绍，然后她用英文问你一个问题 你回答就行有很多学弟学妹问我该怎么准备....emmmm……其实就把微积分（一）的同步辅导的B类题全写完吧 感觉难度和那个差不多英语的话按照四级去准备就行1.录取比例由于我们是第一届计算机校际交流班 可能很多人还不知道 就报名的情况来看不是很火 当时考试是45人考试 录取40人 ，远不如电气中英班120录60人激烈（但是今年的情况……emmmm已经有好多人问过我这个事 而且据我们班主任（秦院长）说 17级只录取35个人，可能录取难度会有点大大）2.课程情况基本所有课程和计科一样，只是我们从大一下开始就不上综合英语了，而是上雅思托福（晚上在科技楼上，一上就上一晚上的英语）选雅思的上雅思 选托福的上托福并且在英语课之外还有外教上的口语课所以课程任务会比较重（何止比较重 很重很重！！）3.保研情况和计科普通班一起保研但是就有一点是转来之后的情况：普通班会不会觉得我们都是交钱进来的对我们有歧视？歧视？不存在的除非你自己看轻自己我们班说实话。就大一下学期的成绩，基本比所有普通班要好很多计算机专业10个班 加上我们班一共11个班大概320人最后保研可能50-60人根据大一下的加权平均分，保研分大概划85.5（为了简洁我就把保研名次的分数简称为保研分）平均每个班保研人数大概在5个左右但是……在保研分是85.5的情况下在我们班，光90以上的就有5个然而别人普通班90+每个班可能只有一两个（虽然这只是大一的成绩，并不能一锤定音，但是还是能反应一些事情）尤其是普通班成绩好的组成了ACM班，加权前三十基本全跑了，我在想普通班只怕真是要被我们按在地上摩擦了....4.出国情况（出国全凭个人意愿，不出国也行，就和普通班没区别了）我们作为校际交流班，是有出国的项目的。就我们计算机校际交流班而言，我们和美国密苏里大学和英国伯明翰大学都有2+2（国内两年 国外两年）项目合作。（最近好像说要加一个英国的曼彻斯特大学的项目 不知道会不会加）出国的费用大概是16万一学期（还是一年忘记了），学校会给你25％作为奖学金，即只需要出12万。能够走项目的条件是1.加权平均分达到75我感觉这个条件一般人都能做到2.雅思6.0（单项不低于5.5）这个条件作为985的学生也不难因为我是学雅思的 所以托福的要求我不是很清楚 ----------分------------割------------线---------2017.12.7 更新 2017年计科校交共报名160人只录取35个额 这个情况我也没想到 只能说 学弟学妹加油吧----------分------------割------------线---------最后附上我以前的回答https://www.zhihu.com/question/62906231/answer/214090856?utm_source=qq&utm_medium=social", "answer_votes": "13", "answer_comment": "​57 条评论"}
{"answer_author": "CaCaCarrot", "answer_id": 228588383, "answer_text": "我是华科大二的，自己没转，同学转了。我是管院的，我们班大一转走了3个，都是报了而且都上了，一个计算机学院，一个自动化，一个软院，都算比较好的学院了，我觉得转专业真的不难", "answer_votes": "1", "answer_comment": "​3 条评论"}
{"answer_author": "范宏伟", "answer_id": 191719290, "answer_text": "还好，不算难并且在华科，搞计算机，有大把的团队可以去学习，比如启明楼里的联创、冰岩、点，三大团队。", "answer_votes": "1", "answer_comment": "​2 条评论"}
{"answer_author": "Derek", "answer_id": 191758264, "answer_text": "转专业机会只有三次，第一次是启明实验班，这个要看能力了，一般很难很难。第二次是中英，这个稍微简单一些，但是学费高，还有一次是普通的，这个就是好的专业竞争大，普通专业较容易。", "answer_votes": "1", "answer_comment": "​6 条评论"}
{"answer_author": "鱼罐头", "answer_id": 228057797, "answer_text": "emmmmm，就转中英/中法班嘛当年的物价水平是36000考试的话，记得是期中考试过后，十二月份，微积分，题目难度适中，别发挥过分差，都能入选总决赛另外，跟辅导员关系别闹太僵硬∠( ᐛ 」∠)＿", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "解涛", "answer_id": 226714173, "answer_text": "曲线救国转电信,课差不了多少", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "mymx123", "answer_id": 200071682, "answer_text": "其实吧，专业并不重要，重要的是学校，那个王大珩班转到计算机的我认识，我还有两个学弟通过大二的学科内转到计算机的，但是只限于信息科学大类专业内部转，不对其他专业调剂的哦！专业随便学点，自己有兴趣可以自学很多计算机课程，不如报一个计算机二学位", "answer_votes": "0", "answer_comment": "​3 条评论"}
{"answer_author": "匿名用户", "answer_id": 192298796, "answer_text": "今年貌似大类招生，只高几分也是有很大可能进计科大类的", "answer_votes": "0", "answer_comment": "​3 条评论"}
{"answer_author": "叫我叶绿素", "answer_id": 192040184, "answer_text": "我那一届大一转专业计算机根本是不开放名额的..", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "Greene", "answer_id": 191638396, "answer_text": "转计算机的话一般通过校际交流班具体什么是校际交流班建议百度华中科技大学校际交流班不算特别难", "answer_votes": "0", "answer_comment": "​7 条评论"}
