{"question_id": "63620002", "question_text": "", "question_title": "在武汉上大学有哪些需要注意的地方？", "question_commet": "​1 条评论", "answer_number": "186 个回答", "question_followers": "1,087", "brower_number": "814,852"}
{"answer_author": "熊婕", "answer_id": 211727711, "answer_text": "今天收到很多私信告诉我这篇回答被转发到QQ空间，贴吧等地方，问是不是我的号还是我授权了。非常感谢告诉我的大家。说一句，我并没有授权任何人甚至没有人告诉我一声，写这个回答本意就是给来武汉的大学生，希望他们能更好的融入武汉，当然是希望更多人看到，如果找我要求转载我肯定是会同意。但是我在个人资料里说了，不欢迎不礼貌的人，不告诉我一声就直接复制粘贴走，那我就当你默认一字千元的标准了呢！1.步行街遇到给你名片让你去体验美容的这种千万别去，骗钱坑人的。2.街道口的鹏程国际还有光谷广场的创业街这一类地点的招聘信息一定要多留一个心眼，很多同学会在大学找兼职工作，千万不要听信他们的交各种押金培训费！基本都是骗子！！（这个一定要记住！）3.买电脑尽量还是去苏宁、国美这样的店，不要觉得自己很专业敢去电脑城自己淘，多半是你被骗。在广埠屯买电脑要小心，尽量不要去，可以搜一搜广埠屯纠纷特别的多，作为学生还是不要轻易尝试！4.一定要准备好厚被子和羽绒服，九月份来武汉遇到秋老虎体验到武汉的热情，但是你不知道冬天的武汉有多可怕！5.学校周边的热干面不要吃！至少第一次不要吃学校的！作为武汉人非常希望你能尝尝正宗的热干面！听了很多吃不正宗热干面的人说热干面不好吃，心很痛！蔡林记也许是最有名的，但是我最喜欢李记热干面还有蔡明纬。6.圣诞节、跨年尽量不要去光、江汉路凑热闹！你被堵在路上回不去的时候别哭。在人多的地方一定小心手机和财物，特别是公交车上！7.武汉是有通宵公交车的，比如去火车站的，所以要是买到晚上的票也不用太担心不方便。8.江滩嘛，我比较推荐汉口江滩，可以顺路去科技馆还有武汉关逛一逛。9.这条要标黑！武汉每年都会给大学新生发武汉通，里面有100元，可以坐公交地铁还能去超市买东西。是纪念版，只有当年的大学生有的，很有纪念意义，所以一定要保存好。我是第一届享受这个福利的，而且我们这一届的卡是最好看的啦啦啦<img src=\"https://pic1.zhimg.com/50/v2-cbf066ef3660b3f5e5f3c815a4d9bf1a_hd.jpg\" data-rawwidth=\"960\" data-rawheight=\"1280\" class=\"origin_image zh-lightbox-thumb\" width=\"960\" data-original=\"https://pic1.zhimg.com/v2-cbf066ef3660b3f5e5f3c815a4d9bf1a_r.jpg\">好看吗？我就炫耀炫耀~~~10.如果你的学校“不幸”在光谷，那么你一定要学会错峰出行，现在的光谷就是一个时尚的大工地，别说公交车了，地铁都不一定能上的去。11.地铁安检请配合，这个是看到一个答案下有人说武汉地铁安检就是因为安检员想要贪污乘客的防晒霜。呸！请尊重规定，也许会耽误一点时间，但是安全出行才是最重要的不是吗？12.武汉欢乐谷虽然没有什么特色但是也值得一去，特别是大学的时候可以买到学生票，推荐你们在工作日没有课的时候去，人少不用排队！13.东湖是肯定要去的啦，东湖绿道也是必去的地方，还有武汉植物园也很值得一去。14.如果你的学校在光谷甚至江夏，沌口，那么记得趁有时间到大汉口也转转吧，不然在你印象中武汉可能真的只是一个交通不怎么方便的大工地。武汉可大可好玩了呢！武昌汉口汉阳各有特色。15.武汉的大学大多都很大，所以到学校第一件事就是一定要摸清楚路啊！我在华师武大华科都迷过路。。。16.一定要注意体育锻炼，在武汉你很容易就吃胖的，毕竟武汉过早可以做到一个月不重样的~！17.出门时保证手机有充足的电，因为你不知道你会被堵在哪里，会堵多久。18.武汉长江大桥很值得去，但是不要一个人走长江大桥，不是因为傻，而是因为一个人走过长江大桥，你就等着单身一辈子吧！19.如果生病了找武汉本地同学问问哪家医院合适再去，比如看皮肤病去武汉一医院，看牙齿去武大口腔，千万不要信百度啊广告的那些。20.汉阳的汉阳造、归元寺都值得一去，汉阳相比于汉口武昌，生活节奏会慢一点。是不是很神奇？一座城市三种不同的生活。21.湖北省博物馆是我最想推荐给你们的，希望你们有时间可以去哟！湖北省图书馆的藏书非常丰富，如果在校图书馆找不到的书可以去那儿找，每周还有各种免费的讲坛和讲座，请的都是大师级别的，非常推荐你们去！（湖北大学的同学们比较方便）22.武汉人说话大嗓门，可能会有同学觉得他们脾气不好，但是啊很多武汉人说起话来就像是在吵架，其实武汉人很友好的，路上问路他们恨不得牵着你的手带你去。23.其实在武汉做个旅游达人是很方便的，高铁火车飞机都很方便，武汉也是九省通衢。如果刚刚来武汉，可以在武汉周边的木兰天池啊，宜昌三峡啊，恩施大峡谷啊，荆州古战场啊玩一玩，一个周末的时间也可以玩的很开心（不要报你们学校墙上贴的那些旅行团，自由行或者报团都是不错的选择，一定要注意安全！）24.这点我也想标粗武汉的传销窝点也有，请大家一定注意安全，不要轻信什么老乡同学！之前做社会新闻，看到这样的事情都很痛心，所以希望大家一定注意！有什么事情及时和家人辅导员联系，如果外出尽量告诉室友和同学去处，一定要注意安全啊！希望你们在武汉过的开心更希望你们在武汉安安全全的度过这四年（感觉做了记者以后就变的特别爱操心了，不！我还是个少女!）25.江汉路，南京路，大智路，吉庆街，黎黄陂路，这些都是在一条线上的，最后还可以去古德寺看看。推荐你们在多云不热的天气好好逛一逛，个人认为比昙华林有意思的多。26.个人不怎么推荐黄鹤楼和户部巷，但是在户部巷买个烤猪蹄，吹着江风坐在旁边的江边看看江和朋友聊聊天也挺开心的。27.之余逛街无非就是江汉路 楚河汉街 光谷 武汉天地和武广了，我还是爱江汉路和武广，毕竟是汉口人23333其实主要是这边交通更方便，1号线2号线6号线都很方便的，光谷太堵。评论下有同学补充：在武昌火车站有“迷路”的中年妇女借回家的车票钱，别相信她，也别给她。其实还有在路上说联系不到家人借钱吃饭的装聋哑人要钱的，希望大家都不要相信，这个在每个城市都有，但是武汉的大学生非常多，所以会更多一点，希望大家的善心不要被欺骗了！还有什么一时想不起来，先写这么多吧，如果有什么想问的欢迎来问我。给你们另一个答案做一个补充参考。熊婕：有哪些建议给初到武汉生活的知友？希望大家不要因为一件事一个人而对一座城市下定论。最后希望你们喜欢武汉这座城市，希望你们能在武汉留下美好的回忆。", "answer_votes": "715", "answer_comment": "​351 条评论"}
{"answer_author": "元首", "answer_id": 211991133, "answer_text": "武汉是一座大城市，这个大，体现在你要是在藏龙岛上学，汉口对你来说就是另一个城市，而宜家，每次去就跟旅游一样。武汉本地公众号推送的美食，要么是已经烂大街的东西，要么是已经变了味儿的东西。真正靠谱的美食地图是你身边那个看起来最胖的武汉本地土著同学。请记住，你是来读书学习的，并不是来领略城市风光融入城市生活的。因此不要过于纠结这些问题。如果实在对武汉有兴趣，不如好好学习毕业找个好工作，娶个武汉媳妇儿。请注意，如果找武汉媳妇儿，请抛开武汉人这个属性，单纯从妹子个人来选择。武汉话不都是脏话连篇，也有很多很好玩的部分。所以，请远离那些满嘴脏字的垃圾，他们不代表武汉。热干面是一种处于薛定谔的猫状态的食物。没吃之前你充满好奇，吃了之后你不太适应，于是决定不吃，然后过一阵再重复这样的过程。但是对于某些人来说，这真的不好吃。比如我。大学只是一个学习阶段而已。至于社会，那是另一个状态。因此别抱着预演的心态过大学，尤其是那些社团和学生会之类的。有心情就去，没心情就不去。也别在意什么部长会长之类，更别对师兄师姐有什么崇拜。他们只是比你早入学而已。对于我们这些社会人儿来说，你们都是学生，傻的可爱。接下来更重要了！大学，是你最后一次有闲工夫的时光。所以，一定要趁这个机会把驾照考了。但是并不需要急于谈恋爱。有合适的就谈，谁也别追谁，费劲。如果成功脱单，请注意保护自己，无论男女。我曾在读书时给别人借过太多次钱用于kill baby。。。有男有女。。。最后，欢迎大家来到武汉学习。另外。。。我不是在武汉读的大学。只是由于工作生活在武汉，加上本身做的就是武汉本土文化相关。。。所以对武汉有很深的了解罢了。。。另外，最后的最后，欢迎大家在武昌创业，说不定就加入我们武昌区工商联了呢", "answer_votes": "52", "answer_comment": "​52 条评论"}
{"answer_author": "铭志star", "answer_id": 212167939, "answer_text": "他们都说的是找工作，出行，吃饭，我说个不一样的。武汉的KTV色情服务全国有名，在武汉呆超过一个星期的人都知道，摸摸唱，简称，mmc，听名字就很色情。但是！她们都是利用男人好色的bug骗钱的！你以为陌陌上一个女生约自己去KTV（非常多）是一起唱歌交友，而且她表现出今晚很寂寞，你去了就发现消费如流水，消费完了该带走了，不好意思，人家要回宿舍，说不回宿舍就罚款。别问我怎么知道！血与泪的教训，当年我消费到没钱打车回家，最后朋友来接我回去的。要脸，别赞。不过下次有钱了还是会去，知道公主真的带不走了，发现她们服务真棒，尤其是汉阳，三个地区最开放的就是汉阳，玫瑰街，桃花源，最坑的就是汉口的钻石皇朝，你信不信手都不可以摸的两个小时就消费两千！店大欺客啊，还是小店实惠。很多仙人跳，各种色情骗局，其实我们这种在武汉呆了七八年的老司机一眼就看穿了，但是题主说的是大学生，那在KTV公主手里真是分分钟上当没商量，分分钟就撩的热血沸腾，揣钱打车就去送钱了，最后财色两空。最后我想说句前辈老司机给我说的话色字头上一把刀。年轻人，把持住啊！", "answer_votes": "195", "answer_comment": "​144 条评论"}
{"answer_author": "知乎用户", "answer_id": 211195510, "answer_text": "评论也很精彩……………………………………………不要嫖女大学生！记得当年中国青年报，有篇报道就是说武汉女大学生卖淫的事，引起了很大的争论。新闻本身的真实性，也曾受到质疑。然而，多年过去了，女大学生卖淫，似乎成了全国多个城市和多所高校不得不面对的问题。当然，卖淫的方式也在变化，包养、KTV、网上联系卖淫……唉，大家可以谈恋爱，但不要嫖女大学生。答应我，好不好。", "answer_votes": "686", "answer_comment": "​518 条评论"}
{"answer_author": "HectorLee", "answer_id": 211904744, "answer_text": "无论男女，找男朋友，记得去华科。", "answer_votes": "103", "answer_comment": "​161 条评论"}
{"answer_author": "man lm", "answer_id": 212051543, "answer_text": "如果第一次吃热干面你就爱上这玩意儿了，那恭喜你，下面的可以不用看了。如果第一次吃热干面，你骂这TM什么玩意! 并决心再也不吃的时候，请一定第二天，第三天都买一份热干面过早。因为你后面早晚会爱上这玩意。", "answer_votes": "182", "answer_comment": "​181 条评论"}
{"answer_author": "Kukmoon谷月", "answer_id": 211684672, "answer_text": "不要跟秋叶学包括ppt在内的职场技能。不要买秋叶的课程和书。秋叶以武汉为根据地，针对大学生的迷茫与焦虑，推销其课程，收取智商税。", "answer_votes": "37", "answer_comment": "​23 条评论"}
{"answer_author": "囧 雪诺", "answer_id": 211556770, "answer_text": "武汉市政府给大学生发的含100武汉通挺好用，不要全部刷酸奶喝了&lt;img src=\"https://pic3.zhimg.com/50/v2-f33844fb26537b661610505c15fa78ae_hd.jpg\" data-rawwidth=\"133\" data-rawheight=\"120\" class=\"content_image\" width=\"133\"&gt;", "answer_votes": "123", "answer_comment": "​90 条评论"}
{"answer_author": "广君", "answer_id": 212031235, "answer_text": "1、清明节前后千万不要去武大，如果你是武大郎，最好别出寝室门。2、节假日不要去光谷凑热闹，跨年不要去江滩凑热闹，因为真的很热闹。3、黄鹤楼外面看看就行了，实在控制不住心里的冲动，去一次就好，记得带上学生证——来自一名去过七次黄鹤楼的“促进武汉旅游事业积极分子”的诚恳建议。4、湖北省博物馆、湖北省美术馆、汉街半日游很充实。5、黄鹤楼、户部巷、辛亥革命纪念馆、长江大桥、汉口江滩一日游很充实，回程记得乘轮渡过江。6、汉正街后面的江滩上有个石凳，编号是5201314。7、男生缺钱了可以去三阳路试试，很可能会获得一笔不菲的“劳动报酬”。8、昙华林、武汉天地、403、德芭与彩虹、汉阳造艺术区，适合文艺又小资的同学。9、武大凌波门、汉口江滩芦苇荡还有上面那些个文艺又小资的地方适合拍照。10、若是想找个没人的地方，古德寺，大智路汉口火车站，还有万国公园都是不错的选择。去古德寺不要嬉闹，会有老大妈跟你碎碎念。刚下过雨不要去万国公园。11、想感受一个朋克的武汉可以去棋盘街看涂鸦，可以去VOX听摇滚，也可以去和各路公交车司机说说话。12、在学校里有辆电动车会很方便。13、从武昌去天河机场绕二七长江大桥会比直接穿城快很多。14、广埠屯的发票似乎比数码产品更值得信赖。15、找一个男\\女朋友，上面的许多事都会变得更美好。暂时就想到这么多", "answer_votes": "72", "answer_comment": "​45 条评论"}
{"answer_author": "鬼畜破", "answer_id": 212187218, "answer_text": "人生吃的亏，和受得骗，总要自己一样一样的经历了才好。国婊子养滴跟老子你多听听，很快也就不离口了。但是武汉的冬天有多冷这个事儿，你就不要较劲了…………那是完全较不过的……那是我人生第一次被冻哭，你知道我是怎样的汉子么？烟头往手上一按眼睛都不眨！四十度的北京，硬顶着太阳眉头都不皱。这么大的蟑螂，会飞的那种，面不改色心不跳，一脚踩死一个！！！！零下三十多度的哈尔滨中央大街，一件普通衬衫一件羊绒大衣，我不仅能跑能跳，还能摆造型！拔智齿，我是生生没打麻药！艹她妈你是不知道武汉有多冷(╥﹏╥)｡他那不是冷你知道么？他那个叫“足以让灵魂绝望的极度深寒与最初的恐惧的寒冰地狱”不仅冷而且湿度特别大你知道么？？？？？羽绒服根本不好使你知道么？？？？？？？你得买皮的！！！！！买自发热内衣！！！！切记自发热的！！！！还有除湿器！！！！！寝室应该有空调，千万别不舍得钱！开！！！！！！！", "answer_votes": "39", "answer_comment": "​26 条评论"}
{"answer_author": "岩中花树", "answer_id": 211634593, "answer_text": "想了想，从学、玩、衣、食这几个方面想想自己在武汉这快10年吧。学：1、进校第一个月，不要相信除了辅导员之外的“学长学姐”的“哲理”（比如忽悠创业、60分万岁），尤其是想跟你谈生意和钱的。2、可以多买些书。提前买点自己专业的入门级、进阶级的书，上了一些课程后买点专业级、哲学级的书。武汉的书店啊、盗版批发市场很多，我本科所在的理工大学旁边的出版城后面也是“出版城”。3、如果学校是211基本上就在洪山区了，可以多串串门，感受一下学风的差异，尤其是多来华科武大走走，多听听课。大班课基本上可以随便听，小班的也一般不会有老师介意。其他学校的也可以来，但估计常来不太方便。4、武汉夏天很热、冬天很冷，但是也要经常走出寝室去自习。图书馆的内环境应该还是不错的，最为推荐，但请在图书馆里先仔细看看阅览制度再进门；如果图书馆爆满了，去教学楼次之；教学楼爆满了（一般非考试周不太可能），去安静的奶茶店再次；最次是寝室。5、大一基础好好学，别顾着疯玩(˶‾᷄ ⁻̫ ‾᷅˵)这是我的辛酸泪，如果真忍不住想玩一会，尽量别让GPA低于3.0，所有功课及格是底线；大二要好好准备专业、夯实专业基础咯，多看书、看好书、好看书，刷GPA；大三尽量拔高冲刺，如果准备考研，最晚大三下开始行动，如果准备出国，最好大三上就着手，如果想保研，大三上的时候默默旁观新大四的走流程；到了大四，木已成舟，即便悔之晚矣，也不要自暴自弃；如果收获满满，更要开怀畅饮( ´▽｀)毕业酒虽好，不要贪杯哦。6、武汉7校联合办学是个好东西，但是一定要好好斟酌，努力和成果因人而异。7、大学里多交几个华科武大的朋友。名企招聘、名校宣讲、大师讲座，基本上都是华科武大的学生们近水楼台了，其他学校的学生都是来赶趟儿的。8、武汉学校的境界整体上还是比较封闭落后，不如沿海学校开放先进。大学期间如果有机会，在安排好行程、学习安排和财力安排、并且有合适的院校机会的前提下，一定出去交换看看，读暑期学校、学分课程或是做交换生都可以，肯定会大有裨益。9、多上cnki（中国知网）和ncpssd（国家哲学社会科学文献中心），肯定会有好处。10、少在课堂上使用电子设备。玩：1、刚来一个月内，别去光谷......节假日别去光谷......如有可能，尽量不去光谷......华科学子除外。2、旅游啊吃饭啊什么的一定找正规单位，付款一定要有发票或者较合规收据。3、武汉商圈蛮多的，这些年我看着一个个商圈如雨后春笋......看新生入学发的《最武汉》应该没错。建议选择吃饭逛街购物看电影如果条件允许，尽量选择去汉口商圈，e.g.武汉天地、江汉路、武广什么的。4、新生入学的武汉通政府赠卡别丢了，以后会经常用，大学毕业去了外地也可以做纪念。5、多听辅导员的话，出去玩按照办事流程和手续来，一是尊重、二是出事了有照应。6、武昌是湖北省的武昌，很多历史文化遗迹都在，国立网红大学、中共会议、毛主席故居和各种博物馆等等balabala可以百度的；汉口是武汉市的汉口，租借风情不错哟，江汉关、古德寺、沿江大道、汉口江滩必去，还有武昌-汉口的轮渡傍晚黄昏时分可以坐几摆、几块钱一次蛮划得来；汉阳嚒......几百年难得去一次，不过琴台剧院、音乐厅值得一去欣赏；江夏貌似现在建设的也还可以了，以前感觉过了三环都是荒地......鱼丸好吃的、农家乐不错的。7、东湖绿道修的蛮扎实，可以多去骑车，景色也不错，就是注意天气。。。8、外地第一次来，建议可以在不反对的情况下去一下归元寺数个罗汉。。去旁边铁佛寺看看。。9、出来玩，记得带上你的学生证。10、红灯区什么的蛮复杂。。。我也没去过。。。但是洁身自好总是没错的，年纪轻轻搞这些不好。。。衣：1、一年四季有时候也可以是一日四季，寝室里还是备着些衣服，多是夏装和冬装就够了（广东同学请自行咨询广东学长学姐(˶‾᷄ ⁻̫ ‾᷅˵)）男士的话建议考虑备一套northface的加厚冲锋衣，这样一来很省事。。。冬穿厚、雨穿薄。2、奢侈品衣服店子蛮多在汉口咯。。廉价的到处都有。。各取所需，但是别去地摊。。3、经过雄楚大道、关山大道、民族大道等一年有365天都在施工的路，请谨慎选择穿鞋。。4、在大一下的四月，找个信得过的店子，买双耐用的雨鞋（武汉话叫做套孩），如果到了五月还没买，你会后悔的。5、夏天在衣柜里一定放点樟脑丸什么的。食：1、一般来说，湖北本地的应该对过早（早餐）的热干面豆皮蛋酒鱼糊粉什么的都能接受（本人十分热爱\\(//∇//)\\）外地孩子刚开始可能吃不惯、时间长了可能就会爱上了......不过大武汉有九省通衢之美名，南北美食海外名点在全市和各大高校内都有分布的，不会出现找不到家乡菜馆的情况.....2、湖北的排骨藕汤，谁喝谁知道，原来在英国的华人餐馆喝到了一口藕汤.....(˶‾᷄ ⁻̫ ‾᷅˵)浓浓的家乡味；排骨么要新鲜的、筒子骨也好，藕嚒，一定得是洪湖的藕、最好是潜江的黄湾藕，不然就没味道了。3、油焖大虾......呃......这个我过敏，不过听别人吃过的都说好，（给老家打个广告），乘坐高铁往返武汉潜江很方便，只要50分钟，票价不贵发车也多，潜江的油焖大虾品质更好、品种更多、也更正宗。4、烧烤摊子.....每一个常去烧烤摊子的大学生，都有一段深夜吹b或者深夜痛哭的难忘经历。5、户部巷什么的......反正我是觉得不咋地➕坑钱，旁边的粮道街倒是不错的，经常去过早。6、水果湖的机关食堂据说不错，据悉是对外开放了，有机会看看，物美价廉。7、必须来华科的食堂吃饭啊！30+食堂，个个都还好吃！！关键是用学生卡贼便宜啊，热干面外面三块五华科只要一块五啊！！！8、理工大南湖校区的食堂贼难吃，还贼贵，但是不远处的九龙大酒店（理工老哥聚会指定官方大酒店，学生证88折）升升美食广场和东、西院的食堂吃的都还不错。P.S.东院风味食堂经常有隔壁的妹子来，理工的学弟们...我就说到这里了啊 :D9、汉口沿江大道上的租界房子很多改造成了会所和饭店，消费相对于学生来说较高，但是蛮值得一去的。10、武汉天地消费蛮好的，就是一般学生请事先注意一下预算。以上--------------------------------------------------------------------------------------------------------深夜看到这个问题也是感慨了一下，一是感慨武汉这几年变化之大、二是回想一下自己大学时候走了许多弯路，总结了不少教训，不少过来长辈、老师、学长学姐都曾真诚给予我帮助，目前无以为报，写点东西，传递帮助吧.....如果对你有用请点个赞(˶‾᷄ ⁻̫ ‾᷅˵)，如果有疑问或者是不赞同请在留言区一起讨论，谢绝无建设性乱喷。(˶‾᷄ ⁻̫ ‾᷅˵)欢迎来找我玩～【一般没时间(˶‾᷄ ⁻̫ ‾᷅˵)】--------------------------------------------------------------------------------------------------------Update:    感觉住、行和商也可以写一写...住：1、武汉的7所211基本上已经实现了空调全覆盖，其他学校抱歉真是不太清楚，据说普及情况也做得不错了；热水卫浴嚒，好像还在普及ing，一般以本科生为主体的新校区都是普及了；总体上来说，大多数学校把本科生照顾得还是不错的，尤其是有（gong）钱（ke）的学校，博士生次之，最次是硕士。话说，在这样的条件下，一定要注意提前问一下直系学长学姐，然后因地制宜...该买床帘、窗帘和宿舍地板（以防理工大学升升公寓这样的水泥地）的就买，顺便安利几款自己用得满意的宿舍神器：公牛多功能转换插头、水龙头过滤器、宜家莱瓦书架、一元一捆的塑料包装绳。2、入住的第一天会遇到伪装入寝的推销人员（100%都是骗钱的）is probable，每到节假日寝室里混进来不法分子is possible，你身边的同学缺钱了、堕落了、变故了而变质is possible，所以请谨记随时随地保证随身携带钥匙离开or寝室里有放心的人留守，另外自己的柜子也请上锁；电脑什么的贵重物品最好锁着or有人看着。3、开学第一周办理电话卡、办网络啊balabala，最好打开手机地图，自己找到学校里的or最近的电信移动联通营业厅or官方推广帐篷，别找兜售电话卡的学长学姐买（基本上拿钱走人），不然后面万一有纠纷很难处理。P.S. 不推荐办外网，因为以后校园网的便利会特别突出。。。校园网一般都还不错，我在南湖的校园网贼快，峰值14mb，但是一到选课就gg。。。4、我的经历和看的实证告诉我跟离我住的不远甚至偶尔见多了还主动上来凑近乎的留学生哥哥可以谈话、可以交流学术和生活、可以做presentation，但最好跟他们保持礼貌距离，勿谓言之不预。可能有人会问为什么是留学生哥哥而不是姐姐呢......这个是不宜公开讨论的敏感话题。5、宿舍是你只交了几百上千块钱的集体廉租房，不是您想住的单人入住四季酒店行政套房。跟室友搞好关系、搞不好关系创造条件也要搞好关系，实在不行惹不起还是躲得起的；跟楼友也尽量尊重，不要在寝室里听歌打游戏外放（除非室友允许）、吃螺蛳粉等味道大的食物、光着屁股走来走去、楼道里拍篮球、喝酒开趴耍酒疯、赤身裸体到处晃、高声喧哗引吭高歌，这样只会显得自己很没教养，如果你比较知名，OK，你的知名度越大、名声越臭，我大学四年受够这种人了（是个正常人都烦），如果抽烟请尽量到楼道窗户那里抽，打电话去厕所、天台or anywhere except别人寝室门口，熄灯后请轻一点最好不要开自己的灯以免影响到上床的室友。宿舍里、宿舍间的诸多矛盾都是因小事而起，况且与人方便也是与己方便。6、晒被子鞋子衣服什么的谨慎上天台，有的人手脚不干净；晒在窗户外面注意固定好，夏天冬天很容易起风吹到外面去；武汉夏天可以睡个午觉就把衣服晒干、冬天可以一个星期都干不了。7、见到楼管大爷、大妈多问好，没事陪他们下下棋聊聊天，你会发现以后求他们办事啊、问他们怎么办事啊什么的会方便的多...8、搞好寝室和个人卫生。我从高中开始养成的习惯是寝室基本上每天一次清洁，每周一次大扫除，自己每天早晚两次刷牙，每天洗澡，夏天一天1-2次，每天洗头，卫生搞好了会让人身心愉快。9、寝室里讨论不可描述、不可外泄的话题越多，寝室关系越好。10、跟武汉本地的伢搞好关系玩转武汉，武汉本地的伙计也应该主动帮助外地同学尽早适应。交流过程中可能会发现有culture shock比如我两个广东室友总觉得我说话太大声一天到晚像在吵架然后“个bz养的”之类的词太多感觉对不起“创建国家文明城市，做文明武汉可爱市民”的标语...这很正常，时间久了有了共同话语就磨合好了。比如在我的带领下，我们寝室四个人现在都是某位不可描述的伟人的资磁者。行：1、武汉曾是中南大区的驻地、是国家中心城市、湖北省省会、华中地区唯一的副省级城市、汉水和长江在此交汇，铁路、公路、航空、水路交通发达，票只可能是你抢不到、而不是买不到，学生证坐高铁动车二等座和k车非卧铺可以打折，武汉通在地铁站充值免收手续费还开发票、发票留着你以后用得着。2、当你需要跨江时，应理智地选择乘坐轨道交通2号线而不是向一脸茫然看着你告诉你“我是武昌的车”的出租车师傅挥手；当你选择去江夏区等非武汉中心城区时，应理智地选择9XX或者7XX之类的公交车or等以后高新区的新型轨道交通而不是坐上等着宰你的黑车；等公交车时候，武汉本地的都晓得应该在朝车站外车开去的方向10-20米处等车停下来；刚来武汉的同学要做好心理准备，公交车师傅能带你体验安全的速度与激情，以前高中时候坐570那个破车，从汤逊湖北路回南湖走还没修好的、一路上全是小商贩和学生、一边是臭死人的巡司河另一边是华农的粪田的近似单车道的李纸路，师傅居然敢开40码还打转......；在4-6点打车是不理智的，师傅忙着交班；出门前不看手机地图看看哪条路又被挖了也是不理智的；女生不要单独行动，尤其是晚上，一般聚会后我都会送女生到门口，安全第一...3、不要相信素不相识的“老乡”拼车和顺风车（滴滴除外），我高中时候见过会说三种方言的“老乡”；女孩子不要相信有车的学长带你出去只是“逛逛”，男孩子嚒，有可能真是逛逛；摩的可以拿生命试一试。4、手机里下个“地铁通”、“铁路12306”、“携程旅行”、“航旅纵横”、“滴滴出行”、“ofo共享单车”。5、没事的话不要去什么学校旁边的红灯区，比如什么雅安街、瑞安街、岭南路、石牌岭，也不要去周围不干净的会所酒店歌厅KTV，万一碰到去兼职的同学多尴尬。6、马鞍山森林公园从华科附中东北门的小路进去不用票，为什么我知道因为我在家吃完饭散步进公园就走这条路...(˶‾᷄ ⁻̫ ‾᷅˵)别广而告之了；国立网红大学的老牌楼不在八一路那个地方，在武珞路上的珞珈山国际酒店后面的珞珈山路...；理工大学南湖校区的孩子去街道口堵车的话不要走完珞狮路，走到楚玉酒店旁边的珞桂路右转进华师大，然后走华师大里面出去是最快而且一般不堵车，回来同理可得。7、长江观光的话，坐汉阳门（在武昌）那边的轮渡是最好的，只要几块钱而且可以刷武汉通，我有个大学同学坐了280的游艇，其实就是多了个灯光.....8、到了广埠屯走快一点，卖假发票的、推销垃圾电脑的、卖yin的、发小广告的贼烦人...而且靠近以前老华师文化街的地方的那个烤羊肉串的新疆小哥的摊子真是太熏了...每次都把我眼睛辣到。9、在下大雨➕节假日➕2018.12.28之前➕上下班通勤期间都具备的情况下来到光谷广场会给你留下深刻的印象。（其实我没上大学之前的那一阵子还蛮好的）10、开车or坐车一般能走二环、三环高速路就不要穿市区了，怕堵车。商：1、广埠屯的电脑、光谷广场及其周围的推销洗护用品、中南路的发票、买了就后悔。2、没有什么书籍是你们学校的旧书店老板搞不到的，如果有，就来理工大旁边图书城后面的“图书城”，这里都搞不到估计是还没出版。3、吃饭购物高端路线往汉口走，特色亲民路线往武昌走，低质易耗路线往江夏走。4、去各种地方（尤其是景点）消费之前记得带上学生证并询问是否有优惠，支付宝的大学生认证也很能省钱，尤其是海底捞的79折，啊我感觉我因为这个79折都不怎么去其他火锅店了...5、说个小众一点的，铁路系统也是可以办理货运的，行李送回家可以走这个，三大火车站都有点，不过现在貌似装修了，具体地点请咨询工作人员，价钱比起快递实惠很多！我一个柳州老铁大学四年的行李都是走的这个。6、在你家里开得出1k生活费的情况下就别找兼职了，我一个月2k基本上能留1.1k做储备金；实在是困难的先依次考虑得奖学金、国家助学金、学校助学金、国家助学贷款、实习、兼职；兼职找辅导员推荐最好，学生自律自助组织次之，外面中介再次，蒙到的最次；要先交钱再介绍工作的就别去了；工作类型最好是跟你们专业有关的啊，一个大学生别跟中学文化的人抢工作，这对不起你的边际收益啊！！！其次是家教，再次是大型正规企业的杂活儿，沃尔玛中百武商什么的貌似都招的，最次就是一些中小型企业了，注意谈好条件，保存合同，发传单什么的不是很推荐.....7、每到毕业季，可以去跳蚤市场压榨一下毕业狗，而且他们还会很感激你。8、学校附近的小饭馆是老乡叙旧、学生干部腐败的天堂，不过食物质量难保证；小旅馆很脏，你男朋友带你去那的话基本上可以考虑分手；汽车站、火车站附近，尤其是傅家坡车站附近遇到招嫖、卖手机（偷来的赃物）的人，别搭理；购买、维修苹果设备优先去校园体验店，Apple官网上有列表，链接在此：教育 - Apple 校园体验中心 - Apple (中国)。9、自己好好对比一下现在雨后春笋般的奶茶店的食谱价格、味道和环境，你会发现costa和Starbucks真是很良心了。10、去正规店子而不是对车源不能保证公开的地方买自行车和电动车，很多东西都说循环使用的...", "answer_votes": "177", "answer_comment": "​142 条评论"}
{"answer_author": "明郁欢", "answer_id": 211655272, "answer_text": "给大家推荐几个年轻人去的地方非常小众的地方干货哈！！！本人二十多年武汉原生小土著哈哈哈我知道一提到武汉玩的地方大部分人就知道光谷江滩江汉路户部巷接下来推荐几个小众的地方记好了TOP1VOXlivehouse &lt;img data-rawheight=\"750\" src=\"https://pic3.zhimg.com/50/v2-9985bde5d07c240551acef0b37d5ff3b_hd.jpg\" data-rawwidth=\"1001\" class=\"origin_image zh-lightbox-thumb\" width=\"1001\" data-original=\"https://pic3.zhimg.com/v2-9985bde5d07c240551acef0b37d5ff3b_r.jpg\"&gt;&lt;img data-rawheight=\"800\" src=\"https://pic1.zhimg.com/50/v2-ecee8786539d9e3bc614d7e799e8dcd1_hd.jpg\" data-rawwidth=\"1068\" class=\"origin_image zh-lightbox-thumb\" width=\"1068\" data-original=\"https://pic1.zhimg.com/v2-ecee8786539d9e3bc614d7e799e8dcd1_r.jpg\"&gt;&lt;img data-rawheight=\"1334\" src=\"https://pic3.zhimg.com/50/v2-f341a916aca32979ffd60e078d431bf9_hd.jpg\" data-rawwidth=\"750\" class=\"origin_image zh-lightbox-thumb\" width=\"750\" data-original=\"https://pic3.zhimg.com/v2-f341a916aca32979ffd60e078d431bf9_r.jpg\"&gt;这是属于武汉摇滚乐的小圈子票价便宜百把块钱喝酒也很便宜几十块钱一瓶啤酒看演出的也大部分是年轻人这是本人最爱去玩的地方TOP2感官唱片店&lt;img data-rawheight=\"1334\" src=\"https://pic2.zhimg.com/50/v2-5a555c0869d23f6607ba99b5c24bdf38_hd.jpg\" data-rawwidth=\"750\" class=\"origin_image zh-lightbox-thumb\" width=\"750\" data-original=\"https://pic2.zhimg.com/v2-5a555c0869d23f6607ba99b5c24bdf38_r.jpg\"&gt;这家店是小众到不能在小众的店建议可以带姑娘去看看电影什么的知道的人极少TOP 3江滩jazz酒吧演出每晚九点开始不要门票这个酒吧音响酒水也都还可以喜欢爵士 布鲁斯音乐的可以来看看各位来上学的朋友们请注意过马路不要玩手机到处都在修路^_^有人赞我再更新几个地方哈哈点个赞吧大佬们。。。。。。。。。。。。。。。。。4 音乐学院附近的 海岸线酒吧本来想再多推荐几个有意思的livehouse 可惜有的很多酒吧都倒闭了。。。这年头混口饭吃也是不容易光谷附近昙华林女孩子应该可以去玩玩拍拍照咖啡店坐坐啥的不过这个真不算小众吧武汉天地也可以逛逛只不过那边消费太高学生应该都消费不起我读高中的某一年去那里还遇见过刘亦菲被一群人围观。。。除此之外暂时想不出什么地方好玩了到处都在修路空气灰尘又大我平时都选择宅死在家。。。最近vox装修又是更加无聊。。。。总而言之在武汉注意 火车站 是比较危险的地方切记不要跟陌生人走除此之外个人感觉这个城市还是非常安全的尤其是越繁华的地方越安全个人觉得群众还是比较热心的有人敢扯着你们老武汉人一定会上去搞一句你个斑马搞么斯啊婊子样的是想死吧？&lt;img data-rawwidth=\"750\" data-rawheight=\"1334\" src=\"https://pic2.zhimg.com/50/v2-812a42c257455fa4b10b9a3a31633871_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"750\" data-original=\"https://pic2.zhimg.com/v2-812a42c257455fa4b10b9a3a31633871_r.jpg\"&gt;你们见过哪个地方演出限量观众人数的？？？？？离的近的朋友23可以去啊哈哈", "answer_votes": "61", "answer_comment": "​46 条评论"}
{"answer_author": "小明", "answer_id": 211470210, "answer_text": "1.坐车要拉好扶手，不论是的士还是公交，地铁就算了2.发现有人吵架，而且吵得不可开交！不要惊讶，请放心，他们只是在正常聊天3.不用带现金，做任何事都不需要现金！(汽车加油等个别案例除外，如果实在急用现金，可以试着找附近的小超市直接用支付宝提现)4.放暑假就快回家，别在武汉瞎溜达5.追武汉女生一定要\"痛快\",\"诚实\"，别做作6.请下载好高德地图，出门时看看地图，合理规划路线，避免拥堵(有时候骑摩拜比公交的士快)其他的都没什么了，欢迎来大武汉一切以评论为目的而不点赞的行为都是耍流氓……", "answer_votes": "57", "answer_comment": "​60 条评论"}
{"answer_author": "知之", "answer_id": 213662972, "answer_text": "夏天能穿多少穿多少，冬天能穿多少穿多少！！！春和秋？武汉哪有这两个季节 ", "answer_votes": "3", "answer_comment": "​5 条评论"}
{"answer_author": "西瓜酱", "answer_id": 211362442, "answer_text": "更新~既然有人看的话，我继续来写几条吧对于第二条，滴滴比出租车贵，可能是因为我基本没坐出租的原因，不太了解出租车的情况，有错误话可以听听其他人的意见。我刚来武汉的时候坐出租感觉有点贵又听别人说司机会绕路坑外地人，所以没用了。喜欢用是因为滴滴上可以看到价格而且有时候会有优惠券，所以成为了首选。1.武汉只有冬夏，没有春秋（这个没人反对吧）……我们老师说，适应了武汉的天气以后，到哪都不怕了（微笑）补充……我说的没有春秋就是只春秋很短，春秋装不用准备很多，天气多变，可能今天穿短袖明天就想穿毛衣，而且经常在穿秋裤，脱秋裤，洗秋裤，收秋裤的轮回里。2.出门还是尽量公交地铁吧，再不行就滴滴用快车。（出租车虽然起步10，但是我坐坐出租车车费没低过30，滴滴一般几块钱）可能我几年没坐出租了，前几年的滴滴经常会送优惠券，5元10元的减，就坐习惯了。3.武汉人素质真不算好，但是大学生的素质还是在的，坐公交地铁的时候还是注意大叔大婶啥的，小心被怒怼。4.武汉人特别多，节假日出游做好心里准备，特别是光谷。说光谷人少的我就特别不同意了，在光谷坐过公交的人来握个手(*꒦ິ⌓꒦ີ)（有人看的话就继续更新吧）5.武汉有三个火车站:武汉火车站（最大），武昌火车站和汉口火车站，前两个在地铁四号线上面，后一个是地铁二号线，二号线也是最挤的一条地铁线……基本上没看见过空位。还有，武汉的公交卡，可以先不用办，学校会发的而且里面有100（有人已经回答过了，应该是每个学校都有，我们学校是在10.1以后发的，当时不知道，我开学就自己办了一张）以下是地铁线路图，对于经常堵车的武汉来说，坐地铁是很方便的，不要在地铁上吃东西哦~&lt;img src=\"https://pic1.zhimg.com/50/v2-05f4aa107ca7e3c6e8bf5a7b4ea8b5bc_hd.jpg\" data-rawwidth=\"2048\" data-rawheight=\"1633\" class=\"origin_image zh-lightbox-thumb\" width=\"2048\" data-original=\"https://pic1.zhimg.com/v2-05f4aa107ca7e3c6e8bf5a7b4ea8b5bc_r.jpg\"&gt;6.学会用导航（武汉还算是比较大了吧，如果你学校在偏远地区，就要公交转地铁转几次……羡慕生活在城里的孩子），拿着手机和公交卡就可以走遍全武汉了……然后你会发现到处都是人，出去玩都会成为别人拍照的背景，而且有时候全把时间浪费在路上了( ‘-ωก̀ )。7.武汉容易下暴雨，很多学校都会被淹，可以看到“海景”顺便游个泳。冬天的空气很潮湿，袜子经常不能干，衣架可以多备几个（感觉永远不够用），说起天气来，武汉就有说不完的话题……作为一个妹子，在夏天，经常纠结该带雨伞还是太阳伞，因为经常大晴天的突然就下起雨来……以下是一些图片可以感受一下……&lt;img src=\"https://pic2.zhimg.com/50/v2-665ced04584d6a257da69beac4d865c3_hd.jpg\" data-rawwidth=\"940\" data-rawheight=\"627\" class=\"origin_image zh-lightbox-thumb\" width=\"940\" data-original=\"https://pic2.zhimg.com/v2-665ced04584d6a257da69beac4d865c3_r.jpg\"&gt;（网图）&lt;img src=\"https://pic3.zhimg.com/50/v2-d6aad9c9fe061d9199e0297b55163da4_hd.jpg\" data-rawwidth=\"702\" data-rawheight=\"877\" class=\"origin_image zh-lightbox-thumb\" width=\"702\" data-original=\"https://pic3.zhimg.com/v2-d6aad9c9fe061d9199e0297b55163da4_r.jpg\"&gt;我们学校……（不是去年特别大的雨那次的，就是平常下暴雨……）&lt;img src=\"https://pic3.zhimg.com/50/v2-b15d37dd5434a228a4222f45fec3cac9_hd.jpg\" data-rawwidth=\"640\" data-rawheight=\"854\" class=\"origin_image zh-lightbox-thumb\" width=\"640\" data-original=\"https://pic3.zhimg.com/v2-b15d37dd5434a228a4222f45fec3cac9_r.jpg\"&gt;（路上基本就是见水只能走过去）8.武汉特色热干面，周黑鸭等等一大堆，说多了你们也记不住，但其实这两个最有名。大家都对热干面争议挺大的，但是我觉得，味道其实还不错，不过还是要看店，卖热干面的地方很多，最出名的招牌店家是“蔡林记”，其他位置的可能就不正宗，但是不能因为吃一家觉得不好吃就否认我大武汉特色啊（我个人觉得我们学校食堂的是我吃到的最好吃的热干面）。周黑鸭对于喜欢吃辣的人来说，就很好，不过有很多卖盗版的，就要仔细分辨了。9.评论里有人提到了，武汉冬天的雾霾，这个……确实，到了辣鼻子的地步了，对雾霾敏感的人可以戴口罩出门，不过最好别出门了（我的室友就感觉不到雾霾）。10.到武汉来了，多熟悉熟悉方言……宿管阿姨，上课老师说的有可能都是方言，听不懂就尴尬了（同学说她高数挂是因为老师上课讲方言导致的→_→），不过对于湖北省的孩子来说，没什么压力，对于其他离的有点远的地方来说，交流基本没问题，但是还是有些字听不懂的。另外，武汉的方言听起来都像是要吵架一样，在路上看到大妈们谈家常都会以为是在吵架，其实人家感情好着呢~举个栗子（几个常见的）:清楚（coǔ），吃药（七yó），理解（gaǐ），可（kuǒ）以，窦（dòu）里——里面，发泡（pāo）——吹牛，说大话，造业——可怜。虽然武汉缺点一大堆，我觉得生活在武汉也很好，以前看到有人说“武汉必定是个先抑后扬的城市”，我觉得说的很对，她的确称得上大武汉。她给我的感觉就是很平淡，真实，带有一些大叔大妈们的市侩也有学生们的朝气，在这个嘈杂的武汉生活总觉得能给人带来活力，希望你可以爱上这个城市。", "answer_votes": "84", "answer_comment": "​93 条评论"}
{"answer_author": "知乎用户", "answer_id": 211891222, "answer_text": "不要买秋装", "answer_votes": "29", "answer_comment": "​15 条评论"}
{"answer_author": "豆豆", "answer_id": 211573535, "answer_text": "1.武汉天气热，注意降温,特别是军训的时候，多喝热水 。&lt;img src=\"https://pic3.zhimg.com/50/v2-f0b03ebc9e210fa2ee0e8c6971cef581_hd.jpg\" data-rawwidth=\"640\" data-rawheight=\"640\" class=\"origin_image zh-lightbox-thumb\" width=\"640\" data-original=\"https://pic3.zhimg.com/v2-f0b03ebc9e210fa2ee0e8c6971cef581_r.jpg\"&gt;2.户部巷的东西不卫生更不好吃，但是可以去体验一下户部巷的风土人情，想吃好吃的去万松园 3.好玩的地方多,别天天在宿舍宅着，搬个小板凳坐江汉路看漂亮的小姐姐。4.很多大学里的风景还是不错的，值得去逛一逛。5.出去玩的时候有发床单，呸呸呸，发传单发传单的，有礼貌的接过来就走，如果他要拉你说赠送什么东西或有什么免费体验，请不要搭理他，直接走，贪小便宜会吃大亏的哦。6.出去玩千万别得罪大爷大妈，不然你会被怼的很惨，特别惨，而且你还没办法。而且还是正宗的武汉话，你听得半懂不懂，一直不停的怼你，所以碰到大爷大妈能躲还是躲了吧！&lt;img src=\"https://pic3.zhimg.com/50/v2-4fd0001afa88f941fac411d605e572c5_hd.jpg\" data-rawwidth=\"300\" data-rawheight=\"300\" class=\"content_image\" width=\"300\"&gt;说几个学校里面的吧7.不要购买任何学长学姐开学推销的整套或单独的生活用品，自己去超市买，你永远不知道学姐学长们进的货质量有多差，进价有多便宜，平时有人去宿舍推销东西最好也不要买，打着各种口号其实质量真的不咋的，说不定就是某宝上批发下来的甚至质量还不如某宝8.刚开学不要被各种学生会社团招新弄得头脑发热就冲进去了，多从各方面了解社团和学生会的实际情况再考虑是否加入，不要相信来招新的学长们天花乱坠的忽悠，不忽悠你你愿意加进去。（在这点名学生会）9.每个学校图书馆里都藏了宝藏，闲的没事就去找找。10.玩的时候开心玩,别光记得玩忘了学习就先到这吧，想起什么再继续更，有什么想问的欢迎移步评论，我会尽力解答&lt;img src=\"https://pic4.zhimg.com/50/v2-5c238789307c87b5a508b1c7f08c9f8e_hd.jpg\" data-rawwidth=\"1536\" data-rawheight=\"2048\" class=\"origin_image zh-lightbox-thumb\" width=\"1536\" data-original=\"https://pic4.zhimg.com/v2-5c238789307c87b5a508b1c7f08c9f8e_r.jpg\"&gt;派大星 我们一起去抓水母吧", "answer_votes": "8", "answer_comment": "​8 条评论"}
{"answer_author": "鏖战的脚斗士", "answer_id": 212397200, "answer_text": "1、宿舍集资装个空调2、提前2个小时出发去机场或者火车站3、和本地人交流的时候，别人说：个斑马，个婊子养的，你别激动，他绝对没有骂你4、坐公交车要拉好扶手，有几个传说是关于521的一个是有一次521司机飚车的时候车轮起火了；另一个是521刹车的时候一个乘客把那根直的铁扶手拉弯了……；521超taxi那算不了什么壮观，壮观的是521超521！5、昆明是文艺青年，一年四季如春；西安是普通青年，一年四季依次来；武汉是二逼青年，一年四季随机来。所以不管什么时候来武汉，一定记得带各种季节的衣服！6、节假日去光谷一定要做好思想准备，赌的你怀疑人生；双脚离地可以自己移动！", "answer_votes": "62", "answer_comment": "​62 条评论"}
{"answer_author": "佘软", "answer_id": 213384438, "answer_text": "       真的大家如果在光谷那一带一定要注意财产安全！        我两部手机都是刚买就在那丢了:)我放在外套口袋里，和朋友去吃饭。我有确认过手机的存在吃饭前还玩了一会消消乐。        然后有点热，把外套脱了。放在椅子上        然后出门的时候猛然发现手机不见了！qvq然后也别指望能找回来了，当地警察说这种事一天一百四十多起。        我来回查了几遍监控都没发现有谁靠近了我的外套的。:)真的是神不知鬼不觉的就不见了！        当时简直绝望。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "便便好烫", "answer_id": 211920756, "answer_text": "看到有人答了一条找男朋友上华科！那么，找女朋友，无论男女，上华师顺便补充一个华师限定版答案:1.千万别买自行车！武汉的大学基本上都是依山而建，武大珞珈山，华师桂子山，华科喻家山，华农狮子山，理工马房山，地大南望山。但，真正需要每天上课都爬山的，怕是只有华师独一家，校车司机各个都是桂子山车神，路窄，坡陡，弯急。所以在华师根本骑不动什么自行车。而且现在共享单车如此发达，更不需要了。2.华师一共五个门，三个门出去有地铁，一个门出去有BRT。公交，呵呵，四个门出去都是堵车。不过，多出去走走，挺好。3.华师周边吃饭的基本管够了，不一定非要往汉口跑，低端到东南门后街，高端到广埠屯金马门的自助，各个层次的需求都能覆盖到。4.练就一身憋屎憋尿的本领，华师日常停水！！！而且有句话要牢记，师欲断其水，必先喷其泉。&lt;img src=\"https://pic2.zhimg.com/50/v2-3efbdfa42d35a89826961aa50eb40620_hd.jpg\" data-rawwidth=\"720\" data-rawheight=\"540\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic2.zhimg.com/v2-3efbdfa42d35a89826961aa50eb40620_r.jpg\"&gt;5.每当四六级听力听不清的时候，可以试着听听对面武大的调频", "answer_votes": "20", "answer_comment": "​26 条评论"}
{"answer_author": "木木", "answer_id": 211667665, "answer_text": "#华科限定版不要吃太多，不要吃太多，不要吃太多，不要吃太多，一年胖十斤啊喂哭咪咪&lt;img src=\"https://pic1.zhimg.com/50/v2-53613e46cfe4d7ed55af4f01ac199ca4_hd.jpg\" data-rawwidth=\"720\" data-rawheight=\"720\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic1.zhimg.com/v2-53613e46cfe4d7ed55af4f01ac199ca4_r.jpg\"&gt;好好学习好好学习好好学习，发现身边全是长得好看身材又好加权又高的小姐姐会觉得自己真是小辣鸡武汉的天气预报是我见过最最最准的 看到大幅度降温的预报即使出门的时候觉得热到飞起来也要记得带，因为你可能上完一节课出来气温就降了十多度emmmmmm放假的时候多出去逛逛，武汉很多地方真的很好玩，长江大桥的风很大，东湖拍妹子拍汉子都合适冬天十斤的被子其实就够了宿舍选阴面并没有晒不干衣服，夏天反而很凉快去图书馆自习千万别走路去 不然可能没走到就已经到吃午饭的时候了韵苑超市门口那只毛色发亮像是罗威纳的串串的 长的非常威武雄壮的狗，是母的，不要把人家认成小哥哥 水果去集贸买会便宜很多emmmmmm就这么多了", "answer_votes": "18", "answer_comment": "​36 条评论"}
{"answer_author": "明月惊寒", "answer_id": 211525167, "answer_text": "1.出门可以不用带现金，自大一以来基本都是无现金出门。2.公交师傅很凶，很凶，很凶。当然会乐意帮忙，但是脾气不好是真的。3.晚上慎去光谷，明明没几百米，愣是呆了一小时，亲测，七点准备走，十一点多才到寝室，华农的，不堵公交坐过二十多分钟的～4.旅游景点人多，可以去不同大学校园转一转，武汉大学还是很多的。5.武汉的夏天有半年，是真的，春秋季基本不存在～6.901慎坐。可能会刷新坐公交的印象。7.光谷书城的书比一般书店贵，但是分类做的很好，人流量大，没有一般书店那么安静，但看看书也挺好的。买过书店的连环画，也不贵，挺有意思的。8.汉口那边有很多旧址啊老街什么的，周末一个人去走走很有韵味。9.武汉的夏天是真热，真的，一点都不假，冬天我感觉没那么冷，但是湿。10.不要听一些人说武汉没有什么可玩的，其实还是可以的。11.武汉的节奏其实有点快。12.新到一个城市，多观察。以上。", "answer_votes": "17", "answer_comment": "​37 条评论"}
{"answer_author": "Edward", "answer_id": 211835077, "answer_text": "1.不要去广埠屯电脑城去采购电脑，因为水很深，要买电脑可以去苏宁易购或者在京东买都是不错的选择！2.不要相信街边低价卖给你苹果手机的骗局，天上不会掉馅饼！3.小心电信诈骗，当你的老师或者同学给你发消息说急需用钱，需要你借钱给他，需要警惕，打电话核实！4.最好吃的热干面不是蔡林记的热干面，而是大街小巷里小馆子里的热干面！5.武汉有夜行公交，不用担心在外面太晚没车回学校啦，现在也开通了支付宝付车费的功能，乘车打八折。6.不要相信天气预报，毕竟..武汉每天不一样出门记得带晴雨伞，也许一秒前是晴空万里，一秒后就淋成了狗......7.找兼职尽量不要在网上找，网上很多虚假的信息，自己去到外面的店面问，如果是要交押金什么的就不要去了！爱玩的同学看过来啦武汉旅游年卡定价200软妹币 可以全年不限次数，节假日不限的免费畅游57家优质景区，比起门票钱来还是很划算的，在中百可以办理！8.武汉的大学可好玩啦，可以在樱花盛开的季节约上小伙伴一起去武大看樱花，可以在网上免费预约的，一个手机号可以预约一次，需要关注公共号。&lt;img src=\"https://pic4.zhimg.com/50/v2-54ba5a732b9d22517cd0d053d5756dc8_hd.jpg\" data-rawwidth=\"1000\" data-rawheight=\"917\" class=\"origin_image zh-lightbox-thumb\" width=\"1000\" data-original=\"https://pic4.zhimg.com/v2-54ba5a732b9d22517cd0d053d5756dc8_r.jpg\"&gt;9.东湖绿道开通了，可以约同学去骑小黄车、小红车、小白车、多happy啊！&lt;img src=\"https://pic1.zhimg.com/50/v2-944b581fd12362bb026b6bba5a62052b_hd.jpg\" data-rawwidth=\"620\" data-rawheight=\"412\" class=\"origin_image zh-lightbox-thumb\" width=\"620\" data-original=\"https://pic1.zhimg.com/v2-944b581fd12362bb026b6bba5a62052b_r.jpg\"&gt;10.欢乐谷我真没去过...但是听同学说买夜场的票比白天的便宜好多！有学生证也可以打折哦！&lt;img src=\"https://pic2.zhimg.com/50/v2-6053473998daee86c36c31c42c0a68fa_hd.jpg\" data-rawwidth=\"898\" data-rawheight=\"607\" class=\"origin_image zh-lightbox-thumb\" width=\"898\" data-original=\"https://pic2.zhimg.com/v2-6053473998daee86c36c31c42c0a68fa_r.jpg\"&gt;11.武汉科技馆是一个学习科技知识的好去处在江汉路附近，是免费的，但是要排队，去的时候要早一点哦~&lt;img src=\"https://pic3.zhimg.com/50/v2-32946514d1398829852619f77c358b09_hd.jpg\" data-rawwidth=\"900\" data-rawheight=\"675\" class=\"origin_image zh-lightbox-thumb\" width=\"900\" data-original=\"https://pic3.zhimg.com/v2-32946514d1398829852619f77c358b09_r.jpg\"&gt;12.湖北省图书馆让你在知识的海洋中遨游...环境安静适合自习，可以花100软妹币办理借书卡，一次最多可以借四本书。去之前找好乘车线路哦，图书馆离车站有点距离，我去过两次都迷路了_(´ཀ`」 ∠)__ &lt;img src=\"https://pic1.zhimg.com/50/v2-999373b3040c08995ced32654e158b58_hd.jpg\" data-rawwidth=\"497\" data-rawheight=\"282\" class=\"origin_image zh-lightbox-thumb\" width=\"497\" data-original=\"https://pic1.zhimg.com/v2-999373b3040c08995ced32654e158b58_r.jpg\"&gt;最后，各位同学要多读书、多看报、少吃零食、多睡觉哦！就这样子，有人看再更，拜了个拜~", "answer_votes": "16", "answer_comment": "​14 条评论"}
{"answer_author": "没有", "answer_id": 212027097, "answer_text": "如果家里有闲钱，可以付首付买套房子，然后租出去抵一点房贷。如果以后留武汉，这房子买的就刚刚好。如果不留，4年之后卖掉，你只会赚不会亏。", "answer_votes": "3", "answer_comment": "​添加评论"}
{"answer_author": "Xxxxx", "answer_id": 211395958, "answer_text": "1找兼职什么的尽量别去街道口，去也要多留心。2光谷人特多，主要是大学生多，武汉不止光谷，别的位置也可以逛逛。3公交卡不用办理，军训的时候学校会发武汉通，里面一百块，免费发放。3如果学校在江夏那边，做好节假日公交上不去或者贴玻璃门上的准备。4九月份开学带夏天的衣服就可以了，带件衬衣也可以，军训的时候偶尔早晚温差还是会有点大，早上会有点凉，女生可能要注意点。其他的冬装十一有机会可以再回去拿。5武汉公交也可以用支付宝，可以自己在支付宝卡包里面领取，上车对着扫描孔就行，好像这个不能换乘免费。⊙_⊙6连着你们公交卡发的应该还有一本最武汉的册子，拿那个去上面的景区好像可以打折。7武汉的过早的其实蛮多的，初了热干面，豆皮，欢喜坨，糯米鸡，煎包，糊汤粉，糯米包油条，凉面，油条，面窝，苕面窝，烧卖，豆腐脑，酥饺………一个月不重样是可以的。8外地同学来武汉不一定每次都去户部巷，其实户部巷也就是骗外地人的，万松园可以去吃吃，粮道街这种苍蝇馆子也可以去逛逛，一般好吃的都在平平淡淡的街道，可以自己多留意本地美食博主。9公园可以去中山公园逛一逛，坐坐过山车，虽然没有欢乐谷的刺激，但是细细感受一下可能比去欢乐谷要舒服点。10学校要是在江夏那边可以去八分山、青龙山绿道逛逛，八分山江夏最高的山，青龙山绿道我觉得比八分山的要好看许多，个中滋味自己慢慢品味。&lt;img src=\"https://pic2.zhimg.com/50/v2-e68e503e14599599867cf6249ad3aa91_hd.jpg\" data-rawwidth=\"576\" data-rawheight=\"1024\" class=\"origin_image zh-lightbox-thumb\" width=\"576\" data-original=\"https://pic2.zhimg.com/v2-e68e503e14599599867cf6249ad3aa91_r.jpg\"&gt;11每年看樱花也不一定非要去武大，东湖夜樱也可以，或者晴川阁这些地方也有，只不过没武大那么有名，但胜在安静。12汉阳那边去的少，不过归元寺可以去逛逛，在里面数数罗汉，体验一把“封建”13昙华林也没什么好逛的，也挺短的，就那么一两个拍照的地方装装逼。14来武汉的外地同学，可以在凉快，你们军完训十月份的晚上坐一次轮渡过江，感受一下晚上的凉风（有一艘船顶楼是非封闭的，这个船我挺喜欢的，坐一定坐这一首）以及武汉长江两岸的夜景。15有钱的话，可以在知音号上玩一玩，感受一下二三十年代的武汉。16江边的武汉科技新馆，湖北省博物馆，武汉关博物馆，都可以去看看，感受一下历史，这些都是不要钱的，带好身份证就好。17南湖大道，华农到民大那一段路车少，风景也好，很惬意，最喜欢那一条路了。18武汉地铁你如果在光谷上的没位置，你也不赶时间，你就上车坐到杨家湾下车，然后在对面在坐到光谷广场的地铁到了光谷之后不要下车，你就有位置了。19武汉人不是没有素质，只是武汉话给你的错觉，老人也一样，只不过是武汉话声音有点硬气，不要以为你问个事他们用武汉话回你，你就觉得是在对你不满，时间久了，听听武汉话，慢慢融入这个城市也蛮有味道的。20来了都是客，武汉也有挺多不好的地方，但是武汉人也是很热情的，没有网上说的那么差劲，那么爱骂人脾气大。么听别人的，慢慢融入城市细细感受它。武汉每天不一样！", "answer_votes": "42", "answer_comment": "​77 条评论"}
{"answer_author": "匿名用户", "answer_id": 211485717, "answer_text": "下面都是一些个人看法，小伙伴们酌情采纳1＞热干面可能吃不惯， 我开学大二，热干面        还是吃不惯2＞坐地铁的话，进门之前请排队，我之前没       有注意过，有一次突然发现的，觉得既然         有素质好一些3＞尽量地铁，不要公交，陆上交通比较堵4＞经过汉口火车站的时候看下它的进入地铁       的入口朝向，不然等到国庆，寒假暑假等         大流量时间，站错了入口朝向要等更加长         的时间5＞出去玩有人发传单给你，接了之后说带你        去个地方领东西，这个套路是骗子6＞黄鹤楼远远的看下就好，个人觉得不必要       细观7＞万松园可能比户部巷好一些8＞春秋的衣服买少一些，冬天和夏天的衣服        备齐9＞学校会发交通卡给你，好好保管，我觉得       大学生的那个最好看，丢了没法补办，我         的丢了现在的蓝色普通款感觉不好看，也         有纪念款但是买不到大学生的那款10＞一开始去人生地不熟，要是可以有武汉           的朋友相熟最好了，但是交朋友顺其自然         吧，别太刻意了11＞找兼职最好自己出去问，中介Ken，我差          点被搞去东莞，所以出去找兼职留心                眼，还有即使五八同城上面找兼职也有            好多骗子。12＞去楚河汉街的时候注意下地铁的位置，            我每次进了汉街就出不来，可能就我比            较傻吧  13＞网购学生票以后，汉口的火车站自动取票机器不能读取学生证信息取票，如果买了学生票去人工服务台，还有一个就是江浙沪那边网购火车票以后，可以不取票直接刷身份证过，汉口不支持，我百度过说是机器不支持，经过评论小伙伴提示武昌的自动取票可以刷出来学生票了14＞好好学习。不管在哪里，都要好好学习15＞武汉的饮食偏辣（没有四川和湖南那么           夸张），如果吃不习惯或者肠胃不好的，买吃得之前问清楚或者交代一下不要辣椒，不然会拉肚子的16＞建议一开始不要买太多东西，宿舍生活以简单为主，有的学校会换宿舍，我今年就换了，东西搬的我要死17＞洪山区停水有些频繁，但是现在好多了，还是建议备个桶什么的来装水18＞共享单车摩拜不要骑进华科，出不来，车子出不来。&lt;img src=\"https://pic2.zhimg.com/50/v2-28dc6df00918f111de79e116caa492e3_hd.jpg\" data-rawwidth=\"960\" data-rawheight=\"960\" class=\"origin_image zh-lightbox-thumb\" width=\"960\" data-original=\"https://pic2.zhimg.com/v2-28dc6df00918f111de79e116caa492e3_r.jpg\"&gt;", "answer_votes": "39", "answer_comment": "​44 条评论"}
{"answer_author": "杨小花", "answer_id": 211625455, "answer_text": "1   武汉的气候：一年两季，一天四季。我带的春秋装基本很难用上，曾经试过一个星期从短袖过度到棉袄，夏天很热，中国四大火炉的常客，冬天略有雾霾；2  武汉的交通：武汉交通在非上下班高峰时期不堵，上不下班时期堵车，而且满城挖，四处在城建，也导致了一部分交通堵塞，另，武汉的公共交通系统很发达，地铁和公车大部分地方都能到，就是注意大半部分公车晚上十点前末班，在武汉挤公交和地铁需要小心，因为很挤！很挤！很挤！3  武汉的饮食：人口多且流动大的城市饮食文化都包容贯通，学校里应该什么口味，都有但个人觉得这边本地口味相对偏咸口，热干面和周黑鸭都可以试试看；4  武汉的语言文化：这点很重要，作为一个南方人，刚过来上学，觉得武汉人脾气好暴躁，老喜欢吵架，后面发现原来正常说话就是比较大声，听多了也就习惯了。附赠一张本人瞎拍的黄昏照&lt;img data-rawwidth=\"1707\" data-rawheight=\"1280\" src=\"https://pic2.zhimg.com/50/v2-51883e39cc707440c9c0b62683641f36_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"1707\" data-original=\"https://pic2.zhimg.com/v2-51883e39cc707440c9c0b62683641f36_r.jpg\"&gt;以上均为个人观点，不喜轻喷，码字不容易啊，点个赞再走吧 (•̀ᴗ•́)", "answer_votes": "12", "answer_comment": "​12 条评论"}
{"answer_author": "宁缺", "answer_id": 211452148, "answer_text": "我来了一年，其实也没啥，就说下居住环境&lt;img src=\"https://pic1.zhimg.com/50/v2-0ebcc1012392648a52d11c6d71d77346_hd.jpg\" data-rawwidth=\"693\" data-rawheight=\"131\" class=\"origin_image zh-lightbox-thumb\" width=\"693\" data-original=\"https://pic1.zhimg.com/v2-0ebcc1012392648a52d11c6d71d77346_r.jpg\"&gt;", "answer_votes": "34", "answer_comment": "​23 条评论"}
{"answer_author": "西西", "answer_id": 211409746, "answer_text": "不要逼着自己入乡随俗地吃热干面。", "answer_votes": "38", "answer_comment": "​61 条评论"}
{"answer_author": "知乎用户", "answer_id": 211600590, "answer_text": "华中科技大学限定&lt;img src=\"https://pic1.zhimg.com/50/v2-52d3834727b3d9cc254e74c27fde9a91_hd.jpg\" data-rawwidth=\"185\" data-rawheight=\"198\" class=\"content_image\" width=\"185\"&gt;", "answer_votes": "24", "answer_comment": "​11 条评论"}
{"answer_author": "杨九魁", "answer_id": 211980825, "answer_text": "就一件事，每年都有很多人上当受骗：不要去广埠屯买任何电子产品，尤其是电脑和手机！！！！！广埠屯周边也一样！！！不要买！！！不要买！！！不要买！！！", "answer_votes": "7", "answer_comment": "​1 条评论"}
{"answer_author": "珊瑚", "answer_id": 211870841, "answer_text": "对于北方孩子到武汉上学，一定要想好自己能不能吃苦。首先，说个天气。  春雨贵如油这句话在北方没问题，在武汉你就会发现天天在下雨。夏天，热的感觉不一样。没有温差，也就是说你在晚上也是特别热的那种，就算你在凌晨时候，他的热度也是没有变化的。我是山西的，我们这边的热属于你可以呼吸，不会觉得呼吸困难。而武汉不一样，她是属于空气好像完全不流动一样！所以，很多人觉得天气预报上温度好像差不了多少，但是热的感觉不一样，很多人都受不了。 有人看我在写！继续写！然后，说一个衣服的问题。10月份之前你都可以穿短袖的，夏天衣服一定要多带！要多带！夏天，长袖长裤穿上基本就在医院了，防晒很重要，防晒伞打和不打俩个感觉！吹的风也是热风，别想着凉快！冬天，其实我觉得南方的冬天才是冷，但奇怪是冬天大家都只穿一条裤子，所以棉裤什么的都别带，带了也不穿。 但是，那边确实是冷，冷的感觉也不一样，众所周知，湿冷的感觉。这是什么样的体验？你在北方，穿的厚点，感觉也不是那么冷。在武汉，穿的在厚，也没感觉。注意，南方没暖气。只有空调！空调的热和暖气不一样。我住在山西，山风已经可以了，但是武汉的那叫妖风，吹的头疼，伞，一定要买质量好点的！否则，很容易一次就坏掉了！下次写吃的吧！突然更   最近武汉有火锅节，有22个地方打5折。都是推荐的地方。在武汉，吃东西不要害怕。只要你有钱，就有各种各样吃的可以吃。我室友，贵州的（老干妈）特别能吃辣，但是在武汉一年之后，放点辣就会觉得很辣，回家之后她妈说她不能吃辣  。再说一个广东的，完全不能吃辣，但是现在也能吃辣了。所以，什么能吃辣的不能吃辣的都能在武汉完美的生存着。还有什么都可以问我噢！！", "answer_votes": "14", "answer_comment": "​21 条评论"}
{"answer_author": "柚屿", "answer_id": 211594656, "answer_text": "大概是永远找不到手机信号的光谷", "answer_votes": "13", "answer_comment": "​14 条评论"}
{"answer_author": "Mamihlapinatapai", "answer_id": 211561416, "answer_text": "上面答的差不多全了，我在换个方向补充点……虽然武汉还蛮好玩的，但是人真的很多……&lt;img src=\"https://pic1.zhimg.com/50/v2-d5a09b0b6f8e88603c50fc409db6c1b6_hd.jpg\" data-rawwidth=\"1080\" data-rawheight=\"1920\" class=\"origin_image zh-lightbox-thumb\" width=\"1080\" data-original=\"https://pic1.zhimg.com/v2-d5a09b0b6f8e88603c50fc409db6c1b6_r.jpg\"&gt;&lt;img src=\"https://pic1.zhimg.com/50/v2-dfa028c7ef00b19e8b61301b70b32410_hd.jpg\" data-rawwidth=\"1080\" data-rawheight=\"1920\" class=\"origin_image zh-lightbox-thumb\" width=\"1080\" data-original=\"https://pic1.zhimg.com/v2-dfa028c7ef00b19e8b61301b70b32410_r.jpg\"&gt;", "answer_votes": "13", "answer_comment": "​4 条评论"}
{"answer_author": "SakuraBoy", "answer_id": 211408758, "answer_text": "不管天气预报多么扯淡，你都要相信它这里是武汉", "answer_votes": "12", "answer_comment": "​15 条评论"}
{"answer_author": "李圆圆是圆脸啊", "answer_id": 211647501, "answer_text": "今年刚刚毕业，其实还是蛮怀念在武汉的生活的。可能有点跑题，想说下自己的习惯。1.武汉的出租车很容易拒载，所以能用滴滴就用滴滴。本人在群光晚上10点以后已经有过数次被出租车拒载的经历了。2.能选择不在周六日出去玩就不要选择周六日，如果一定要周六日出门玩记得早上九点以前坐公交人会比较少。大四没有课后，我从来都在工作日和小伙伴约。3.汉口火车站在2号线，武汉站和武昌站都在4号线。因为我家就在省内，所以经常坐动车都是在汉口站，你会发现有些动车是从武汉站始发，但是下一站就是汉口站。4.大一经常往光谷跑，大二经常往江汉路那边跑，现在想想觉得年轻的自己真实经历充沛。大三开始只要超过公交车车程半小时的，几乎不考虑，所以群光是我最爱。5.坐公交车记得带耳机，可以打发时间。另外在公交车上，能选的话最好坐在公交车后面，这样你就不用面临老人上车时那种尴尬了。6.武汉真的是很方便的城市，趁着长假想去周边省份玩的话也很方便。7.昙华林还是不错的，虽然我自己也只去了一次。不过今年我从汉口站回学校，在螃蟹岬下车转公交的时候，爱上了在那里买咖啡。8.现在再也感受不到武汉公交车司机那种“疯狂”了，在广州公交车司机都开的超稳的。9.就武大樱花来说，虽然我自己没有去看过一次，不过武汉现在差不多好多高校都有樱花树了，我觉得我们学校的还是蛮漂亮的。所以，只是想看樱花的话，在自己学校也可以。10.双学位这件事将会占用你之后很多的周末以及节假日时间，如果你并不是真的喜欢，并且意志力薄弱，我觉得没必要去参加。说实话对你找工作并没有什么作用。11.汉街和汉正街是两个地方。我当年就弄错了，跑到汉正街去了。12.黄鹤楼和户部巷去过一次你可能再也不会去了。我还是去了三次，第二次是和学妹一起去她的高中玩，离户部巷比较近，她告诉哪些店还可以，第三次是毕业我父母来武汉玩带着去了一次。13.想到了再说吧。", "answer_votes": "10", "answer_comment": "​11 条评论"}
{"answer_author": "那抹斜阳", "answer_id": 211564201, "answer_text": "在武汉的准大二狗，这一年真的对武汉感受很深。1、到处都在修路，哪里不堵修哪里……2、如果听到几个大妈在吵架，一定要看清形式，很有可能只是在聊天3、热干面真的满大街都是，如果喜欢可以天天吃4、千万不要去广埠屯买电脑，如果需要一些电子元件还是可以去看一下的5、放了暑假能多快回家就多快回家，除非你家比武汉还热6、虽然武汉有些地方感觉着脏乱差，但是也有很多地方挺美的，趁短暂的春秋天多出去溜达溜达", "answer_votes": "10", "answer_comment": "​7 条评论"}
{"answer_author": "李先之", "answer_id": 216259405, "answer_text": "这问题很好嘛，列举几条。1,夏天热死，冬天冷死（躲在空调屋，尽量不出门）2,校外人员复杂，地处华中，什么鸟人都有（出门小心）3,武汉骗子很多，特别是大一刚去，大街上有很多拉客的，什么免费美容，免费洗脚，免费品尝，免费等等（得小便宜吃大亏，切记管住自己的腿）4,自从修了地铁，公交车不那么挤了，好像车速也更快了，建议出门能步行就步行，不能步行就坐地铁（整天蹲在学校很容易有小肚腩）5,武汉的夜生活，什么酒吧，迪厅,mmc，红灯区，夜市，如果非要去，小心为上（高消费，高风险，高富帅才有的玩）6,多读书，多加社团参加活动（丰富经历的同事很容易找到自己的另一半）7,每天坚持一项运动，坚持四年你也就是大师级别了，强身健体，振我中华（打飞机、挖地雷除外，别看毛片，别约炮，世风日下，多干点有意义的事）8,如果遇到好的想法，问家里要点钱，或者同学们融资做点想做的小事业未尝不可，大学充裕的时间可以让你成为一个小老板，为以后踏足社会奠定良好的物质基础和处事经验（我就有点后悔了，不然早就成老板了）9,武汉的中介比较多，特别是学生兼职的那种，有很多骗术，让你交钱的别信，最好是自己找，老师介绍（皮包公司会让你一夜之间找不到它的老巢，别妄想跑的了和尚还跑得了庙么，真跑的了）10,把自己的专业扎扎实实学好，日后必有大用，还有就是能多学点其他的技能就多学点，特别是跟工作后相关的（办公软件就不用说了，可以积极参加学生会，懂得处理人情世故，多会几项运动，以后单位有活动你就可以参加，比如最基本的羽毛球，乒乓球，篮球，象棋等等)11,我其实有很多想说的，一时半会说不完，先说这么多吧，打字手累，以上仅是个人观点，如有不服，欢迎来辩，想知道其他的同学也可以问我 ", "answer_votes": "9", "answer_comment": "​4 条评论"}
