{"question_id": "63889710", "question_text": "例如：（只是简单举例啦）", "question_title": "有哪些前面很平淡，后面却一鸣惊人的诗句？", "question_commet": "​27 条评论", "answer_number": "1,259 个回答", "question_followers": "18,037", "brower_number": "4,227,064"}
{"answer_author": "张佳玮", "answer_id": 262874321, "answer_text": "谢邀。郑板桥有首诗，常被讹传是乾隆与刘墉写的。前三句很随意：一片两片三四片，五六七八九十片。千片万片无数片最后一句，画龙点睛：飞入梅花都不见。于是全诗是：一片两片三四片，五六七八九十片。千片万片无数片，飞入梅花都不见。忽然禅意盎然了。苏轼在黄州四年，要走了。大家问，为什么不写写著名的歌姬李淇。苏轼先忽悠了两句大白话：东坡四年黄州住, 何事无言及李淇。然后来了两句神的：却似西川杜工部，海棠虽好不吟诗。——杜甫久居四川，见过许多海棠，却不写海棠诗。——这就忽然成了将李淇比海棠，夸得更动人了。辛弃疾有首骂儿子的词。前面很白话：我老啦；富贵没啥鸟用；陶渊明才是我效法的对象；盖个亭子吧，弄个园林吧，喝喝酒，吟诗。忽然来了一句：千年田换八百主，更说甚，是和非？——忽然境界就高了。吾衰矣，须富贵何时。富贵是危机。暂忘设醴抽身去，未曾得米弃官归。穆先生，陶县令，是吾师。 待葺个、园儿名佚老。更作个、亭儿名亦好。闲饮酒，醉吟诗。千年田换八百主，一人口插几张匙。便休休，更说甚，是和非。最后，我国著名军阀张宗昌的玩意儿。仿刘邦《大风歌》。前两句：大炮开兮轰他娘，威加海内兮回家乡。一句粗鲁，一句抄袭，没意思。最后一句，神了：安得巨鲸兮吞扶桑。这句的气势，和而今我谓昆仑：不要这高，不要这多雪。安得倚天抽宝剑，把汝裁为三截？一截遗欧，一截赠美，一截还东国。格局相仿。端的是好，化腐朽为神奇。", "answer_votes": "7.5K", "answer_comment": "​410 条评论"}
{"answer_author": "楚云卿", "answer_id": 220955122, "answer_text": "NO.1苏轼· 《鹧鸪天·时谪黄州》林断山明竹隐墙，乱蝉衰草小池塘。翻空白鸟时时见，照水红蕖细细香。村舍外，古城旁。杖藜徐步转斜阳。殷勤昨夜三更雨，又得浮生一日凉。《庄子·刻意》云：“其生若浮，其死若休。”以豁达之心胸看人生，自是雨添新凉而非愁也。NO.2贺铸· 《青玉案》凌波不过横塘路，但目送、芳尘去。锦瑟华年谁与度？月桥花院，琐窗朱户，只有春知处。碧云冉冉蘅皋暮，彩笔新题断肠句。试问闲愁都几许？一川烟草，满城风絮，梅子黄时雨。末句连用三个比喻，置愁绪于无穷无尽。贺方回这样的词句还有很多，把警句、名句、点睛之句放在结尾，这是他的特色，炼句已入化境。NO.3姜夔·《湖上寓居杂咏》布衣何用揖王公，归向芦根濯软红。 自觉此心无一事，小鱼跳出绿萍中。 到底是有事，还是无事。颇有禅意，值得玩味。NO.4许浑· 《谢亭送别》劳歌一曲解行舟，红叶青山水急流。日暮酒醒人已远，满天风雨下西楼。一首诗就足以让许浑跻身一流诗人行列。NO.5张先· 《青门引》乍暖还轻冷，风雨晚来方定。庭轩寂寞近清明。残花中酒，又是去年病。 楼头画角风吹醒，入夜重门静。那堪更被明月，隔墙送过秋千影。张子野写杨花，独步一绝，深得其神韵。“那堪更被明月、隔墙送过秋千影。”与“云破月来花弄影”和“柳径无人，堕飞絮无影”合称“三影”，同为名句，系描神之笔。NO.6张先· 《木兰花·乙卯吴兴寒食》龙头舴艋吴儿竞，笋柱秋千游女并。芳洲拾翠暮忘归，秀野踏青来不定。 行云去后遥山暝，已放笙歌池院静。中庭月色正清明，无数杨花过无影。朱彝尊评其曰：“余尝叹其工绝，世所传‘三影’之上。”大赞“无数杨花过无影”更在“三影”之上，学者也普遍认为该句应该与“三影”合称“四影”。余以为，写杨花者，唯苏子瞻《水龙吟》可敌之，而“四影”之神妙，唯此一人。NO.7苏轼· 《水调歌头》落日绣帘卷，亭下水连空。知君为我新作，窗户湿青红。长记平山堂上，欹枕江南烟雨，杳杳没孤鸿。认得醉翁语：“山色有无中。” 一千顷，都镜净，倒碧峰。忽然浪起，掀舞一叶白头翁。堪笑兰台公子，未解庄生天籁，刚道有雌雄。一点浩然气，千里快哉风。何谓浩然气也？宏大刚正，吞吐天地之气。NO.8苏轼· 《浣溪沙》细雨斜风作晓寒。淡烟疏柳媚晴滩。入淮清洛渐漫漫。雪沫乳花浮午盏，蓼茸蒿笋试春盘。人间有味是清欢。NO.9苏轼· 《临江仙》夜饮东坡醒复醉，归来仿佛三更。家童鼻息已雷鸣。敲门都不应，倚杖听江声。 长恨此身非我有，何时忘却营营。夜阑风静縠纹平。小舟从此逝，江海寄余生。与上首结句有异曲同工之理，有驾舟流逝、浪迹江海、将余生融入大自然中的心音，使整首词增添了飘逸浪漫的情调。NO.10苏轼· 《临江仙》一别都门三改火，天涯踏尽红尘。依然一笑作春温。无波真古井，有节是秋筠。惆怅孤帆连夜发，送行淡月微云。尊前不用翠眉颦。人生如逆旅，我亦是行人。末二句化用李白《春夜宴桃李园序》：“夫天地者，万物之逆旅；光阴者，百代之过客。而浮生若梦，为欢几何？”借道家思想劝慰友人忘却升沉得失。以极平易的语言表达出对漂泊、短暂人生的感悟，既动人心弦又引人深思。NO.11苏轼· 《卜算子》缺月挂疏桐，漏断人初静。时见幽人独往来，缥缈孤鸿影。惊起却回头，有恨无人省。拣尽寒枝不肯栖，寂寞沙洲冷。风格清冷奇峻，俨然如不食人间烟火的世外高人所语。NO.12苏轼· 《南堂·其一》扫地焚香闭阁眠，箪纹如水帐如烟。客来梦觉知何处，挂起西窗浪接天。诗家之“味真”。NO.13苏轼· 《戏张先》十八新娘八十郎，苍苍白发对红妆。鸳鸯被里成双夜，一树梨花压海棠。NO.14苏轼· 《望江南·超然台作》春未老，风细柳斜斜。试上超然台上看，半壕春水一城花。烟雨暗千家。寒食后，酒醒却咨嗟。休对故人思故国，且将新火试新茶。诗酒趁年华。无所往而不乐者，盖游于物外也。NO.15苏轼· 《定风波》莫听穿林打叶声，何妨吟啸且徐行。竹杖芒鞋轻胜马，谁怕？一蓑烟雨任平生。料峭春风吹酒醒，微冷，山头斜照却相迎。回首向来萧瑟处，归去，也无风雨也无晴。坦荡胸怀，任天而动。陶渊明有诗云：“纵浪大化中，不喜亦不惧。”这是陶潜的态度。“一蓑烟雨任平生”则是苏轼的态度，两者心态是相类的。NO.16苏轼· 《浣溪沙》山下兰芽短浸溪，松间沙路净无泥，潇潇暮雨子规啼。谁道人生无再少？门前流水尚能西！休将白发唱黄鸡。白乐天《醉歌乐妓人商玲珑》诗意悲观，苏子瞻反用其诗意，表达出乐观积极的人生精神。NO.17辛弃疾· 《贺新郎·同父见和，再用前韵》老大那堪说。似而今、元龙臭味，孟公瓜葛。我病君来高歌饮，惊散楼头飞雪。笑富贵千钧如发。硬语盘空谁来听？记当时、只有西窗月。重进酒，换鸣瑟。 事无两样人心别。问渠侬：神州毕竟，几番离合？汗血盐车无人顾，千里空收骏骨。正目断关河路绝。我最怜君中宵舞，道“男儿到死心如铁”。看试手，补天裂。好一个“男儿到死心如铁。看试手，补天裂。”堪称时代最强音也！稼轩词豪放的一面表露无遗。全词爱憎分明，情感激越，境界雄浑博大，读之令人气短。NO.18姜夔· 《踏莎行》燕燕轻盈，莺莺娇软，分明又向华胥见。夜长争得薄情知？春初早被相思染。别后书辞，别时针线，离魂暗逐郎行远。淮南皓月冷千山，冥冥归去无人管。末二句为传世名句，然今人不解其美。“月冷千山”极言清冷广远，“冥冥归去”指离魂已远，永不可回。王静安先生赞曰：“白石之词，余所最爱者，亦反二语。”增补：NO.18朱庆余·《近试上张水部》洞房昨夜停红烛，待晓堂前拜舅姑。妆罢低声问夫婿，画眉深浅入时无。唐代文人参加科考前常作“行卷诗”，即为了给自己造势，迎合主考官，献诗给地位较高的达官贤贵，希望得到赏识和提拔。本诗就是朱庆余写给张藉的行卷诗。作者以新娘初见公婆的情状自喻，将自己的紧张心情表现得十分传神。NO.19李白·《行路难》金樽清酒斗十千，玉盘珍羞值万钱。停杯投箸不能食，拔剑四顾心茫然。欲渡黄河冰塞川，将登太行雪满山。闲来垂钓碧溪上，忽复乘舟梦日边。行路难，行路难，多歧路，今安在。长风破浪会有时，直挂云帆济沧海。年轻的时候就应该像李白，成熟之后就应该学苏轼。NO.20李商隐·《无题·其二》飒飒东风细雨来，芙蓉塘外有轻雷。金蟾噬锁烧香人，玉虎牵丝汲井回。贾氏窥帘韩掾少，宓妃留枕魏王才。春心莫共花争发，一寸相思一寸灰。NO.21秦韬玉·《贫女》蓬门未识绮罗香，拟托良媒益自伤。谁爱风流高格调，共怜时世俭梳妆。敢将十指夸针巧，不把双眉斗画长。苦恨年年压金线，为他人作嫁衣裳。增补：——李清照·《如梦令》昨夜雨疏风骤，浓睡不消残酒。试问卷帘人，却道海棠依旧。知否，知否？应是绿肥红瘦！----------------------------------------------------------------------------------------------------------------------------------未完·待更创作不易，欢迎点赞关注。", "answer_votes": "4.4K", "answer_comment": "​180 条评论"}
{"answer_author": "墨言", "answer_id": 262961203, "answer_text": "这类诗叫做逆挽诗，我是突然想起来紫薇送老铁那个诗想起来了。乾隆皇帝带小燕子、紫微江南出巡,在江边见一群儒生摇头晃脑作诗赠别朋友\"老铁\"。乾隆见诗后便说:\"我家丫头也会作这样的诗。\"于是叫紫微露一手。紫微便吟道:你也作诗送老铁,我也作诗送老铁。众人一听,哈哈大笑:这能叫诗吗 谁知紫微笔锋一转,又续诗道:江南江北蓼花红,都是离人眼中血。百度百科逆挽诗，又叫逆转诗、抑扬诗、陡转诗、雅俗诗。创作年代有宋，明，清。逆挽诗的最大特点是作者在它的开头，故意以极其普通的语句下笔，给人造成一种平淡无奇、甚至是大失所望的感觉，可到诗后，尤其是结尾，却以出人意料的飞来之笔和逆转成奇蜂之势，把读者引入一个崭新的诗歌境界。比如：                           鸡叫（一）                                 【宋】赵匡胤        鸡叫一声撅一撅，鸡叫两声撅两撅。三声唤出扶桑日，扫败残星与晓月。                          鸡叫（二）                               【明】朱元璋        一叫一勾勾，两叫两勾勾。三叫日出满天红，驱散残星月朦胧。                            沱雨献寿                               【明】朱元璋         奈何奈何可奈何，奈何今日雨滂沱。滂沱雨祝李公寿，寿比滂沱雨更多。                             咏麻雀                                【清】李调元         一窝二窝三四窝，五窝六窝七八窝，食尽皇王千种粟，凤凰何少尔何多？                           游虎丘山                                    明 唐伯虎         一上一上又一上，一上上到高山上。         举头红日白云起，四海五湖皆一望。前两句写举步登山，拾级而上，语意浅俗，后两句笔锋一转，写登高所见，俯仰天地，使诗的境界骤然开阔，气势宏伟， 堪称点睛传神之笔。                            《咏雪》                                    清 郑板桥        一片二片三四片， 五片六片七八片；千片万片无数片， 飞入梅花总不见。                            不留姓名                                    【清】纪晓岚        一爬爬上最高楼，十二栏杆撞斗牛。纪昀不愿留名姓，恐压八闽十二州。                              杨柳树                                   【清】纪晓岚        东边一棵杨柳树，南边一棵杨柳树。西边一棵杨柳树，北边一棵杨柳树。任你柳丝千万条，怎么系得行人住？                             咏枇杷         路旁一株树，两个大丫杈。未结黄金果，先开白玉花。                       集句逆挽诗         一二三四五六七(罗隐)，        昨夜今宵又明日(白居易)。河低月落五更时(储光赣)，        吴歌楚舞欢未毕(李白)。                  《树！树！树！树！》                                           明 祝枝山              东边一棵树，南边一棵树。              西边一棵树，北边一棵树。              树！树！树！树！系不得郎舟住。     这首题诗反复铺陈四次“一棵树”，兼之一连渲染四个“树”，诗中柳丝般的千丝离情已束满蕴盈，简直呼之欲出了。一句“系不得郎舟住”，更冲开了心绪的闸门，升华了诗意。少女难舍情郎，却又不得不分的愁绪，真个一抒无余！        传说清代乾隆皇帝得到一幅《百鹅图》后,特邀翰苑近臣为此画题诗.翰苑大臣们惟恐所题诗句不合圣意,迟迟不敢动笔.可近臣纪晓岚却毫无顾忌,上前挥毫疾书道:        \"鹅鹅鹅鹅鹅鹅鹅,一鹅一鹅又一鹅……\"        众大臣看到纪晓岚连书这么多的\"鹅\"字,不觉掩口窃笑,乾隆皇帝望着这么多\"鹅\"字也不得其解.而纪晓岚目不斜视,继续写道:        \"食尽皇家千钟禄,凤凰何少尔何多 \"        人皆称其妙。无知的分割线&lt;img data-rawheight=\"402\" src=\"https://pic2.zhimg.com/50/v2-ebe6b4c18c658b18470cfcc0169a7050_hd.jpg\" data-rawwidth=\"620\" class=\"origin_image zh-lightbox-thumb\" width=\"620\" data-original=\"https://pic2.zhimg.com/v2-ebe6b4c18c658b18470cfcc0169a7050_r.jpg\"&gt;其实很少有诗前面真的平平无奇，但有很多诗都是结尾点睛。印象最深的是文天祥脍炙人口的那首诗                      过零丁洋                                 文天祥辛苦遭逢起一经，干戈寥落四周星。山河破碎风飘絮，身世浮沉雨打萍。惶恐滩头说惶恐，零丁洋里叹零丁。人生自古谁无死，留取丹心照汗青。这首诗作为初高中必备古诗词，必有绝妙之处。自首联至颈联，回顾往昔，叙述抗战经过，句句经典，对仗工整，形象生动，流露国破家亡的悲愤。而尾联却是真正的点睛之笔，谢榛在《四溟诗话》里评价为：“结句当如撞钟，清音有余。”全诗的格调立刻有悲愤沉郁转为豪放洒脱，令人眼前一亮，有逼仄之地突然豁然开朗的开拓之感，也得以流传千古。当然这个回答其实不太符合题意，只是前面平淡无奇的诗我实在是很难想出来，很多答主的答案我也不觉得前面平淡无奇。不过类似于此结尾点睛的诗句倒是很多，可以再更。", "answer_votes": "360", "answer_comment": "​40 条评论"}
{"answer_author": "明夷待訪", "answer_id": 258893129, "answer_text": "1：元稹的《遣悲怀·其三》闲坐悲君亦自悲，百年都是几多时。邓攸无子寻知命，潘岳悼亡犹费词。同穴窅冥何所望，他生缘会更难期。惟将终夜长开眼，报答平生未展眉。前面很一般，后面真是一句比一句好，到了结尾是一句无敌流水对。无法形容得好。只能说星星眼了(✪ω✪)。羡慕他能写出来。2：王国维的《浣溪沙》山寺微茫背夕曛，鸟飞不到半山昏，上方孤磬定行云。试上高峰窥浩月，偶开天眼觑红尘，可怜身是眼中人。前5句都是最后一句的铺垫，读一读就知道前5句骨力极高，起句就写得很高，按理来说起得太高后面都会弱下来，就不是好作品了。但王国维把前5句往高了写，末句急转直下，跌落谷底，有反差的震撼。这种写法在诗词里是不多见的。3：钱谦益的《秋夕燕誉堂话旧事有感》东虏游魂三十年，老夫双鬓更皤然。追思贳酒论兵日，恰是凉风细雨前。埋没英雄芳草地，耗磨岁序夕阳天。洞房清夜秋灯里，共简庄周说剑篇。这是我很喜欢的一首诗，在风雨飘摇的明末乱世，一个灯火温存夜里，聊的不是郎情妾意，而是说剑篇。联想到时代背景，有种无法言说的美感。先这几首。。。。", "answer_votes": "284", "answer_comment": "​38 条评论"}
{"answer_author": "应许", "answer_id": 215649174, "answer_text": "闻乐天授江州司马唐 · 元稹残灯无焰影幢幢，此夕闻君谪九江。垂死病中惊坐起，", "answer_votes": "421", "answer_comment": "​424 条评论"}
{"answer_author": "夏小年", "answer_id": 218580433, "answer_text": "贾宝玉的《姽婳词》，也算是曹雪芹的“卖弄”之作吧！贾政道：“你只顾说那些，这一句底下如何转至武事呢？若再多说两句，岂不蛇足了？”宝玉道：“如此，底下一句兜转煞住，想也使得。”贾政冷笑道：“你有多大本领！上头说了一句大开门的散话，如今又要一句连转带煞，岂不心有馀而力不足呢。”宝玉听了，垂头想了一想，说了一句道：“不系明珠系宝刀。”恒王好武兼好色，遂教美女习骑射。秾歌艳舞不成欢，列阵挽戈为自得。眼前不见尘沙起，将军俏影红灯里。叱吒时闻口舌香，霜矛雪剑娇难举。丁香结子芙蓉绦，不系明珠系宝刀。", "answer_votes": "190", "answer_comment": "​24 条评论"}
{"answer_author": "逸仙森", "answer_id": 215609900, "answer_text": "天噜啦 居然破百了【激动】【捂脸】   谢谢各位！接着更吧，O(∩_∩)O哈哈~。暂且不说东坡啦，说几句其他人的。（重点在后面哈哈哈）读书不觉已春深，一寸光阴一寸金。————唐·王贞白《白鹿洞》------------------------------------------------------------------------------------------十有九人堪白眼，百无一用是书生。————清·黄景仁《杂感》------------------------------------------------------------------------------------------凭君莫话封侯事，一将功成万骨枯。————唐·曹松《己亥岁》------------------------------------------------------------------------------------------公子王孙逐后尘，绿珠垂泪滴罗巾。侯门一入深如海，从此萧郎是路人。————唐·崔郊《赠去婢》------------------------------------------------------------------------------------------崆峒访道至湘湖，万卷诗书看转愚。踏破铁鞋无觅处，得来全不费工夫。————宋·夏元鼎《绝句》------------------------------------------------------------------------------------------世间爹妈情最真，泪血溶入儿女身。殚竭心力终为子，可怜天下父母心！————清·慈禧《祝母寿诗》（有木有感觉大吃一斤，这句居然是慈禧说的。）------------------------------------------------------------------------------------------富家不用买良田，书中自有千钟粟。安居不用架高堂，书中自有黄金屋。出门莫恨无人随，书中车马多如簇。娶妻莫恨无良媒，书中自有颜如玉。————宋·赵恒《励学篇》------------------------------------------------------------------------------------------色不迷人人自迷，情人眼里出西施。————清·黄增《集杭州俗语诗》------------------------------------------------------------------------------------------万一禅关砉然破，美人如玉剑如虹。————清·龚自珍《夜作》------------------------------------------------------------------------------------------待到秋来九月八，我花开后百花杀。冲天香阵透长安，满城尽带黄金甲。————唐·黄巢的《不第后赋菊》------------------------------------------------------------------------------------------力微任重久神疲，再竭衰庸定不支。苟利国家生死以，岂因祸福避趋之？————清·林则徐《赴戍登程口占示家人》------------------------------------------------------------------------------------------东坡先生貌似才是这方面的行家：枝上柳棉吹又少，天涯何处无芳草。————苏东坡《蝶恋花·赤花褪残红青杏小》------------------------------------------------------------------------------------------粗缯大布裹生涯，腹有诗书气自华。————苏东坡《和董传留别》------------------------------------------------------------------------------------------横看成岭侧成峰，远近高低各不同。不识庐山真面目，只缘身在此山中。————苏东坡《题西林壁》------------------------------------------------------------------------------------------十八新娘八十郎，苍苍白发对红妆。鸳鸯被里成双夜，一树梨花压海棠。　　“一树梨花压海棠”出自宋代词人苏轼嘲笑好友词人张先的调侃之作。　　“一树梨花压海棠”是老夫少妻，也即“老牛吃嫩草”的委婉的说法。梨花是白色的，海棠是红色。　　据说张先在80岁时娶了一个18岁的小妾，兴奋之余作诗一首：“我年八十卿十八，卿是红颜我白发。与卿颠倒本同庚，只隔中间一花甲。”　　苏东坡知道此事后遂作此诗调侃友人。在下有个不成熟的小建议，看完的朋友留个赞呗。", "answer_votes": "1.7K", "answer_comment": "​81 条评论"}
{"answer_author": "Jewel Staite", "answer_id": 215705838, "answer_text": "渺渺钟声出远方，依依林影万鸦藏。一生负气成今日，四海无人对夕阳。", "answer_votes": "303", "answer_comment": "​22 条评论"}
{"answer_author": "陈浪", "answer_id": 215887682, "answer_text": "“君王城上竖降旗，妾在深宫那得知？”第一句仅陈述事实，第二句表达自己这位亡国之妃的内心活动。首联两句，看似幽怨，甚至是所谓“深宫女子”的小家子气和嗔怪。然而后两句——“十四万人齐解甲，更无一个是男儿”第三句描述了蜀国投降的惨状，十四万本该保卫家国的将士丢盔弃甲，第四句痛彻淋漓地斥责、嘲笑了文武群臣没有骨气甘当俘虏的丑态。这一首《述国亡诗》，放到如今描述我国某叛党依然是十分生动形象的，这首诗也沾他们光越来越广为传颂。", "answer_votes": "354", "answer_comment": "​61 条评论"}
{"answer_author": "哈哈哈哈哈123", "answer_id": 227088092, "answer_text": "我记得一个 小时在杂志上看到的 古时候有个穷先生，回家后用仅剩的几十粒米熬了一碗粥，喝粥的时候诗性大发，便说   数粒熬成粥一瓯 鼻风吹起浪悠悠吟完后在屋里怎么也想不起下句，这时在他房上一个小偷说    分明一派西湖景 只欠渔翁一钓钩――――――――――――――――――――――评论区真是各种人才啊~~ 那我就再搬运一个吧 记得是在一本叫“特别关注”的书上看到的，是小偷和古代文人的趣事。  里面还有一个印象比较深刻的叫“世上如今半是君”是这样的唐朝李涉是太学博士 一日他经过皖口时遇强盗 强盗见是李涉，对其相当客气，并向李涉求诗，李涉写到“春雨潇潇江上村，绿林豪杰夜知闻。   他时不用相回避，世上如今半是君。”这一句真是讽刺，李涉平日所见的官场之人，多半和你们没有区别。后两句不一定多惊艳，但讽刺意味十足。――――――――――――――――――――――更正一下是“他时不用逃名姓，世上如今半是君。”感谢评论的@Koko ", "answer_votes": "1.5K", "answer_comment": "​110 条评论"}
{"answer_author": "王伟麟", "answer_id": 214143518, "answer_text": "力微任重久神疲，再竭衰庸定不支。", "answer_votes": "247", "answer_comment": "​16 条评论"}
{"answer_author": "青野", "answer_id": 215858200, "answer_text": "想起《还珠格格》里紫薇刚出道时提的诗：你也作诗送老铁，我也作诗送老铁。江南江北蓼花红，都是离人眼中血。一首刚开始不怎么样，还有点令乾隆爷略感尴尬，但后来一个漂亮反转的诗，当众感动了扎心的老铁，也感动了电视机前面十岁的我。o(*￣▽￣*)o", "answer_votes": "381", "answer_comment": "​54 条评论"}
{"answer_author": "王小七", "answer_id": 226353245, "answer_text": "【每天持续更新ing】很喜欢读诗，老诗虫欢快地跑来占坑。分享一些曾经惊艳到我的诗句，希望也能惊艳到你：1.这里荒芜寸草不生后来你来这走了一遭奇迹般万物生长这里是我的心——喜欢倒着读这首小诗2.说是寂寞的秋的清愁，说是辽远的海的相思，假如有人问我的烦忧，我不敢说出你的名字。我不敢说出你的名字，假如有人问我的烦忧，说是辽远的海的相思，说是寂寞的秋的清愁。——戴望舒《烦忧》3.我来自地狱欲通往天堂正路过人间——司汤达4.那时我们有梦，关于文学，关于爱情，关于穿越世界的旅行。如今我们深夜饮酒，杯子碰到一起，都是梦破碎的声音。——北岛《波兰来客》5.你没有如期归来而这正是离别的意义——北岛《白日梦》【第二次更新：】6.如果有来生， 要做一棵树， 站成永恒， 没有悲欢的姿势。 一半在土里安详， 一半在风里飞扬， 一半洒落阴凉， 一半沐浴阳光， 非常沉默非常骄傲， 从不依靠 从不寻找。如果有来生，要化成一阵风 一瞬间也能成为永恒 没有善感的情怀，没有多情的眼睛 一半在雨里洒脱 一半在春光里旅行 寂寞了，孤自去远行 把淡淡的思念统带走 从不思念、从不爱恋 如果有来生，要做一只鸟 飞越永恒，没有迷途的苦恼 东方有火红的希望 南方有温暖的巢床 向西逐退残阳，向北唤醒芬芳 如果有来生 希望每次相遇 都能化为永恒——三毛《说给自己听》7.瀑布的水逆流而上 蒲公英的种子从远处飘回，聚成伞的模样 太阳从西边升起 ，落向东方 子弹退回枪膛 运动员回到起跑线上 我交回录取通知书，忘了十年寒窗  厨房里飘来饭菜的香 你把我的卷子签好名字 ，关掉电视 帮我把书包背上 你还在我身旁——戴畅《你还在我身旁》8.螃蟹在剥我的壳笔记本在写我漫天的我落在枫叶上雪花上而你在想我——武大三行情诗【第三次更新：】9.远方除了遥远一无所有 更远的地方，更加孤独 远方的幸福，是多少痛苦。——海子《远方除了遥远一无所有》10.从明天起，做一个幸福的人 喂马、劈柴，周游世界 从明天起，关心粮食和蔬菜 我有一所房子，面朝大海，春暖花开 从明天起，和每一个亲人通信 告诉他们我的幸福 那幸福的闪电告诉我的 我将告诉每一个人 给每一条河每一座山取一个温暖的名字 陌生人，我也为你祝福 愿你有一个灿烂的前程 愿你有情人终成眷属 愿你在尘世获得幸福 我只愿面朝大海，春暖花开——海子《面朝大海，春暖花开》11.我多么希望，有一个门口，早晨，阳光照在草上。我们站着，扶着自己的门窗，门很低，但太阳是明亮的。草在结它的种子，风在摇它的叶子，我们站着，不说话，就十分美好。——顾城《门前》【第四次更新】破四百了，我再来更新一次～～12.其实，睡你和被你睡是差不多的，无非是两具肉体碰撞的力，无非是这力催开的花朵，无非是这花朵虚拟出的春天，让我们误以为生命被重新打开。大半个中国，什么都在发生：火山在喷，河流在枯一些不被关心的政治犯和流民一路在枪口的麋鹿和丹顶鹤我是穿过枪林弹雨去睡你我是把无数的黑夜摁进一个黎明去睡你我是无数个我奔跑成一个我去睡你当然我也会被一些蝴蝶带入歧途把一些赞美当成春天把一个和横店类似的村庄当成故乡而它们都是我去睡你必不可少的理由——《穿过大半个中国去睡你》余秀华13.我穿过思念齐眉的年代,手指苍白。多情而悲伤的句子,是时光腰身的流年,像水一样蔓过四季。你仍像是没有归航的船。14.醉过才知酒浓，爱过才知情重。你不能做我的诗，正如我不能做你的梦。——《梦与诗》胡适破五百了，我再来更一次～第五更：15.记忆的梗上，谁不有两三朵娉婷，披着情绪的花——林徽因《你是那人间的四月天》16.答案很长，我准备用一生的时间来回答，你准备要听了吗？——林徽因17.用急躁等待将来，用后悔回顾过去，都等于独立核算现在。——冯至《冯至选集》破六百了耶，我再来第六更～18.你是深深地懂得我的心意 你却淡淡地没有一言半语 一任远远近近的有情无情 都无主地飘蓬的风里雪里——冯至《雪中》19.我们准备着深深地领受 那些意想不到的奇迹， 在漫长的岁月里忽然有 彗星的出现，狂风乍起。——冯至《十四行诗》20.我的心骤然一阵疼痛，一定是 妈妈缀扣子的针线穿透了心胸。 这时，我的心变成了一只风筝， 风筝的线绳就在妈妈的手中。——食指《这是四点零八分的北京》破七百赞了，大家好厉害啊，我再来第七更～21.海中月是天上月,眼前人是心上人。向来心是看客心,奈何人是剧中人。——张爱玲22.所有的结局都已写好 所有的泪水也都已启程 却忽然忘了是怎么样的一个开始 在那个古老的不再回来的夏日 无论我如何地去追索 年轻的你只如云影掠过 而你微笑的面容极浅极淡 逐渐隐没在日落后的群岚 遂翻开那发黄的扉页 命运将它装订得极为拙劣 含着泪 我一读再读 却不得不承认 青春是一本太仓促的书——席慕蓉《青春》破八百赞了，大家好热烈啊，我来第八更～23.在年轻的时候，如果你爱上了一个人， 请你，请你一定要温柔地对待他。 不管你们相爱的时间有多长或多短， 若你们能始终温柔地相待，那么， 所有的时刻都将是一种无瑕的美丽。 若不得不分离，也要好好地说声再见， 也要在心里存着感谢，感谢他给了你一份记忆。 长大了以后，你才会知道，在蓦然回首的刹那， 没有怨恨的青春才会了无遗憾， 如山冈上那轮静静的满月。——席慕蓉《无怨的青春》24.在一回首间，才忽然发现，原来，我一生的种种努力，不过只为了周遭的人对我满意而已。为了搏得他人的称许与微笑，我战战兢兢地将自己套入所有的模式所有的桎梏。走到途中才忽然发现，我只剩下一副模糊的面目，和一条不能回头的路。——席慕蓉《独白》25.爱是一场远方独自的焚烧，是用灰烬重塑的自我 是疼到毁灭之时的一声喊叫 是喊叫之后永恒的沉寂 我以旋转的方式向你靠近，如激流上的花朵 如花朵下的漩涡 我听见时间以时间的速度下坠，撞击轰鸣 噢，我坚持以我的方式等你辨认，也这样辨认你 半辈子耗尽，半辈子耗尽了啊 我混匿于人群，哑口无言 而爱，是你满头白发时，准确地叫出了我的名字后 比天空更深的 沉默——余秀华《摇摇晃晃的人间》哇，九百赞了～我来【第九更】～只要你们敢赞，我就敢更新到天荒地老！26.你来人间一趟，你要看看太阳， 和你的心上人，一起走在街上。——海子《夏天的太阳》27.面对大河我无限惭愧 我年华虚度 空有一身疲倦 和所有以梦为马的诗人一样 岁月易逝 一滴不剩——海子《以梦为马》28.我以为我已经把你藏好了藏在那样深那样冷的昔日的心底我以为只要绝口不提只要让日子继续地过去你就终于终于会变成一个古老的秘密可是不眠的夜仍然太长而早生的白发又泄露了我的悲伤——席慕蓉《七里香》29.你见，或者不见我我就在那里不悲不喜你念，或者不念我情就在那里不来不去你爱，或者不爱我爱就在那里不增不减你跟，或者不跟我我的手就在你手里不舍不弃来我的怀里或者让我住进你的心里默然  相爱寂静  欢喜——仓央嘉措《见与不见》嘿哈～破千啦，我来第十更～30.我喜欢你是寂静的，仿佛你消失了一样。 你从远处聆听我，我的声音却无法触及你。 好像你的双眼已经飞离远去， 如同一个吻，封缄了你的嘴。 如同所有的事物充满了我的灵魂， 你从所有的事物中浮现，充满了我的灵魂。 你像我灵魂，一只梦的蝴蝶， 你如同忧郁这个字。 　　 我喜欢你是寂静的，好像你已远去。 你听起来像在悲叹，一只如鸽悲鸣的蝴蝶。 你从远处听见我，我的声音无法企及你。 让我在你的沉默中安静无声。 并且让我借你的沉默与你说话， 你的沉默明亮如灯，简单如指环。 你就像黑夜，拥有寂静与群星。 你的沉默就是星星的沉默，遥远而明亮。我喜欢你是寂静的，仿佛你消失了一样， 遥远且哀伤，仿佛你已经死了。 彼时，一个字，一个微笑，已经足够。 而我会觉得幸福，因那不是真的而觉得幸福。 ——聂鲁达《我喜欢你是寂静的》31.当华美的叶片落尽生命的脉络才历历可见——聂鲁达《似水流年》我来第十一更拉～32.每个人都站在地球的中心一线阳光透过他的全身瞬息间夜晚降临——萨瓦多尔·夸西莫多33.投入那倒转的世界在那，左便是右影子便是实体我们整夜无眠那里天堂浅俗而大海深远而你爱我——伊丽莎白•毕肖普嘿哈～我来第12更拉～34.若逢新雪初霁 满月当空下面平铺着皓影上面流转着亮银而你带笑地像我走来月色与雪色之间你是第三种角色——余光中《绝色》35.我们活在遗忘与回忆之间此刻是受绵亘不变的时间所侵蚀的一座岛屿——奥克塔维奥·帕斯还有很多珍藏在小本本里的诗句，喜欢就点个赞关注一下我哦，等到到一千三百赞了我回来第13更诶*罒▽罒*持续更新ing～我们商量个事，一起走到天荒地老行不？(◎｀・ω・´)人(´・ω・｀*)（群众内心os：这个楼主这么明目张胆的骗赞真不要脸）", "answer_votes": "1.2K", "answer_comment": "​99 条评论"}
{"answer_author": "laura", "answer_id": 216040953, "answer_text": "苏东坡的诗往往都是最后一句牛逼压轴。分享一首我很喜欢的。《水调歌头·黄州快哉亭赠张偓佺》      落日绣帘卷，亭下水连空。知君为我新作，窗户湿青红。长记平山堂上，欹枕江南烟雨，杳杳没孤鸿。认得醉翁语，山色有无中。      一千顷，都镜净，倒碧峰。忽然浪起，掀舞一叶白头翁。堪笑兰台公子，未解庄生天籁，刚道有雌雄。一点浩然气，千里快哉风。人都该有点浩然之气才可立于江湖。", "answer_votes": "219", "answer_comment": "​33 条评论"}
{"answer_author": "夜景湛虚明", "answer_id": 216644535, "answer_text": "1 颦有为颦，笑有为笑。  不颦不笑，哀哉年少   ——《牡丹亭》不再任由性子肆意妄为，知道隐藏自己不爽和喜悦的情绪，成年的大门就此打开2 桃溪不作从容住。秋藕绝来无续处。当时相候赤栏桥，今日独寻黄叶路。烟中列岫青无数。雁背夕阳红欲暮。人如风後入江云，情似雨馀黏地絮。——《玉楼春》周邦彦《白雨斋词话》评此词云：“美成词有似拙实工春，如玉楼春结句云：‘人如风后入江云，情似雨余粘地絮。’上言人不能留，下言情不能已。呆作两臂，别饶姿态，都不病其板，不病其纤，此中消息难言。”3危楼还望，叹此意、今古几人曾会。鬼设神施，浑认作、天限南疆北界。一水横陈，连岗三面，做出争雄势。六朝何事，只成门户私计。——《念奴娇·登多景楼》陈亮 上半阙传闻喵晚年，看罢“六朝何事，只成门户私计”泪痕数重。所谓“党内无派千奇百怪”“”，所谓要警惕资产阶级“糖衣炮弹”的进攻“”。归根到底，不就是为了自己那点私利么？4十方无影像，六道绝行踪跳出三界外 不在五行中这是形容我女朋友的诗句5  世人纷纷说不齐，他骑骏马我骑驴。 回头看到推车汉，比上不足比下有余郭德纲教导我们：往下看你会活得很快乐。你老往上看，你好不了，非死不可，往下瞧。你做买卖你赔钱了？那还有跳楼的呢。跟他比你很快乐。对不对？你这生一闺女你恨得慌，那还有没孩子的呢。你这失业了，那还有失身的呢。你媳妇不要你了，她也没要我呀6 芦叶满汀洲，寒沙带浅流。二十年重过南楼。柳下系船犹未稳，能几日，又中秋。黄鹤断矶头，故人曾到否？旧江山浑是新愁。欲买桂花同载酒，终不似，少年游——《唐多令》刘过7 山水万重书断绝，念君怜我梦相闻。我今因病魂颠倒，唯梦闲人不梦君——《酬乐天频梦微之》元稹麻蛋，伦家怎么木有梦到你，雅蠛蝶对于元稹和白居易，我只想说，在一起！在一起！在一起！8 醉别钟林十余春，重见云英掌上身。我未成名卿未嫁，可能俱是不如人。——《赠妓云英》罗隐罗隐同志年轻的时候和妓女云英一起在夜里成长过，十多年后又遇见了，所谓表子无情，云英嘲笑他没有考上功名。罗隐表示，我是落第秀才，你是色衰老妓，彼此彼此嘛。9玉楼冰簟鸳鸯锦，粉融香汗流山枕。帘外辘轳声，敛眉含笑惊。 柳阴烟漠漠，低鬓蝉钗落。须作一生拼，尽君今日欢。——《菩萨蛮》牛峤自动脑补小黄文10洞庭青草，近中秋，更无一点风色。玉界琼田三万顷，著我扁舟一叶。素月分辉，银河共影，表里俱澄澈。悠然心会，妙处难与君说。——《念奴娇•过洞庭》张孝祥 上半阙别人问你读完我写的这个感觉如何，拽一句“悠然心会，妙处难与君说”，逼格满满", "answer_votes": "285", "answer_comment": "​19 条评论"}
{"answer_author": "叶良辰", "answer_id": 214119806, "answer_text": "老来多健忘", "answer_votes": "243", "answer_comment": "​36 条评论"}
{"answer_author": "M3小蘑菇", "answer_id": 216251876, "answer_text": "轻肥 白居易意气骄满路，鞍马光照尘。借问何为者，人称是内臣。朱绂皆大夫，紫绶悉将军。夸赴军中宴，走马去如云。樽罍溢九酝，水陆罗八珍。果擘洞庭橘，脍切天池鳞。食饱心自若，酒酣气益振。是岁江南旱，衢州人食人！", "answer_votes": "119", "answer_comment": "​14 条评论"}
{"answer_author": "Lens", "answer_id": 223357213, "answer_text": "从“一诗一曲”栏目里摘取了几首，读诗真是很舒服的。一、《萤火虫》那是有萤火虫的傍晚我们等着公共汽车去维莱特里，我们看见两个老人在悬铃木下面接吻。就在那时，你一半对空气说，一半对我说：任何爱了多年的人，都没有白活。而就在那时，我看见了黑暗中的第一只萤火虫，围绕你的头明灭地闪耀着光亮。就在那时。——罗尔夫·雅各布森  作  董冀平  译二、《路人》不知为何，明明想和你说话。却骗你说，风雨正好，该去写点诗句。不必嘲讽我，你笑出声来，我也当是天籁。不必怀有敌意，你所有心计，我都当是你对我的心意。我的宿命分为两段，未遇见你时，和遇见你以后。你治好我的忧郁，而后赐我悲伤。忧郁和悲伤之间的片刻欢喜，透支了我生命全部的热情储蓄。想饮一些酒，让灵魂失重，好被风吹走。可一想到终将是你的路人，便觉得，沦为整个世界的路人。 风虽大，都绕过我灵魂。—— 西贝 作三、《冥想》 <一>为什么万物之灵的我们， 遭遇还比不上一棵小树？ 今天你摇摇它，优越地微笑， 明天就化为根下的泥土。为什么由手写出的这些字， 竟比这只手更长久，健壮？ 它们会把腐烂的手抛开， 而默默生存在一张破纸上。因此，我傲然生活了几十年， 仿佛曾做着万物的导演， 实则在它们长久的秩序下 我只当一会小小的演员。 <二>把生命的突泉捧在我手里，我只觉得它来得新鲜，是浓烈的酒，清新的泡沫，注入我的奔波、劳作、冒险。仿佛前人从未经临的园地就要展现在我的面前。但如今，突然面对着坟墓，我冷眼向过去稍稍回顾，只见它曲折灌溉的悲喜都消失在一片亘古的荒漠，这才知道我的全部努力 不过完成了普通的生活。—— 穆旦 作四、《不上班多好》 不上班多好，在被闹钟叫醒的那一刻！不快点起床，不快点擦牙、洗脸、穿鞋袜、穿衣服，可以继续睡或不睡，免除对世界的责任，对别人的责任，对自己的责任。不是已成习惯的周末不上班，也不是做了充分准备和计划的年假不上班，也不是没工作的无所事事不上班，而是在被闹钟叫醒的那一刻不上班多好！就像要是一生中有那么几年丶几个月丶几天，甚至几小时，甚至一刻钟不做人多好！做一枝花一株草，做一滴水一线阳光，啊，哪怕做做别人！哪怕 做自己挂在墙上的 那件外套—— 黄灿然  作更多有趣内容欢迎Lens-知乎微信、微博 “WeLens”Lens是一个致力于发现创造与美、探求生活价值、传递人性温暖的文化传播品牌", "answer_votes": "260", "answer_comment": "​19 条评论"}
{"answer_author": "尔朱容若", "answer_id": 215741059, "answer_text": "             赠范晔诗           南北朝   陆凯折花逢驿使，寄予陇头人。江南无所有，聊赠一枝春。        山中与幽人对酌                 李白        两人对酌山花开，        一杯一杯复一杯。        我醉欲眠君且去，        明朝有意抱琴来。", "answer_votes": "92", "answer_comment": "​7 条评论"}
{"answer_author": "清欢", "answer_id": 216039080, "answer_text": "看到这个题目，第一反应就是张宗昌的《大明湖》。大明湖，明湖大，大明湖里有荷花，荷花上面有蛤蟆，一戳一蹦跶。前面平平无奇，甚至略显寡淡，加上最后一句画面感，动感就出来了，心情都变好了了呢ε( 　ˇωˇ　 )э", "answer_votes": "1.2K", "answer_comment": "​114 条评论"}
{"answer_author": "起点中文网", "answer_id": 231967036, "answer_text": "王勃的《滕王阁序》是一个很好的例子，只不过惊艳之句来得更早了一些。公元675年，时任南昌故郡洪州都督的阎伯屿，重修滕王阁，于九月九日重阳节宴请文人雅士于阁上。此时，王勃在探望父亲的途中路遇洪都，作为有名文士，亦被邀请参加这次宴会。席间，都督阎伯屿提出为重修滕王阁作序之事，宾客都托辞不作，唯王勃却不拒绝，这使得有心让女婿吴子章一显才气的阎伯屿，只好作罢，这便有了有关《滕王阁序》创作的一则趣事：王勃著《滕王阁序》，时年十四。都督阎公不之信，勃虽在座，而阎公意属子婿孟学士者为之，已宿构矣。及以纸笔，延让宾客，勃不辞。公大怒，拂衣而起，专令人伺其下笔。第一报云：“南昌故郡，洪都新府。”公曰：“亦是老生常谈。”又报云：“星分翼轸，地接衡庐。”公闻之，沉吟不语。又云：“落霞与孤鹜齐飞，秋水共长天一色。”公矍然而起曰：“此真天才，当垂不朽矣!”遂亟请宴所，极欢而罢。（五代·王定保《唐摭言》）以下为原文：《滕王阁序》豫章故郡，洪都新府。星分翼轸，地接衡庐。襟三江而带五湖，控蛮荆而引瓯越。物华天宝，龙光射牛斗之墟；人杰地灵，徐孺下陈蕃之榻。雄州雾列，俊采星驰。台隍枕夷夏之交，宾主尽东南之美。都督阎公之雅望，棨戟遥临；宇文新州之懿范，襜帷暂驻。十旬休假，胜友如云；千里逢迎，高朋满座。腾蛟起凤，孟学士之词宗；紫电青霜，王将军之武库。家君作宰，路出名区；童子何知，躬逢胜饯。时维九月，序属三秋。潦水尽而寒潭清，烟光凝而暮山紫。俨骖騑于上路，访风景于崇阿；临帝子之长洲，得天人之旧馆。层峦耸翠，上出重霄；飞阁流丹，下临无地。鹤汀凫渚，穷岛屿之萦回；桂殿兰宫，即冈峦之体势。披绣闼，俯雕甍，山原旷其盈视，川泽纡其骇瞩。闾阎扑地，钟鸣鼎食之家；舸舰迷津，青雀黄龙之舳。云销雨霁，彩彻区明。落霞与孤鹜齐飞，秋水共长天一色。渔舟唱晚，响穷彭蠡之滨；雁阵惊寒，声断衡阳之浦。遥襟甫畅，逸兴遄飞。爽籁发而清风生，纤歌凝而白云遏。睢园绿竹，气凌彭泽之樽；邺水朱华，光照临川之笔。四美具，二难并。穷睇眄于中天，极娱游于暇日。天高地迥，觉宇宙之无穷；兴尽悲来，识盈虚之有数。望长安于日下，目吴会于云间。地势极而南溟深，天柱高而北辰远。关山难越，谁悲失路之人？萍水相逢，尽是他乡之客。怀帝阍而不见，奉宣室以何年？嗟乎！时运不齐，命途多舛。冯唐易老，李广难封。屈贾谊于长沙，非无圣主；窜梁鸿于海曲，岂乏明时？所赖君子见机，达人知命。老当益壮，宁移白首之心？穷且益坚，不坠青云之志。酌贪泉而觉爽，处涸辙以犹欢。北海虽赊，扶摇可接；东隅已逝，桑榆非晚。孟尝高洁，空余报国之情；阮籍猖狂，岂效穷途之哭！勃，三尺微命，一介书生。无路请缨，等终军之弱冠；有怀投笔，慕宗悫之长风。舍簪笏于百龄，奉晨昏于万里。非谢家之宝树，接孟氏之芳邻。他日趋庭，叨陪鲤对；今兹捧袂，喜托龙门。杨意不逢，抚凌云而自惜；钟期既遇，奏流水以何惭？呜乎！胜地不常，盛筵难再；兰亭已矣，梓泽丘墟。临别赠言，幸承恩于伟饯；登高作赋，是所望于群公。敢竭鄙怀，恭疏短引；一言均赋，四韵俱成。请洒潘江，各倾陆海云尔：滕王高阁临江渚，佩玉鸣鸾罢歌舞。画栋朝飞南浦云，珠帘暮卷西山雨。闲云潭影日悠悠，物换星移几度秋。阁中帝子今何在？槛外长江空自流。", "answer_votes": "889", "answer_comment": "​182 条评论"}
{"answer_author": "知乎用户", "answer_id": 216283817, "answer_text": "《凯歌》沈明臣 衔枚夜度五千兵，密领军符号令明。狭巷短兵相接处，杀人如草不闻声。", "answer_votes": "91", "answer_comment": "​7 条评论"}
{"answer_author": "例不虚发探花郎", "answer_id": 280583066, "answer_text": "我是个怪咖，唐诗里我喜欢杜超过李，无论是杜甫之于李白，还是杜牧之于李商隐。可能是因为，两杜都是善于用诗歌写故事的高级段子手吧。响彻千古的《三吏三别》系列，毫无疑问都是前面很平淡，后面却一鸣惊人的诗句。其中《石壕吏》是我们中学课本学过的，诗人夜宿，平淡开头，然后如电影镜头一般叙述了一个真实而悲惨的故事。暮投石壕村， 有吏夜捉人。老翁逾墙走， 老妇出门看。吏呼一何怒！ 妇啼一何苦！听妇前致词： 三男邺城戍。一男附书至， 二男新战死。存者且偷生， 死者长已矣！室中更无人， 惟有乳下孙，有孙母未去， 出入无完裙。老翁翻墙跑掉，还颇有黑色幽默感，到了小吏的恼怒，妇人的字字泣血，气氛就完全沉重了下来。安史之乱中的重要战役：邺城之战，唐军20万联军被叛军击溃，而以升斗小民的视角来看，短短三局话，三，一，二，三个数字跳脱，就是三个儿子，瞬间就有两个战死了，好莱坞现代也有讲这样的故事，用了150分钟，那部经典《拯救大兵瑞恩》<img src=\"https://pic2.zhimg.com/50/v2-629cad3e5839a2b70fdc1af5fb453964_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"549\" data-rawheight=\"300\" class=\"origin_image zh-lightbox-thumb\" width=\"549\" data-original=\"https://pic2.zhimg.com/v2-629cad3e5839a2b70fdc1af5fb453964_r.jpg\">本来这首诗读到这，已经觉得很凄惨了，但是还有更惨的呢！老妪力虽衰， 请从吏夜归，急应河阳役， 犹得备晨炊。唐朝的瑞恩没有人去救他，政府不仅没有丝毫怜悯反而绑走了他的老娘，去构筑新的河阳防线，这就是残酷的，毫无人性的战争！《石壕吏》的结尾可谓点睛：夜久语声绝， 如闻泣幽咽。天明登前途， 独与老翁别。万籁俱寂，却有着什么声音控诉着什么，到了天明，剩下的只有逃走的老翁了，这一切，未来还有希望么？唐王朝做为正统一方，做为牧民的首领，惨败后依然如此痛苦凌虐人民，那么历史上的安史之乱到底有怎样的惨像？三吏三别里我最喜欢的一首是《无家别》仍然是平淡中逐渐撕扯人内心的悲惨叙事，直到最后一句，把三吏三别整体的悲剧气氛渲染到了极致，在新安镇，在石壕村，在潼关，新婚别，垂老别的悲剧不断在发生着，直到百姓发出嘶哑的呐喊：人生无家别， 何以为蒸黎！我连家都没有了，还怎么做老百姓啊？！没有了青年会当凌绝顶，一览众山小的豪气，也还没有漫卷诗书喜欲狂的晚年喜悦。中年杜甫饱经离乱，用双眼凝视盛唐的衰亡，用笔记录人民的血泪，从平淡中升华超脱，这就是我所尊崇的诗圣吧。<img src=\"https://pic3.zhimg.com/50/v2-c88ec5a3f5df0b41d6c9b06ff1c2a75e_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"770\" data-rawheight=\"1127\" class=\"origin_image zh-lightbox-thumb\" width=\"770\" data-original=\"https://pic3.zhimg.com/v2-c88ec5a3f5df0b41d6c9b06ff1c2a75e_r.jpg\">", "answer_votes": "135", "answer_comment": "​18 条评论"}
{"answer_author": "萧楚白", "answer_id": 261602450, "answer_text": "杨子江头杨柳春杨花愁杀渡江人数声风笛离亭晚君向潇湘我向秦", "answer_votes": "42", "answer_comment": "​2 条评论"}
{"answer_author": "离离图总裂夫", "answer_id": 216210828, "answer_text": "《钗头凤》这词牌，从体例上固定了全文的重心必然在两阙最后三个字。前面都是铺陈。所以这词挺难写，好多大家写出来也就那样。只有陆游这首成名了。钗头凤·红酥手\n宋 · 陆游 红酥手。黄滕酒。满城春色宫墙柳。东风恶。欢情薄。一怀愁绪，几年离索。错错错。春如旧。人空瘦。泪痕红浥鲛绡透。桃花落。闲池阁。山盟虽在，锦书难托。莫莫莫。秦观写的这个，也还不错。钗头凤·别武昌\n宋 · 秦观 临丹壑。凭高阁。闲吹玉笛招黄鹤。空江暮。重回顾。一洲烟草，满川云树。住住住。 江风作。波涛恶。汀兰寂寞岸花落。长亭路。尘如雾。青山虽好，朱颜难驻。去去去。", "answer_votes": "94", "answer_comment": "​34 条评论"}
{"answer_author": "荔枝", "answer_id": 259124791, "answer_text": "看了一遍，没有罗隐啊。他是个太祖都着眼点评的诗人。很多答案里的诗太过浅白，像是讲段子，有的呢，开头就语出不凡，结尾更是掷地有声。罗隐则没那么大的手笔，更像是个凡人，一溜小跑，用尽全身气力，蹦起三尺就为蹬人一脚。被他踹得真窝心。《雪》尽道丰年瑞，丰年事若何?长安有贫者，为瑞不宜多。《蜂》不论平地与山尖，无限风光尽被占。采得百花成蜜后，为谁辛苦为谁甜?（与“遍身罗绮者，不是养蚕人”，同为千古诘问）《鹦鹉》莫恨雕笼翠羽残，江南地暖陇西寒。劝君不用分明语，语得分明出转难。《西施》家国兴亡自有时， 吴人何苦怨西施。西施若解倾吴国， 越国亡来又是谁?《自遣》得即高歌失即休，多愁多恨亦悠悠。今朝有酒今朝醉，明日愁来明日愁。《黄河》莫把阿胶向此倾，此中天意固难明。解通银汉应须曲，才出昆仑便不清。高祖誓功衣带小，仙人占斗客槎轻。三千年后知谁在，何必劳君报太平。《汴河》当时天子是闲游，今日行人特地愁。柳色纵饶妆故国，水声何忍到扬州。乾坤有意终难会，黎庶无情岂自由。应笑秦皇用心错，谩驱神鬼海东头。《西京崇德里居》进乏梯媒退又难，强随豪贵滞长安。风从昨夜吹银汉，泪拟何门落玉盘。抛掷红尘应有恨，思量仙桂也无端。锦鳞赪尾平生事，却被闲人把钓竿。《投所思》憔悴长安何所为?旅魂穷命自相疑。满川碧嶂无归日，一榻红尘有泪时。雕琢只应劳郢匠，膏肓终恐误秦医。浮生七十今三十，从此凄惶未可知。《鹭鸶》斜阳淡淡柳阴阴，风袅寒丝映水深。不要向人夸洁白，也知常有羡鱼心。《赠妓云英》钟陵醉别十余春，重见云英掌上身;我未成名卿未嫁，可能俱是不如人。（古往今来单体打出伤害量最大的四句诗，可谓精确制导。）还有一句新的，朋友转述，是他在别班考试，有人刻在墙上的，我觉得深得罗隐之妙，从高中笑到现在都不停歇——“自古红颜多薄命，我班女生活万年。”", "answer_votes": "279", "answer_comment": "​29 条评论"}
{"answer_author": "徐卫伟", "answer_id": 215900197, "answer_text": "补充一些南歌子（晚春）日薄花房绽，风和麦浪轻。夜来微雨洗郊坰。正是一年春好、近清明。 已改煎茶火，犹调入粥饧。使君高会有余清。此乐无声无味、最难名。望江南（超然台作）春未老，风细柳斜斜。试上超然台上望，半壕春水一城花。烟雨暗千家。 寒食后，酒醒却咨嗟。休对故人思故国，且将新火试新茶。诗酒趁年华。 江城子（江景）凤凰山下雨初晴。水风清。晚霞明。一朵芙蕖，开过尚盈盈。何处飞来双白鹭，如有意，慕娉婷。 忽闻江上弄哀筝。苦念情。遣谁听。烟敛云收，依约是湘灵。欲待曲终寻问取，人不见，数峰青。 南乡子（用韵和道辅）未倦长卿游。漫舞夭歌烂不收。不是使君矫世，谁留。教有琼梳脱麝油。 香粉镂金球。花艳红笺笔欲流。从此丹唇并皓齿，清柔。唱遍山东一百州。 ---------------------------苏轼的词可能是因为我水平有限，只能被最后一句惊艳到。。但喜欢苏轼是真的临江仙·送钱穆父一别都门三改火，天涯踏尽红尘。依然一笑作春温。无波真古井，有节是秋筠。惆怅孤帆连夜发，送行淡月微云。尊前不用翠眉颦。人生如逆旅，我亦是行人。水调歌头（黄州快哉亭赠张偓佺）落日绣帘卷，亭下水连空。知君为我，新作窗户湿青红。长记平山堂上，欹枕江南烟雨，渺渺没孤鸿。认得醉翁语，山色有无中。 一千顷，都镜净，倒碧峰。忽然浪起，掀舞一叶白头翁。堪笑兰台公子，未解庄生天籁，刚道有雌雄。一点浩然气，千里快哉风。 西江月（梅花）玉骨那愁瘴雾，冰姿自有仙风。海仙时遣探芳丛。倒挂绿毛么凤。 素面翻嫌粉涴，洗妆不褪唇红。高情已逐晓云空。不与梨花同梦。 西江月（平山堂）三过平山堂下，半生弹指声中。十年不见老仙翁。壁上龙蛇飞动。 欲吊文章太守，仍歌杨柳春风。休言万事转头空。未转头时皆梦。 临江仙（疾愈登望湖楼赠项长官）多病休文都瘦损，不堪金带垂腰。望湖楼上暗香飘。和风春弄袖，明月夜闻箫。 酒醒梦回清漏永，隐床无限更潮。佳人不见董娇饶。徘徊花上月，空度可怜宵。  临江仙夜饮东坡醒复醉，归来仿佛三更。家童鼻息已雷鸣。敲门都不应，倚杖听江声。 长恨此身非我有，何时忘却营营。夜阑风静縠纹平。小舟从此逝，江海寄余生。鹧鸪天（东坡谪黄州时作此词，真本藏林子敬家）林断山明竹隐墙。乱蝉衰草小池塘。翻空白鸟时时见，照水红蕖细细香。 村舍外，古城旁。杖藜徐步转斜阳。殷勤昨夜三更雨，又得浮生一日凉。 emmm再来一首晏几道的很喜欢的鹧鸪天 [晏几道]彩袖殷勤捧玉钟，当年拚却醉颜红。舞低杨柳楼心月，歌尽桃花扇底风。从别后，忆相逢，几回魂梦与君同。今宵剩把银釭照，犹恐相逢是梦中。（看到这里赞一下啦）&lt;img data-rawheight=\"549\" src=\"https://pic2.zhimg.com/50/v2-df3fc039bd02aa8a05b3bcd4ad0be26d_hd.jpg\" data-rawwidth=\"632\" class=\"origin_image zh-lightbox-thumb\" width=\"632\" data-original=\"https://pic2.zhimg.com/v2-df3fc039bd02aa8a05b3bcd4ad0be26d_r.jpg\"&gt;", "answer_votes": "102", "answer_comment": "​14 条评论"}
{"answer_author": "掌阅读书", "answer_id": 226292870, "answer_text": "1. 菩萨蛮韦庄人人尽说江南好，游人只合江南老。春水碧于天，画船听雨眠。垆边人似月，皓腕凝霜雪。未老莫还乡，还乡须断肠。清末大词人王鹏运说过，写词要符合“重、大、拙”三字诀，韦庄这两句，“拙”得真诚，是一种人生经历的感慨，没有华丽的辞藻，未成功名的人，回到家乡，心情抑郁哀凉，只盼有一天能衣锦还乡，在外拼搏的人们，是否会引起共鸣？2. 绝句夏元鼎崆峒访道至湘湖，万卷诗书看转愚。踏破铁鞋无觅处，得来全不费工夫。执着未必能获得回报，放弃时却有意想不到的效果。有时候，放手也是一种智慧。3. 不第后赋菊黄巢待到秋来九月八，我花开后百花杀。冲天香阵透长安，满城尽带黄金甲。菊花，历来是众多文人墨客咏叹的对象，有言道：“咏菊花而写不出国魂者，皆下品。” 黄巢借咏菊以抒抱负，“满城尽带黄金甲”，语调高昂，气势凌厉。4. 临江仙·送钱穆父苏轼一别都门三改火，天涯踏尽红尘。依然一笑作春温。无波真古井，有节是秋筠。惆怅孤帆连夜发，送行淡月微云。尊前不用翠眉颦。人生如逆旅，我亦是行人。你我都是漂泊的旅人，何不恬淡自适，随遇而安？5. 人月圆吴激南朝千古伤心事，犹唱后庭花。旧时王谢、堂前燕子，飞向谁家。恍然一梦，仙肌胜雪，宫鬓堆鸦。江州司马，青衫泪湿，同是天涯。吴激此词，通篇借助前人诗句，巧妙地裁剪组合，倾吐其对故国的思念，对流亡的酸楚。6. 蝶恋花柳永伫倚危楼风细细，望极春愁，黯黯生天际。草色烟光残照里，无言谁会凭阑意。拟把疏狂图一醉，对酒当歌，强乐还无味。衣带渐宽终不悔，为伊消得人憔悴。俞陛云《唐五代两宋词选释》有评：长守尾生抱柱之信，拼减沈郎腰带之围，真情至语。千古名句，前部不提半句“相思”，最后一句一语道破，浓情之深。7. 渔家傲李清照天接云涛连晓雾，星河欲转千帆舞。仿佛梦魂归帝所。闻天语，殷勤问我归何处。我报路长嗟日暮，学诗谩有惊人句。九万里风鹏正举。风休住，蓬舟吹取三山去。一改南渡之后的消沉愁苦之气，境界雄奇阔大，不似女儿语，颇有苏辛风味，是李词少有的豪放风格。8. 一剪梅李清照红藕香残玉簟秋，轻解罗裳，独上兰舟。云中谁寄锦书来，雁字回时，月满西楼。花自飘零水自流。一种相思，两处闲愁。此情无计可消除，才下眉头，却上心头。上阙着重环境描写，伤春悲秋的景色，下阙“才下眉头，却上心头”之愁自然流露，更显难过。9. 诉衷情陆游当年万里觅封侯，匹马戍梁州。关河梦断何处？尘暗旧貂裘。胡未灭，鬓先秋，泪空流。此生谁料，心在天山，身老沧洲。请缨无路，屡遭贬黜，有志难申，报国欲死无战场，犹如一心要搏击长空的苍鹰，却被折断羽翼，痛苦悲凉。10. 咏荆轲陶渊明燕丹善养士，志在报强嬴。招集百夫良，岁暮得荆卿。君子死知己，提剑出燕京；素骥鸣广陌，慷慨送我行。雄发指危冠，猛气冲长缨。饮饯易水上，四座列群英。渐离击悲筑，宋意唱高声。萧萧哀风逝，淡淡寒波生。商音更流涕，羽奏壮士惊。心知去不归，且有后世名。登车何时顾，飞盖入秦庭。凌厉越万里，逶迤过千城。图穷事自至，豪主正怔营。惜哉剑术疏，奇功遂不成。其人虽已没，千载有馀情。朱熹曾说：“陶渊明诗，人皆说是平淡，据某看他自豪放，但豪放得来不觉耳。其露出本相者，是《咏荆轲》一篇。”陶渊明按照荆轲刺秦的事件经过，描写了出京、饮饯、登程、搏击的场面，似白描而非白描，最后对荆轲的惋惜，对其的慨叹，愤慨之情，赫然托出。11. 浣溪沙纳兰性德谁念西风独自凉，萧萧黄叶闭疏窗。沉思往事立残阳，被酒莫惊春睡重。赌书消得泼茶香，当时只道是寻常。“上阕是此时此地的沉思，下阕是对往时往事的回忆”，昔日往事，只能是回忆，读此处，不禁潸然泪下。12. 好事近·渔父词朱敦儒摇首出红尘，醒醉更无时节。活计绿蓑青笠，惯披霜冲雪。 晚来风定钓丝闲，上下是新月。千里水天一色，看孤鸿明灭。这是一首上乘的山水风物词，细节之处，渔夫形象显现，最后一句宏观场面，更显旷然。让阅读变得有趣欢迎关注知乎机构号： @掌阅读书 ", "answer_votes": "1.1K", "answer_comment": "​77 条评论"}
{"answer_author": "云台三落", "answer_id": 226476164, "answer_text": "轻肥唐 · 白居易 意气骄满路，鞍马光照尘。 借问何为者，人称是内臣。 朱绂皆大夫，紫绶或将军。 夸赴军中宴，走马去如云。 尊罍溢九酝，水陆罗八珍。 果擘洞庭橘，脍切天池鳞。 食饱心自若，酒酣气益振。 是岁江南旱，衢州人食人。", "answer_votes": "602", "answer_comment": "​29 条评论"}
{"answer_author": "王爱国", "answer_id": 216158250, "answer_text": "最符合题意的当推那首《咏雪》。某日，大雪。乾隆见飞雪摇坠而诗兴大发，张口吟道：“一片一片又一片……”“……两片三片四五片……“雪真大啊，再接一句：“六片七片八九片……”emm...六片七片八九片......emmmm...........正当场面如此尴尬的时候，纪晓岚灵机一动，上前一步，接道：“飞入芦花都不见。”也不算一鸣惊人，至少音律和内容没毛病，手法和意境更是直接升华了全诗，堪称妙笔。不过这毕竟是民间传言，这诗也没什么可评说的。认真答一个：王爱国：有哪些后劲很足的诗句？作为一个学中文的，真心希望我在本专业领域的回答 比我讲的故事有更多的人阅读……(´ . .̫ . `)", "answer_votes": "136", "answer_comment": "​35 条评论"}
{"answer_author": "涵君", "answer_id": 216099588, "answer_text": "随园杂诗         袁机草色青青忽自怜，浮生如梦亦如烟。乌啼月落知多少，只记花开不记年。从清朝大才子袁枚的《祭妹文》里，了解他的三妹袁机，而后又遇此诗。前两句着实平淡，并不比大部分感怀身世的诗出彩。后两句却让人眼前一亮，优雅的韵味和精炼的情愫已出，再多的描写都比不上那个对月忆乌啼，赏花忘年华的女子影姿了。袁机是才女，超脱不出封建束缚，婚姻尤其失败，惨遭丈夫虐待而无力摆脱，最终忧郁而终，不幸至极。这些经历与朱淑真倒有几分相似。联系上她的生平再去品读最后两句，依旧云淡风轻，却是凛凛动人。一直很喜欢这样的句子，安静，暗香，背后的故事永远比字面难过许多。", "answer_votes": "104", "answer_comment": "​7 条评论"}
{"answer_author": "杜天雨", "answer_id": 217478699, "answer_text": "瀑布的水逆流而上，蒲公英种子从远处飘回，聚成伞的模样，太阳从西边升起，落向东方。子弹退回枪膛， 运动员回到起跑线上，我交回录取通知书，忘了十年寒窗。厨房里飘来饭菜的香，你把我的卷子签好名字，关掉电视，帮我把书包背上。 你还在我身旁。这是香港微情书比赛中的作品。前面的描写平淡无奇，但最后你还在我身旁，却让整个画面活了起来，流露出人世间子欲养而亲不待的深刻无奈。﹋﹊﹋﹊﹋﹊﹋﹊帅气的分割线﹋﹊﹋﹊﹋﹊贺新郎·读史  毛泽东 人猿相揖别。 只几个石头磨过， 小儿时节。铜铁炉中翻火焰， 为问何时猜得？ 不过几千寒热。 人世难逢开口笑， 上疆场彼此弯弓月。流遍了，\n郊原血。 一篇读罢头飞雪， 但记得斑斑点点， 几行陈迹。 五帝三皇神圣事， 骗了无涯过客。 有多少风流人物？ 盗跖庄蹻流誉后，更陈王奋起挥黄钺。歌未竟，\n东方白。        最早接触毛主席的诗词还是上小学，只觉得是众多诗里最好背的，也是最好懂得。        现在再来看感觉是这诗词是真的豪迈，用知友的一句话是让那些关西大汉的铜琵琶，铁绰板也黯然失色。        长歌未竟，东方既白。", "answer_votes": "195", "answer_comment": "​13 条评论"}
{"answer_author": "西庆余里", "answer_id": 219176333, "answer_text": "歪个楼，不算诗句，是副对子。东晋书法家王羲之有一年从山东移居到浙江绍兴，此时正值年终，于是王羲之写了一副春联，让家人贴在大门两侧。对联是：“春风春雨春色，新年新岁新景。”可不料因为王羲之书法盖世，为时人所景仰，此联刚一贴出，即被人趁夜揭走。家人告诉王羲之后，王羲之也不生气，又提笔写了一副，让家人再贴出去。这副写的是：“莺啼北里，燕语南郊。”谁知天明一看，又被人揭走了。可这天已是除夕，第二天就是大年初一，眼看左邻右舍家家户户门前都贴上了春联，惟独自己家门前空空落落，急得王夫人直催丈夫想办法。王羲之想了想，又提笔写了一副，写完后，让家人先将对联剪去一截，把上半截先张贴于门上：“福无双至，祸不单行。”夜间果然又有人来偷揭。可在月色下一看，见这副对联写得太不吉利。尽管王羲之是书法名家，可也不能将这副充满凶险预言的对联取走张贴啊。来偷揭的人只好叹口气，又趁夜色溜走了。初一早晨天刚亮，王羲之即亲自出门将昨天剪下的下半截分别贴好，此时已有不少人围观，大家一看，对联变成了：“改革开放树典范，富民强国颂党恩”贴错了，不好意思。“福无双至今朝至，祸不单行昨夜行。”", "answer_votes": "158", "answer_comment": "​45 条评论"}
{"answer_author": "解药", "answer_id": 227014760, "answer_text": "打我记事开始，爷爷就是个老头他那么老，好像从来不曾年轻过他那么老，好像生来只为了做我的爷爷可我从未认真想过他有一天会死我总以为，一个人再老，总可以再活一年吧然而有一天他还是死了， 就像土垛的院墙 风雨多了，总有一天会塌下来没了。 完了。他的一生我也知道得很少 他说过一些，我记不大起来 就像他爱我很多， 我只是喊他爷爷——海桑一开始看了前半段内心毫无波动，后半段联想起自己的爷爷却潸然泪下，尤其是最后一句就像他爱我很多，我只是喊他爷爷——————既然有人看我就多说一句我每次看到这首诗都想到爷爷前几年去世时 我们为他整理衣物 然后发现我和我的两个堂哥照片都被他缝在外套里面  如果你们爷爷健在希望你们好好珍惜  真的   最重要还是常回家看看——————————第一次体会到收藏比赞多╭(๑¯⌓¯๑)╮", "answer_votes": "987", "answer_comment": "​35 条评论"}
{"answer_author": "江二", "answer_id": 215548935, "answer_text": "此身恰似弄潮儿 曾过了千重浪且喜归来无恙  一壶春酿12.24还有28天 还是忍不住给梦老师和老帅打了call银河战舰首轮出局无论对选手还是粉丝们来说都是一件超级难以接受的事几场比赛ban位上都问题不大 除了最后一局没ban苏烈之外 但在选阵容上一直后四局一直把凯放给对面 对后排真的太伤老帅梦老师一起走完了三届KPL 下一次证明自己或许是一年后 或许也有太多变数赛后窝窝落寞的眼神真的刺激到了我 我不想一个月之后出了考场 也要再等一年的时间。附上这首 略做改动的下阕鹏北海 凤朝阳 又携书剑路茫茫 明年某日青云去 却笑人间举子忙&lt;img src=\"https://pic3.zhimg.com/50/v2-f54efe0294ad0b834eec3655ef24a68e_hd.jpg\" data-rawwidth=\"2048\" data-rawheight=\"1536\" class=\"origin_image zh-lightbox-thumb\" width=\"2048\" data-original=\"https://pic3.zhimg.com/v2-f54efe0294ad0b834eec3655ef24a68e_r.jpg\"&gt;与AG共勉 超玩会永远超会玩。&lt;img src=\"https://pic1.zhimg.com/50/v2-dc600224d80111184ae07ec22e1a5ac7_hd.jpg\" data-rawwidth=\"1070\" data-rawheight=\"738\" class=\"origin_image zh-lightbox-thumb\" width=\"1070\" data-original=\"https://pic1.zhimg.com/v2-dc600224d80111184ae07ec22e1a5ac7_r.jpg\"&gt;火车上果然读书佳处，小晏犹恐相逢是梦是幸福的惶恐， 红袖添香 互诉衷肠 是有惊无险的欢乐。 莫名想起李商隐的那句何当共剪西窗烛 却话巴山夜雨时 在南宋洪迈编的《万首唐人绝句》里，这首诗的题目为《夜雨寄内》，意思是诗是寄给妻子的。李商隐于大中五年七月赴东川节度使柳仲郢梓州幕府途中写下此诗，而王氏是在这一年的夏秋之交病故，李商隐过了几个月才得知妻子的死讯，剪烛叙旧的相逢似乎只能在梦中了。时光一去永不回。愿大家眼前人俱是心上人，能终成眷属绝不好聚好散。共勉！十一月四日风雨大作其一风卷江湖雨暗村，四山声作海涛翻。溪柴火软蛮毡暖，我与狸奴不出门。 再更 都知道其二铁马冰河入梦来的男儿本色其实当年万里觅封侯 匹马戍梁州的放翁也是个猫奴呢！想起小时候雪天一家人坐在大火桶说旧事的情形了。再更一首我超喜欢的。&lt;img src=\"https://pic1.zhimg.com/50/v2-2ce86e5b1a95c748a74eb6f9245ee59d_hd.jpg\" data-rawwidth=\"703\" data-rawheight=\"438\" class=\"origin_image zh-lightbox-thumb\" width=\"703\" data-original=\"https://pic1.zhimg.com/v2-2ce86e5b1a95c748a74eb6f9245ee59d_r.jpg\"&gt;蝶恋花王国维\n 阅尽天涯离别苦，不道归来，零落花如许。花底相看无一语，绿窗春与天俱莫。待把相思灯下诉，一缕新欢，旧恨千千缕。最是人间留不住，朱颜辞镜花辞树。&lt;img src=\"https://pic2.zhimg.com/50/v2-59e33188f1d15cd89a5b97167a59fb59_hd.jpg\" data-rawwidth=\"787\" data-rawheight=\"450\" class=\"origin_image zh-lightbox-thumb\" width=\"787\" data-original=\"https://pic2.zhimg.com/v2-59e33188f1d15cd89a5b97167a59fb59_r.jpg\"&gt;赠妓云英  罗隐\n 钟陵醉别十余春，重见云英掌上身。 我未成名卿未嫁，可能俱是不如人。罗隐当初以寒士身份赴举，路过钟陵县（今江西省进贤县），结识了当地乐营中一个颇有才思的歌妓云英。约莫十二年光景他再度落第路过钟陵，又与云英不期而遇。见她仍隶名乐籍，未脱风尘，罗隐不胜感慨。更不料云英一见面却惊诧道：“怎么罗秀才还是布衣？”罗隐便写了这首诗赠她。：首句写“别”，第二句则写“逢”。由怀旧过渡到眼前。前句兼及彼此，次句则侧重写云英。用汉代赵飞燕“掌上舞”典故。当诗人在“十余春”后再次见到已属半老徐娘的云英的时候，其婀娜的身姿竟然还同十余年前 一样，犹有“掌上身”的风采，可以想见年轻时的云英一定是十分令人倾倒。末句用“可能俱是不如人”的假设、反诘之词代替回答，启人深思。它包含丰富的潜台词：即使退一万步说，“我未成名”是“不如人”的缘故，可“卿未嫁”又是为什么？难道也为“不如人”么？这说不过去（前面已言其美丽出众）。反过来又意味着：“我”又何尝“不如人”呢？既然“不如人”这个答案不成立，那么“我未成名卿未嫁”原因到底是什么，答案也就很明确了。此句情感深沉悲愤，一语百情，将诗人满腔的愤懑、无奈倾泻无余。对于那些把最后两句理解成反鸡汤的 我只想说&lt;img src=\"https://pic3.zhimg.com/50/v2-086e2474c315ebcba24488e2c1a167e3_hd.jpg\" data-rawwidth=\"559\" data-rawheight=\"412\" class=\"origin_image zh-lightbox-thumb\" width=\"559\" data-original=\"https://pic3.zhimg.com/v2-086e2474c315ebcba24488e2c1a167e3_r.jpg\"&gt;明天回学校了 再更《题鹤林寺僧舍》终日昏昏醉梦间，忽闻春尽强登山。\n　　因过竹院逢僧话，\n　　偷得浮生半日闲。以前每个星期六下午不想写作业都用最后一句安慰自己。。鹧鸪天·送人 辛弃疾\n 唱彻阳关泪未干功名馀事且加餐浮天水送无穷树带雨云埋一半山 今古恨 几千般只应离合是悲欢？江头未是风波恶别有人间行路难辛翁的送人颇有下面东坡 人生如逆旅我亦是行人的感觉啊 不过这首不是特别切题只是最近多雨 见惯了带雨云埋一半山的精致真心想分享大家 强答。&lt;img src=\"https://pic2.zhimg.com/50/v2-5d642fa2e15a09fb5bf0367113b67673_hd.jpg\" data-rawwidth=\"1280\" data-rawheight=\"960\" class=\"origin_image zh-lightbox-thumb\" width=\"1280\" data-original=\"https://pic2.zhimg.com/v2-5d642fa2e15a09fb5bf0367113b67673_r.jpg\"&gt;以上写线代写到停电 现在外面黑云翻6墨 好生恐怖啊 顺手更两首                               妾薄命                                 李端\n 忆妾初嫁君，花鬟如绿云，回灯入绮帐，转面脱罗裙。 折步教人学，偷香与客熏。容颜南国重，名字北方闻。 一从失恩意，转觉身憔悴。对镜不梳头，倚窗空落泪。 新人莫恃新，秋至会无春。从来闭在长门者，必是宫中第一人。    呀 但见新人笑 那闻旧人哭 人生失意无南北 不如高卧且加餐。&lt;img src=\"https://pic4.zhimg.com/50/v2-587369c8686bb4dc76f73741b2f86d6d_hd.jpg\" data-rawwidth=\"714\" data-rawheight=\"561\" class=\"origin_image zh-lightbox-thumb\" width=\"714\" data-original=\"https://pic4.zhimg.com/v2-587369c8686bb4dc76f73741b2f86d6d_r.jpg\"&gt;关于忠诚最初的念想就是源自这首诗眼里只是聪明真诚的姑娘且莫管他背后有什么劳什子的政治隐喻人皆有情望忠诚莫被忠诚误一生啊~第一次被评论 猴开森 @splendid  我只能说 苟富贵 不相忘hhh 于是果断再更那些初见一般 再见惊艳的作品 除了秋风生渭水 落叶满长安一类有句无篇的 大多是寓情于深 平淡中见真淳 或者多用典晦涩句各举一例&lt;img src=\"https://pic2.zhimg.com/50/v2-ab856ff6509eabbfb995a4bff92d8503_hd.jpg\" data-rawwidth=\"1024\" data-rawheight=\"1109\" class=\"origin_image zh-lightbox-thumb\" width=\"1024\" data-original=\"https://pic2.zhimg.com/v2-ab856ff6509eabbfb995a4bff92d8503_r.jpg\"&gt;这首记得旧时好是在汪曾祺的一篇散文上见的 好像叫茶馆 初见只一小节 刻在茶馆的墙壁上 自己找全 始读只觉皆平淡事 细细品味满脑子都是 儿时欢乐 儿时欢乐 斯乐不可作的旋律。&lt;img src=\"https://pic1.zhimg.com/50/v2-c533a0459152c4f393d3260c4d324306_hd.jpg\" data-rawwidth=\"720\" data-rawheight=\"1675\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic1.zhimg.com/v2-c533a0459152c4f393d3260c4d324306_r.jpg\"&gt;元稹的遣悲怀三首 最开始只记得后两首的贫贱夫妻百事哀 和报答平生未展眉二句 配上注释 才难怪曾经沧海一句 有些人因为西厢记讲元稹是渣男  且不说这个尚无公论  不管怎样我们总认识了一个贫贱不移 生死相依的伟大女性。&lt;img src=\"https://pic4.zhimg.com/50/v2-995dfb00532aa7aafcd65c1c300a75ef_hd.jpg\" data-rawwidth=\"710\" data-rawheight=\"375\" class=\"origin_image zh-lightbox-thumb\" width=\"710\" data-original=\"https://pic4.zhimg.com/v2-995dfb00532aa7aafcd65c1c300a75ef_r.jpg\"&gt;啊 我又来了 可能有人觉着不切题 稍微解释一下 私以为这是苏轼四时回文里最靓的一首了 凉衫薄汗香一联更是美极末句前一半写 少年打趣姑娘的吃相 大概是嘴太小 没法直接咬断只能任藕丝越拉越长 情侣间的小确幸 满是欢喜的样子 后半句却笔锋急转 意为那牵丝的冰藕却笑多情的少年不似它情思绵长 与其说是喜中见悲 不如说是一种透彻 就像纳兰的词 情到浓时情转薄 又或者那首八至中的 至亲至疏夫妻 一般 东坡大概想说 那曾经金屋以藏的阿娇不也被幽闭在咫尺的长门宫里么 喜乐无常 祸福相依人生一世 还当专注过程..细思回味无穷啊 居然有十个赞（这个居然用的好凄凉啊） 再更一首            《梅岭三章·其一》                         陈毅 断头今日意如何？创业艰难百战多。 此去泉台招旧部，旌旗十万斩阎罗。   临江仙·送钱穆父 宋 · 苏轼 一别都门三改火，天涯踏尽红尘。依然一笑作春温。无波真古井，有节是秋筠。 惆怅孤帆连夜发，送行淡月微云。尊前不用翠眉颦。人生如逆旅，我亦是行人。 ", "answer_votes": "89", "answer_comment": "​6 条评论"}
{"answer_author": "少年不白首", "answer_id": 215544681, "answer_text": "我来说一个。前两句是，誓扫匈奴不顾身，五千貂锦丧胡尘看似筋骨毕露，但是，且看后两句可怜无定河边骨，犹是春闺梦里人明王世贞《艺苑卮言》赞赏此诗后二句“用意工妙”，但指责前二句“筋骨毕露”，后二句为其所累。其实，首句写唐军将士奋不顾身“誓扫匈奴”，给人留下了深刻的印象。而次句写五千精良之兵，一旦之间丧身于“胡尘”，确实令人痛惜。征人战死得悲壮，少妇的命运就更值得同情。所以这些描写正是为后二句表现少妇思念征人张本。可以说，若无前二句明白畅达的叙述描写作铺垫，想亦难见后二句“用意”之“工妙”。", "answer_votes": "77", "answer_comment": "​4 条评论"}
{"answer_author": "韩博Spurs", "answer_id": 263054346, "answer_text": "谢邀。唐伯虎唐寅算是诗中“话糙理不糙”的杰出代表，他的诗虽押韵得当，朗朗上口，但有的词藻过于平淡，读起来像打油诗一样。而且他的诗有一大部分都很切合这个主题，有的时候，一首诗前后差别之大让人不敢相信这是一个人写的。比如说：《桃花庵歌》桃花坞里桃花庵，桃花庵下桃花仙；桃花仙人种桃树，又摘桃花卖酒钱。酒醒只在花前坐，酒醉换来花下眠；半醒半醉日复日，花落花开年复年。但愿老死花酒间，不愿鞠躬车马前；车尘马足富者趣，酒盏花枝贫者缘。若将富贵比贫贱，一在平地一在天；若将贫贱比车马，他得驱驰我得闲。别人笑我忒疯癫，我笑别人看不穿；不见五陵豪杰墓，无花无酒锄做田。电影里的唐伯虎风流倜傥，可现实中唐寅的生活确坎坷曲折。他15岁少年出仕，但仕途不顺，后来又因考试舞弊被被革去功名，后来亲人接连离世，家道落寞，过山车一般的人生，这其中心酸只有他自己知道。“别人笑我忒疯癫，我笑别人看不穿”，炼句入境，领悟通透。《言志》不炼金丹不坐禅，不为商贾不耕田。闲来写就青山卖，不使人间造孽钱！《言怀》笑舞狂歌五十年，花中行乐月中眠。漫劳海内传名字，谁论腰间缺酒钱。诗赋自惭称作者，众人多道我神仙。些须做得工夫处，莫损心头一寸天。《言世》万事由天莫苦求，子孙绵远褔悠悠。饮三杯酒休胡乱，得一帆风便可收。生事事生何日了，害人人害几时休。冤家宜解不宜结，各自回头看后头。以上这三首算是唐伯虎警示世人，阐明处事准则的代表作。前面几句都平淡无奇，最后一句虽用词普通，却将意境迅速升华，醍醐灌顶。郭德纲每次专场结束在唱《大实话》之前，必要说“江山父老能容我，不使人间造孽钱”。我觉得能做到以上三点，应该就算圣人了吧。《扬州道上思念沈九娘》相思两地望迢迢，清泪临门落布袍。杨柳晓烟情绪乱，梨花暮雨梦魂销。云笼楚馆虚金屋，凤入巫山奏玉箫。明日河桥重回首，月明千里故人遥。这是唐伯虎在迎娶沈九娘之前，与之分别期间所作的一首诗。前三句的铺垫在宋词中一找一大堆，可“明日河桥重回首，月明千里故人遥”一出来，一副孤翁独立桥头之上，眺月思人之景跃然纸上，结合后来二人结婚生女，卖画为生的后续生活，实在令人唏嘘。《花下酌酒歌》九十春光一掷梭，花前酌酒唱高歌。枝上花开能几日，世上人生能几何。好花难种不长开，少年易过不重来。人生不向花前醉，花笑人生也是呆。李白的四首《月下独酌》说的是人生得意须尽欢，不要虚度光阴，要去追求人生的意义；但唐伯虎这首诗给人的感觉就是：“别扯那么多没用的，喝就完了。”", "answer_votes": "140", "answer_comment": "​12 条评论"}
{"answer_author": "杜衡", "answer_id": 232583273, "answer_text": "锄禾日当午汗滴禾下土谁知盘中餐粒粒皆辛苦…………………………………………不过我想补充一下，我初中食堂墙上就贴了这首诗后两句，以及“粮食是农民伯伯辛苦种的，不可以浪费”之类的白话标语。我就不同意了，农民伯伯辛苦种的粮食被你们弄得那么难吃，还让我们不要浪费，真的好意思【当然我不是支持可以随意浪费粮食……】", "answer_votes": "80", "answer_comment": "​28 条评论"}
