{"question_id": "64021992", "question_text": "我是大一新生，已经学完了高数，线代和概率论，还学了Python的基本语法，想学习机器学习下一步该怎么走？", "question_title": "大一新生想学机器学习该怎么走？", "question_commet": "​添加评论", "answer_number": "9 个回答", "question_followers": "11", "brower_number": "622"}
{"answer_author": "Limbo", "answer_id": 275657873, "answer_text": "泻药怎么入门相信知乎有特别多答案说个成长快的实习/做项目 不断学不断用不断学。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "细雨平湖", "answer_id": 276436435, "answer_text": "机器学习的精髓在于实务操作，应当围绕实际应用，形成从模型构建、算法选择到实际应用再回到模型调优的正反馈，这样学才有成就感，学习才有持久动力。实际上，机器学习的参考资料浩如烟海，如果不加选择，很容易陷入知识爆炸的恐慌，进而容易打击信心。我当年就是无人指点，走了很多弯路，这里讲讲一些学习体会，总结一些经验教训，供你参考：1.彼得.哈林顿的《机器学习实战》(2013年出版，全程python代码实现)。建议精读，这本书的最大优势是重新造轮子，而不是简单调用既有的python机器学习库(比如scikit-learn)。重新造轮子的好处是能带你深入了解十多种常用机器学习模型的底层细节，这是极为重要的。这本书的算法实现并不是最优的，也有一些编码错误，但的确是一本手把手教你从头至尾实现每一类模型的好教材，所以瑕不掩瑜，是初学者入门培养兴趣、建立信心的好书。事实上，如果你哪天能看出其算法的瑕疵来，说明你的机器学习功底已经上台阶，届时得鱼忘筌，亦不失境界，但在精通前，建议不要轻视这本书。2.毕夏普的《模式识别与机器学习》(2006年英文版)。建议精读三遍以上，课后题目全部做一遍。本书虽然是十多年前出版的，但除了深度学习、强化学习之外，几乎绝大多数常用机器学习模型都涵盖了，知识并不过时。这本书的最大好处是体系性极强，环环相扣，读下来一气呵成，感觉比MLAPP(墨菲的《机器学习：一个现代观点》，2012年出版)要好。我2014年接触机器学习时，墨菲(MLAPP,2012)这本已经有电子版了，但是经过反复比较之后，我最终还是选择毕夏普(PRML,2006)那本旧书作为入门教程。要知道，在CS领域，新教材往往全面碾压老教材，但是，经过全面考察之后，我仍然选择了毕夏普的老教材，足见这本书的重要性。【有人可能会说两本都看不就结了？说得容易，您还真不知道这些书的份量，都是1000页的大部头，随便选一本光是初读一遍就得差不多半年，这个时间成本可是相当高的。】至于PRML究竟强在哪里，知乎上已经有详细介绍，这里不再赘述。当然，鉴于老外写书的思维习惯与中国人有比较大的差异，如果刚开始不太适应其文风，可以先学学李航《统计学习方法》，那本书应该是国人所著为数不多的经典好书之一(看的时候要下载一个勘误表【CSDN上可下载】，免得很多地方看不懂)。另外，周志华老师的机器学习“西瓜书”也不错，我没有细看，翻了一下，感觉写得非常具体，可操作性强，而且模型囊括得相当全面，可以作为重要的辅助读本。3.伊恩.古德费洛等人的《深度学习》(2015出版)。精读前十二章。这本书是深度学习方面的经典著作，而且非常难得的是，它避开了大量极其艰深繁琐的数学推导，直面工程实现。刚开始看不懂的话，可以先看看《人工神经网络与深度学习》(米歇尔.尼尔森，2016中文版)，那里对人工神经网络有深入介绍，有详细的数学推导，也全程用python实现了一遍，不调用第三方库，重新造的轮子。有了这个基础，再学《深度学习》(古德费洛，2015出版)就会容易一些。4.其他主题。一是强化学习。深度学习掌握了之后，可以再学一点强化学习的东西，这一块我了解不多，目前比较有名的是萨顿：《强化学习导论(第二版)》(2017年出版)，里边介绍了alphago zero的基本原理。二是概率图模型。据说大卫.巴贝：《贝叶斯推理与机器学习》(BRML，2016年出版)是很不错的教材，深浅适度，比科勒那本大部头《概率图模型：原理与技术》要友好得多，尽管该书也是经典著作。最后一个小提示：机器学习的模型非常之多，但真正好用的就那么几种。而且每种模型都有其适用场景，且或多或少存在这样那样的缺陷(看看“没有免费午餐”定理)。因此，学习机器学习，最重要的是掌握机器学习模型的基本原理，掌握每种流派(贝叶斯主义/联结主义/演化主义/符号主义/类比主义)的精神实质。千万不可陷入对各种模型奇技淫巧无休无止的追逐之中，不要因为没有学全所有模型而惶惑。掌握核心精髓，得其环中，道进乎技，自然无所不可。以上希望对你有参考。", "answer_votes": "2", "answer_comment": "​1 条评论"}
{"answer_author": "扬万兮", "answer_id": 276920885, "answer_text": "考研", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 276706116, "answer_text": "谢邀。如果学校有实验室就争取打杂，做扎实的科研训练。如果没有，很不建议基础不牢靠，上来就是深度学习，还是先把机器学习基础知识学好，另外，数学很重要，尤其是概率和线代。看到后辈越来越多对机器学习领域感兴趣，很开心，但也觉得多数人很浮躁。别整些花里胡哨的东西，有能力不如多看看论文。至于资源的话，我还是不推荐了，太多了，也太杂了。祝好。", "answer_votes": "1", "answer_comment": "​1 条评论"}
{"answer_author": "还是叫我楚哥好听", "answer_id": 284011509, "answer_text": "多做做工程，理解理解原理", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "小泽陛下", "answer_id": 280105909, "answer_text": "kaggle", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "小美妞", "answer_id": 279043690, "answer_text": "先学好写代码，做个名副其实的计算机专业学生，代码能力很重要(๑> <๑）作为一个数学还行且有点小棒棒的我，代码能力被导师和实习的mentor嘲笑不知道多少次，嘲笑完了还要安慰我，没关系，毕竟你本科又不是计算机", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "君子如兰", "answer_id": 278093266, "answer_text": "1 建议学习一下吴恩达的机器学习视频(当然，网易云课堂上也有吴恩达的深度学习课程视频，有兴趣可以看看)2 关住一下kaggle，上面有一些简单的项目，也有数据，可以照着跑跑程序。3 找有这方面课题的老师，申请加入课题组，进去打个杂也不错。有方向，有指导进步快。4 GitHub上有一些来源的优秀的机器学习项目，下载下来跑通了，看懂，可以选择重写或改进等。5 找一个你感兴趣的应用领域，搜索一些相关论文，最好是论文＋代码，看懂实现它。本人水平有限，以上建议仅供参考。", "answer_votes": "0", "answer_comment": "​添加评论"}
{"answer_author": "袋鼠爸", "answer_id": 277699858, "answer_text": "泻药#最开始百度百度，数据挖掘/机器学习有哪些常用算法，一个个搜这些算法，因为博客的讲解会比较容易理解然后买本周志华的机器学习，看的就会顺一点，这时候边调包比如Python的Sk-learn去做做kaggle的项目要慢慢来，别一开始就吃很多很多吃不下的", "answer_votes": "0", "answer_comment": "​添加评论"}
