{"question_id": "65496036", "question_text": "如题，今天刚刚出现的座位预约制，让我很是郁闷，有没有人想要吐槽一下这个预约制？", "question_title": "如何看待武汉大学图书馆座位预约制度？", "question_commet": "​添加评论", "answer_number": "89 个回答", "question_followers": "132", "brower_number": "47,446"}
{"answer_author": "唯尊秦戟之殇", "answer_id": 273488136, "answer_text": "其实我很不明白在信图大家都预约得好好地实行了一年多了，而一在总图实行了预约制度热度一下子就升上来了？", "answer_votes": "25", "answer_comment": "​8 条评论"}
{"answer_author": "知乎用户", "answer_id": 272490034, "answer_text": "首先，这种技术的创新必然会对有技术的人有利。自然利弊都有，但大家总会倾向于原有的办法。我虽然一开始也有一些抗拒，但是现在可以打开手机发现图书馆没位置就直接去教学楼了，不然还要一层一层一层一层一圈一圈一圈一圈目不转睛的看哪里有一个没人没放书没放水杯的位置。另外，今天在图书馆发现有很多同学是坐在书架中间的，空座也没有很多，资源利用率应该上升了一些吧。", "answer_votes": "17", "answer_comment": "​4 条评论"}
{"answer_author": "脸折", "answer_id": 272405386, "answer_text": "首先肯定一下，这是个好制度，但是有一点点的遗憾，文末会说。就好像是12306，刚出来的时候也有人喷，现在大家都觉得12306很方便。如果觉得这个制度不好，而早起排队先到先得更好的话，那以后买火车票千万别用12306，到线下窗口排队买。从个人使用体验来说，我想起之前信图还没建好的时候。信村人民大老远跑到总图去，从1楼转到5楼，就是一个空位都没有。看那些摆了两本书就占着的空座真的气不打一处来。回答里有说放本书占座也是付出劳动的，我服。预约制度可以保证的是，只要手机一点就可以确定你现在到图书馆去到底能不能有一个自习的座位，预约成功就到图书馆去，没有座位就另外找地方，那么不会再发生我刚刚讲的那种郁闷的情况了。个人使用体验变好了。从整体资源利用率来说，关于座位使用率的问题，我记得某同学曾经做过一个脚本，统计开通图书馆预约系统分馆的预约履约率，数据显示基本上都在97%以上，也就是说，预约的基本都来了。在下午和晚上时段，现在信图哪怕是坐起来不怎么舒服的3C区、讨论区，也基本上找不到空位。回头看看实行座位预约系统之前的总图，基本上到任何一个阅览区，视野范围内都能看到拿着一两本书（桌面上东西比较多的就不算了，就单算一两本书摆在桌面，明显占座的那种）占着的空位。从利用率来看，到底是孰优孰劣？私以为，现在核心时段（14:00~21:00）图书馆座位的利用率比以前高了（预约了你就要来，不来就会被取消预约，然后被别人约上），而图书馆的资源是全校师生共享，总体来看图书馆的资源得到了更好的利用，整体资源利用率就变高了。这个机制遗憾的点在于，现在的预约系统在反爬虫方面做得并不好（准确的说是基本上没有有效的反爬虫措施），外挂遍地，制作一个简单脚本的门槛极低，晚上预约简直就是神仙打架。晚上预约的时候服务器容易挂掉，如果图书馆能够做一点反外挂机制以及服务器性能方面的努力的话（和12306反刷票是一个道理，当然12306要比图书馆有钱得多），这个机制就很完美了。12月26日更新：最近预约系统在反爬虫方面做出了一点努力：不正常的UA请求全部返回403，并记录，1~2天封IP；短时间内密集访问请求全部返回503，并记录，1~2天封IP；但是目前没有见到大面积封号的情况，可能是图书馆比较谨慎，观望中；关于有回答给外挂洗白：利益相关：我也是一个外挂作者；外挂洗不白，挂逼就是挂逼；12306和针对12306的刷票软件不是一个东西，性质完全不一样；", "answer_votes": "42", "answer_comment": "​60 条评论"}
{"answer_author": "凉的n次幂", "answer_id": 281922125, "answer_text": "这里有一个专业大神回答，毕竟不是计算机专业我就不班门弄斧啦，在此贴上链接@脸折https://www.zhihu.com/question/65496036/answer/27240538612.26更新很多同学还不知道图书馆预约外挂或者脚本是什么，有什么作用，会造成哪些危害，现在我把这些都列出来，让某些狡辩的人再也找不到狡辩的理由。图书馆预约外挂是什么：简单来说就是一种外部脚本，可以帮助实现自动操作而不通过人手动操作，手机app，电脑网页理论上来说都可以做。由于外挂制作者智商捉急，或者有贼心没贼胆，目前还没有发现能够直接修改预约系统内部代码的外挂。某些人一直在跟我扯外挂和脚本的区别，在这里为了让更多人明白我就用大家都知道的名词来表示。某些想借此洗白的人，先别着急，看完下面的东西你要还是有话说我只能佩服你坏到骨子里。图书馆预约外挂的工作方式：一般来说，目前所见外挂都是指定数个座位和时间段，然后由脚本自动给后台发送请求。如果当前座位不可用，它就会一直以某种时间规律不停地请求直到终止。当然，也有能大范围搜索空座的外挂。某些高级外挂还会设置几个座位的优先级去抢座。目前由于打击措施，也有新型外挂出现，具体方式为，规律时间登陆app，发送指令后下线，设置的时间间隔后再上线，这样系统根据发送辣鸡数据的频率就不会判定他是外挂，只认为是正常登陆。注意，这一切过程中寄生虫们什么都没有做，只是点了开始和结束。有哪些危害：从同学的角度而言，公平性的丧失。举几个例子说一下，都是身边同学的真人真事。1. 你每天晚上望穿秋水等在设备前，准备一到时间上去抢到自己心仪的座位。时间到了却发现登陆不上去。（啊哈，知道为什么网络那么卡嘛，同一时间如果大家正常登录基本是不会有特别明显的卡顿的。有外挂使用者这种搅屎棍在，辣鸡数据就会不停发送。这就是卡的重要原因，详情后文截图有介绍。）2.好不容易登陆想去抢心仪的座位，有窗户，有插座，有阳光，结果却发现不论你怎么努力总是有人捷足先登。你看看双手以为自己手残或者抱怨校园网真是s＊。（真的不怪你，外挂使用者选座位就是一瞬间秒杀的事，你的手速不可能超过他们。）3.预约到一个不喜欢的座位也无所谓啦，为了去学习也不管那么多啦。第二天早上你起来高高兴兴的去图书馆，没想到在路上碰到了带你做科研的导师。他问起你最近的进展，一直说个不停，你也没注意时间，说完话一看手机，卧槽预约时间都过了34分钟还没签到，赶紧把时间调一下。（图书馆给迟到预留的真正时间是34分钟左右）你心里打鼓，如果先释放的话会不会有别人抢走。（调整时间必须先释放重新预约）果不其然刚释放就被别人预约了一整天，你对别人的“手速”瞠目结舌，感叹图书馆的火爆，但一时又不知道去哪里，一天刚开始就这么不顺，一种迷茫感和挫败感油然而生。这一天都觉得不舒服。4.晚上好不容易预约到一个座位，但手残点错了预约时间。改一下吧，那个时间还在上课啊。这次你玩命极速操作，呵呵呵，2秒不到点进去看大发现一个下午被别人抢走了，于是你再次惊呆了。5.又过了一天，你预约到一个座位。但是后来突然兄弟要来武大找你玩，你想改一下时间。这次长了经验，定个闹钟凌晨两点半起来改。这次总没问题了吧。。。3秒钟之后，你开始坐在床头怀疑人生，真的有凌晨两点半等着抢座位的学霸嘛？绝非杜撰，全部来自真人真事改编。如果有雷同者，你应该感谢外挂制作人外挂使用人给你带来的奇妙经历和靠捡漏活着的寄生虫们永不停止的努力工作，以及利己主义者，鼓吹技术革新者的大力支持。是否有针对预防办法：有的。从技术方面来说，加入验证码就是很好的办法。以前网页版没有，现在有了。但手机app没有，也就成为了外挂重灾区。从制度层面来说，乱世用重典，不杀几只鸡猴子不会消停。封号就是很好的办法，通报院系批评等措施还在研究中。有些同学自己用鼠标一直点击查找害怕被认为是外挂，您真的多虑了，这个真的不会被误判。外挂的数据和人手动操作数据有本质不同。说了这么多，其实外挂最让人可恨的就是不论使用人身在何时何处，外挂都可以自动操作秒杀。比如上述真事中那个通宵开的外挂。所以说，自动给后台提交请求的语句才是外挂最重要的地方，就这一点您再和我扯什么外挂脚本有啥区别有意思嘛？真是您说的所谓外挂怕现在您应该在监狱里面手握铁栏杆悔不该当初了吧了吧？您靠这个洗地感觉有意思？自己干了什么自己心里面没点B数嘛？其他比如同时可以发送几个座位的请求，可以大范围搜索之类的功能，都是很可恨的。说这些就是为了让大家意识到外挂的可恨，如果想观看洗地表演以及大学生三观扭曲大赛请麻烦移步评论区，我就不挂某些人的嘴脸了，我原以为你身为汉朝老臣（大误），哦不，代码高手，来到阵前，面对知乎同学，必有高论。没想到竟说出如此粗鄙之语！无耻之徒，不知正气为何物，羞耻为何物，有何面目去面对师长同学？汝苟活二十春秋，只会摇唇鼓舌，助纣为虐，安敢在此饶舌洗地？一条断脊之犬，还敢在我等面前狺狺狂吠，我从未见过有如此厚颜无耻之人！从学校的角度：以后需要预约的东西越来越多，比如体测，是不是是个预约你就能做外挂？还有点王法没有？不得不说我们可能正在面临一场信任缺失的风暴。--------------愤怒的分割线--------------可以可以，举报我政治因素需要修改，这些人可真是厉害。如果您觉得我说的有道理，请麻烦一秒钟点一个赞和感谢，这个答案才能保持在这个排序顺位，让更多的人看到，谢谢啦。12. 24更新感谢各位的支持与帮助。祝大家平安夜快乐。首先摆明，我是支持预约制度的，只是想把用外挂的人拉出来抖抖，这些虱子跳蚤之类的东西该收拾干净了。有些人没有意识到问题的严重性。也的确我今天一天很气愤，缺少了把问题掰开理性分析的内容，现在来补充。这个问题其实根本上是涉及到平等与公平的问题。我们知道法律面前人人平等，校规也是同理。学校赋予每个人有学习地点进行学习活动的权利面前，每个学生都是平等的，不会因为院系专业不同年级不同而区别对待。这是前提。由于现阶段资源有限，不可避免因为该权利有竞争，而该权利的平等性实际上体现在保证竞争公平上。好的，现在你用外挂这种行为，首先，的确是和别人构成了竞争学校赋予权利的关系，如果是规则内的公平竞争，那当然没问题。但是，如果是外挂，就等于是第二条，你在用某些预先存在的不可抗因素为自己谋利（并非法学专业，如果有法律系同学欢迎以专业知识指教）。那些厚着脸皮用所谓脚本的人，你们敢不敢拍着胸脯说学校认为脚本是公平竞争？你们扪心自问之前是不是抱着侥幸心理在打规则的擦边球？现在学校已经开始封号了，你还能掩耳盗铃认为是合理的？那怕是你已经坏的没救了。举几个例子，大家可以想想，如果姑息这种行为，是不是等于默认相关专业的学生有自习选择的优先权？这凭什么？是不是违反了人人平等的精神？某些专业是不是天生弱势？难道他们就不应该有平等自习的权利？你可以胡搅蛮缠说你也可以去学写代码啊，那文科同学怕是哭晕在厕所了吧？那你又凭什么剥夺别人的权利？别人就因为没选这个专业就不该学习了？（并没有怼相关专业遵纪守法的同学的意思，请见谅。）某些歪理邪说持有者一个劲的说我的意思是大家只能用鼠标键盘竞争才叫公平，那好我就来告诉你为什么这叫公平，因为大部分人都长了两只手，一只用键盘，一只用鼠标足矣，事实上这就是赋予了每个人平等的权利。您要是没长手用外挂代替那我还敬您身残志坚，但是现在您这个表现怕是身坚智障吧？再退一步说，那些设备不支持的，家庭条件不是那么好的又很勤奋的同学，难道就该被你这么欺负？就因为你有好的手机好的电脑？他们就不该学习了？再举个例子，假设你是刚进学校的学弟学妹，每天都预约不到座位，无论拼尽全力去预约发现总有几个人比你快。于是你感觉时间的流逝在自己身上比在别人身上快，非常郁闷。直到有一天，一个学长或者学姐摆出一副长者的样子神秘兮兮的告诉你，因为你没用外挂呀，naive。。。你是什么感觉？我们再进一步假设，这时候长者释放善意说我给你个外挂吧，你会不会要？不要小看这个问题，选择坚守正道的话你还是预约不到，还是一脸无奈的看着宵小之辈狼奔豕突。有几个人能拍着胸脯说我就是在这种情况下能经受住考验就是不要？大部分人只要分得利益就乐于同流合污了吧？这里说几句诛心之论，是因为我觉得对大部分人来说，人性是经不起考验的。细思恐极，各位权且一看吧。不要以为是危言耸听，现在这些外挂制作者使用者都如此猖獗了，将来进一步发展，会不会有更多的人在考验面前抵制不住诱惑？仅靠技术手段，不用严刑峻法，会不会有更厉害的“技术升级”如雨后春笋般冒出来？好啊，有些无耻之徒说那就应该鼓励所有人都用外挂嘛。您要是这么正确学校为什么不开一门所有人必修课叫计算机外挂引论与图书馆预约指导？大家都用外挂的后果也很明显，大量垃圾数据反复提交给服务器，上万学生集中在一分钟内哪种服务器能不奔溃？你那么厉害把天河二号拉来吧，顺便还能解决同学们的选课难问题。不是我多说，如果不把话说清楚，怕是按照下面某不敢用真名用户的回答，又该怪学校没花钱买好服务器了。不过说到这里，我又得多说一句，某些鼓吹技术革新，说做外挂用外挂是练手的好机会的丑恶之徒，我想问问您，您要是真想挑战自我勇攀技术高峰，您为啥不想想办法优化优化学校的选课系统呢？您那一身本领，为啥不去做于己于人都好的事情呢？说到底还是为自己谋利比啥都重要呗？某些写外挂的那绩点不过2的水平，您怕是也解决不了学校选课系统优化的问题吧？我不妨就在这里说一句话，用外挂的人，其智可笑，其心可诛，借用知乎流行句式，不是蠢就是坏，要不就是又蠢又坏。至于具体对应哪个，我们不会剥夺你平等选择的权利哦。--------------愤怒的分割线--------------以下原文说实话某些人的丑恶嘴脸我是真不想说。用外挂还有理了？我就纳了闷了，你作为程序员就没点行业操守？天天不劳而获指着捡漏当寄生虫是什么行为？哦，写了代码就叫劳动了？呵呵呵，寄生虫为存活也努力了，照样还是寄生虫。还有不拿这当事儿的，当做练手的，某些院系的同学不妨想想这些行为的性质。用手段破坏公平竞争光彩？图书馆允许这样的行为？为了自己的利益就这么心安理得破坏别人的利益，那也恕我直言一句，用挂一时爽，后面半句您自己接上去吧。我必须挂人上去实在太丑恶了。这三观让我怀疑是不是华科派来捣乱的2333333（并无黑华科的意思），有本事您别匿名啊，您这么正确干嘛躲在阴暗的角落呢？&lt;img data-rawheight=\"1334\" src=\"https://pic3.zhimg.com/50/v2-db7e3a006027e4f3d9b406d15ce9d2fa_hd.jpg\" data-rawwidth=\"750\" class=\"origin_image zh-lightbox-thumb\" width=\"750\" data-original=\"https://pic3.zhimg.com/v2-db7e3a006027e4f3d9b406d15ce9d2fa_r.jpg\"&gt;凭自己本事句式系列啊，是啊，你凭自己本事杀个人是不是该怪那个人打不过你啊？买火车票之类的比喻简直就是无稽之谈，这性质能一样？这种无理取闹，胡搅蛮缠所谓胡说八道式比喻居然从这位的嘴里就这么放出来了，真是臭不可闻。&lt;img data-rawheight=\"1334\" src=\"https://pic2.zhimg.com/50/v2-c1bd8204fcc2d829a33408b05d2a6176_hd.jpg\" data-rawwidth=\"750\" class=\"origin_image zh-lightbox-thumb\" width=\"750\" data-original=\"https://pic2.zhimg.com/v2-c1bd8204fcc2d829a33408b05d2a6176_r.jpg\"&gt;别自作聪明了以为是图书馆预约系统发现不了你，看看下面微信聊天记录那张图，殊不知是给你留着脸留着机会，心里还真是没点B数，自己只是一瓶子不满半瓶子晃荡的醋罢了。练手需要通过这种损人不利己的方式？靠这种机会练手我怕你的绩点上不了2吧？毕不了业也好，省得给武汉大学丢人现眼。我从未见过如此厚颜无耻之人，颠倒是非混淆黑白的功夫真是厉害，煽动性的歪理邪说一套一套。无耻之人，苟活于世罢了。再来看看精彩的评论区&lt;img data-rawheight=\"1334\" src=\"https://pic3.zhimg.com/50/v2-cb134ddbd0f2b17b9426673e32dbd882_hd.jpg\" data-rawwidth=\"750\" class=\"origin_image zh-lightbox-thumb\" width=\"750\" data-original=\"https://pic3.zhimg.com/v2-cb134ddbd0f2b17b9426673e32dbd882_r.jpg\"&gt;有想拜师的，真心建议你还是走正道吧，人在做天在看，多行不义必自毙，哦，开挂的话家人生命安全也有问题。有说没大问题没规定的，那我就给您贴出规定来。&lt;img data-rawheight=\"1334\" src=\"https://pic1.zhimg.com/50/v2-cfb19bea24aca2186a7689b2434210e6_hd.jpg\" data-rawwidth=\"750\" class=\"origin_image zh-lightbox-thumb\" width=\"750\" data-original=\"https://pic1.zhimg.com/v2-cfb19bea24aca2186a7689b2434210e6_r.jpg\"&gt; 微信公众号说没说是违规行为？您认识汉字嘛？学校采用座位预约制度的初衷就是希望大家合理利用资源，公平竞争，可是由于专业原因有些专业有这个特长就能拿来破坏竞争的公平性？学校会默许这是合理的行为？您这个智商怕真的侮辱武汉大学的名声吧。假设如果有人碰到用挂的现象觉得气不过就是不让座给用挂的人，然后这样会不会造成民愤的泛滥和预约制度公信力的丢失？平心而论，我觉得有些人不应该在这所学校里，他们品德决定了不配拥有知识。忍无可忍之后，我把情况全部如实反应给了图书馆和软件公司，现在初步的技术方案和惩罚措施都已经出来了，只要用七天封号加公布名单，通报院系。&lt;img data-rawheight=\"1334\" src=\"https://pic4.zhimg.com/50/v2-244b4788674ab4d8b5a303283e40da6e_hd.jpg\" data-rawwidth=\"750\" class=\"origin_image zh-lightbox-thumb\" width=\"750\" data-original=\"https://pic4.zhimg.com/v2-244b4788674ab4d8b5a303283e40da6e_r.jpg\"&gt;那些打着想学习旗号哗众取宠写外挂用外挂的人，您这一封号1/3个期末就废了，不妨掂量掂量。哦，我忘了，您心里连点B数都没有，连自己的行为性质都不清楚，怕是掂量不出轻重来吧。我是真的生气，某些人用外挂用的理直气壮，还拿什么12306，刷票app来比较，恕我直言您这三观以后蹲局子的时候可别说是武汉大学的校友。国家法律写没写让不让刷票我不太清楚，但是武汉大学图书馆规章制度明确规定不可以有此类行为。奉劝各位最近风头正紧，用外挂请考虑自己的学籍安全和家人生命安全。别忘了，当年汉姆运动刚出来的时候，某软件学院高材生投机取巧直接让警察带走了呢。我知道，某些人用违规行为严重损害别人的合理利益，采用不正当竞争手段无所不用其极的做法，是丑恶的，是见不得人的。公理正义自在人心，希望看到的同学们如果不想自己的公平权益被外挂损害，给一个赞吧，我想让更多正义之士看到这个回答，引起大家的重视，让某些不法分子成为过街老鼠，谢谢啦。", "answer_votes": "121", "answer_comment": "​40 条评论"}
{"answer_author": "东东", "answer_id": 272690027, "answer_text": "预约制度在信图一直实施的很顺利，到总图开始实施的时候，我没想到会有这么大的反弹。我先表明立场，我个人是支持预约制度的，这确实是现代高校图书馆管理的发展方向。针对大家反对的几个点，我也谈下我自己的看法。1.过去早起才能有座位，现在前一晚就能预约，那些睡懒觉的人居然也能有座位了，不公平！他们根本没有我们早起的人儿辛苦！    : 现在早起的人儿也可以不用慌慌张张的赶向图书馆了，有啥不好的？！至于公平，我不是很懂早起=付出更多=更有资格享有座位使用权=公平  这个逻辑过程。你要知道那些抢座位的人也是晚上订好闹钟抢座的呢，凭什么早上订闹钟的人就比晚上订闹钟的人厉害呢，就因为有太阳公公撑腰吗？2.我原来可以在一个位置坐一天的，现在只剩下分散的时间段了，都怪预约的人每次来赶我走！    :我只能说大兄弟，提前预约啊，只要你踩着点预约肯定会有连续的时间的，请拿出你早起占座的力气。3.不是我不想预约，是我的网络太慢，是移动联通电信校园网联盟起来打压我:兄弟，人生呢，运气也是很重要的。如果你想扼住命运的咽喉呢，请打开你的电脑，开启手机抢座app, 校园网4G双保险，在校园里寻找网速最快的地方。讲道理我没想到这种理由都能提出来，我们当年体育课选修课选课的时候服务器卡成啥了，还不是有天选之子一次成功的。说因为网速没抢到座位我信，说每次都因为网速没抢到的，emm.要不您去转个运？4.每次选座我都要挑半个小时，不然怎么选的到好位置呢。现在要预约，等我选好座位，座位已经是别人的了！太过分了，他们配不上这个位置，我为了这个位置付出了宝贵的半个小时呢！ =) 送您一个微笑如果您千挑万选的座位，过了半个小时还没被人选走，我觉得您这千挑万选的半个小时可能真的没啥意义呢，比较好东西都是抢手的。5.同一个座位，有人预约的8-12点，另一个预约的14-22点，中间两个小时就浪费了！预约制差评！     :首先呢，这2个小时并不是被浪费了，因为这个座位在这两个小时依然可以被第三个人预约，如果大家都不预约，是不是说明这个时间段没有使用需求呢？既然没有使用需求，又谈何浪费呢。而且有多少人在图书馆玩手机看视频啥的，大家都心里清楚。如果看到一个人玩了5分钟手机，就在心里大叫:天哪，他居然玩了5分钟手机，图书馆的宝贵资源竟然被浪费了整整5分钟，这是什么概念，四舍五入就是一个亿啊！！你说这事还有完没完了，摊手6.谁说没有使用需要，我就想要，但是只有两个小时，太零散了，我不想选    : 你需要你就选啊，又不是不能选，你不想选也怪预约制咯。如果一定要全天时间的座位，请再从2开始看起。为什么很多人觉得预约制不好呢，因为自己原有的利益被损害了呀，但你们捂着胸口说，难道以前的占座制度就没有不好的地方吗，难道预约制真的还不如占座制吗，要从学校整体利益出发，而不是只考虑自己的利益。我说实话预约制真的好处多多，我刚刚在另一个评论看到，有人说以前占座制的时候，都不敢去上厕所，怕回来自己的座位就被当作用书占的空座，被另一个人征用了，而预约制就不会有这种问题。PS: 曾经选过两次的座位会出现在常用座位里，可以直接选不用搜。网页版需要验证码，而手机上不用，对座位没有特殊癖好的人可以尝试快速选座。我感觉大家没必要跟不利现状硬刚啊，对于改变现状没有半点意义，要学会去学习规则适应规则啊！！！小哥哥小姐姐们！！！自强弘毅下一句是什么，请大声告诉我！！", "answer_votes": "55", "answer_comment": "​27 条评论"}
{"answer_author": "林惘言", "answer_id": 282105174, "answer_text": "来晚了，一路看下来可以说是非常精彩。白老板说过，人和人的差距有时候比人和猪还大。信哉斯言。为同样来晚的朋友们提供一个站队指南。要想在国立网红大学的日常撕逼之中，站到历史上正确的一边，你先得思考清楚这样三个问题：1. 早起 = 更有资格获得图书馆座位吗？观点1：不是，每个武大学生都是平等的，也就是说不管你是1点睡7点起还是1点睡12点起，都有同样的资格、以同样的代价获得一个图书馆的座位。任何合理的制度都应该保证这一点。观点2：是，起得早说明我更勤奋，说明我更需要一个座位，说明我更愿意为获得一个座位付出代价，制度应该保证出价更高的我，获得座位的资格更优先。对，真有人觉得自己早起在座位上放本书是付出了劳动的。这句话不包括早起然后一人一座学一天的朋友。2. 预约制度有没有解决/改善“占座”问题呢？观点1：改善了。以前我想去图书馆，从一楼开始一层一层一圈一圈地找位置，找到5楼才发现要么有人，要么有书，我又不好意思把人家的书拿开，只好放弃在图书馆学习。现在嘛…我只要打开手机看一眼，就知道没位置了，直接放弃在图书馆学习，省去了找一圈的麻烦，美滋滋。观点2：没改善。以前用书占座，现在用“取消-再预约”大法占，占座党足不出户就能占座位，真是******（祝所有爆粗的同学每晚10点半准时断网两小时）私货：要想回答这个问题，有以下两个方法。瞎b站队没意义。实地调研，对比实施预约前后占座率。不过现在没戏了。分析一下用“取消-再预约”大法的人数。本问题下的大部分人，无论在问题1上占哪一边，都同意每日取消预约次数应有限额。3.为什么我抢不到座位呢？这个问题一般有如下几种回答，按频率排序：网不好。其实用校园网多数情况下是没问题的，哪怕你在三环。实在不行用4G嘛。他们其实是想说服务器承载量太低，没有为晚上10点半的高峰期配置足够的冗余，导致二三十分钟登录不上系统。没脚本。贵系统反爬机制基本没有，导致随便哪个学有余力的同学都敢骑预约系统的脸，晚上十点半随便骑爆系统。这也是很多同学登录不上的主要原因。开头我已经说了，希望同学们站在历史上正确的一方。稍有常识的人都能看出，本人是支持预约制度的。有的朋友虽然上了大学，但是思辨能力依然停留在发展不充分的阶段。需要认清的一个基本前提是，图书馆的座位本来就是不够的。怎么才能保证图书馆座位能公平分配呢？占座制保证了早起的同学一定能占到座，对早起的这一部分同学来说先到先得，很公平。最大缺点也是占座，因为一个人10本书，有的朋友能占11个座，实际上破坏了先到先得的原则。预约制保证所有人同时抢座，晚上十点半开始，先到先得。不公平吗？有的人说不公平，因为他网不好，因为他没脚本，因为服务器辣鸡。问题来了，以上三个原因，哪一个是制度本身的弊端呢？真正有立场反对预约制度本身的，只有早起党一个党派（……）。原本只需要早起就能稳定占到的图书馆座位，现在要人人平等去抢了，我们早起党人决不答应。所以朋友们，这就是为什么逼乎答题首先要声明利益相关的原因了。简短总结一下。改善网络/反爬虫/增设服务器的工作，就留给运营方去做，我们在这方面保持关注，施加压力就够了。截止到2017-12-24 14:32:07，本问题还是“如何看待武汉大学图书馆座位预约制度”。这个问题实在太好回答了，你只需要问自己一个问题：我是早起党人吗？如果不是，你还思考什么呢？", "answer_votes": "22", "answer_comment": "​7 条评论"}
{"answer_author": "Shuboss", "answer_id": 282436413, "answer_text": "别评价了！来这边，需要考研的，或者需要考试复习的，可以考虑联系我，我实验室的位置，有空调有热水有无线网软座椅，没人和你占座，还有一台24寸台式机，8G内存，960显卡，2T硬盘。我的要求只有一个，请我吃一顿校门口YJT走进去第三个窗口的爆炒猪肝饭，加一点辣椒。", "answer_votes": "2", "answer_comment": "​5 条评论"}
{"answer_author": "匿名用户", "answer_id": 273004468, "answer_text": "工学部的，感觉用了预约系统之后占座现象明显减少，有些回答里说之前也没多少占座现象……呵呵呵呵呵，可能我们不在一个学校吧→_→还有说去的早的却没位子，不公平，额，你都能早起去图书馆就不能抽半分钟时间预约个座位？？？还有一些同学认为起得早本来就应该更有资格占有座位，且不争论这个观点的对错，但是TM的5、6个人就一个起得早了去啪啪啪占一排位子，这算什么？一人早起全班有座？？？赞同预约系统，但是目前有个漏洞，就是取消预约的次数没有限制，会导致有人不停的取消再重新预约，这样即使不去也可以一直占着座位→_→，希望可以修改为每天只能取消预约1次(或者2次吧)", "answer_votes": "10", "answer_comment": "​3 条评论"}
{"answer_author": "Thallo景木", "answer_id": 273132486, "answer_text": "1. 感觉确实占座现象减少了很多。2. 去图书馆早晚并不能代表学习积极性，有时候就是恰好有课，剩下的时间就去了图书馆3. 从个人利益角度出发的观点保持意见，学习大多靠自觉性，自律性好寝室一样学，况且我们还有教123454. 知道考研党辛苦，但是别拿这个说事，不是所有人都必须道德绑架为你的梦想让步。5. 武大精神崇尚包容，观点不同希望大家不喜勿喷，不管实不实行预约制度，不占座是良好素养……我尊重每个人，认同不求赞，想跟我吵架我也不奉陪。以上观点不针对任何人，想跟我吵架的同学和抱怨的同学收收手。一来我是寡淡之人，二来不如腾出争论时间想想期末课程论文……不说了……滚去学习了&lt;img data-rawheight=\"1125\" src=\"https://pic3.zhimg.com/50/v2-e5df75a95564fed463e93c707d9e33a4_hd.jpg\" data-rawwidth=\"1125\" class=\"origin_image zh-lightbox-thumb\" width=\"1125\" data-original=\"https://pic3.zhimg.com/v2-e5df75a95564fed463e93c707d9e33a4_r.jpg\"&gt;", "answer_votes": "13", "answer_comment": "​1 条评论"}
{"answer_author": "堂吉诃德小姐", "answer_id": 273344605, "answer_text": "实力跟不上理想制度本身是好的 但 预约系统 垃圾得跟shi一样", "answer_votes": "3", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 272422385, "answer_text": "我都快被这个鬼预约整抑郁了！平时我不需要担心第二天的自习座位，我起的早，早早就屁颠到图书馆了，现在可好，我晚上准点，系统崩溃（校内肯定占便宜的）刷二十几分钟，service unavailable???你告诉我这是我的错？？？？这是你们所谓的公平！来来来，扯扯扯预约的优势:1.早上起不来的同学仿佛遇到救星了哈，你们可以美美睡一个懒觉再跑去图书馆。2.偶尔去图书馆的孩子们也不愁了，反正你们就是去几个小时。运气好，能碰到几个位置。缺点（太多）:1.A晚上因为系统原因错过了选位置，睡觉前郁闷死了，想着:明天早上我该去哪自习呢？哎哎哎。天亮了，他八点半就到了图书馆，放眼望去，都是座位，这个时间点本来应该也有很多人的，但现在只有几个人，很好，随便坐下来准备看书了。九点半到了，或者说十点到了，一群人陆陆续续进来了，B走到A面前:兄弟，这位置是我的，麻烦让一下（滚）！A端着电脑换了个临近的位置，刚刚坐下来十分钟，C来了:不好意思，兄弟这位置我预约了！A无奈的走了:这年头找个地方自习，搞得像是打游击一样！！2.看懂了上个故事A的心酸，你能说这是个提高图书馆座位效率的方式？传统占位的时候，八点多就有一群努力的孩子在自习了，现在，大家都还在被窝里做梦，起的早的孩子只能怪自己没有抢到位置！3.你说预约是为了防止恶意占座？故事是这样的:A晚上没有抢到座位，B抢到了，而且预定的还是早上九点半到晚上十点的。第二天，B想睡个懒觉，估计到不了，于是在九点的时候就取消了，但是A在八点半去看了一遍，没有合适的座位，然后默默离开了，这个时候我们能不能说B实际上是占用了A选座的机会（当然这个座位最终是会被其他同学消化掉，但这对于A这种急需座位的人来说太不公平了，难道我们现在占座位仅仅凭运气了？？？）4.预约导致我无法制定学习计划以前，我起的早肯定是有座位的，现在我只能凭运气，运气好就能预约到一个座位，运气不好，我只能观望。。。我每天会生活在一种恐惧之中。。。5.在我看来，图书馆是否应该最先保护那些对位置有实际需求的人呢！什么叫做对位置有实际需求？那就是早早就到图书馆的人。去的早的人会被管理员轰出来，这不人道吧，去的早没位置不合适吧！你们想想到底是谁对自习的需求更急迫，现在就是位置空着也不能坐（妈的，这和拿书占座的区别在哪，人家拿书占座还是付出劳动的，你这预约算是什么鬼）6.以前就算我下午到，我也很少遇到一个位置都没有的窘境，现在我去，到处都是空位，但我只能看着，因为我不想坐半个小时就得被哄走，你们说说这和恶意占座的区别在哪？？？？7.图书馆完全不考虑那种全天复习的人的需要么，现在座位都被占半天的人切割了。。。你让我自习一上午后去哪去哪去哪。。。。自从这个系统运行，我从前有节奏的学习和生活都被打乱了，我现在吃完早饭就不知道去哪了？？以前我只需要去图书馆就好，现在。。。呵呵了！！！以前我太喜欢总图了，现在都不敢进去了，因为每一个地方都被切割了，我们不是机器人，每个人都有不同的生活习惯，学习一天，出去透透气也不行了。晚上花时间预定就算了，第二天我要随时盯着手机还得一个个位置的点开，然后才能决定去哪，找一次座位半小时要的吧！你们自己去掂量下！！虽然自由学习的地方很吵，但听到大家的读书声，我就会有一种动力，一种更加努力的动力，现在呢？？？每天都没法预知第二天的自习位置。。。这种感觉很不好很不好加一句哈:很多人说恶意占座你怎么知道不是你到的时候人家正好去上厕所，吃饭了！你们是蹲在那里看了一天？PS:不要和我说信图自从有了预约后座无虚席，总图总比信图大吧，有些位置没人很正常啊，上厕所，打水的！我经常在图书馆待一天，除了吃饭那段时间，座位基本都是满的。。来来来，现在快十点了，你们来看看空了多少位置。。。补充:很多人拿信图、工图作例子。首先，它们都是各个院的图书馆，基本上是能满足本院人的自习需求的，最重要的是，没有预约上的人可以来总图！现在总图实行了这个预约后，你们要明白一点:总图的位置数量是满足不了全校人的需求的，所以就变成看运气抢座的现象！有一点很好奇:最近信图预约难道不是比之前难了么？划重点:很多人对这个系统其实认识的并不深刻，天真的认为占座的问题被解决了！哈哈，我来告诉你现在是怎么占座的:1. 图书馆现在七点到十点之间有很多空位，而这个空位在这个点是绝对绝对绝对不会有人预约的，所以这个时间段有上百人在被窝里就完成了占座！2.下午一点到两点半又有几百个座位是没有人去预约的，好，这又被人占座了！各位同学们！不是说拿书占座就是占座，现在不拿书占座更可恨好不好！我是不会告诉你们我抢到座位是怎么占座的！但我始终不希望自己变成卑鄙的银！！！不过学校逼急了，那我也没办法。。。。", "answer_votes": "80", "answer_comment": "​96 条评论"}
{"answer_author": "王佳鑫", "answer_id": 273271123, "answer_text": "在我看来，很多问题的根源并不是制度本身，有些问题也有些牵强。本质问题是总馆的预约制度上线的很不是时候，为何非要在考研前打破常规，强迫本来压力已经很大的考研党们去重新习惯一套新的制度呢？是不是在做出这种决定的时候欠缺一些思考呢？我们信部的预约制度实施的很好是有前提的，比如预约系统的公告与信图重新修好的时间差不多，大家基本都是从一开始就适应这个制度了，再比如总馆的人员流动更大，预约制度的一些细节是不是可以进行一些调整。在很多问题欠考虑的情况下贸然上线，并且要求绝大多数学生在这样一个时间点去很快的调整自己以往d的作息时间、学习计划，我觉得是不合理的。", "answer_votes": "9", "answer_comment": "​5 条评论"}
{"answer_author": "Danke", "answer_id": 233327489, "answer_text": "12.20更新我算是明白了，预约制度确实解决不了一些自我意识极强的人所谓的个人习惯，这些人竟然还常常拿着自己的习惯来反驳别人，把这当成公认的，岂有此理。这几天恰好在总馆预约位置都预约到了类似的一块区域，就发现这一块区域有个位置，昨天晚上人坐了半个小时以内，今天下午从两点半我坐下就没见过人。人去哪了呢？出去了应该不可能，我猜是去上面读书了。为什么呢？因为他带了一大袋书，桌上一堆地上一堆，自然就借着“我上去读书了，这么多东西也不好拿，就放在这里算了”。之前没有预约制度，那自然是无人问津。现在有了预约制度，这位同学或许已经掌握了预约的技巧，连续几天预约到了同一个位置，但是，我不知道他一天坐在这个位置的时间有没有一半，我也不知道他一天带的这么多书打开过的有没有一半。哦，接着说，现在有了预约制度，那更是合法的占有了这个位置，更加无人问津，他又没出去，不能释放座位，没得治了。我不知道总馆一天这样的人多有多少，不知道多少位置被这样霸占着，心痛。我希望那些在这个问题底下反对的人，那些把自己的习惯摆在理由里面反对的人，那些堂而皇之说自己没见过霸占座位的人，没有做过这样的事，要是有，算了，不骂人了，累。看来这个制度也是指标不治本，这种人，你再怎么想办法，想制度，也没法治，但愿，是极少的一部分吧。就目前而言预约制度还是给我们寝室带来了很多便利，上午上完课预约一个位置然后下午来一直待到晚上，之前，下午来是不会有位置的。如果上午没课，要不去教五，要不就在寝室浪一浪学一学，也不去抢那些要从早上八点开始学的人的座。是的，人人都不容易，但是要是我为人人，不就人人为我了吗？————分割线————————原答案现在预约系统实施了，有些同学有意见，其实预约制度是好的，有问题也可以解决，没必要因为自己的利益受损而破口大骂。首先宏观上看预约系统，能够保证每个位置空出来没人使用的时间间隔在半个小时以内。因为预约半个小时不进馆就要被释放，所以每个位置的利用率是提高了的。至少不会看到像之前一个位置一本书空一天的情况出现，有人质疑，到这确实存在，我和我的室友都遇到过，而且我还不止一次的拍过照。其次有人说早上八点到九点没人坐妨碍了起早的人。这个问题可以改善一下系统来解决，可以设置部分位置只允许从八点开始预约，这样就让部分八点就到的同学保证了他们有位置。更何况九点之前图书馆自然入座率并没有太高。对了，有的人（考研）说起的早的人勤奋就应该有位置坐这我认为纯属是无稽之谈了。凭什么起得早的人就一定勤奋？这种帽子扣的良心不痛吗？八点钟到图书馆的人就保证自己从早到晚除了累了休息一下一直在学从来没玩手机？早知道你去图书馆应该获得位置不是因为你去的早或者你有什么所谓的刚需，而是因为你是武汉大学的学生，你有在图书馆学习的权利，起的晚的同学同样有这个权利，难道起的晚的同学就没有刚需？就没有人会有更急的事情要在图书馆学习？这个系统的设定有一定程度上是保障了后一部分同学的权利（因为解决了占座），如果剥夺了前一部分同学的权利，可以通过上面我说的方法解决，而不是继续剥夺后一部分同学的权利。最后，这个是为了保障每一个同学的权利，让每个同学随时去都有位置坐（信图之前基本上实现了这一点），所以有问题可以研究可以改善，而不是因为自己的利益而喷这项制度。——————————预约制度实行之前的答案感觉很好。现在除了文理学部总图书馆其他分馆都实行了预约制度。预约制度大大提高了座位利用率，基本杜绝了占座现象的发生。由于座位基本物尽其用，所以基本各个时段直接去也都有少量座位。反观没有实行预约制度的文理学部总图书馆，虽然位置最多，但是大量空位被长期占用，导致很多同学去了没有位置。据我观察，有些时段座位利用率甚至不到一半，长此以往，会导致图书馆的氛围相当差。所以强烈建议文理学部总图书馆采取座位预约制度！", "answer_votes": "23", "answer_comment": "​15 条评论"}
{"answer_author": "匿名用户", "answer_id": 272517237, "answer_text": "目前为止这个活动已经进行了两天了果不其然，这个政策一出现，就引起了轩然大波。它本身就具有很强的话题性，和学生生活息息相关，尤其是现在是考研季和考试月，图书馆几乎上午10点之后再也找不到位置了。<img src=\"https://pic4.zhimg.com/50/v2-2054d2f303435515c3f7a738697434ac_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"120\" data-rawheight=\"137\" class=\"content_image\" width=\"120\">就从我个人感觉来说，我觉得是利大于弊的很多去图书馆的同学们肯定会有这样一个感觉，到了图书馆，准备找一个位置美滋滋的自习，结果走遍了a区或b区或c区，硬是没看到一个空座，好不容易看到一个椅背上没书包的，结果桌上放着单薄的一本书，你是去拿走那本书呢？还是算了，继续找呢？占座真的是很烦很烦，屡禁不止，有些同学放本书在这里，然后一天都不在，或者一下午，一晚上都不在？？大家都是比较害羞而且有礼貌的人，一般不会去把这个桌位上的东西移走，想想别人回来之后关爱智障的眼神，对你碰了别人的个人物品的嫌弃，我还不如找个别的地方去自习。。。<img src=\"https://pic1.zhimg.com/50/v2-19ca8986559030eedca4b6973dd8189b_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"162\" data-rawheight=\"198\" class=\"content_image\" width=\"162\">之所以有这么大的反响，我觉得有三个原因。第一、对这个政策本身不够了解。<img src=\"https://pic4.zhimg.com/50/v2-a8a8783bed2d8cffc20d3491f94d34ed_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"1080\" data-rawheight=\"1845\" class=\"origin_image zh-lightbox-thumb\" width=\"1080\" data-original=\"https://pic4.zhimg.com/v2-a8a8783bed2d8cffc20d3491f94d34ed_r.jpg\">我仔细看了这个问题底下所有反对的理由。例如:给偷懒的人提供了一个温床。错错错！如果你没有在预约时间内刷卡进入，你就会有违约记录，违约记录多了就会被拉入黑名单。相反，对于那些早上要早起的室友帮忙占座，自己反而中午才到的人，没有一点制度上的约束，一旦预约，时刻有一个违约提醒在你心里，你能不早起吗？（评论区某位细心的同学指出的问题确实我没有想到，这样的漏洞如果不能得到好的解决，那么这个政策就失去了意义，建议取消预约也有一个限额设置，毕竟故意取消再预约直至一天都没去的人是少数，限额对大多数人没有影响）二、脱离舒适区。大多数高年级的学长学姐，尤其以考研党，习惯了以前传统的占座模式，对新模式表现出不满和不适应。其实讲真，我也蛮心疼考研党，现在正值考研冲刺阶段，突然被打断学习方式，时间安排，必然需要自我调整时间，影响心情和效果。站在整体角度讲，这个政策总体是好的，如果选择在开学或者考研之后，会更好被接受。任何一个新的事物出现，都需要一个接受和适应期。信息学部图书馆的预约制度从去年发展到现在已经比较成熟了。三、技术问题。昨天晚上相信大家在10点30被那个空白的页面给整崩溃了，施行第一天，系统却出了问题，到达预约时间却点不开，就让人很崩溃。( ˘•ω•˘ )希望，学校能够快点解决一下校园网和图书馆预约系统还有选课系统！！无论这个制度是否可以继续走下去我们都要谨记实践才是检验真理的唯一标准<img src=\"https://pic4.zhimg.com/50/v2-0883330ee52476747768d5d9ca7a0e29_hd.jpg\" data-caption=\"\" data-size=\"normal\" data-rawwidth=\"445\" data-rawheight=\"418\" class=\"origin_image zh-lightbox-thumb\" width=\"445\" data-original=\"https://pic4.zhimg.com/v2-0883330ee52476747768d5d9ca7a0e29_r.jpg\">", "answer_votes": "11", "answer_comment": "​14 条评论"}
{"answer_author": "李橙橙", "answer_id": 272403466, "answer_text": "个人认为挺好的，经常要去C区查资料，每次都发现好多桌子，东西一堆，人一直不来，这种预约方式对占座党是一大利器…", "answer_votes": "7", "answer_comment": "​1 条评论"}
{"answer_author": "XuJ1aHu1", "answer_id": 272740445, "answer_text": "&lt;img data-rawheight=\"1334\" src=\"https://pic1.zhimg.com/50/v2-ee196537d42059885badcb25259aa6f7_hd.jpg\" data-rawwidth=\"750\" class=\"origin_image zh-lightbox-thumb\" width=\"750\" data-original=\"https://pic1.zhimg.com/v2-ee196537d42059885badcb25259aa6f7_r.jpg\"&gt;我也不说支不支持、好不好了，我每天晚上打开都是这样的……下载了app以后&lt;img data-rawwidth=\"750\" data-rawheight=\"1334\" src=\"https://pic3.zhimg.com/50/v2-67e6e016ebdecca61c51f30dbda1831f_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"750\" data-original=\"https://pic3.zhimg.com/v2-67e6e016ebdecca61c51f30dbda1831f_r.jpg\"&gt;永远的服务器异常等我终于打开预约系统了，只剩各种夹缝时间。&lt;img data-rawheight=\"986\" src=\"https://pic2.zhimg.com/50/v2-4b84b39aa005183b5fb67afe08208c80_hd.jpg\" data-rawwidth=\"1074\" class=\"origin_image zh-lightbox-thumb\" width=\"1074\" data-original=\"https://pic2.zhimg.com/v2-4b84b39aa005183b5fb67afe08208c80_r.jpg\"&gt;", "answer_votes": "6", "answer_comment": "​4 条评论"}
{"answer_author": "燎原", "answer_id": 272438010, "answer_text": "我觉得很好，用户体验极佳，我用微信预约，尚未出现进不去系统的状况，只是稍微慢些。而且即使不提前约，也是有座位能“现在”预约使用的忍不住再想补一句，有些答案或者有些答案下的评论真是戾气很重。一口一个睡懒觉，占便宜，懒鬼……我不管我有没有睡懒觉九点后到图书馆吧，在这个预约体制下，我约到的每一个时间段，我都实实在在地在学习，我是在有效的利用图书馆资源，只要资源在被利用，那图书馆的开放不就是有意义的?哈哈哈哈哈，我占谁便宜了?我拿书占座人走不学习了?有趣。不是不承认这个系统有问题，有些同学用的很不顺畅约起来很难，有的同学又能很快约上，所以这就不公平了，但是这好歹是可以通过改进系统有所改善的。那按原来的办法，恶意占座怎么改善，还真不是所有人都会挪开桌上的书，冒着和占座的人争论一番影响心情的风险，去要这一个座位的。", "answer_votes": "6", "answer_comment": "​1 条评论"}
{"answer_author": "匿名用户", "answer_id": 272439776, "answer_text": "个人觉得这个制度能够上线，它的优点还是大于缺点的。觉得不好的同学一部分是觉得打乱了他原来的习惯。一部分觉得这样对早起却预约不到合理时长的人不公平。但是座位预约都是统一时间的，大家一起预约。即使是有外挂，又没有说你不能用，也就是花一点时间预约一下第二天的座位罢了。同样，预约的座位超时半小时不到是会被释放的。这比每次去图书馆看到一桌桌的书好太多了。如果你本着先来后到的想法，别人就可以放一本书，对不起，同学，这里有我的书。", "answer_votes": "4", "answer_comment": "​2 条评论"}
{"answer_author": "粽粽粽", "answer_id": 272904787, "answer_text": "知乎小透明首次回答献给图书馆预约，上午真的是被气坏了。个人观点，欢迎大家跟我讨论，但是请注意文明用语，不要上升至人身攻击，谢谢(  ˃᷄˶˶̫˶˂᷅  )—————————分割线————————据不确切消息，图书馆实行该项预约制度是为了减少图书馆现存的“占座”现象，提高图书馆座位等资源的利用率。这是目前我所听说的，同学们提到的最多的一个原因，其他原因并没有了解到。那么下面我们就来看一下图书馆“占座”问题到底有没有通过该项制度得到解决，实施该项制度的利弊又各占几分，以下所有问题均以近日实施图书馆预约制度的总图为例：1.预约系统崩溃，无法预约到想要预约的座位。自图书馆预约系统试运行以来，我于12月6日，12月7日两晚均进行了图书馆座位的预约。在12月6日晚，由于猜测预约人数可能非常多，因此十点半一到我便即刻登录了系统想要预约，结果不出所料，系统崩溃了，显示服务器故障，无法登陆。我又尝试了第二种方式，微信公众号预约。按照之前图书馆发放的文件显示的程序，我在公众号界面进行了操作，结果界面始终让我绑定账号，讲道理的话，应该绑定一次之后无需重复绑定，然而不知为何，点击预约座位总是要求绑定账号或者直接页面崩溃无法显示。在不停的更新与等待中，页面持续崩溃，我的耐心也到了极限。四十分钟过后，十一点十分我终于进入了系统，预约到了一个座位，而那时系统里显示有大片大片的可预约座位，不知为何系统迟迟无法登陆。第二晚，依然是系统崩溃。不知今晚是不是还会崩溃。但是我相信，这个只是刚刚试运行的技术问题，日后可以解决，所以希望系统开发方面的负责人可以尽快解决这个问题。2.按照规定履约，却莫名“被失约”。以个人亲身经历为例，昨天晚上我预约了今天早上八点半到晚上九点的图书馆某区一个座位，今天早上我于八点十分刷卡进入图书馆开始学习。在接近十一点时，一位女生来到我的座位旁告诉我我的座位是她预约的。我很疑惑，于是打开系统想要给她证明。结果，万万没想到的是，系统显示我失约。据我了解，因为种种原因莫名其妙“被失约”的人，绝不仅仅只有我一个，而系统规定，失约两次就要被列入黑名单，一周无法进入图书馆学习。那“被失约”的这些同学该怎么办。大家均按照规定的流程，规规矩矩进入图书馆却突发这种状况，不仅自己的学习计划被打乱，另一位不明情况的同学的计划也被打乱，这样的损失又该由谁来弥补。图书馆负责人给我的回答是，让我去c区，有座位不需要预约。那我就好奇了，为什么明明是系统的bug却要受害者来背这个锅？想要来图书馆学习的同学遭受着莫名其妙的困扰，而对于不来图书馆学习的同学并没有任何损失，所以各种利弊如何权衡。3.预约系统时间段划分不合理。根据系统时间段的划分，我们能够预约的开始和截止时间通常都是整点或者半，而在预约时间点的后半个小时内入馆，均不会被记为违约。那么，举个很简单的例子：有一位同学想要睡个懒觉再去学习，于是便预约了第二天早上九点半的座位，结果第二天早上不小心睡过了头，睡到了九点五十，一看时间来不及了，便索性想着取消预约继续睡过去，那么此时时间仍在上午十点之前，这位同学没有失约，然而座位却被整整浪费了一个上午。试想，谁会预约八点到九点半的时间在图书馆自习，即使是3—5节有课，短暂自习，那这样的人又会有多少。在这位同学取消预约后的十点到十一点半，又有多少人会预约这个时间段在图书馆自习。即便是真的有人选择如此奇怪的时间段即兴自习，这种事件发生的几率与取消预约的事件发生的几率相比，大小一目了然。可能上面的事件会让人觉得是小概率事件，那么下面就说一个我亲眼所见的实例。今天早上大概九点半左右，有一位女生来到了某张桌子前，对正在学习的男生说，座位已经被她预约，请这位男生离开。而正在学习的男生显然并不想要离开，两人发生了争执，僵持不下。男生说我早早的就来学习，为什么要在这时让给你；女生说，这个座位我就是预约的这个时间，我准时到，有错吗。是的，他们两个都没有错，如果非得说男生有错，确实他没有预约，不该坐在那里，但是他早起来学习有错吗，图书馆本就是为大家提供学习的场所，现在却让人在学习的时候还要担忧会不会随时有人来把我赶走。原本可以专心致志学习现在却被搞的惶惶不安，学习的效率又从何谈起呢。可能有人会说了，那他离开后再预约其他座位不就可以了吗。可是，让我们想一下，身为大学生，认真学习的同学通常都会有自己的计划和时间安排，以我个人为例，如果当天没课，那么我便会很早起床，去选择一个自己喜欢的座位，然后开始一整天的学习，中午吃饭和午休会离开图书馆，晚饭也会离开图书馆，除此之外，我会在图书馆一直待到闭馆。如果我中午临时有事，预计下午和晚上无法继续在图书馆学习，那么我必然会在中午便把书拿走，或者抽出时间把书带走，不影响其他同学使用我的座位，我相信大多数同学都是有这样的素养的。但是现在有了这个预约的时间段，好比今天因为系统故障，我预约的座位突然被别人预约，那我只好寻找其他的座位，但是有的人只预约下午，有的人只预约晚上，没有可以预约下午到晚上的时间段，难道我今天来图书馆自习，要连续不断的搬着书换三张桌子吗？这其中对于我学习效率的损失和学习心态的打击，又该如何来弥补呢?再者，就像前面提到的例子，有人预约九点半到十一点半，那么八点到九点半这个时间段有人会去预约吗？真正预约这样时间段的人又有多少呢？这一段时间是不是就会发生桌子空着，也没有人预约，却让看到这张空桌子的人想坐又“不敢”坐呢？今天我在被迫预约其他座位后的寻找过程中，就发现了很多这样的现象，对，确实不会有“占座”的现象了，但是这样有桌子空着却没人敢坐不是一种更大的浪费和悲哀吗？谁知道临时坐在那里的我，会突然被哪个临时预约这张桌子的人赶走呢？而且，退一万步来讲，即使是“占座”，那也证明这位同学是想要来学习的，只是采取了一种不合理的方式和手段。想要学习的想法是值得肯定的，而且我认为这种现象是可以通过其他方式进行解决的，等到图书馆其他区域开放之后，会大大增加图书馆的座位和空间，这种问题和现象也会得到很好的缓解。4.中午午餐及午休时间划分不合理。虽然系统设置确实考虑到了中午午餐暂离的时间可能会更长，所以延长到了一个小时，那且不说有的食堂多么拥挤，同学们能不能顺利吃完饭回来，午休问题该如何解决？让所有的同学都趴在桌子上睡觉吗?总图附近是有很多宿舍楼的，那么这些去总图自习的同学便要面临着明明宿舍就在旁边却必须要趴在图书馆硬邦邦的桌子上，忍受着旁边人随时可能产生的噪声，来“午休”。而且，中午的时间本不就是用来吃饭和午休的吗，不然的话为何上午下课时间最晚十二点十五，下午上课时间最早两点五分呢？所以，可不可以结合实际情况，让我们的系统更合理更人性化一点呢？5.学习变成一种负担而不是享受。原本一直以来我都把能在图书馆一坐学习一整天当作一件非常开心和享受的事情，但是这两天我却非常的神经紧张。因为身边不停的有人被赶走，甚至自己也莫名其妙被赶走了。这样一来，又谈何安心学习呢？而且有同学说，发现这几天到教室自习的人变多了，不知道跟预约制度有多大程度的联系。而且，以前如果校园卡坏了，我们是可以通过在总台登记进入图书馆学习的，可是现在，想要有座位就必须预约，而预约就必须刷校园卡进馆，那让校园卡消磁或故障的人怎么办呢？6.一点不成熟的小建议。如果真的想要解决图书馆占座的现象，那么为什么不可以将每个区都整改为B2那种刷卡取号的区域呢，既很好地避免了占座的问题，也节省了同学们漫无目的地找座位的时间，还可以区分有电和无电，而所有的一切只需要增加一个机器就好了。这仅仅是我个人的一点不成熟的想法，想必政策的出台者必然比我想得深远得多。考研和期末都即将到来，我真的很怀念以前可以选择自己喜欢的座位学习一整天的时候，而不是现在这样，每天都像去战场，被一个系统牢牢掌控，这种被限制的滋味真的很不舒服。我喜欢武大这样自由和开放的环境，也相信政策的出台者是想为同学们提供更好的学习环境，所以即使这个制度一定要推行下去，那我也希望可以及时改进。", "answer_votes": "5", "answer_comment": "​6 条评论"}
{"answer_author": "孙先生的施小姐", "answer_id": 272631052, "answer_text": "我只有一个感觉，很不方便。在总馆预约制度发生之前，我可以任何时候想去图书馆了，背个书包过去，99%的概率是有坐儿的，当然除去A1、A2等风水宝地。在有坐儿的情况下，我可以根据自身的需求，选择靠窗的，或者有电的，以及距离卫生间较远的。因为实地的考察，关系到接下来几个小时学习状态、效率等等。然而，网上预约（并且是提前一个晚上预约）之后，我打开公众号的链接，在没有bug的情况下，登陆账号，选择总馆明天的座位表，很多绿色的啊（绿色可选）。但我还是选择先看C1，因为一直喜欢在C1。C1显示有48个空位，nice！&lt;img data-rawwidth=\"1242\" data-rawheight=\"2208\" src=\"https://pic3.zhimg.com/50/v2-0ab8149d3284a755b34327d6fe7cdebc_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"1242\" data-original=\"https://pic3.zhimg.com/v2-0ab8149d3284a755b34327d6fe7cdebc_r.jpg\"&gt;C1不能带包不能带自己的书进去，这限制了很多的客流量，但是特别僻静，没有什么外界的干扰，进来找坐儿的人也比较少，人员走动不频繁，绝佳！但………………点开一看，傻眼了。。我以为是bug，反反复复登陆了好几次，才确认真的都红了…&lt;img data-rawwidth=\"720\" data-rawheight=\"1280\" src=\"https://pic3.zhimg.com/50/v2-39d24ae67146f30459df22179ea7119f_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic3.zhimg.com/v2-39d24ae67146f30459df22179ea7119f_r.jpg\"&gt;红红火火恍恍惚惚。好吧再看看A区B区以及C区其他，顺手截了几张图，随机但是大概能代表大多数吧。&lt;img data-rawwidth=\"720\" data-rawheight=\"1280\" src=\"https://pic4.zhimg.com/50/v2-839dc2b3da3984f9b165d7b1c0e226f8_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic4.zhimg.com/v2-839dc2b3da3984f9b165d7b1c0e226f8_r.jpg\"&gt;&lt;img data-rawwidth=\"720\" data-rawheight=\"1280\" src=\"https://pic4.zhimg.com/50/v2-9fecfad6b78d7490340011e670e5d814_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic4.zhimg.com/v2-9fecfad6b78d7490340011e670e5d814_r.jpg\"&gt;&lt;img data-rawwidth=\"720\" data-rawheight=\"1280\" src=\"https://pic1.zhimg.com/50/v2-3342b698ed8c06dd5e4111e1e97121fa_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic1.zhimg.com/v2-3342b698ed8c06dd5e4111e1e97121fa_r.jpg\"&gt;&lt;img data-rawwidth=\"720\" data-rawheight=\"1280\" src=\"https://pic3.zhimg.com/50/v2-70659485a379ae7cf81e7a014e26b7e1_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic3.zhimg.com/v2-70659485a379ae7cf81e7a014e26b7e1_r.jpg\"&gt;&lt;img data-rawwidth=\"720\" data-rawheight=\"1280\" src=\"https://pic1.zhimg.com/50/v2-265131f7a293b018d20d7fc95c021c64_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic1.zhimg.com/v2-265131f7a293b018d20d7fc95c021c64_r.jpg\"&gt;&lt;img data-rawwidth=\"720\" data-rawheight=\"1280\" src=\"https://pic2.zhimg.com/50/v2-020554ffadde289748ef855f59570c22_hd.jpg\" class=\"origin_image zh-lightbox-thumb\" width=\"720\" data-original=\"https://pic2.zhimg.com/v2-020554ffadde289748ef855f59570c22_r.jpg\"&gt;可预约的时间段都在8:00-9:00，8:30-9:30以及晚上9:00-9:30之间，也就是说，我只能明天起个早，幸运的话骑个小黄或者摩拜，蹬蹬蹬踩到总馆，坐下来学习一个小时，或者一个半小时，然后回来一个姐们儿或者哥们儿，拿着手机跟你讲，诶同学不好意思，我预约了这个座位了。（f…）你呢，要抱着你的个人所有物，拿着手机，一个个点开那些（伪）绿色的椅子标志，寻找下一个空位。或者可以选择明天晚上八点多出门，九点去图书馆，九点半回来，就当散步吧。今早跟同学讨论过这个问题，可能会改善占座的现象，但也会衍生出其他的一些问题。鉴于我本人不属于学霸，也不喜欢八点就到，不方便之处可能没有学霸有发言权吧。一些闲话，权当娱乐。毕竟现如今是一个拼手速的时代。", "answer_votes": "7", "answer_comment": "​9 条评论"}
{"answer_author": "清和", "answer_id": 276772837, "answer_text": "……只说我自己的观点吧。自从有了这个制度后我再没去过图书馆。因为我不想看见一堆空位不敢坐，哪怕我知道他们很多人预约了都不会来。", "answer_votes": "3", "answer_comment": "​1 条评论"}
{"answer_author": "雾里 逐阳", "answer_id": 272601603, "answer_text": "预约就预约吧，但得留够位置啊？总馆旁边那栋从进校就开始装修，如今信图都建成好久了，还没完工。。。就这速度，怕是毕业都修不好了 ", "answer_votes": "3", "answer_comment": "​添加评论"}
{"answer_author": "一去二三里", "answer_id": 272709722, "answer_text": "看起来高级的浪费。", "answer_votes": "4", "answer_comment": "​9 条评论"}
{"answer_author": "Hu cares", "answer_id": 272496074, "answer_text": "知乎首答献给我深爱的图书馆。我认为图书馆是学校最好的地方。武大图书馆更是十分的舒适、人性化和个性化。先说一下总的立场吧，总体而言我是反对这个规定的，个人认为弊大于利。对于图书馆占座行为，应该视具体情况来具体分析，不能完全否定，很多时候占座是合理的。但是，我也强烈反对恶意占座行为。下面具体说一下这个规定的实施分别的优缺点吧——————按照知乎尿性此处应有一条优缺点分割线—————————————————————————优点：1，治理占座行为，提高座位的利用率。规定的实施能提高座位的利用率（但是实际有效利用率是否提高真不好说），这也是规定的根本目的，占座的情况确实是少了。2，可以快速找到座位。利用预约系统的平面图，可以快速知道哪里有座位，不用像以前那样到处转找座位。这样节省了找座位的时间，预约好了直接去就好。3，对于有严格时间观念的人有利于他们做出规划和安排4，可以睡懒觉（如果这算优点的话，预约好了不用早起抢座位）缺点：1，规定造成了灵活性和自由度的丧失。很多时候去图书馆是并没有计划好的，而是临时起意，并且也不知道自习多久，什么时候走，所有这些都带有随机性。而预约制度个人的自由和选择则在预约之后被限定了。虽然这其中的福利的损失很难计算，但确实是存在并且可能是很大的。此外，我们常常对座位的环境有要求的。比如我约好了一个座位，去了之后发现那个座位旁边很吵，或者有异味，或者有同学就是受不了旁边的人抖腿之类的，总之让人不喜欢，那么我就不会在那个地方自习。预约规定实施后我就只能取消预约，再找其他地方，这带来了麻烦，也浪费了一定时间的那个座位的使用。2,预约使得一个座位的使用在时间上被分割了，反而降低了座位的使用率，会抵消占座的减少带来的利用率的提高，所以座位的有效利用率不一定提高。由于可以预约不同的时间段，一个座位可能被切割开来。假如A预约了8：00-11：00，B预约了13：00-17：00，那么中间这个时段很可能就没人预约，因为很难做到刚好有人也需要这个时间段，这和占座有区别吗？预约使得可以大段时间利用的座位变少了，以前每个座位可以无限利用（只要你看到一个空位，你想用多久就可以用多久，而不用担心你之后你的座位还被别人预约了）预约可能使得一个没有预约到大段时间的人频繁转移阵地。还有早上八点到九点这个时间，令人尴尬。3,杜绝占座行为带来的损失。前面已经说了占座有时是合理的。再次声明坚决反对长时间、占多地等恶意占座行为。比如两个同学（有时是情侣）约好一起上自习，但有一个晚点到，这样先到的可以帮后到的占一个邻座，他们对相邻的座位的需求是极高的。在旁边一起自习比各自单独自习能带来更大的福利（加入每个人单独自习的福利是10，两个人在旁边一起自习的福利可能就是30,而不是简单相加的20）所以这种情况的占座能提高总体福利水平，而且理论上说这样的占座越多，对总体越有利。预约之后虽然也可以约定好两个人预约相邻的位置，但这样的操作恐怕并不容易实现吧，能实现也增加了麻烦。4,预约使得个性化选择的丧失。我每次去总馆，几乎都能看到一个黑人留学生在连接新书展区的那个走廊的靠墙的一个座位上自习。对他而言，他对那个座位可能就是很钟情，那一个座位给他带来的收益极大。预约规定实施之后他很难再预约到那个座位，一个普通座位对他而言是没什么好处的。可能有人说每个人不应该平等地选择座位吗，但仔细想想平等用在这里就太幼稚了吧。假如那个特定的座位给一个一般人带来的福利是10，给那个黑人的福利是20甚至更大，为什么不把这个作为留给他呢。有些人就是对某个地方某几个座位情有独钟，他们每天都去那里自习，而且时间久了可能那一块地方的人都相对固定，形成了一个相对熟悉和稳定的环境。也可能某个小哥哥对某个小姐姐有意思，知道她每天都在某个固定的地方自习，然后…嘿嘿。虽然说预约也可以约你以前习惯自习的地方，但是约中的可能性就看天了。也许你会说不预约的话你的座位也可能被别人使用，但是久了之后你就能摸清那一个地方的大致规律，你就可以安排好你的时间和计划，可能是早起，这样就比较容易使用到那个座位。所以说预约打破了这些习惯和人情，制度就是这么冷冰冰，制度带来的平等的好处也不一定很大，也不一定是合理的平等。5,实施的时机对这一届的考研党极其不利。（非利益相关，今年不考研）我已经听到过这一届的考研党的抱怨了。就算这个规定要实施，为什么不等这一届的考研党考完之后呢。以前考研党每天早起在图书馆排队，因为自己去的早总能找到自己想要的座位，并且是一整天的座位（而且他们为了学习本来就要早起，并不全是为了抢座位）现在他们“平等”地和所有人一起抢，还不一定能抢到一整天的自习的座位。他们对一整天的座位的需求是极高的，难道不应该先满足他们的需求吗？这个时候理应照顾还有不到一个月就要考研的他们（并且也不能说照顾，他们也不是坐享那些好座位，他们早起去排队了，你要抢你也可以早起）。再次反对有人说的简单幼稚的平等观！这个规定突然出台，也没有事先通知某个时间会实行，这个未预期到变化是带来了极大的不便，打乱了他们的复习安排，就快考研了还要为抢座位而糟心。如果晚点实施的话，下一届的考研党就有充足的时间应对这个变化。减少恶意占座可以想其他办法，而不是靠这样大规模的规定。    以上。", "answer_votes": "21", "answer_comment": "​18 条评论"}
{"answer_author": "李赋仁", "answer_id": 272860160, "answer_text": "经历了本科三年的选（抢）课，如今图书馆的选（抢）座简直就是a piece of cake，在此要向曾经的教务部致以衷心的感谢。玩笑归玩笑，个人还是坚决支持图书馆的选座的。君不见，预约之后占座现象彻底消失，也可以提前安排第二天的学习计划，避免八点半去就没有座位的尴尬。虽然服务器瘫痪的问题确实存在，但几天来我都能在15分钟内选上座位。个人觉得，与其花钱更换效能更好的服务器满足大家几分钟的需求，不如省下钱盖宿舍楼把文科研究生们搬回学校住。", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "金雷", "answer_id": 272690529, "answer_text": "我相信去图书馆谈恋爱的情侣都会吐槽的", "answer_votes": "2", "answer_comment": "​1 条评论"}
{"answer_author": "小渔酱", "answer_id": 272623169, "answer_text": "我觉得弊大于利，因为确实不便于那些起得早去图书馆自习一整天的学生，无论是考研党、复习党还是平时的学习党预约制度导致能不能在图书馆自习全靠运气，早上起得再早也没有用，哪怕八点到图书馆找到了一个座位，中间想起身透个气都战战兢兢，主要是没有安全感…讲真，对于真的很自觉和努力的学生的确是挺烦人的尽管这样是为了打击占座党，但凭什么早起现场到图书馆的学生却没办法享受那些缩在被窝里比手速的同学得到的待遇呢？毕竟并不是每一个人都能够预约上合适的时间和座位的，再怎么拼手速就是预约不上那难道要干脆不学习了吗？或者明明想用大块时间专心学习，却只预约到早上八九点或者中午十二点到两点，那怎么破？抱着书来回换地方吗？尽管图书馆上座率提高了，可学生的学习效率却可能因此降低了，甚至会引发对总馆的失望和逆反心理，这算不算得不偿失呢？预约固然可行，但打击那些预约不到但是真的很努力的学生去图书馆的积极性，真的也是很大的问题。并不是每一个学生都是“我觉得最近我应该去图书馆自习一会儿了，预约一下吧”，有一些学生只要有时间就往图书馆里钻，去图书馆学习已经成为了一种习惯，根本不存在计划不计划，而是一种自觉的、下意识的或是突发性的反应。而在这种情况下，让他们丧失正常学习节奏，明明看到图书馆有空位却没办法坐，这难道是合理的吗？我知道学校这样做是为了打击恶意占座，但这种方法在人流量最大的总图很有可能最后会引发口诛笔伐。是的，我承认恶意占座的行为非常讨厌，但的确有人不在位置上只是为了去接个水、上个厕所、找本书或者去自由学习区背一会儿东西，这种情况下不应该过于苛责。而那些放一本书半天不见人的恶意占座，的确可耻，但也可以通过其他一些方法来解决这个问题我个人认为，可以尝试着在图书馆建立现场占座的机制，一个人只能够占一个座位，这个座位在学生到达现场后可以让学生有选择地征用，比如刷校园卡之类的身份验证，然后在座位上连接一个小装置，比如led灯，刷完卡会亮，离开时候再刷一次或者手动关闭会灭。这样，一个学生只能够占一个位置，这个座位对学生有身份验证和占用时间的记录，就像机房的手动上机和下机一样，既有门禁的记录又有相应座位的记录，学生中间去上个厕所或者出馆透透气走个汉姆运动，都比较自由。只要不手动“下机”，这个座位就是你的。或者干脆学小黄搞一个蓝牙锁得了…不过这些都是我的小脑洞，没考虑实际操作问题，感觉也挺贵的…不过，仅仅实行网上预约机制不给早起的学生一点儿出路，彻底否定无预约现场到图书馆的突发情况，还是在学校自习重地的总图，绝对绝对会引起很大的不满另外，我武是没钱还是咋滴了，天天修这个楼修那个楼还盖体育场，却没想着给学生扩建自习区，拜托隔壁某科都有俩亚洲最大教学楼了，人家楼层走道的自习区设置得简直就跟咖啡厅座位一样，我本校图书馆抢不到位置的时候去隔壁东九自习过，感觉特别好我武全校几万号学生，图书馆座位严重不足，平时教学楼的自习环境也不是特别好，很多需要插头的同学没有办法插电脑。凤毛麟角的专门自习室非常简陋，比如我所在的枫园有枫园阅览室，下面就是食堂，因此这个自习区总有食堂味儿，插头稀缺就不说了，作为一个自习室没有卫生间真的让人很难受…不管怎么说，改善学生学习环境是比在外面吹牛逼更切实的事情，什么全国第三亚洲第四的，振兴学风，创造更好的学习条件，激起学生的学习热情，而不是打消他们的学习斗志、破坏他们的学习习惯，这才是重中之重还有就是，秋季学期考研党多所以图书馆位置紧俏，但春季学期经常随时去随时有空位，这种情况下还要提前预约或者干瞪眼看着空位不能坐，谁受得了？顺便吐槽，图书馆的校园网也大不如前了", "answer_votes": "5", "answer_comment": "​6 条评论"}
{"answer_author": "Rolls-Royce", "answer_id": 273191218, "answer_text": "强烈赞同。1.节约时间成本以前上午不是很早，或是下午晚上想去图书馆学习一下，或者看看闲书时，要一楼二楼三楼四楼五楼，ABCDE区的跑去找座位，当然了你还不一定能找到位置，一个杯子，一本书一个笔记本就占着了你有什么办法。不管有没有找到位置，对使用者的时间成本都是一种极大浪费。2.减少占座行为个人是十分反感占座行为的，图书馆教室以及我们最近装修的梅园皇家食堂都一样，有需求的人没位置，拿本书拿把伞占位的人正悠闲得慢慢选菜打饭，整体利用率极低。半小时没到自动释放，离开位置后半小时以上早退释放(午餐晚餐期间一小时)，而且会记录违规，次数达到条件会被禁用预约，想着喊人随便拿个啥东西霸占一整天座位的日子一去不复返了。3.充分利用零散时间每个座位的每个时间都能得到最大化利用。网页版的预约系统可支持按条件筛选座位，大家可根据自己的实际需求(时长，自习区域，起始/结束时间，座位类型等)快速精准地找到合适的位置。关于跑去想学习但是却没有座位的观点：我真的想问同学，你去过图书馆没有，在图书馆网页版找了位置没有，一层一层爬楼找位置是比较麻烦，我在实行第一天的上午10点以及下午2点半现场筛选预约，均2分钟内约到，楼梯都没爬顺利入座，被预约满了？不存在的", "answer_votes": "2", "answer_comment": "​添加评论"}
{"answer_author": "纹樟", "answer_id": 272569849, "answer_text": "千呼万唤始出来，出台预约系统，图书馆一定是经过了慎重考虑以及试点考察的（信图），否则也不会花人力物力（改用双向刷卡系统，作为全部标号，服务器等），武大图书馆作为服务全校的机构，自然是要以绝大多数同学的需求为目标，所以这个预约系统的推行我认为是正确的，可能会影响到个人，但是应该从适应中找对策，从变化中调整自己的安排。首先，预约系统可能是存在着技术上的问题，22:30开始预约的时候的确是崩掉了，技术问题，出现了，相信一定会被解决（选课系统我觉得已经很棒了）。试运行阶段的所有问题一定都能被完善，这一点我十分愿意相信。其次，预约系统实打实的提高了资源的利用效率。资源精细化管理，实型预约不可或缺。解决占座问题是一个方面，另一方面是给来图书馆学习的人一个时间管理意识，什么时候干什么事，从什么时候开始，什么时候后结束，履约这个词我觉得非常恰当。图书馆资源有限，并不可能让所有的人想来就来，随时都有资源供给，以往那种一个水杯占位一天的人我相信现在一定做不到了，以前那些住的远的我相信一定能在寝室里满足的查看图书馆位置情况，到图书馆时能够有个位置坐下。无理的占座者在制度上真正无理了，真正的需求者在现实上有了可靠的保证。最后，改变。图书馆改变了，我们的安排肯定也要改变，预约管理给了图书馆的使用一种仪式感，去图书馆不仅是学习，更是履约，是完成一种使命。我觉得这种紧迫感会使我在图书馆更加珍惜时间，更加利用好资源。关于图书馆自习和看书的功能我的看法不明确，也就不说了。上有政策，下有对策，毫无疑问不久之后，一定会出现各种新奇的招数，但是这种服务化的思路是正确的，方法也是合理的，顺理成章，阵痛也是有的，过去了就好，适应了就好。", "answer_votes": "2", "answer_comment": "​1 条评论"}
{"answer_author": "沈嗣玮Ian", "answer_id": 283233059, "answer_text": "预约制度是为了防止占座浪费图书馆资源，可是这样的预约方式其实就是一种变相占座，问题主要不是预约，而是这个预约的机制举个例子我明天想睡个懒觉去图书馆，于是我预约了九点半的图书馆的A区001位置，预约成功然后第二个人早上想起早去图书馆，看到A区001位置显示绿色，也就是可用，然后想预约点进去却发现只有早上八点到九点半有时间，这个人立马对这个位置失去了兴趣，然后又找下一个位置，又出现了同样的问题，这样不仅凭空增加了找位置的成本，而且这些八点到九点半的位置本身并不受大多数人偏好，很有可能就这么空着了。所以事实上有了预约系统后入座率反而低了。另一个例子我预约了明天九点半的图书馆A区001的位置，但是第二天我起床晚了，醒来已经九点二十分了，肯定来不及赶上预约的时间，于是我马上取消预约，然后趁位置刚释放出来，秒预约同一个位置十点半以后的时间，那我就可以安安心心慢慢起床再赶过去也不用担心违约。好了，那这样，九点半到十点半的时间也浪费了。由于有些人钻这样的空子，于是入座率更低了。这个预约系统其实就是把简单的是变麻烦了，要改变很简单，把预约直接变成显示座位使用状况就可以。简单说来，我去图书馆，找到一个空位置，坐下然后位置的状态就变成占用，然后系统就显示这个位置被我占用，如果出门，座位保留半个小时，半个小时不回来就自动释放座位，这样通过座位提示系统，既减少了选座的时间成本，又避免了之前的预约方式造成的零碎时间的浪费。", "answer_votes": "1", "answer_comment": "​3 条评论"}
{"answer_author": "某人", "answer_id": 283102456, "answer_text": "如果第二天想好了一个时间去图书馆，只要在前一晚10.15---11.50预约，总会找到合适的位置，即便是期末考试月，杜绝了占一天座没人来的现象，但也存在一些\"合理占座\"的现象，虽然预约系统还待改进，但现在的预约方式真的很好了。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "老菜菜哦", "answer_id": 282232709, "answer_text": "提前预约肯定能全天，预约不到？不存在的吧？怕忘了订个闹钟，美滋滋！之前利用率有多低心里没数吗？我对面经常一本书放个一天，现在随时去都能有位置，时间肯定不长，但为什么你不预约呢？总之，预约制度估计能拯救我的期末成绩，开心ing&lt;img data-rawwidth=\"290\" data-rawheight=\"290\" src=\"https://pic4.zhimg.com/50/v2-763b57f53296f99076510336a54ce864_hd.jpg\" class=\"content_image\" width=\"290\"&gt;", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "Liberty", "answer_id": 277101226, "answer_text": "首先，肯定一下这制度确实带来了利用效率的进步。  其次（绝对热爱国家热爱党热爱学校），这个系统确实存在很大的弊病，由于科学家们的存在，晚上预约第二天的座位时我等只能等神仙打完架去选他们留下的座位。而且，而且这系统还容易挂。还有一个问题，这个方式让时间碎片化，打一枪换一个地方很难受。真的很难受。  以下为粗鄙只见，我啥都不懂，乱说的。至于解决方法，可以取消线上预约，强制在图书馆那里预约，软件上只显示座位使用情况。并在使用完后给予2-3分钟的保护时间，方便续约。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "星光不问过路人", "answer_id": 276255789, "answer_text": "期末考试的时候，每天晚上10:15都像双十一不过个人觉得挺好的，提高了座位的利用率。但是还存在一个bug，就是取消作为后还可以再预约。就导致有些人没去，不停的延迟半小时，延迟半小时……图书馆以后可能会发现这个问题吧", "answer_votes": "1", "answer_comment": "​1 条评论"}
{"answer_author": "唐心怡", "answer_id": 275838644, "answer_text": "谁能来安慰一下每天八点钟准时入场却不能抢到自己心爱小座位的考研狗。。。求摸摸狗头", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "匿名用户", "answer_id": 273780645, "answer_text": "早上8点到9点这种时间段空出来的确不太好，但是要因噎废食就不好了吧，那你坐座位上玩手机，上个厕所是不是也得把位置空出让给其他同学，然后自己再找，这样利用率会更高？信部实行好久了，不知道现在为啥有些人那么矫情。我考试复习还真没找不到位置的时候，你起床了点时间段预约，多刷新几下，总有几个起不来的释放位置的，经验之谈。", "answer_votes": "1", "answer_comment": "​添加评论"}
{"answer_author": "热衷于烤盐的琴梨", "answer_id": 273159602, "answer_text": "武大没有图书馆选座系统吗，就是进门想坐首先要刷学生卡那种。几个小时再续一下，不用再退，不然进黑名单三日。我们的预约是建立在这样一个选座系统上的，头晚预约的座位需要第二天早上7点半前去激活，否则进黑名单。", "answer_votes": "1", "answer_comment": "​1 条评论"}
{"answer_author": "Zbtrik", "answer_id": 272990843, "answer_text": "很不完善，没有惩罚机制", "answer_votes": "1", "answer_comment": "​添加评论"}
